{"name":"GameSwift","id":"gameswift","symbol":"gswift","description":"What is the project about? GameSwift is a modular blockchain network comprising the gaming-optimized Layer 1 and zkEVM rollups designed on demand for specific games. By leveraging zkEVM, developers can reduce gas costs, optimize contract execution speed, and enable confidential computation. What makes your project unique? GameSwift not only provides an optimized SDK-based infrastructure for game developers to deploy their dApps efficiently and securely on zkEVM, but also introduces the multichain GameSwift Platform, which ensures that the games built within the modular ecosystem are not isolated from other networks. The Platform provides solutions that respond to the needs of non-crypto gamers, who may not be familiar with interacting with blockchain technology. History of your project. Founded in 2022 by a group of blockchain and gaming passionates, GameSwift quickly became one of the fastest-growing gaming ecosystems in the entire Web3 space, which now makes a true home for numerous gaming projects and gamers. What’s next for your project? GameSwift's long-term goal is to become the go-to blockchain network for development studios to build and launch their dedicated gaming roll-ups, easily accessible to both web3 and web2 gamers through the one-stop multichain platform. By unifying games and players in one place, GameSwift aims to create the World’s largest web3 gaming community. What can your token be used for? $GSWIFT is the driving force behind the entire GameSwift ecosystem, serving as a native currency, utility, and governance token, capturing value from all GameSwift products and services. Being an essential component for key functionalities, such as transaction fees, validation, and payments on GameSwift layer 1 blockchain or validating transactions on zkEVM roll-ups, makes $GSWIFT a crucial asset in the entire GameSwift Ecosystem, which additionally accrues real yield generated by the GameSwift Platform from multiple revenues streams.","links":"https://gswift.community/","market_cap":52614033,"market_cap_rank":893,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gameswift/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x580e933d90091b9ce380740e3a4a39c67eb85b4c"},"ethereum":{"decimal_place":18,"contract_address":"0x580e933d90091b9ce380740e3a4a39c67eb85b4c"}}}