{"name":"Purchasa","id":"purchasa","symbol":"pca","description":"What is Purchasa about? Purchasa is a web3 shopping ecosystem that empowers merchants to sell products with cryptocurrency. Our platform is free to use, with no listing costs, we only take a transaction fee on sale which is set at 1% for all popular cryptocurrencies, while there are no fees when using our native token, $PCA. Furthermore, we have integrated our own payment processin What makes purchasa unique? Purchasa is developing a suite of products, decentralized finance tools, and services that aim to enable merchants to establish more effective and meaningful connections and interactions with their customers. While assisting in the mass adoption of cryptocurrency in the retail sector is a primary goal, our vision extends beyond this. Our mission is to create a trusted brand that prioritizes user experience and intuitive design, supporting merchants in increasing visibility, revenue, and sales to enable their businesses to scale. Ultimately, our goal is to establish Purchasa as a safe ecosystem for merchants to operate within, while also delivering web3 shopping experiences that redefine traditional business models. Our Products Purchasa Marketplace is a user-friendly platform that was designed to help merchants tell their story, sell products and services, hire staff, and more. Our goal is to make the platform accessible and intuitive for people of all technical levels, while also providing a secure and inviting environment for new users. Hero Wallet is a decentralized, non-custodial digital wallet that offers users a secure and convenient way to store, send, and receive cryptocurrency. Purchasa PAY is a global payment infrastructure that makes it easy for businesses of all sizes to accept and remit cryptocurrency.","links":"https://purchasa.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/purchasa/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe700ba35998fad8e669e3cca7b3a350f1fdcacf8"}}}