{"name":"DUA Token","id":"dua-token","symbol":"dua","description":"The DUA token is our solution to bring diaspora communities, expats and migrants using the dua.com and spotted.de apps into the world of DeFi, and enable them to interact effectively as part of a global economy. DUA is a utility token issued by the Stichting dua Foundation, a non-profit organization based in the Netherlands, central to the promotion, growth and development of fragmented communities. DUA allows users to: - Transact without intermediaries quickly and easily, - Build their own digital identity and reputation while verifying that of other participants, - Remove the financial burdens and limitations imposed by centralized institutions, while seeing the benefits of decentralized finance. Our goal is to empower anyone using the app to move out from the shadow of traditional financial limitations, earn and transfer money as they see fit, and flourish wherever they choose to make a new home. In practical terms, the functionality of DUA can be broken down into two broad market segments, individuals and businesses. For individuals using the app, DUA can be: - Earnt through creating and spent through purchasing products or services, - Bought with or sold for other currencies, - Sent and received with low transaction fees, - Used for core DeFi services such as swaps, yield generation, lending, and borrowing, - Staked for rewards, - Used to create self-sovereign IDs and reputations, which can easily be verified. For businesses, DUA has the following use cases within the app: - Used to pay for advertising space, enabling high-volume ad visibility to tailored audiences, - Staking for discounts against available services, - To pay for creating and updating sets of decentralized identities. In this way, DUA will enable true community building and engagement, not only for individuals but also for the businesses they choose to operate.","links":"https://duatoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dua-token/logo.png"}