{"name":"ARK","id":"ark","symbol":"ark","description":"ARK provides users, developers, and startups with innovative blockchain technologies. They aim to create an entire ecosystem of linked chains and a virtual spiderweb of endless use-cases that make ARK highly flexible, adaptable, and scalable. ARK is a secure platform designed for mass adoption and will deliver the services that consumers want and developers need. It is fast, decentralized, scalable, collaborative, bridging and open-source. The ARK Desktop Wallet is natively built for all major Operating Systems. ARK wallets connect to fully synced network peers removing the need to download the full blockchain. ARK operates using a <a href=\"https://www.coingecko.com/en?hashing_algorithm=Delegated+Proof-of-Stake&view=market\">Delegated Proof-of-Stake (DPoS)</a> consensus algorithm. Unlike <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a>, in which miners with expensive rigs secure network transactions, the ARK network is secured by delegates. There are hundreds of potential delegates, but token holders in the ARK ecosystem continuously vote on who actually gets to be an active, forging delegate. Only 51 delegates make the cut. As a token holder, you’re only allowed to vote for one delegate at a time. The fee to vote/unvote is just 1 ARK, so it’s advantageous to at least vote once for a delegate you support. The more ARK tokens you own, the more powerful your vote. ARK was launched in February of this year by 27 members spread across the world. With team members located everywhere from California to Bulgaria – the ARK Crew is truly decentralized. The team currently consists of 15 core members. The ARK infrastructure is modeled heavily on that of three older projects: <a href=\"https://www.coingecko.com/en/coins/bitshares\">Bitshares</a>, Crypti, and <a href=\"https://www.coingecko.com/en/coins/lisk\">Lisk</a>. In fact, some of the ARK developers were previously developers on some of those projects. Francois-Xavier (FX) Thoorens, the CTO, was a core developer at Lisk in 2016. Ark Community A diverse group of people and skill sets, including Full Stack and Web Developers, Network Engineers, Hardware Experts, Money Managers, Musicians, Traders, Social Media Promoters, and Business Owners, uniting to realize a vision shared by 30 members of the ARK Crew. All passionately devoted to collaboration and the development of the ARK ecosystem and community. Ark Token Secured by a cryptographic blockchain network similar to Lisk and Crypti, running on a Delegated Proof of Stake Consensus Algorithm developed by Bitshares. ARK DPoS provides a newly adapted voting system and incorporates many improvements over previous DPoS implementations. <a href=\"https://blog.ark.io/what-is-the-ark-smartbridge-and-how-does-it-work-1dd7fb1e17a0\">SmartBridge</a> To increase the reach of the ARK platform, ARK bridges together useful and proprietary blockchains through the use of ARK SmartBridges. These SmartBridges allow for communication among validated bridged blockchains with the ability to perform tasks and advanced functions. Through the use of SmartBridges, the ARK Crew is able to connect many popular blockchains and finally create a unifying bond among different ecosystems. As examples, the first blockchains the ARK Crew will bridge are: Bitcoin, Ethereum, Lisk, 3rd Party Anonymous Network Integration, one or more proprietary gaming economy tokens (Codename: A***** [Ticker: A***]), and numerous other bridges connecting new and already existing blockchains in the future. Security Because we understand security is a major point of concern for everyone, cryptographic and security principals are incorporated throughout the entire Development Life Cycle to guarantee a secure core meeting the requirements and expectations of our users. Through continuous risk analysis and internal recurring penetration testing, we provide a system that fulfills the high standards required by this type of environment. Privacy ARK Anonymous Network Integration provides ARK users with optional privacy when sending ARK transactions throughout all of the services developed for the ARK platform. Anonymization services could be potentially provided by a 3rd Party technology integration Partnership. Self-Sustaining The ARK Crew has a mission to make blockchain technology easily accessible to consumers​, even to the point where consumers do not know that they are using it. We not only develop the tools bridging the virtual with reality, but also provide the unique services consumers want, understand, and are willing to purchase using ARK. The ARK Crew develops additional platforms and services benefiting from the ARK technology, providing online and offline revenue streams for the ARK Platform, and leading to faster research and development of new and exciting ways to encourage consumer participation, educating them about blockchain technology, while simultaneously adding value to the ARK coin. By incorporating revenue streams into our projects, the ARK Crew can provide even more unique services for user adoption as we grow.","links":"https://ark.io/","market_cap":115887663,"market_cap_rank":566,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ark/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}