{"name":"FORE Protocol","id":"fore-protocol","symbol":"fore","description":"1. FORE Protocol is the first decentralized peer-to-peer predictions ecosystem powered by people. Create, participate in, and validate any prediction market on any event - and be rewarded through the redistribution of platform fees. Whether popular events in sports, esports, current affairs, or crypto, to incredibly niche events, you can find (or create) any market on FORE. 2. Players participate in markets against each other, with incredibly low fees, better odds, and trustless payouts. Meanwhile, 50% of platform fees are redistributed back to users for all productive activity: Prediction market creators earn 0.5% of the market. Analysts validate market outcomes to earn 2% market share. This creates a truly decentralized and democratic predictions ecosystem where the house doesn’t win - the users do. FORE Protocol is a set of smart contracts to help users create, participate, and validate prediction markets. 3. FORE initially set out to offer preferable odds to users by using machine learning and AI to come up with better pricing. But what the team quickly realized that centralization was the core problem, not just pricing. So, FORE pivoted to create a truly decentralized peer-to-peer predictions ecosystem - one that would improve arbitrage opportunities and distribute rewards to users instead of centralized entities. 4. FORE Token will be live June 30th 13:00 UTC. Shortly after, FORE Predict, a decentralized peer-to-peer predictions protocol, will launch on Arbitrum (MATIC, FTM & more to follow). After TGE and protocol launch, we have a number of key milestones to follow in 2023: FIAT on ramp, gamification of the protocol, real-world partners & sponsors, further chain integrations, new market structures, etc. FORE Predict will debut its mobile app in 2024, followed by FORE's development and more! 5.FORE's deflationary utility token rewards activity. FORE will have utility from day one: used to create, participate in & validate markets, mint NFTs, governance..","links":"https://foreprotocol.io","market_cap":713957,"market_cap_rank":3433,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fore-protocol/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xcbe94d75ec713b7ead84f55620dc3174beeb1cfe"},"ethereum":{"decimal_place":18,"contract_address":"0xb2ee0adbe0ef1281025d0676511bb1df14600f4d"}}}