{"name":"DOGE-1","id":"doge-1","symbol":"doge1","description":"In an unprecedented fusion of technology, finance, and space exploration, DOGE-1, a CubeSat mission initiated by Geometric Energy Corporation (GEC), is poised to revolutionize our perception of the moon and cryptocurrencies. Inspired by the popular Dogecoin and driven by innovation, this project is set to make history. What is DOGE-1? DOGE-1 is a groundbreaking mission that will send a compact 40kg satellite into lunar orbit aboard a SpaceX Falcon 9 rocket. Its primary objective is to capture images and data of the lunar surface, advancing our knowledge of lunar geology and potential resources. What sets DOGE-1 apart is its space art display, capable of broadcasting ad images captured by an onboard camera back to Earth. The Birth of DOGE-1 Token One of the most captivating aspects of the DOGE-1 mission is the birth of the DOGE-1 token. This cryptocurrency token, inspired by the groundbreaking event, aims to bridge the gap between the world of cryptocurrencies and space exploration. The DOGE1 Token: What Makes It Unique? - Inspired by Space Exploration: The DOGE1 token draws its inspiration from the DOGE-1 mission, representing a significant milestone where cryptocurrency and space travel converge. - Decentralization: Like Dogecoin, the DOGE1 token embraces the principles of decentralization, offering users a transparent and community-driven platform. - Financial Potential: The DOGE-1 token has the potential to gain significant value if recognized and adopted by a broad audience, allowing investors to capitalize on its growth. -Utility within the Ecosystem: Beyond its investment potential, the token may provide access to exclusive content or participation in the project’s ecosystem, further enhancing its desirability.","links":"https://www.doge1mission.com/","market_cap":46329,"market_cap_rank":7671,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doge-1/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xd721706581d97ecd202bbab5c71b5a85f0f78e69","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xd721706581d97ecd202bbab5c71b5a85f0f78e69"}}}