{"name":"Dog (Bitcoin)","id":"dog-go-to-the-moon-rune","symbol":"dog","description":"Dog (Bitcoin) is a fully decentralized memecoin on the Bitcoin blockchain, backed by a community dedicated to onboarding millions of people to Bitcoin. Dog is secured by the Bitcoin blockchain and exists on Bitcoin L1, marking a significant innovation compared to Bitcoin with just BTC. Dog is a Bitcoin Runes token with a minimal on-chain footprint, native to Bitcoin, and stored in UTXOs, just like Bitcoin. What is the project about? Dog does not do any paid promotion and is fully decentralized just like Bitcoin. Every influencer who chooses to post about Dog either received the airdrop or bought on secondary. Dog leverages the CC0 license to ensure that Dog is not owned by any single entity but rather by everyone. This had lead to the \"DOG Army\" independently creating art, apps, lotteries, plushies, websites, podcast, magazines, X account, IRL meetups, clothing lines, PFP collections, Telegram groups, and TikTok/Instagram about Dog. What makes your project unique? Dog was airdropped in the fairest memecoin launch ever. In early 2024, the Bitcoin Ordinals ecosystem came together in a full volunteer initiative that rewarded early adopters of the Ordinals Protocol. There was no team allocation, and 100% of the supply was airdropped for free. The airdrop algorithm favored neither whales nor influencers; it was determined by the community and made open-source for maximum transparency.","links":"https://dogofbitcoin.com/","market_cap":266847392,"market_cap_rank":280,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dog-go-to-the-moon-rune/logo.png","detail_platform":{"ordinals":{"decimal_place":5,"contract_address":"840000:3"},"starknet":{"decimal_place":5,"contract_address":"0x040e81cfeb176bfdbc5047bbc55eb471cfab20a6b221f38d8fda134e1bfffca4","geckoterminal_url":"https://www.geckoterminal.com/starknet-alpha/tokens/0x040e81cfeb176bfdbc5047bbc55eb471cfab20a6b221f38d8fda134e1bfffca4"},"solana":{"decimal_place":5,"contract_address":"dog1viwbb2vWDpER5FrJ4YFG6gq6XuyFohUe9TXN65u","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/dog1viwbb2vWDpER5FrJ4YFG6gq6XuyFohUe9TXN65u"}}}