{"name":"Maxity","id":"maxity","symbol":"max","description":"1. What Is Max Token? Launched in Nov 2021, Max Token is the ERC-20 utility token used within the world first Web3 social impact protocol – Maxity. The aims of Maxity are to solve NGOs fundraising issues and charity transparency through blockchain technology. Aside being the largest charity NFT Marketplace, Maxity has launched a whole ecosystem of functionalities for its users including Charity Dao, Artists Dao, Influencer Dao, DEFI platform, Volunteer-to-earn (V2E) scheme and finally the Symbiotic Metaverse, all with the means to achieve the 17 United Nation Sustainable Development Goals for human being. 2. Who Are the Founders of Max Token? Professor Xiong is the co-founder and director of Maxity. He is the Associate Dean International of Surrey University, one of the nine advisory board members of All Party Parliamentary Group on Blockchain in the UK and a leading expert in blockchain technology. His research interests in the impact bitcoin mining has on climate change targets and how Blockchain could revolutionise the ownership of digital content, particularly on social media platforms. Amjad Suleman AJ is the senior strategic advisor for Maxity. He has been associated with global investment banking and Fintech industry for over two decades and has held Senior Management positions with Citigroup. He specialised in large scale Investments, energy projects including alternative energy, mining and manufacturing. 3. What Makes Max Token Unique? Being a Web3 social impact incubator that uses distributed ledger technology, cryptography, smart contracts, non-fungible tokens and metaverse, Maxity is a new business model that links current global issues to the blockchain world and allows fundraisers and NGOs to create digital artwork. Maxity NFT Marketplace: One stop solution for charities, NGOs, artists and celebrities to design, develop, market and sell charitable NFTs. Maxity DeFi Platform: High APY financial management through cryptocurrencies (including MAX Token) staking or yield-farming techniques. Maxity Transparency Platform: Helping charities to build greater trust by putting construction of buildings and other resources, or grants made to beneficiaries on blockchain. Symbiotic Metaverse: 7 Continents with 100K virtual lands, NGOs and other institutions onboard and release Charitable Tasks for volunteers to accomplish (V2E), Symbiotic Metaverse aims to solve all problems faced by living beings, environment, society, and etc. It is a metaverse where social inequality will no longer exist, and where organisms and environment live in genuine freedom and solidarity with each other. The Social Impact Protocol proposed by Maxity comes in a comprehensive development framework on the irrevocable and transparent blockchain. From fundraising, fund management and spending, reports disclosure, activities voting and execution, Maxity provides a versatile platform where all functionalities come in one package. Max Token is Maxity’s governance token, allowing token holders to buy NFTs or directly contribute to donation at the click of a button. It is also the native currency of Symbiotic Metaverse, a tool to participate in the ecosystem by incorporating Max Token into services and charities projects. 4. How Many Max Token Are There in Circulation? Total supply of Max Token is fixed at 1 billion tokens, all minted at once. Since the Launch Day (July 19, 2022), 6.5% is currently in circulation before IEO. This percentage will continually increase following IEO at regular intervals over a 36-month period. The amount of Max Token in circulation is a dynamic number that will constantly change both due to the aforementioned schedule and a myriad of market factors. 5. How Is the Max Token Network Secured? Max Token is an ERC-20 token launched on the Ethereum blockchain. As a result, it is secured by Ethereum’s proof-of-work (POW) consensus mechanism. 6. Where Can You Buy Max Token? Max Token will be available to trade on numerous exchange platforms, top centralized exchanges and decentralised exchanges.","links":"https://maxity.io/#","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/maxity/logo.png"}