{"name":"Coin","id":"coin","symbol":"coin","description":"What Is Coin ($COIN)? Coin is a digital decentralized network composed of protocols, smart contracts, decentralized apps (dApps), and services that help facilitate the transfer of value across the Internet. Coin creates an open financial system made up of decentralized solutions that empower consumers to execute financial transactions with freedom and ease. What Makes Up the Coin Ecosystem? Token The Coin Ecosystem is powered by the $COIN token, a digital asset and network access token that enables holders to execute Coin smart contracts, stake interest, and execute governance rights. $COIN also represents a stake in the Coin protocol and is the voting currency for all proposed protocol and platform changes by the community. Wallet Coin Wallet is an all-in-one decentralized cryptocurrency wallet, exchange, and AI assistant. Coin Wallet includes a native cryptocurrency wallet and exchange for users to store and swap popular digital assets directly with each other. Unlike many other decentralized exchanges, swaps can occur cross-chain across different blockchains including Bitcoin, Ethereum, ERC20 tokens, and more. Coin Wallet is non-custodial, lives in a browser extension, and is non-susceptible to hacks as users are the only people that have and can access their funds. For exchanging assets, Coin Wallet uses atomic swap technology to handle direct peer-to-peer (P2P) transactions across different blockchains. Coin's integrated artificial intelligence (AI) assistant transforms the traditional financial experience by highlighting and providing insights for blockchain-specific keywords on any web page. Additionally, the Coin AI enables users to execute transactions by simply typing a command in any input field. The combination of decentralized P2P technology, cross-chain interoperability, and AI integration, creates a secure and unparalleled experience to help consumers easily manage their digital assets. Swap Coin Swap is a P2P cross-chain decentralized exchange (DEX) that is compatible with any Internet web browser. It utilizes the same atomic swap technology in the Coin Wallet excluding a native wallet and the Coin AI assistant — this enables users to connect their favorite Web3 cryptocurrency wallet (including Coin Wallet) without the need to install a browser extension. Who Are the Founders and Advisors of Coin? Coin is assembled from a diverse and experienced team of technology veterans spanning the information technology, financial, and blockchain industries. Founder and CEO Damon Nam is formerly an accomplished 17-year IT services professional at Microsoft. He held multiple management roles for the largest software company in the world and in his last role, was responsible for a $90M book of business as a Partner Program Director for Microsoft North America. CTO Byron Levels is an experienced 20-plus-year technologist who has worked for many Fortune 500 companies including Microsoft, Pepsi, and American Airlines to name a few. He has a strong background in developing and deploying enterprise applications. Coin is supported by a team of advisors who are the pioneers in AI and blockchain. They include founder and CEO of FetchyFox Christina Apatow, founder and CEO of Celsius Network and investor of VoIP Alex Mashinsky, and co-founder of the Augur prediction market and Ausum Ventures, Jeremy Gardner. What Makes Coin Unique? Native cross-chain interoperability No more wrapped tokens. No more sending to multiple exchanges to swap tokens. Unlike many industry leading decentralized exchanges, one of the unique features of the Coin network is swapping directly between different blockchains. The Coin network leverages atomic swap technology and Hash Time Lock Contracts to handle direct peer-to-peer trustless transactions. This removes the need for custodians, middlemen, and escrow agents. Coin Wallet and Coin Swap supports popular digital assets such as Bitcoin, Ethereum, ERC20 supported tokens, and more. An AI assistant providing insights Coin Wallet includes browser extension support for popular web browsers such as Google Chrome. When installed, the browser extension extends its capability by using AI technology to execute transactions faster and provide insights to help users save time and money. By recognizing finance and blockchain-related keywords from any webpage, the AI assistant can provide education, pricing information, or help consumers execute financial transactions directly from any webpage with an input field. Conversational-level experience Usability and ease-of-use remain a significant barrier-to-entry and problem for many consumers in the blockchain industry. Coin Wallet and Coin Swap uses natural language processing technology to recognize intent while helping users navigate through their financial journey. Coin also leverages this technology for alternate input sources such as text (messaging apps) and voice (digital assistants). How Many Coin ($COIN) Tokens are Available and In Circulation? $COIN has a maximum supply of 100M tokens. Approximately 49M of the tokens are circulating with the remainder of those tokens distributed in the network’s staking reserve and Uniswap liquidity pool. Where Can You Buy Coin ($COIN)? As of December 2020, Coin ($COIN) can be traded at Uniswap.","links":"https://coindefi.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe61fdaf474fac07063f2234fb9e60c1163cfa850"}}}