{"name":"ChangeNOW","id":"changenow","symbol":"now","description":"What is ChangeNOW Token? NOW is the native digital asset introduced by ChangeNOW, an instant exchange platform, to serve as an internal currency on NOW products. At this moment, the token is used as a means of payment for asset listing fees on ChangeNOW, as well as is the platform’s own stakeable token. What Makes ChangeNOW Token Unique? NOW tokens fuel all the products within the NOW product ecosystem. You can get NOW Token as cashback at ChangeNOW or NOW Wallet. Also, you can get up to 6.25% ROI yearly by staking it! Token’s use area is constantly widening for individuals and businesses to add new possibilities. Meanwhile, regular quarter burns increase the value of each token. Where ChangeNOW Tokens can be used? Use NOW Tokens to purchase goods and services with NOW Payments Pay for nodes services in NOW Nodes at special prices using NOW Tokens. Gain access to Pro account in ChangeNOW, which offer up to 20% fee back on every transaction. Take out crypto loans using NOW tokens as collateral. Pay for Anti-Money Laundering (AML) checks using NOW Tokens. And much more How Many ChangeNOW Tokens Are There in Circulation? Total supply of NOW Tokens is 199,763,509.9. It has been already burnt 102,190,154.33 NOW Tokens and it will continue until their number reaches 100,000,000! Allocation of NOW Tokens: 40% Reserve 12% Development fund 12% Advisors and corporate evangelists 12% Marketing needs 10% Risks prevention 30% Airdrop 14% Team bonuses 10% Private investors Staking ChangeNOW Tokens NOW Token holders have the opportunity to stake their funds by 6,25 % per annum! Rewards are granted weekly and accumulated in a staking pool. You can redeem or restake them partially or fully as desired. How Is the ChangeNOW Network Secured? NOW is supported by the reliable Binance Chain and Ethereum networks for consensus. This token contracts are thoroughly audited, with no extra minting or admin features, ensuring full decentralization and security. Additionally, ChangeNOW has est","links":"https://changenow.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/changenow/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0xe9a95d175a5f4c9369f3b74222402eb1b837693b","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe9a95d175a5f4c9369f3b74222402eb1b837693b"},"binancecoin":{"decimal_place":8,"contract_address":"NOW-E68"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x02533c1e9abbafe5816ed8b27c0d22a8731075e0","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x02533c1e9abbafe5816ed8b27c0d22a8731075e0"}}}