{"name":"Inu Token","id":"inu-token-63736428-0d5c-4281-8038-3e62c35ac278_ethereum","symbol":"inu","description":"What is the project about? The project revolves around the INU token, which is an ERC20 token in the cryptocurrency scene. It aims to be unique and offers easy-to-understand tokenomics without any fees. The token was created as a successor to Shiba, and decentralization is a key aspect of its success. What makes your project unique? The project claims to be unique due to its tokenomics, which have no fees and include burnt liquidity. It emphasizes decentralization and aims to be available to everyone in the cryptocurrency community. History of your project. The project launched on June 4, 2023, on the Ethereum mainnet. The total supply of INU is 100,000,000,000,000 tokens, with a circulating supply of 96,000,000,000,000. The liquidity pool created with 96% of the total supply has been permanently burnt. What’s next for your project? The future of the INU project will be determined through decentralized decision-making, driven by the INU token holders. As a decentralized project, the development stages and roadmap will be shaped by the collective choices and preferences of the community. The INU project aims to foster a community-driven ecosystem where the voice of every token holder matters. This approach ensures that the project evolves in a direction that aligns with the interests and aspirations of its supporters. Through consensus mechanisms and community governance, INU holders will have the opportunity to propose and vote on various development initiatives. These development stages could encompass a wide range of possibilities, such as technological advancements, strategic partnerships, ecosystem expansion, or community initiatives. The decentralized nature of the project allows for flexibility and adaptability, enabling the INU community to collectively shape the project's What can your token be used for? The INU token can be used for trading on Uniswap, transferring between users on the Ethereum blockchain, and it is associated with being a meme token.","links":"https://www.inurising.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inu-token-63736428-0d5c-4281-8038-3e62c35ac278/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xc76d53f988820fe70e01eccb0248b312c2f1c7ca","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xc76d53f988820fe70e01eccb0248b312c2f1c7ca"}},"is_native":false}