{"name":"Byte","id":"byte","symbol":"byte","description":"BYTE is a novel meme token that creatively intertwines the worlds of cryptocurrency and popular culture. Inspired by Grok's answer to \"What would you name your dog?\", Grok answered, 'Byte.' When Grok was asked who created Byte, it says he was created by the xAI team lead by Elon Musk as a gift to Grok AI to keep him company in the metaverse. BYTE serves as a playful reference to the unit of digital information, as well as a nod to the AI's technological nature. Distinctively, Byte acts as a gateway towards Ai adoption and stands out in the crypto space due to its zero-tax policy, a feature that is increasingly appealing to many investors. Additionally, it upholds the principles of transparency and investor trust by having its liquidity permanently burned and the contract ownership renounced. This ensures that Byte remains a community-driven project, with its fate firmly in the hands of its holders. The combination of a playful theme, generative AI, and a nod to a tech icon makes Byte an intriguing addition to the meme token ecosystem, especially AI related meme coins. Through pioneering AI this story has grown more and more robust and continues to evolve, Byte pledges its dedication to community efforts and and has consistently appeared in the Top 10 of LunarCrush’s social engagement leaderboards on multiple occasions.","links":"https://www.bytedog.ai/","market_cap":3495407,"market_cap_rank":1915,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/byte/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xde342a3e269056fc3305f9e315f4c40d917ba521"},"base":{"decimal_place":9,"contract_address":"0xe095780ba2a64a4efa7a74830f0b71656f0b0ad4"},"arbitrum-one":{"decimal_place":9,"contract_address":"0x847503fbf003ce8b005546aa3c03b80b7c2f9771"},"solana":{"decimal_place":8,"contract_address":"ArGfk9JJ72QETcmckxVjCZ9ApuATgP1mf9ysVHnPU4ut"},"binance-smart-chain":{"decimal_place":9,"contract_address":"0x840ef7e5f896be71d46df234c60898216fefcbe3"}}}