{"name":"Corite","id":"corite","symbol":"co","description":"Corite (CO) is a Swedish music and tech startup founded in 2018 that has its own distinct approach to funding artists. It works by letting fans invest in music and get a share of streaming profits, becoming an integral part of the journey from product creation to implementation. The beta version of the platform was released in October 2019 and now has a 25 '000 user base. The essence of the Corite business model is as follows: thanks to the financial support of fans, artists can independently build their careers and earn money from their own work. Fans can even get involved in the creative process and promote their favorite music. Meanwhile, artists can fund and release their music through dedicated fandom. This scheme works due to the strong connection between artists and fans. In July 2021, Corite entered the US market and partnered with Hitco to successfully close a US$2.2 million presale for their utility token $CO – the native currency of the Corite platform. Thus, Corite expanded their audiences, attracted a talented team and created a democratic working environment for artists. More recently, in January 2022, Corite also announced the closing of a €600K seed round for the European launch of its fan funding platform. The round was led by Tagehus, Eastate and Almi Invest. Corite works alongside a number of prominent music industry professionals such as L.A. Reid and Charles Goldstuck, founders of Hitco Entertainment, legendary producers Rico Love (Beyonce, Usher) and Konstantin Kersting (Dance Monkey, 4000 studios) and more. Recently, Corite completed a deal with Alan Walker to release multiple tracks and help bring the \"Walkerverse\" to Web3. In January 2022, Corite CO succesfully completed a $ 6.2 million private token sale round to launch the upcoming blockchain platform. Investors include NGC, CoinCO, Coin98, KuCoin labs, Chromaway, Gate labs, Kyros Venture, Shima Capital, Everse Capital, Rarestone Capital, NGC","links":"https://corite.com/","market_cap":136596,"market_cap_rank":5854,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/corite/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x936b6659ad0c1b244ba8efe639092acae30dc8d6"}}}