{"name":"VoldemortTrumpRobotnik-10Neko","id":"voldemorttrumprobotnik-10neko_solana","symbol":"ethereum","description":"What is the project about? The core philosophy of this project is that memecoins can represent a form of new media entertainment, in which communities evolve around token-related activities, such as receiving NFTs, staking blockchain-derived assets, and using the power of memes to recruit others to join a fun experience interacting with owners and enthusiasts of other memcoins. What makes your project unique? The development team for VoldemortTrumpRobotnik-10Neko has produced a variety of memes, NFTs, and entertaining digital content, related to the on-going fued between $ETHEREUM and $BITCOIN. One unique facet of VTR-10N is that, while 90% of the supply is targeted for liquidity pools, 10% of the supply will be distributed among community members who participate in collecting NFTs and staking those assets for a chance to earn $schizocurrency. 10% of the supply of VTR-10N will be distributed among $schizocurrency holders on June 9, 2024. History of your project. VoldemortTrumpRobotnik-10Neko (Ticker $ETHEREUM) is a memecoin community that represents the major rival of HarryPotterObamaSonic10Inu (Ticker $BITCOIN). The tokens have migrated from BSC to now compete on the Ethereum blockchain. Both HPOS10I and VTR-10N have been the subject of hundreds, if not thousands of memes, and each have accrued a cult following which has made them popular rallying points. What’s next for your project? The project evolves with community engagement. Members of the HPOS10I and VTR-10N communities have already debated with each other in Twitter Spaces and other platforms, for the entertainment of spectators and owners of the digital currencies. The unknown aspect of where the memes and adventures will take the coins' enthusiasts is a form of entertainment. What can your token be used for? Owning these memecoins is a ticket to Discord and other gated communities. The coins can also be used to purchase NFTs and other digital assets.","links":"https://www.vtr-10neko.com/","market_cap":130343,"market_cap_rank":6587,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/voldemorttrumprobotnik-10neko/logo.png","detail_platform":{"solana":{"decimal_place":8,"contract_address":"2kj1MLqBPnhCTyjxT3MtJhcktJHxgR7s4EDu18khsvgj","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/2kj1MLqBPnhCTyjxT3MtJhcktJHxgR7s4EDu18khsvgj"}},"is_native":false}