{"name":"LuckyDragon","id":"luckydragon","symbol":"lucky","description":"$LUCKY is a unique staking and BNB reward token on Binance Smart Chain. Join us for an incredible journey that empowers investors, backed by an experienced team. Lucky Dragon has a unique staking system available on launch, designed to reward those willing to lock up their tokens. The lockup period is 7 days, which generates both $LUCKY and BNB rewards exclusively to the wallet that is staking. These rewards are sustained through our tax system, and will be increasingly sustained when we deploy our stable coin farms (25% locked for these farms when ready). These staking system is called \"Lucky Bank\" and our ecosystem will be designed to sustain these rewards over the long-term. This double reward staking pool captures the beauty of a sustainable APY and reward system. As for tokenomics, $LUCKY tax structure is a simple: 7% on both buys and sells (1% Dev, 3% Bank, 3% Marketing). There was a small presale of 250 BNB, and the following tokenomics were distributed on launch: Lucky Bank: 10% Future Stablecoin Staking: 25%, Locked Team (Vested in Lucky Bank): 13% Private Sale: 7% Tokens for Liquidity: 15% Tokens for Presale: 30% We plan on introducing multiple dApps, including community investment pools that can stake LUCKY to participate in exclusive IPO's, Investments, and more. Our capabilities to grow are greatly enhanced on the Binance Smart Chain, as gas fees are much lower than most other Blockchains. Once we complete specific phases in our roadmap, $LUCKY plans on obtaining full regulations and licensing to become an official sportsbook and expand aggressively. Our goals will continue to grow, and project development and team expansion will occur at a rapid pace. LuckyDragon also has unique community events exclusive to Lucky Dragon holders. One of our community events is the \"777 draw\" that happens every 777 minutes. Random holders are selected to win huge rewards every day just by holding. These community events will be constantly deployed to create a bo","links":"https://luckydragon.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/luckydragon/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x52d95492f421425a5a507c0516034041b95fdaa3"}}}