{"name":"ShredN","id":"shredn","symbol":"shred","description":"What is the project about? ShredN is a protocol dedicated to perfectly solve the low liquidity problemof NFTs. Unlikeother NFT fragmentation or NFT AMM protocols, ShredN will set different liquidity solutionsfor different types of NFTs (ERC-721 or ERC-1155). At the same time, the ShredNprotocol will distinguish different ERC-721 IDs, allowing NFTs with different attributes to achievefairvaluations based on their rarity traits. What makes your project unique? 1. Targeted Solutions The ShredN protocol covers a variety of liquidity solutions. These include: fragmentation, NFT AMM, and the creation of trading strategies for NFT traits. Through Shredn users canchoose the right solution for their individual needs. 2. Multi-chain ShredN's vision is to enable all NFTs to unlock and access liquidity. To this end, ShredNwill support all public chains where NFTs exist. 3. Community Co-Governance Community members can vote to manage the NFT projects that exist on ShredN, decidethedirection of ShredN, and work together to develop NFT liquidity solutions. 4. Aggregation In order to make the price discovery of NFTs smoother and more liquid, ShredNwill aggregate all existing NFT liquidity solution platforms. What can your token be used for? Community Governance: Users holding SHRED can decide the development of ShredNthrough voting and manage the NFT projects on ShredN's shelves. Fee reduction: When trading NFTs on ShredN, the platform will charge a portion of thefeeas a reward for NFT liquidity providers; users holding ShredN will be charged a lower feewhen trading. NFT liquidity providing rewards: the commission charged by the platformwill be issuedtoNFT liquidity providers in the form of SHRED tokens","links":"https://shredn.io/","market_cap":2356818,"market_cap_rank":3071,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shredn/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xddfd6382a18ad7279eb6db4dfb78922ddc33d6e7"}}}