{"name":"Vocare ex Machina","id":"vocare-ex-machina","symbol":"vocare","description":"What is Vocare ex Machina? Vocare ex Machina is the first decentralized influencer that calls and promotes projects through community voting and vetting. It is the first of a kind ecosystem that is not controlled by a single, centralized entity but by an entire community promoting true decentralization of power and influence. Vocare ex Machina offers a comprehensive dashboard for both project owners looking for promotion and the community who is looking to vote. Once a project is under voting, approved or has won the majority votes, it is called on our Telegram channel. This entire ecosystem is connected with our Telegram notification bots to keep the whole process trendy and seamless. What makes your project unique? Vocare ex Machina is unique in a lot of ways, starting with the concept itself. In the quest of decentralization we have been successful with many things but power and influence is yet to be addressed, with our unique brand narrative and approach towards influence, we have been able to successfully create an ecosystem that is both decentralized and fair to all the parties involved. History of your project. We brainstormed for a few months regarding how can we address the problem with influence and awareness in this space, and imagined a way that was more fair and transparent. After successfully creating a tightly knit economy and a sustainable ecosystem, we fairly launched Vocare on 25th August 2023 without any presale, private sale or team tokens. What’s next for your project? Our vision is to provide more incentives for project owners to collaborate with our community and provide better rewards to the existing community. We are also going to work on brand engagement through a number of unique ways such as custom avatars, achievements and other engaging activities. Our mission is to create a wholly community owned ecosystem that is also a powerhouse for generating awareness. What can your token be used for? VOCARE tokens are required by the community to vote on projects and redeem treasury rewards. Project owners also need to lock up a certain amount of VOCARE tokens in order to bring legitimacy to their submitted requests. The entire ecosystem of Vocare ex Machina relies heavily on its native token to ensure that our investors are receiving value in one way or the other.","links":"https://vocare.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vocare-ex-machina/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x4eb5124d04227f1aab771a37e131e62f17c4ffdc"}}}