{"name":"Zircuit","id":"zircuit","symbol":"zrc","description":"Zircuit is a fully EVM-compatible zero-knowledge rollup powering the limitless potential of web3. Backed by pioneering L2 research, the network’s unique hybrid architecture combines battle-tested infrastructure with zero-knowledge proofs to give developers the best of both worlds. With cutting-edge performance and security at the sequencer level, users can explore new frontiers with faster transactions, reduced fees, and complete peace of mind. Currently, Zircuit is still in its Testnet phase. While we undergo the process for Mainnet launch, users can participate in testing on Testnet or being a part of our staking program. Zircuit will protect users at the sequencer level by monitoring the mempool for malicious transactions and preventing their inclusion into a block. In comparison to typical security efforts that focus on the application and smart contract levels, Zircuit’s revolutionary approach goes directly to the underlying sequencer level. Zircuit’s native bridge infrastructure incorporates best-in-class security architecture and safety practices. The canonical bridge is straightforward and easy to use while maximizing user security. By decomposing circuits into specialized parts and aggregating proofs, Zircuit achieves greater efficiency and lower operating costs. Combined with larger transaction batches and accelerated proof processing, users benefit via faster and cheaper transactions. Zircuit works with all your favorite Ethereum apps. It supports all major wallets such as MetaMask, as well as tools like Hardhat.","links":"https://www.zircuit.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zircuit/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfd418e42783382e86ae91e445406600ba144d162"},"zircuit":{"decimal_place":18,"contract_address":"0xfd418e42783382e86ae91e445406600ba144d162"}}}