{"name":"Libra Protocol","id":"libra-protocol-2","symbol":"libra","description":"Libra Finance is a groundbreaking decentralized finance (DeFi) protocol built on the Solana blockchain. It introduces the concept of a rebase token and interest derivative to the Solana ecosystem, offering users innovative financial instruments and opportunities for maximizing their returns. With Libra Finance, users can actively participate in shaping the narrative of decentralized finance while creating their financial masterpieces on a robust and high-performance blockchain platform. Key Features: Rebase Token: Libra Finance introduces Solana's first rebase token, a unique type of cryptocurrency whose circulating supply automatically adjusts based on predefined criteria such as market conditions, network metrics, or user-defined parameters. This dynamic mechanism aims to maintain price stability and incentivize long-term holders, providing a novel approach to managing token economics within the DeFi space. Interest Derivative: In addition to the rebase token, Libra Finance offers an interest derivative that enables users to leverage their assets and earn passive income through synthetic interest rates. This innovative financial instrument allows users to participate in yield-generating strategies without the need for traditional lending or borrowing platforms, providing greater flexibility and efficiency in managing their capital within the DeFi ecosystem. Solana Blockchain: Built on the Solana blockchain, Libra Finance leverages the platform's high throughput and low transaction costs to deliver a seamless and scalable decentralized finance experience. With Solana's advanced technology and growing ecosystem, Libra Finance ensures fast transaction finality and minimal gas fees, enabling users to interact with the protocol efficiently and cost-effectively. Community-driven Governance: Libra Finance empowers its community members to actively participate in governing the protocol through decentralized governance mechanisms.","links":"https://libra-finance.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/libra-protocol-2/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"Hz1XePA2vukqFBcf9P7VJ3AsMKoTXyPn3s21dNvGrHnd"}}}