{"name":"Duel Network","id":"duel-network","symbol":"duel","description":"Duel Network is a play-to-earn project in the Binance Smart Chain network that contains 3 main categories such as GameFi - Play to earn - NFT Marketplace. It is a unique project where you can vote on events such as finance, politics, state elections, and win an award as a result. In addition, the Real Time interactive game designed on Nft characters, which you can win prizes in Duel Network, will be published. There is a burning mechanism in the Duel Network called \"BurnDuels\". It aims to reduce the circulating supply every month by rewarding its users with this burning mechanism. Another feature of Duel Network is the NFT Marketplace. Thanks to this feature, a marketplace has been established for artists, designers and users who want to trade NFT. The most important feature of Duel Network's “duel” mechanism is that you never lose your capital. You can farm without losing your capital by making your choice in the duels (voting pools) that are opened and entering the voting pool with BNB - DUEL LP. If the voting pool you prefer wins when the voting pool is finished, all the farm rewards you make will be yours. You will also receive “farm” rewards for those who choose the other option. In this way, you will have a very good farm income. The other party, on the other hand, does not get any financial loss because he lost the preference, he can not only get the farm prize he has dug in that time, but can get his main money back as he wishes, without loss. The issue we want to solve; Many projects make their users vote via telegram and twitter, for example, a stock market is voting for the tokens it will list, but participating in this may not be transparent and not very fun. However, in the duel network crypto world, the motto of doing all the voting situations and rewarding them was set out. A short vote? The right place is duel.network.","links":"https://duel.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/duel-network/logo.png"}