{"name":"SparkPoint","id":"sparkpoint","symbol":"srk","description":"What is SparkPoint (SRK)? SparkPoint, officially known as SparkPoint Technologies Inc., is a registered corporation in the Philippines under the Securities and Exchange Commission (SEC). Since its launch on October 5, 2018, SparkPoint has been at the forefront of blockchain innovation in the Philippines, leveraging cutting-edge technology to create practical solutions for a global audience. Today, SparkPoint is driving the next wave of blockchain evolution by integrating artificial intelligence (AI) into its ecosystem. At the core of this vision is the SparkAgent AI Agents Launchpad platform, a groundbreaking initiative that combines the power of blockchain and AI to enable intelligent, automated services across various applications. This platform reflects SparkPoint’s commitment to advancing technology that empowers users and transforms industries. SparkPoint’s journey began with an initial funding of just $50,000, which was used to develop and launch a diverse suite of blockchain-based products, including: SparkPoint Wallet: A secure, user-friendly multi-cryptocurrency wallet. SparkLearn: An educational platform promoting blockchain and financial literacy. SparkPlay: Interactive games showcasing blockchain technology. SparkEarn: Incentive programs to encourage cryptocurrency adoption. SparkDeFi: Decentralized finance services aimed at financial inclusion. These products lay the foundation for SparkPoint’s ambitious exploration of blockchain and AI, positioning the company as a pioneer in developing scalable, next-generation solutions.","links":"https://sparkpoint.io","market_cap":443689,"market_cap_rank":5284,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sparkpoint/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0488401c3f535193fa8df029d9ffe615a06e74e6","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x0488401c3f535193fa8df029d9ffe615a06e74e6"},"harmony-shard-0":{"decimal_place":18,"contract_address":"0x9500a1fbef7014dbd384633fd20bb1e6916d6fca","geckoterminal_url":"https://www.geckoterminal.com/one/tokens/0x9500a1fbef7014dbd384633fd20bb1e6916d6fca"}}}