{"name":"Kabuni","id":"kabuni","symbol":"kbc","description":"What Is Kabuni (KBC)? Kabuni is an innovative platform with a mission to educate with purpose to unlock the design potential of every human being and elevate life. We are on a mission to create unprecedented change in the learning experience that enhances curricula and shapes the future of work. Kabuni believes in evidence-based micro-learning to empower individuals and provide them with the tools to excel in various aspects of life. KBC (Kabuni Coin) is the native utility token within the Kabuni ecosystem. It serves multiple purposes, including - Access to Premium Content - In-Platform Purchases - Governance - NFT Marketplace - Cross-Platform Integration - Learning Rewards - Creator Rewards Kabuni Tools and Services Overview: Kabuni offers a range of tools and services to support its mission: - Kabuni WIZARD: An advanced AI-driven platform empowering educators to craft curriculum tailored to individual learning styles and needs. It brings personalization to the forefront, ensuring every student finds their unique path to success. - Kabuni SPACE: An immersive virtual learning environment, leveraging spatial design and cutting-edge technology. It transforms traditional classrooms into dynamic VR spaces where students can interact, collaborate, and dive deep into subjects like never before. - Kabuni CAMPUS: A decentralized educational hub that melds VR, spatial design, and AI. It not only offers courses but fosters a community where learners and educators can co-create, ensuring that learning becomes a truly collaborative adventure. Together, Kabuni's tools will revolutionize the educational landscape, ensuring learners are future-ready in a rapidly evolving world. How Many KBC Coins Are There in Circulation? KBC was created with a total supply of 1B. The circulating supply may vary based on factors such as the release schedule and platform rewards.","links":"http://www.kabuni.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kabuni/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa88920b4a35f7d0e81bc586ce1875036fced9154"}}}