{"name":"Jones USDC","id":"jones-usdc","symbol":"jusdc","description":"jUSDC is a product of JonesDAO, a protocol that is already listed on CoinGecko. Jones DAO is a yield, strategy, and liquidity protocol for options. We deploy vaults that enable one-click access to institutional-grade options strategies while unlocking capital efficiency & liquidity for DeFi options through yield-bearing options-backed asset tokens. Jones recently launched a set of advanced strategy vaults, jGLP & jUSDC, that are built on top of the GMX platform and GLP. These vaults deliver transparent and consistent leveraged yield to users. They work in tandem to amplify the yield generated by GLP for depositors. - jGLP: Smart Leverage on the underlying GLP rewards rate - jUSDC: Transparent USDC yield without the inefficiencies of competing methods Both vaults offer optional auto-compounding. Choosing to auto-compound allows users to mint the jGLP and jUSDC receipt tokens. The jGLP vault accrues yield in ETH, while the jUSDC vault accrues yield in USDC. How do they work? The jGLP and jUSDC vaults are complementary. At a high level, the two Vaults work together by doing the following: 1. Users can deposit GLP or any GLP basket token into the jGLP Vault, and USDC into the jUSDC Vault. 2. The jGLP Vault borrows USDC collateral from the jUSDC Vault to mint more GLP, thereby gaining leverage on its GLP position. 3. The jGLP Vault delivers amplified and transparent real yield to depositors. 4. The jUSDC Vault delivers USDC yield to depositors by receiving a portion of the yield from the GLP strategy built on its collateral. The jGLP Vault only borrows from the jUSDC vault, and does not interact with any other leverage sources. jGLP maintains exposure similar to the broad crypto market (i.e ETH, BTC, etc.) while earning multiples of the base GLP yield. Even better, jGLP uses Smart Leverage, developed with extensive backtesting, to automatically rebalance within an algorithmically determined range.","links":"https://www.jonesdao.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jones-usdc/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xe66998533a1992ece9ea99cdf47686f4fc8458e0"}}}