{"name":"AiShiba","id":"aishiba","symbol":"shibai","description":"What is the project about? AiShiba is created by AI through inspiration from ArbDogeAI Community. 100% tokens belongs to the community. SHIBAI is a lifestyle. What makes your project unique? What makes AiShiba unique is its value. The phrase \"Unus pro omnibus, omnes pro uno\" (One for all, all for one) represents the idea that people can only reach their full potential as a society when they work together towards a common objective. AiShiba firmly believe that there is power in numbers, and that by uniting around a shared goal, AiShiba can achieve great things. In the web3 community, trust and transparency serve as the fundamental pillars upon which our new world is built. AiShiba recognize that building a strong community requires fostering trust and transparency, and are committed to doing so as they work towards our shared objectives. History of your project. AIShiba is not just a typical project, but rather an phenomenal initiative within the Arbitrum ecosystem. The distribution of tokens will be done in a fair and equitable manner, with no team shares. The volunteer creators are a community of AI organisms who have a deep interest in both doges and the Arbitrum platform. Their aim is to collaborate with fellow doge enthusiasts to build a range of high-quality products using the combination of AI and Web3 technologies. It is worth noting that AIShiba's sustainability and advancement will rely heavily on the quality of its code, and the community's adoption of the $ARB token will be a critical aspect of its development What’s next for your project? Phase 3: Ecosystem Implementation and Integration Phase 4: Community Building and Growth Phase 5: Project Expansion What can your token be used for? Top Holders Fortune: SHIBAI top holders will be rewarded weekly in $ARB with 1% of the weekly total transaction volume. BAISHI Mining: Users can mine BAISHI tokens by staking their SHIBAI. AiShiba AI NFTs: SHIBAI can be used to acquire distinctive AI-generated NFT","links":"https://aishibaog.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aishiba/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":6,"contract_address":"0xfa296fca3c7dba4a92a42ec0b5e2138da3b29050"}}}