{"name":"Digimon Rabbit","id":"digimon-rabbit","symbol":"drb","description":"The first digital MEME coin officially and uniquely authorized by the digital baby. A fully formed Digimon in the form of a rabbit, one of the 12 sacred beasts that appear in Oriental folklore. He can freely manipulate the \"chi\" that flows through his body, sometimes moving with flowing flexibility, and at other times delivering blows as heavy as iron, responding to both the soft and the hard. Her signature move is the \"Meditation Cure,\" which instantly heals any damage. His special move is \"Mantra Chant,\" which releases all the energy in his body, hardening his body tissues to the level of Krondizoid alloy and delivering a powerful blow. Digimon Rabbit a fictional creature that appears in the cross-platform product \"Digital Tyrannosaurus\" series developed by Bandai Co. The theatrical version of the anime \"Super Evolution! Digital Armor of Gold\" is the complete form of the digital beast that is the partner of Waris and the digital beast that is the partner of Li Xiaochun in the TV version of the anime \"Digital Beast Tamer\". Digimon (Japanese: デジモン, Hepburn: Dejimon, branded as Digimon: Digital Monsters, stylized as DIGIMON), short for \"Digital Monsters\" (デジタルモンスター Dejitaru Monsutā), is a Japanese media franchise encompassing virtual pet toys, anime, manga, video games, films and a trading card game. The franchise focuses on the eponymous creatures, who inhabit a \"Digital World\", a parallel universe that originated from Earth's various communication networks. There is an original basic setting for each individual digital beast, although the intention to change this situation on the occasion of the debut of the anime, in addition to the main character in the anime, there is also a new design of digital beasts, sometimes because of the change, there are large differences with the original basic setting.","links":"https://digimonrabbit.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/digimon-rabbit/logo.png"}