{"name":"Jesus Coin","id":"jesus-coin_ethereum","symbol":"jesus","description":"**What is Jesus Coin?** Jesus Coin was launched to transform the memecoin market with a unique narrative as the only cryptocurrency that encourages generosity. Jesus Coin is building a native transaction network on top of Ethereum to power decentralized, charitable, applications and organizations. **What makes your project unique?** Jesus Coin is an ERC-20 that revolutionizes generosity through open-source smart contracts and opens the door for decentralized governance within charitable organizations. **History of your project.** Jesus Coin was conceived by [Maker Lee](https://twitter.com/0xmakerlee), after seeing a need for innovation within the non-profit world. On April 25, 2023, $JESUS conducted a fundraising sale and was the number one trending coin on [PinkSale.finance](https://pinksale.finance/) (a presale platform.) Within 24 hours, Jesus Coin attracted over 600 holders who contributed to over $2m in trading volume on [UniSwap.](https://app.uniswap.org/#/swap?outputCurrency=0xba386a4ca26b85fd057ab1ef86e3dc7bdeb5ce70) **What’s next for your project?** Jesus Coin is building a decentralized app to facilitate charitable giving throughout non-profit organizations and is actively looking for new partnerships in the web2 and web3 ecosystems. **What can your token be used for?** Jesus Coin (JESUS) can be used as a currency and as governance within the Jesus Coin network. Because the supply of JESUS is set at 777 trillion, JESUS can also be used as a store of value.","links":"https://www.jesuscoin.xyz/","market_cap":3125306,"market_cap_rank":2502,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jesus-coin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xba386a4ca26b85fd057ab1ef86e3dc7bdeb5ce70","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xba386a4ca26b85fd057ab1ef86e3dc7bdeb5ce70"}},"is_native":false}