{"name":"Hippo Wallet","id":"hippopotamus_binance-smart-chain","symbol":"hpo","description":"What is Hippo Wallet Token (HPO)? Hippo Wallet Token (HPO) is the utility token that will fuel the products and services that are accessible in the Hippo Wallet app. Ten billion Hippo Wallet Token (HPO) will be minted on Ethereum (1/4), Moonbeam (1/4), Polygon (1/4), and Binance Smart Chain (1/4). Notably, there is also a cashback deflationary system whereby Blockchain Commodities will repurchase HPO tokens equivalent to 25% of its annual profit. Multi-blockchain Fungibility Like the Hippo Wallet app, Hippo Wallet Token (HPO) also contains multi-blockchain fungibility. This means that the Hippo Wallet Token (HPO) will be available on Binance Smart Chain, Ethereum, Polygon, and Moonbeam parachains. Hippo Wallet Token (HPO) will natively cross chain as the team develops a Smart Contract that will handle the burning-minting mechanism when tokens move from one blockchain network to another. What is Hippo Wallet? Hippo Wallet is a private and secure, decentralized non-custodial crypto wallet. It allows users to send, receive and store their digital assets through a mobile app (iOS and Android) or a desktop app (Windows, Linux, macOS). It offers unique features like Connect to Custom Node, Multi-signature, Multi-currency, Multi-blockchain, and Buying Crypto Via Fiat—to name a few. Since it is non-custodial, all passwords and keys are generated on users' devices, so only they have access to their accounts and data. Who created Hippo Wallet Token (HPO)? The team behind Hippo Wallet Token (HPO) is Blockchain Commodities. Blockchain Commodities is a custom blockchain software development company based in Dubai. It specializes in blockchain project consultation, helping businesses to create decentralized ecosystems and blockchain-based projects. Blockchain Commodities creates their products based on their values of transparency, privacy, and security. Its mission is to provide tools to make the crypto space safer and more secure for crypto users and its vision is","links":"https://hippowallet.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hippopotamus/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa0ed3c520dc0632657ad2eaaf19e26c4fd431a84","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa0ed3c520dc0632657ad2eaaf19e26c4fd431a84"}},"is_native":false}