{"name":"Cogito Protocol","id":"cogito-protocol","symbol":"cgv","description":"What is the project about? Cogito Protocol offers a “stablecoin-as-a-service” framework to create digital assets with low volatility called “tracercoins” such that they act as complements to existing crypto stablecoin landscapes. These digital assets are designed to offer stability without being directly correlated to traditional currencies or commodities. Instead, they are linked to non-financial indices that represent human progress, with an example of a GCOIN being pegged to an environmental Green Index. What makes your project unique? In recent years, cryptocurrencies and stablecoins have transformed the financial landscape, offering new opportunities for value storage and exchange. However, concerns about their long-term viability have arisen due to volatility and limitations. Cogito offers a visionary approach to stability by combining AI-driven technology with tracercoins, an innovative concept. This project incorporates artificial intelligence, a robust risk management framework, and the CGV token to tackle the challenges faced by stablecoins. Tracercoins represent a monumental leap forward in stable asset technology. History of your project. Cogito Protocol is a part of the SingularityNET's ecosystem that works towards a futuristic development of AI in various fields, such as DeFi, Biotechnology, or Entertainment. Notably, Ben Goertzel, a globally renowned AI expert and the visionary behind artificial general intelligence, co-founded Cogito. What’s next for your project? We are in the midst of developing GCoin and the launch of GCoin which is a \"Tracercoin\" Asset Class is planned in the 3rd quarter of 2023. What can your token be used for? The CGV is a governance and utility token that underpins the transparent and decentralized nature of the Cogito project and provides an opportunity for the community to directly impact and guide how these new assets are managed, measured, and released.","links":"https://www.cogitoprotocol.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cogito-protocol/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x1bdaf9ddd7658d8049391971d1fd48c0484f66ec"},"cardano":{"decimal_place":6,"contract_address":"3d547a7bb805648f86c4c14e5c4df14044ad59753f0a2946d70f8d3c"},"ethereum":{"decimal_place":6,"contract_address":"0xaef420fd77477d9dc8b46d704d44dd09d6c27866"}}}