{"name":"Bitcci Cash","id":"bitcci-cash","symbol":"bitcca","description":"The bitcci Group AG is a group of public stock companies with 25 employees and freelancers, located in the cryptovalley of Liechtenstein and Switzerland. Founded by its CEO, Christoph Elbert in 2017, the bitcci Group AG is building an entirely new global ecosystem for the next-generation sex industry, eliminating problems and making the industry legal, safe and free. In July 2021 the bitcci AG, the daughter company of the bitcci Group AG started an ICO and raised about 7.5 Mio USD winning over 5000 Token holders. bitcci moved to a new and larger office in the Cryptovalley area of Zug / Switzerland in December 2021. The bitcci Group has started a Series A financing round and a marketing campaign in June 2022 for 10 Mio CHF to win larger scale investors and speed up the growth of the bitcci ecosystem. In Q4/2022 the bitcci Group plans to start a Security Token offering with a tokenized share, the “bitcci Equity Token”, to raise an additional 200 Mio. CHF. We are already in the process of preparing the approvals from the financial regulation authorities to start the public sale. bitcci optimizes, regulates and decentralizes the entire sex industry, develop new business areas, introduce innovative technologies. We establish a new, modern culture of acceptance, transparency, trust and free self-determination. Within the \"bitcci ecosystem,\" we are building a new, global network of our own nightclubs, portals, apps, cloud services, and blockchain-based payment solutions for the next generation sex Industry. The global sex market was worth over $ 200 billion in 2021. The potential for growth is huge, because the internet has significantly changed the way in which sex is perceived and how it is experienced. For example, since 1980, the number of men who purchase sexual services has doubled worldwide. In addition to the great potential for the industry, there are also many challenges in the industry for which bitcci is developing unique solutions. Along the value chain of sexual services, we offer sex workers a modern package of services and training programmes marked by free self-determination that ensure their stable and long-term loyalty to the bitcci ecosystem and a high work-life balance. The fact that our IT system is already in operation in the 5 large nightclubs in Switzerland gives us the necessary business data and know-how regarding their needs. The operation of these 5 nightclubs has shown us that there is a considerable need for optimization, modernization, standardization and regulation in the industry. Our entire strategy and culture within the bitcci ecosystem is geared towards achieving these goals. The bitcci Group is preparing the launch of a new portal “bitcci.com” in Q3/2022, which contains all state of the art functions and possibilities for sex workers to promote themselves and monetize their content and communication.","links":"https://bitcci.ag/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitcci-cash/logo.png","detail_platform":{"ethereum":{"decimal_place":2,"contract_address":"0xe4d75e9b493458d032a5c3cc1ee9b0712c1ece06"}}}