{"name":"HELL HOUNDS","id":"hell-hounds","symbol":"soul","description":"Hell Hounds is a static rewards token by being the first lifestyle platform token that incorporates the redistribution and LP acquisition mechanics commonly seen in finance tokens and applies them to the wide variety of applications, including games on the platform. Hell Hounds, was created to serve a real purpose and to fill an unrealized niche. Hell Hounds crypto is an alternative culture token with multiple use case applications such as Gaming, Shopping, Movies, Entertainment and Traveling. Gaming: The first use case in which Hell Hounds will be utilized is in gaming and the release of our first title, Cassian’s Quest, shows just that. It is a fun, simple, tower defense game with a linear story. It is our first foray into gaming and the first of many titles to come. The target platform is Webgl and the technology being used is Unity. The cryptocurrency used in this game is simply to purchase it. It is not play-to-win, no one will charge the users X amount of crypto to buy towers and such. It is straightforward and a classic approach to games wherein you buy said game and it’s all yours. Cassian’s Quest will be followed up in the 1st quarter of 2022 with a massively multiplayer party PVP P2E mobile and pc game. This game is currently under development. In this game player enjoyment takes priority and cryptocurrency as well as NFTs take a backseat just to enhance the overall experience instead of being the centerpiece. There are too many games which push the cryptocurrency ahead of actual gameplay. This means that development will take a bit longer to with this game but we expect a larger player base because of the actual fun factor. Entertainment: Entertainment is a broad subject encompassing a whole myriad of different genres. Though videogames are considered entertainment, for specification sake this will be utilized for Film and Music. We will be hosting independent alternative culture such as horror, cyberpunk, steampunk films as well as indie bands on our site and will be charging our users to view said films and performances at the Hell Hounds Online Cinema where you can share and watch together with your friends, for a limited time only. Proceeds of which go directly to the film makers and musicians with Hell hounds receiving a minimal percentage to offset operational expenses. NFT tickets will be batch minted and sold per screening. Each NFT pass will be valid for 24 hours upon purchase. Travelling: Hell Hounds seeks to support the currently downed tourism industry by partnering up with all kinds of horror attractions around the world as a frictionless, safe, and secure payment system while simultaneously opening them up to a new set of customers. We envision Souls being used to transact with our partnered merchants to deliver an unprecedented level of service and speed without the international fees. Hell Hounds, will have a dedicated section with verified ratings of customers to share their experiences and to entice more people to visit the attraction. “Real reviews by really scared customers” is a fun and entertaining concept. Our reviewers will also be rewarded in our currency for each verified review, giving a new meaning to play-to-earn. Shopping: Hell Hounds seeks not just to partner with horror and counter-culture related e-commerce businesses as a safe and secure payment method but to create the first horror cryptocurrency/ecommerce collaboration as well. We envision ourselves tying up with smoke shops, clothing stores, voodoo/occult supplies and many more. Static Rewards: A static reward payout mechanism has been chosen to alleviate some of the downward sell pressure caused by early adopters dumping their tokens. The reflect mechanism encourages users to hold their tokens in exchange for the rewards which are based on the proportion of tokens held by each user. whıtepaper: https://hellhounds.io/wp-content/uploads/2021/12/whitepaperv10.pdf audit: https://certik-public-assets.s3.amazonaws.com/REP-HellHounds-2021-12-08.pdf","links":"https://hellhounds.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hell-hounds/logo.png"}