{"name":"SLOW","id":"slow","symbol":"slow","description":"The project was created by the NFT holder community inspired by the Artist IAMSLOTH. We are a community-driven project that is endorsed by the actual artist. The goal is to expand into the web 3 space, sharing the art and vision of IAMSLOTH with a broader audience while leveraging the innovative aspects of blockchain technology. This initiative not only aims to celebrate the unique artwork of IAMSLOTH but also to foster a decentralized platform where creativity meets technology. Our vision includes creating a space where art enthusiasts can engage with IAMSLOTH's work in new, interactive ways. Through NFTs, we're not just selling art; we're offering a piece of a community, a part of a movement towards democratizing art ownership. This project is about building a sustainable ecosystem where artists can thrive, and collectors can own and perhaps even influence the direction of new art pieces. We're looking to integrate various web 3 technologies like DAOs (Decentralized Autonomous Organizations) to manage community decisions, smart contracts for transparent transactions, and possibly even virtual reality galleries where members can experience the art in an immersive environment. Our commitment is to maintain the integrity of IAMSLOTH's vision while pushing the boundaries of what art can be in the digital age. This endeavor is not just about expanding into web 3; it's about redefining what community engagement in art looks like. We're inviting art lovers, tech enthusiasts, and visionaries to join us in this journey to explore, enjoy, and co-create in a space where art transcends traditional boundaries.","links":"http://www.slowistheway.xyz","market_cap":4600.79,"market_cap_rank":10198,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/slow/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"FcKmtoSenpRhZS4LLs2YF4eEhaENaDCw169rwLypmoon","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/FcKmtoSenpRhZS4LLs2YF4eEhaENaDCw169rwLypmoon"}}}