{"name":"Global Fan Token","id":"global-fan-token","symbol":"glft","description":"What is the project about? Global Fan Token will regularly bring together fan experiences and the community based on decisions made by the community. Users with the most GLFT, highest GLFT trading volume, and the highest number of GLFT transactions will win the experiences chosen by the community. What makes your project unique? Global Fan Token is designed to maximize fan experiences. Token holders can benefit from the following: • League match tickets. • Private lodges and viewing areas. • Jerseys and signed memorabilia. • Accommodation, travel, and tickets for international matches. • Private meetings. A portion of the commission income generated on the Bitci Exchange Market will be used for experiences voted on every week. History of your project. As technology develops, crypto assets have become increasingly popular. With their expanding range of applications, crypto assets have driven innovation in various sectors. The Global Fan Token was created to enhance fan experiences in a rapidly digitizing world with ever-changing and evolving end-user behavior. What’s next for your project? • Pre-initial supply of GLFT • Bitci Turkiye Listing • Launching Global Fan Token market on Bitci Exchange Market • Coingecko Listing • Coinmarketcap Listing • Bitci Global Listing • Listing GLFT on global exchange markets • Expanding GLFT usage areas • Announcing GLFT burning strategies What can your token be used for? Global Fan Token is designed to maximize fan experiences. Token holders can benefit from the following: • League match tickets. • Private lodges and viewing areas. • Jerseys and signed memorabilia. • Accommodation, travel, and tickets for international matches. • Private meetings. A portion of the commission income generated on the Bitci Exchange Market will be used for experiences voted on every week.","links":"https://globalfantoken.com/","market_cap":300195,"market_cap_rank":3395,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/global-fan-token/logo.png","detail_platform":{"Bitcichain":{"decimal_place":18,"contract_address":"0x74fc789f81b1489e309ea38c0e3aecff60688c60"}}}