{"name":"KAME","id":"kame","symbol":"kame","description":"$KAME is a utility token that transforms internet culture into a force for good. While most memecoins exist solely for speculation and short-term hype, $KAME takes a fundamentally different approach. Built on the Base Network, $KAME merges the viral energy of meme culture with real-world purpose — creating a digital asset that drives impact, not just price charts. Every $KAME transaction contributes to charitable efforts through transparent, on-chain mechanisms. A small portion of trading volume is allocated to verified nonprofit causes, allowing our community to support meaningful initiatives like clean water access, education, disaster relief, and more. These donations are managed through smart contracts and publicly visible on-chain — ensuring accountability, traceability, and trust. But we didn’t stop at promises — we built infrastructure. $KAME proudly launched the first crowdfunding and charity platform on the Base Network. This platform allows donors to directly support campaigns through crypto, with no centralized intermediaries and no hidden fees. Whether you’re contributing 0.01 ETH or just holding $KAME, you’re part of a decentralized movement reshaping how giving works in Web3. Our platform enables campaign organizers to create verified fundraising campaigns, while users can explore causes, donate using $KAME or other accepted tokens, and see real-time updates on how funds are being used. It’s transparent, efficient, and borderless — unlocking new potential for impact in communities often overlooked by traditional systems. This level of on-chain transparency, combined with Base’s low fees and scalability, allows us to create a charity ecosystem that is accessible to everyone — not just whales or institutions. It’s philanthropy reimagined for the blockchain era. At its core, $KAME is more than just a token — it’s a mission. It invites people to engage in something bigger than themselves. Whether through direct donations, NFT campaigns, or simply holding the token, every community member becomes part of a system that turns memes into meaningful action. In a space filled with noise, speculation, and short-lived projects, $KAME stands apart as a utility token built for sustainability, transparency, and global good. We’re here to prove that meme-powered communities can be powerful forces for change — and we’re just getting started.","links":"https://kameonbase.com/","market_cap":57307,"market_cap_rank":8302,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kame/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x2f0464a5da04b3091a328d89183237ffde47e62d","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x2f0464a5da04b3091a328d89183237ffde47e62d"}}}