{"name":"Decentra Box","id":"decentra-box","symbol":"dbox","description":"Decentrabox - The first fully decentralised,immutable file storage system built with IPFS and blockchain Web 3.0 $DBOX will be the native token to use our platform. Decentrabox is a revolutionary new cloud storage platform that leverages cutting-edge web3 technologies such as the InterPlanetary File System (IPFS) and the Ethereum blockchain to offer users free and censorship-resistant storage for their files. This new platform is designed to provide users with all the benefits of traditional cloud storage, such as easy file sharing and accessibility, but without the concerns associated with centralized data storage. With Decentrabox, users can enjoy free and secure storage of their files (free up to 5GB), without the need to worry about the security or integrity of their data. This is achieved through the use of IPFS, which offers decentralized file storage, and the Ethereum blockchain, which provides immutability and trustlessness. Features of Decentrabox Decentrabox offers a range of features that make it an attractive alternative to traditional cloud storage platforms: Free Storage - Decentrabox offers free storage for all users - up to 5GB of space! This means that users can store files with blockchain security, without having to worry about traditional storage problems all over. In case you need more space, we offer different options that you can see in our website! (http://decentrabox.io/) Censorship Resistance - Because Decentrabox uses IPFS, files stored on the platform are resistant to censorship. This means that files cannot be removed or deleted by any central authority, and are always available to those with the appropriate access. Storage Persistence - Unlike traditional cloud storage platforms, Decentrabox ensures that files remain available even if the original uploader is no longer present. This is achieved through the use of IPFS, which ensures that files are always available on the network.","links":"https://www.decentrabox.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/decentra-box/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x56c9d5f1e727de03643af220b5ce52de23d4d973"}}}