{"name":"Yocoin","id":"yocoin","symbol":"yoc","description":"Yoc is a fully decentralized platform. Its main function is an opportunity to create and place smart contracts and the decentralized applications on its basis. It is difficult to overestimate the advantages of these applications since they minimize any risks connected with different types of activity. The management of finance when the ICO is carried out, service insurance, trade, logistics, the creation of partner programs, the creation of new platforms for gamblings are the most popular spheres of use of these contracts and applications nowadays. It is an incomplete list of potential opportunities of the blockchain technology use. The Yoc platforms allow involving in a simple and convenient way to use the full resources of the most modern and advanced technologies existing nowadays. New opportunities for crowdfunding The new platform provides an absolutely new approach to crowdfunding. By means of the YOC platform, you have an opportunity to exclude a trust component between you as a future supplier of goods or service and the investor, to which whether it is peculiar to doubt decision-making to invest own money in the realization of your idea. You have an opportunity to create such conditions, having provided their smart with the contract which will allow storing money of the investor, the conditions stipulated in him won't be satisfied yet. In case of your success money will surely pass to you, and in case of your failure they will return to the investor, at the same time terms of the contract won't be able to be changed after the start of the contract in any way. At the same time, you can avoid the need to have the centralized arbitrator, the center of exchange of information or any other tool which needs to trust. In the same way, you can control the distribution of remunerations to investors who have supported your project at his early stage, and now have to receive all that is due to them. How to create a democratically autonomous organization? Imagine how any centralized organization works. There are people responsible for the adoption of strategic and vital decisions works. People who create a huge number of documents and reports, accountants who are engaged in the accounting of material values, etc. So, all of them can be mistaken as there are no people who are able to commit now mistakes. Their opinion can be prejudiced or represent the interests of any certain group of people, infringing upon the interests of other participants in the process given business. The YOC platform gives an opportunity to avoid it. It’s possible to give the management of all these processes to the robot which is impartial and will carry out all necessary actions according to the conditions which are written down in a smart contract. It would absolutely commit no mistakes. Allocate with an opportunity to vote for acceptance of important questions of the organization life of all participants according to a share of their general participation. It will be able to receive an absolutely transparent and honest adoption of this decision. When all of this is provided with the decentralized network, you will always provide smoothly working service.","links":"https://yocoin.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/yocoin/logo.png"}