{"name":"Gemie","id":"gemie","symbol":"gem","description":"Gemie is an Asian entertainment-focused metaverse platform and NFT marketplace built around fan culture. It serves as both the virtual hub of celebrities in the metaverse, and virtual fan clubs for their fans. In Gemie, fans can attend virtual events and collect utility-focused NFTs of their favorite celebrities, and also create NFTs and experiences to earn rewards. 💫 Our Vision Gemie’s vision is to create a platform for celebrities, brands, and fans to have direct and meaningful interactions. We aim to help celebrities achieve their full potential and reward their fans by launching their NFT collections; we strive to empower fans by giving them the opportunity to create experiences and run fan planets in the metaverse; and we aspire to bring brands to the Web3 space with one-stop design solutions. 🔥 Why is Gemie different? Gemie is the first and only metaverse platform and NFT marketplace dedicated entirely to the Asian entertainment industry and its fan culture. With our team’s industry expertise, utility-driven NFTs, and diverse user-generated virtual experiences, we hope to be the home for celebrating Asian talent. Some key differentiating factors between us and other metaverses include: - Our users can turn their fan art into NFTs to use in the metaverse or sell to generate income. - Our users can start and run their own fan planets with like-minded fans from around the world. - Our users can create experiences to enhance their fan planets. - Our team plans to collaborate closely with celebrities and entertainment partners to custom-create experiences and utility-focused NFTs for the Gemie community. - Our NFTs will be wearables and collectibles in the Gemie metaverse and will come with exclusive online and offline benefits. - Our metaverse will offer users the opportunities to interact with celebrities through virtual events such as concerts, after parties, hangouts, and movie premieres.","links":"https://Gemie.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gemie/logo.png"}