{"name":"Figments Club","id":"figments-club","symbol":"figma","description":"Stylized Figment is the genesis NFT collection of Figments Club. The Figments Club team has just started to deliver cryptographic assets based on blockchain technology. The Figments Club develops NFTs and digital collectibles that exist only in our imagination which gives real meaning to the name Figments, as well as the Figments Club team, specializes in the fields of cryptocurrency. Owners of Stylized Figment NFTs and $FIGMA tokens are considered members of the Figments Club and gain access to exclusive utilities and perks such as future NFTs airdrops, staking rewards, members-only future events and will be able to participate in the governance of the community wallet via a Decentralized Autonomous Organization (DAO), where they can exercise voting rights on key decisions and much more future benefits such as VIP access and Play-To-Earn rewards from the metaverse called Figments, we consider to build in the future. ($FIGMA is our Primary token of Figments Club and will be used as the governance token. Secondary reward token will be used as play-to-earn and metavers rewards in the future). Stylized Figment NFT is not just any PNG NFT project. Our vision is to push the technology boundary of decentralized blockchain and NFT by building a Metaverse called Figments, in which owners of Stylized Figments NFT Avatars can interact with one another in a Virtual Reality world, transact with $FIGMA Tokens as a currency, get rewarded through Metaverse utilities for contributing to the Metaverse by holding Stylized Figment NFTs. The possibilities are endless in the Figments Metaverse. Each Stylized Figment NFT is a key allowing the holders to enter the Metaverse we are building. Figments Club team together found the most affecting reward system as fuel to boost the values of all project`s products and the community at the same time and our strong royal community will be benefited from our own FigmentsClub Boost Reward System (FBR) continuously ahead. All details about our new","links":"https://www.figmentsclub.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/figments-club/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe5bc80382f1ebad820167714118201ae468a9929"}}}