{"name":"Cove Quant","id":"cove-quant_solana","symbol":"cove","description":"Welcome to The Cove - a system processing real-time Solana transaction data on Pump.Fun. Our advanced algorithms generate market insights, create AI-driven visualizations, and deploy autonomous agent protocols to interact with the community. The Cove Ecosystem consists of features and tools that will allow you to look through wallets and assess patterns with tokens and buying activity; discover wallets that are continuously early to runners; and stay updated on notable wallets. Within the ecosystem you'll discover: The Cove Quant: Our AI-powered analyst that synthesizes the wealth of information from pump.fun. Through The Cove Quants’s Twitter/X account (@TheCoveQuant), you’ll gain access to expert analyses of notable wallets and Pump.Fun tokens from data pulled directly from The Cove. In addition to Cove Quant's feed on Twitter/X, you'll also be able to interact and prompt The Cove Quant directly in our Telegram. Pump.Fun Alpha Wallet Analysis A real time updating list of potential alpha wallets on pump.fun Wallet Cluster Analysis A real time view into the last 15 mins of buying activity on pump.fun looking for tokens with high shared maker similarity Top Activity Tokens aka The Universe Tokens under 500k that seem to be getting a lot of activity according to the AI Backrooms An upcoming feature with 2 AI agents that converse about recent market data and trends. Plans include potentially including voice and creating an AI podcast about real time events in the meme markets Our token $COVE fuels the platform's innovative features. $COVE was created as a fair launch via Pump.Fun, allowing everyone the equal opportunity to acquire $COVE on the market.","links":"http://www.covequant.com","market_cap":8650.33,"market_cap_rank":11460,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cove-quant_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"DcU8uHn7abXgYL8AJUK3t8FckeAXrNcGYYBK7uBFpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/DcU8uHn7abXgYL8AJUK3t8FckeAXrNcGYYBK7uBFpump"}},"is_native":false}