{"name":"Lumishare","id":"lumishare","symbol":"lumi","description":"What is the project about? LumiShare is a financial blockchain ecosystem powered by $LUMI to tokenize and fractionalize real-world assets. starting with renewable energy assets. Verified renewable energy projects will have greater access to funding from both individual and institutional investors LumiShare has launched the Trust token, $LUMI, which is backed by three uncorrelated assets: Physical gold, the recovery fund (the cash reserve), and Technology (the stabilization algorithm) The $LUMI token is NOT a stable coin; it is a unique token with limited downside and unlimited upside. and its floor price will always be correlated with its all-time high market cap value. On every new all-time high market cap record, LumiShare will increase the Gold and Cash reserves. and the floor price will be increased accordingly. The primary use of $LUMI tokens will be as a means of investment on LumiPlace and for receiving returns from investments in renewable energy assets through our platform. In the near future it will be possible to pay with $LUMI on certain websites and stores. 'LumiPlace', LumiShare’s asset-backed NFT Marketplace, will tokenize renewable energy assets. On the one hand, this will give individual and institutional investors the opportunity to invest in green energy assets and earn a monthly yield from their investments. On the other hand, it will serve as an affordable alternative to capital for Renewable Energy projects. LumiPlace performs Integration with a third-party technological solution directly connected to the solar panels in order to capture the data and display it on the LumiPlace platform, thereby enabling investors to engage in data-driven risk management. What makes your project unique? LumiPlace offers verified Renewable Energy companies a platform to tokenize and fractionalize their assets, tapping into a predicted $16T Real World Asset Tokenization market by 2030, as indicated by Blackrock. We're backed by the esteemed Private Office of His Highness Sheikh Mohamed Bin Ahmed Bin Hamdan Al Nahyan a member of Abu Dhabi's Royal Family. LumiShare's powerhouse team brings expertise from giants like BlackRock, J.P. Morgan, Microsoft, and more, ensuring unparalleled knowledge from the Blockchain, renewable energy, fintech, and global banking sectors. History of your project. ✓ Recruitment of TOP Experts as employees and advisors ✓ No-Code Module Development ✓ Building the Ambassadors program ✓ The Private Office of H.H. MBA from the Royal Family of Abu Dhabi joined as an official partner and investor ✓ Completed Pre Seed round ✓ Establishing the UAE Company ✓Audit with CyberScope ✓ Official Website Launch ✓ Launching the social media and community ✓ Public Pre-Sale + Gold List Sale ✓ MVP version of LumiPlace asset backed NFT Marketplace ✓ Golden Launchpad on LumiShare website ✓ LumiLearn has launched free offline and online educational events about blockchain in different countries around the globe. ✓Audit with Certik ✓ First Exchanges Listings (August 8th 2023) ✓ Developed the Alpha version of LumiPlace ✓ Silver Badge KYC from Certik What’s next for your project? - LumiPlace's Alpha testing registration - Bug Bounty Program with Certik Q4 - 2023 - Launch LumiPlace V1: Renewable Energy Asset Tokenization Marketplace Q1 - 2024 - LumiShare Donation Plan 1st Project Launch Q3 - 2024 - LumiShare Donation Plan 2nd Project Launch - The Payment Gateway Pilot Launch Q4 - 2024 - The Payment Gateway Official Launch What can your token be used for? The primary use of $LUMI tokens will be as a means of investment on LumiPlace and for receiving returns from investments in renewable energy assets through our platform. In the near future it will be possible to pay with $LUMI on certain websites and stores.","links":"http://lumishare.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lumishare/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9d6df568d4d3e619b99a5f988ac7b2bcc3408753"}}}