{"name":"bofb","id":"bofb","symbol":"bofb","description":"BofB is a crypto exchange that was born as a solution to the unfriendly and uncooperative response that all the mainstream banks would provide to its customers that would try to use the banking channels to trade cryptocurrencies. Anyone who started using their preferred bank back in 2013 and up until today [2022] knows that wiring funds to a crypto platform could easily mean getting your account shut down if not wire-transfers being denied or returned for multiple unexplained reasons. Even up until today, crypto enthusiasts know that trading with digital assets is not welcomed at any bank in the planet. This is why if a crypto-friendly bank such as BofB became a reality it would not only be easily adopted by “bitcoiners”, but it would also send out a message to the banking-system reminding them that they must adapt to the customers’ needs instead of determining how their private property can be spent. BofB stand for “Bank of Bitcoin”, but it is not a bank, even though it has always been since day-1 part of the project to become fully licensed as a money transmitter and/or a chartered bank should BofB’s legal and compliance team determine that these licenses are necessary to continue to grow while being compliant within every jurisdiction where BofB plans to operate. BofB would aim to be a transitional platform, providing wallet, vault and exchange services, that adapt together with Bitcoin’s transformation from a crypto/fiat platform to a digital asset only structure. Until BofB does not obtain a bank and/or a money transmittal license it will only operate under the name of BofB [bofb.com] and never “Bank of Bitcoin” [bankofbitcoin.com] The idea of BofB’s name was born due to BofA -being the founders’ favorite bank- which operates under the two following domains: BofA.com and BankOfAmerica.com. This is why BofB’s founder decided to name his project as BofB and use BofB.com and BankOfBitcoin.com as the project’s main domains.","links":"https://bofb.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bofb/logo.png","detail_platform":{"solana":{"decimal_place":8,"contract_address":"45wdSjpSqZCk9mkqmq5Nh7beCEqqUJMJcVduwYCip5eq"}}}