{"name":"AICrew","id":"aicrew","symbol":"aicr","description":"What is the project about? AICrew is an innovative platform that aims to empower content creators and artists by providing a comprehensive suite of tools and a vibrant social ecosystem. With a focus on fostering creativity and enabling artistic expression, AICrew offers a collection of essential tools for various media formats, including images, videos, audio, and text. Moreover, AICrew has taken a unique step by introducing the Cyber Valkyries NFT Collection, which offers exclusive benefits to its owners and showcases the exceptional artistic potential of AI What makes your project unique? 1. With the help of the smartest AI technology, AICrew has all the essential tools for media of image or video format - from generating and editing to upscaling 2. Ecosystem for creators Limitless features, extensions, and integrations for media creators to craft, visualize, refine, and publish their creations - Mockup and template library - Social channels for creators - NFTs generators - Image to printings - Auto publishing History of your project. AICrew published the whitepaper in 2022. The social media of AICrew was created on March, 2023 and started Marketing campaign then announced partnerships. The token was listed on August 18, 2023 What’s next for your project? - Product & Platform Enhancement: We'll release new features and continue to optimize our platform based on user feedback and technological advancements. - Community Expansion: We'll host a series of webinars, AMAs, and community events to educate potential users What can your token be used for? - Gain access to exclusive community events - Gain access to AI ecosystem - Staking for passive income - Revenue sharing","links":"https://aicrew.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aicrew/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x499fc0ec9aade85de50af0c17513c7b850eb275f"}}}