{"name":"DegenReborn","id":"degenreborn","symbol":"degen","description":"What is the project about? DegenReborn is a text-based Degen life simulation game that offers an entertaining and meme-filled experience for all cryptocurrency enthusiasts. With the support of NFTs of crypto celebrities, players can create their own legendary crypto life. Additionally, DegenReborn focuses on facilitating a tokenomic that allows players to earn rewards, stake, receive BNB and DEGEN airdrops, and compete for the BNB lottery What makes your project unique? DegenReborn employs the powers of blockchain technology by introducing the DEGEN utility token and applying Chainlink Automation as well as Chainlink Vrf. History of your project. Since March 2023, DegenReborn has won numerous awards from ETH Dever Hackathon, CyberConnect Hackathon and Mask Network & Starkware Hackathons. DegenReborn has received strategic investment from notable projects including Project Twelve and CyberConnect. They also managed to build official partnerships with several influential projects such as TokenPocket, BitKeep, Element and more. They have also got special mentions from BNBChain and ChainLink on social media. On the minting day of Degen2009, the official NFT collection of DegenReborn, Degen2009 became the trending projects on OpenSea and still holds a floor price of 0.3ETH What’s next for your project? DEGEN will be listed on BitGet Apr.10th https://twitter.com/bitgetglobal/status/1642799847815118849?s=20 What can your token be used for? DEGEN is the native utility token that is used for: * Rewarding players for their in-game achievements * Staking on incarnations on the leaderboard to receive airdrops and competing for ultimate BNB lottery. * Purchasing talents & attributing points","links":"https://degenreborn.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/degenreborn/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1a131f7b106d58f33eaf0fe5b47db2f2045e5732"}}}