{"name":"Meson Network","id":"meson-network","symbol":"msn","description":"Meson Network is committed to creating an efficient bandwidth marketplace on Web3, using a blockchain protocol model to replace the traditional labor-based sales models, consolidating and monetizing idle bandwidth from long-tail users at a low cost. Meson Network is the foundation of data transmission for decentralized storage, computation, and the emerging Web3 Dapp ecosystem. Meson is trying to create the world’s largest bandwidth marketplace in the future. Here, users can exchange their unused bandwidth resources with Meson for tokens, and those who need bandwidth will come to Meson’s market to borrow bandwidth anywhere in the world. To achieve this goal, we cannot simply use the direct sales model. Existing cloud vendors rely more on a sales model, a top-down model, for aggregation of resources. For example, if you want to open a new local market, you need to recruit local people, and as the market coverage expands, the number of people recruited rises linearly or even exponentially. This model worked very well for the last 10–20 years because the sales model led to people targeting medium to large accounts, which can provide high output per account. But now, the situation is that a lot of resources are slowly dispersing to the long-tail market where the demand is much more fragmented, leading to much lesser output per account. However, demand from the long-tail market is growing stronger than the large account market. To capture the long tail market demand, there needs to be a new alternative to the direct sales model. The answer is open bandwidth exchange, done through Meson Network.","links":"https://www.meson.network/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meson-network/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xaa247c0d81b83812e1abf8bab078e4540d87e3fb","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xaa247c0d81b83812e1abf8bab078e4540d87e3fb"}}}