{"name":"Hamsters","id":"hamsters","symbol":"hams","description":"What is the project about? Hamsters is a groundbreaking gaming platform that blends real-life, live-streamed hamster races with a player vs player (PvP) betting system. Using blockchain technology and DeFi solutions, it offers a unique, interactive gaming experience. What makes your project unique? Our platform stands out for its dynamic fusion of live entertainment, DeFi, and community engagement. We have a unique tokenomics model rewarding active participation and a pioneering Telegram bot that enables betting straight from the messaging app, which is a first in the industry. History of your project. Hamsters was created to revolutionize traditional gaming and betting by offering live-streamed hamster races in combination with a DeFi gaming platform. Our community-centric approach has fostered a dedicated user base that actively participates in our ecosystem. What’s next for your project? Hamsters is committed to further innovation on its gaming platform. This includes introducing new games, enabling users to create and earn from their own games, and leveraging the Telegram bot to facilitate strategic partnerships with other major projects. These partnerships will increase platform exposure and community engagement by featuring partner-branded hamsters and promotional videos during race streams. What can your token be used for? The HAMS token serves as the lifeblood of the Hamsters ecosystem, driving user engagement, facilitating betting, and serving as a mechanism for revenue sharing. A substantial portion of the platform's revenue is systematically distributed amongst token holders, creating a strong incentive for community participation. The token also enhances the entertainment experience by increasing the winning potential for holders on the platform, thereby serving as both an investment tool and an integral part of the user's gaming experience.","links":"https://hamsters.gg/","market_cap":83133,"market_cap_rank":4379,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hamsters/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x48c87cdacb6bb6bf6e5cd85d8ee5c847084c7410"}}}