{"name":"Impossible Finance","id":"impossible-finance","symbol":"if","description":"The first two Impossible Finance products revolve around yield & autonomous community creation. Versus TradFi’s low yields, defi yield protocols have been a killer app, but impermanent loss still looms large. Instead, focusing on low-IL asset pools such as EUR and JPY stablecoins, where central banks have negative interest rates, or non-dividend yielding synthetics (hint: high growth stocks don’t have dividends) like synthetic TSLA, we propose the first wave of “Impossible Yield” products powered by our stablecoin swap, StableXswap. Taking a page out of Aave & Synthetix’ playbook, this also encourages us to integrate many synthetic assets, lending protocols, and cross-chain solutions to aggregate liquidity. This yield generated from stable EUR, JPY, or TSLA pools is unbeatable by TradFi, at least until the ECB changes policies, the Japanese population pyramid inverts, or Elon Musk changes his website’s FAQ. In early 2021, we saw Wall Street Bets clash with Robinhood & hedge funds, putting emphasis on addressing retail users’ needs without sacrificing user autonomy. Beyond avoiding business models that actively harm users (i.e. selling flow to frontrunners, or hiding spreads to mask fees), why would you ever accept dividendless holdings when defi can give you yield? That’s Impossible Finance: we’re hellbent on providing better financial instruments for the world. The second release of Impossible Finance products tackle crypto’s best killer app: fundraising. In the wake of 2017 ICO scams, Vitalik posited DAICOs, (DAO + ICOs), where project teams could raise smart- contract vested funds, provided they achieve certain milestones. Governors determined whether the team was still building, or else refund investors. However, 2018 lacked robust governance and voting portals (i.e.snapshot.page), let alone real products to invest in. Today, we propose the launch of self-sustaining- initial-dex-offerings, or SSIDOs. With the power of yield from our AMMs and partner protocols, a team that raises $10M with a $2M burn rate can be self-sustaining with just 20% APY, creating a new raise once, build forever model. The Andre’s of the world can find capital & liquidity and no longer need to rely on cexes and rent-seeking private investment funds to pay the bills. Meanwhile, vesting stable LP tokens from the fundraise stay within our AMM, which creates sticky TVL. Teams that raise via this system get automatically transparent banking, while traders get access to steady liquidity, anti-rugpull peace of mind. Our mission at Impossible Finance will be to continue finding win-wins for traders, investors, projects, and protocols alike.","links":"https://impossible.finance/","market_cap":111028,"market_cap_rank":4236,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/impossible-finance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb0e1fc65c1a741b4662b813eb787d369b8614af1"}}}