{"name":"Ociswap","id":"ociswap","symbol":"oci","description":"Ociswap is a decentralised exchange (DEX) being built on the Radix Network. Scheduled to release with the highly anticipated Babylon update, Ociswap features a user-friendly swap environment that provides a fast, smooth and inexpensive trading experience. With a potent combination of concentrated and protocol owned liquidity, Ociswap seeks to deliver a capital-efficient protocol that mitigates the occurrence of impermanent loss. Since its inception in November '21, Ociswap started running extensive community-building campaigns, introduced the intuitive Ociswap cDEX and emerged as a leading pioneer in the Radix Ecosystem. Vision Ociswap's vision is to empower anyone to easily and securely exchange their digital assets wherever they are, whenever they desire to, and at a minimal cost. Mission Ociswap aspires to become the Radix Ecosystem's flagship DEX by delivering a feature-rich and convenient platform that elevates the trading experience to the next level. The cultivation of a vibrant, enticing and intriguing community around the platform is regarded to be essential. Utility Token OCI-tokens constitute an essential asset on the Ociswap platform and will play a key role in the Ociverse. These tokens embody ownership over the decentralised exchange, which in turn allows holders to actively supervision the project and its direction via governance proposals by voting in the on-chain governance system. The fine details of this governance system will be published in due time. The utility of the OCI-tokens isn't limited to governance, as it will be weaved into the upcoming services and functionality that the Ociswap platform will offer. These unique features and holder-benefits are still under development and will be revealed in the months leading up to the Radix Babylon update.","links":"https://ociswap.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ociswap/logo.png","detail_platform":{"radix":{"decimal_place":null,"contract_address":"resource_rdx1t52pvtk5wfhltchwh3rkzls2x0r98fw9cjhpyrf3vsykhkuwrf7jg8"}}}