{"name":"Locus Chain","id":"locus-chain_ethereum","symbol":"locus","description":"\"What Is LOCUS CHAIN (LOCUS)? Locus Chain aims to be the most widely used Next Generation Layer 1 Public Blockchain Protocol, which achieves both full decentralization and scalability simultaneously. As a decentralized scalable layer 1 chain based on patented technologies, Locus Chain aims to support various Defi, GameFi, Metaverse, Smart City, CBDC(Central Bank Digital Currency) projects by being the most reliable, secure, low cost and high performance layer 1 public blockchain platform. Locus Chain claims to be the first decentralized Layer 1 public blockchain to ever solve the blockchain trilemma of Decentralization. Scalability and Security. LOCUS token? The current Locus token type before the mainnet is an Ethereum-based ERC20 token with smart contract issued by Locus Chain Foundation. However, given that the tokens on the public Ethereum network cannot be used on the Locus Chain directly, we will be making use of hashed time-locked contracts to allow 1-to-1 atomic swaps of Locus tokens from Ethereum to the Locus Chain mainnet. LOCUS will be the main cryptocurrency required for all the operations of the Locus Chain network and all of its applications. LOCUS is a payment method for the entire network economy. Tokens are used by validators (who can easily participate), developers, and users to participate in the LOCUS network and receive rewards. It is also used to for fees and to participate in future governance. LOCUS Ecosystem Top developers and high profile business partners are participating in the development of Locus Chain one after another. High-performance Layer 1 blockchain can create various business opportunities in sectors including decentralized finance, real estate transaction platforms, and game money, etc as well as creating various other tokens. In addition, Locus Chain allows the users to use the blockchain verification service through a simple linkage without building a separate blockchain. Since it is a high-performance public blockchain platform, technology licensing will be carried out in the future in the areas of CBDC and IOT, including smart cities, smart factories, and smart grids based on vast amounts of data. Special technology of LOCUS *DAG(Directed Acyclic Graph) - AWTC(Account-Wise Transaction Chain) The AWTC, Account-Wise-Transaction-Chain, is a central data structure for Locus Chain's high capacity, distributed transaction processing. AWTC is a Directed-Acyclic-Graph (DAG) based data structure composed of multiple transaction chains, each for an account. Each account has its dedicated chain. A new transaction issued by an account is primarily added to the account's chain. Block grid structures, including DAG-AWTC, do not cause conflicts because there are as many points as the number of accounts to which the transaction is added, and only the owning account can record it exclusively. Also, the account that added the transaction becomes clear, so if the account holder himself is not a malicious user, the transaction is almost confirmed as soon as it is added. The ledger structure of the Locus Chain is one of the main technical features to fundamentally solve the problem of delayed transaction processing that the existing blockchains had. POS - BFT Consensus Algorithm Given the time required for the data to propagate sufficiently to the network, the Locus Chain first implemented a BFT definitive consensus on the DAG by attempting to consent on a small amount of historical points of time. It also selects a new proposer committee that participates in the consensus algorithm every round by a random verifiable function (VRF) based on stochastic PoS (proof of stake: the more shares, the higher the probability of being elected as a committee). Since these methods cannot identify or predict the nodes (proposer, validator) to participate in the consensus, manipulation by malicious attacks is difficult, ensuring fairness and network stability of the consensus results. *Verifiable Pruning Unlike traditional pruning, which reduces the size of a ledger by simply deleting old data to address growing ledger sizes, Locus Chain's Verifiable Pruninng uses a Skewed Merkle Tree structure to validate the legitimacy of the data even when most of the previous data is deleted in the local environment. Verifiable pruning deletes outdated data on the ledger while still being able to provide full data verification by verifying previous data with hash values. *Dynamic Sharding Locus Chain has a ledger structure formed of each account (AWTC), making it easy to adjust the number and size of the shard, and the validator ratio by relocating the shard in the event of an imbalance between shards. With dynamic sharding, the network usage that a node has to cover is reduced to 2/N when the number of shards is N. The total network TPS for network usage on the same node will increase by that amount, plus the additional ledger state sharding, which will also divide the storage usage by the number of shards. LOCUS’S creators The key development members of the Locus Chain were developers of the Blueside Engine, Korea's first commercial game engine. The core of Locus Chain technology is to effectively process and synchronize large amounts of network traffic. The developers of Blueside Engine have acquired 18 software development related intellectual property rights, which are the product of the technology accumulated through console/online games and software development over the past 20 years, and hold 2 other software patents.\"","links":"https://www.locuschain.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/locus-chain_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xc64500dd7b0f1794807e67802f8abbf5f8ffb054","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xc64500dd7b0f1794807e67802f8abbf5f8ffb054"}},"is_native":false}