{"name":"Floor Protocol","id":"flooring-lab-credit_ethereum","symbol":"flc","description":"The $FLC token is the native currency that powers the Floor Protocol ecosystem. It unlocks and fuels customized platform utilities for all users. Enabling Safeboxes By staking $FLC in their Floor Account, users can create personalized Safeboxes to reserve NFTs for custom time periods. Higher $FLC stakes allow longer max durations and greater benefits. Unlocking VIP Perks Staking $FLC also determines a user's VIP status tier. Higher tiers unlock exclusive perks tailored to strategies from swift cash-outs to long-term stability and collector retention. Incentivizing Liquidity Providers The protocol rewards liquidity providers who add to $FLC and μToken exchange pools with $FLC mining rewards proportional to their share of the pool. These incentives robust liquidity vital for ecosystem growth. Managing the Treasury Reserve The protocol treasury accumulates a portion of all $FLC expenditures like fees and bids. These reserves help fund ongoing development, provide collateral, and maintain $FLC value stability. The treasury may also provide Eco-system contributor grants to worthy contributors and projects. Maintaining Protocol Stability Random Vault redemptions normally have no fees. But if reserves dip too low, a redemption fees in $FLC applies. This disincentivizes excessive withdrawals during periods of volatility. In summary, $FLC constructs Floor Protocol's economic framework by incentivizing beneficial platform interactions. This enables a dynamic, utility-driven marketplace.","links":"https://fp.io","market_cap":169014,"market_cap_rank":6177,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flooring-lab-credit/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x102c776ddb30c754ded4fdcc77a19230a60d4e4f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x102c776ddb30c754ded4fdcc77a19230a60d4e4f"}},"is_native":false}