{"name":"Coder","id":"coder_solana","symbol":"cdr","description":"CDR is a utility token on the Solana blockchain powering an ecosystem of trading tools and token services for the pump.fun ecosystem. Signal Bot: An algorithmic detection system that monitors 400+ pump.fun tokens every 4 seconds. Ten parallel algorithms detect patterns including explosive growth, stealth accumulation, swarm buying, and panic spikes. Premium subscribers receive alerts with sub-500ms latency via Telegram. Token Launcher: A tweet-to-token deployment platform that converts viral Twitter posts into tradeable memecoins. AI generates unique logos and banners automatically. Flat fee of 0.1 SOL per launch with tokens live on pump.fun within seconds. Token Locker: Time-locked vesting built on Jupiter Lock smart contracts (audited by Sec3 and OtterSec). Supports SPL tokens, Token2022, pump.fun tokens, and LP tokens. Fee of 0.08 SOL per lock. Token Burner: Permanent token destruction service at 0.05 SOL flat fee regardless of token value. X Scraper: Twitter monitoring with 50-200ms notification delivery. Alerts sent to Telegram the moment tracked accounts tweet. Track your favorite influencers, buy their contract/token addresses, instantly. AI Agent API: x402 protocol integration enabling autonomous AI agents to purchase signals via native SOL payments at $1 per signal. Community Tools: Token-gated Telegram group bot and automated SPL airdrop distribution bot. Token Utility: Holders of 1%+ supply receive lifetime access to all products. Holders of 0.5%+ receive weekly revenue share distributions (50% of subscription revenue).","links":"https://cdr.fun/","market_cap":51118,"market_cap_rank":8184,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coder_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"DjAbfe6EjhvZs4RAajYs8r3jcC1cFqqK4beTfGS7Lidd","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/DjAbfe6EjhvZs4RAajYs8r3jcC1cFqqK4beTfGS7Lidd"}},"is_native":false}