{"name":"Espento","id":"espento","symbol":"spent","description":"What is the project about? Espento Is An Algorithmic Money Market Created Solely On Binance Smart Chain (BSC). The Protocol Brings To The Decentralized Finance (DeFi) Ecosystem A Simple Crypto Asset Swap, Bridge, Stake, And Lending-Borrowing Solution. Allowing Users To Borrow Directly Against Collateral At Rapid Speeds While Incurring Less Transaction Costs. What makes your project unique? The Key Strength Of Espento Is Its Fast Speed And Incredibly Cheap Transaction Fees, Which Are A Direct Result Of Its Build On Top Of The Binance Smart Chain. The Protocol Is The First To Allow Users To Have Real-Time Access To the Liquidity Pool For BNB, BUSD, USDT(TRC20), BTC, ETH, And Other Cryptocurrencies Via Bridging Protocol. Users Seeking Liquidity Using The Espento Protocol Do Not Need To Pass A Credit Check And May Get A Loan Immediately By Interacting With The Espento Decentralised Application (DApp). Users Are Not Restricted And May Always Obtain Liquidity By Providing Necessary Collateral. These Loans Are Made Possible By A Pool Of Funds Supplied By Espento Users, Who Earn A Variable APY In Return For Their Inputs. These Loans Are Backed By Borrowers' Over-Collateralized Deposits On The Platform. History of your project. The project started on January 31, 2023, with a basic exchange, farm, and stake. More than 16000 LP tokens have been added to the Liquidity by the users, and there are currently close to 100 SPENT holders over this time period. What’s next for your project? Up to the end of 2023, Espento will introduce the wallet, the DAO protocol, and Blockchain. What can your token be used for? Espento Tokens are \"SPENT\" and can be traded, exchanged, staked to earn other tokens, used as collateral for loans, used to play games, or used to pay the fees for projects on Launchpad.","links":"https://espento.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/espento/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x178fbe1cf4775fbdb9756d6349195a05799c0fe5"}}}