{"name":"NeoBot","id":"neobot","symbol":"neobot","description":"What is the project about? NEO Bot is a telegram bot that has a suite of products including contract auditor, rug scanner, token scanner, chart function and unrealized PNL of holders What makes your project unique? NEO bot tools include: -Analyze: gives information on the earliest buyers of the requested token with a graphical representation -Holders: gives information on the top 20 holders of a token, including their PNL and their amount of buys, sells and transfers. -Token Scan: which includes social information, security information, liquidity information, marketcap, volume, holders and deployer information -Deployer scan: gives information on the deployer of the token, tokens held and the market value of the tokens held -Token search: this allows you to search for any tokens matching the query, it will return the address, chart and FDV -Chart function: returns an image of the chart of the requested token -Volume scan: gives extra details on volume profile and how the price reacted to this information Rug scan: gives security information on the token, including max txn, liquidity details, tax, honeypot details -Find: gives information on the tokens held by the top holders of one or more tokens History of your project. NEO Bot has been under development for the last 3 months by founder and developer 0xSleuth, what started as a simple token scanner eveloved to become a suite of tools to help traders understand the information on Blockchain What’s next for your project? Adding more tools and improving users experience using our bot to make well informed decisions for their investments What can your token be used for? NEOBOT is the native utility token that is used to gain access to tools on telegram","links":"http://neobot.live/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/neobot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3f2d4708f75de6fb60b687fed326697634774deb"}}}