{"name":"ZKWASM","id":"delphinus-lab","symbol":"zkwasm","description":"ZKWASM is an innovative blockchain infrastructure project that integrates zero-knowledge proofs (ZKP) with WebAssembly (WASM) to deliver scalable, privacy-preserving, and high-performance computations on-chain. Open-sourced in 2023 as the first ZKWASM VM—pioneering the integration of zero-knowledge proofs with WebAssembly in a virtual machine—ZKWASM has evolved through years of research and community engagement, with backing from Binance Labs and OKX Ventures. Its journey is marked by key milestones: an invited talk at the 5th ZKProof Workshop (2022, Israel) on “ZK-WASM: A ZK Virtual Machine that Supports WebAssembly”; presentations at ZK Summit 9 (2023, Lisbon) on Web3 game development and ZK Summit 12 (2024, Lisbon) on performance optimization in KZG-backed Plonkish systems; and practical applications showcased at ETHDenver 2024 and Taipei Blockchain Week 2024, focusing on Ethereum rollups and on-chain game development. A 2024 [IEEE paper](https://ieeexplore.ieee.org/document/10587123) further validates ZKWASM’s technical advancements. These efforts highlight ZKWASM’s growth from a foundational ZKVM concept to a production-ready infrastructure, empowering developers to build decentralized applications (dApps) across DeFi, gaming, identity, and more, while bridging Web2 and Web3. Delphinus Lab, the core contributor to ZKWASM, is building a chain-agnostic ZKWASM rollup infrastructure with support for Rust SDK, Rollup-as-a-Service (RaaS), and decentralized AI inference. The live developer ecosystem includes 6 active applications and over 60,000 daily active users (DAU).","links":"https://www.zkwasmhub.com/","market_cap":4293775,"market_cap_rank":2493,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/delphinus-lab/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa8d3dee6671c4fdac4743a1eb1f276eabd4ba302","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa8d3dee6671c4fdac4743a1eb1f276eabd4ba302"}}}