{"name":"BabyDogeARMY","id":"babydogearmy","symbol":"army","description":"What is the project about? BabyDogeARMY was created by BabyDoge lovers to bring together the largest and most beautiful community in history and show their true power. In this direction, we will create the BabyDogeARMY Meeting dApp and a metaverse universe in which we exist with NFTs, each unique from the other. What makes your project unique? BabyDogeARMY is regularly trending on Twitter and other social networks. It is currently thought to have more than 1 million real followers and supporters. With the BabyDogeARMY meeting dApp, we will bring this family together around the world. In addition, we will give them a new identity in the metaverse universe we have established. History of your project. We are the first holders of BabyDogeCoin. Actually the project team were killing the project but our lives changed with ElonMusk's BabyDooDoo tweet. It was truly a historic moment and I hope it will be documented in the future. However, BabyDogeARMY is a very loving and special community. A family that believed in the same dream and fought for it. We want to bring this family together and be together for world problems. What’s next for your project? A very clean and realistic roadmap has been prepared. First of all, we would like to complete our listings in order to ensure financial price stability and strengthen the community. In the background, the development of the BabyDogeARMY meeting dApp continues. In short, our first steps will be exchange listings and BabyDogeARMY meeting dApp. What can your token be used for? BabyDogeARMY dApp hosts interactive ways to meet new people using artificial intelligence. Build your BabyDogeARMY profile. ( Wallets holding at least 1 BabyDogeARMY token will be able to become a member in order to protect our family and ensure security and it will be mandatory to do KYC**) Open your location and match with our family members around you. There will be a global search option for our family members from all over the world to meet an","links":"https://babydogearmy.app","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/babydogearmy/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x906089721cc5cb41c87d35bb05bea70bdf47a269"}}}