{"name":"Num ARS","id":"num-ars","symbol":"nars","description":"NUM Finance is a project that aims to create stable cryptocurrencies that follow the value of currencies of emerging countries. We call these cryptocurrencies NUM Stablecoins. Currently there are several stablecoins on the cryptoasset market. However, most of them follow the price of currencies of developed countries. The most well-known examples are the stablecoins pegged to the US dollar as are USDT, USDC, DAI, etc. The existence of these currencies was fundamental to the development of the decentralized finance ecosystem that flourishes today on major blockchains. Activity in decentralized finance protocols grows linearly with the circulation of these stablecoins. In turn, there are other stablecoins that track the price of other currencies from developed countries, however, there are very few stablecoins from emerging or Latin American countries. NUM Finance seeks to facilitate access to cryptocurrencies and decentralized finance to millions of people and businesses in emerging countries through the creation and promotion of NUM Stablecoins. It is precisely in these countries, where monetary problems such as inflation, capital controls, lack of access to credit and complex financial products abound, that decentralized finance can have the greatest impact on the lives of citizens and the economic activity of companies. With NUM Stablecoins and the growth of their adoption, NUM Finance seeks to strengthen local currencies by adding a product that can be used by market players in a completely free manner.","links":"https://www.num.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/num-ars/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x65517425ac3ce259a34400bb67ceb39ff3ddc0bd","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x65517425ac3ce259a34400bb67ceb39ff3ddc0bd"}}}