{"name":"Patex","id":"patex_ethereum","symbol":"patex","description":"Patex offers a diverse range of products that includes: C-Patex Exchange — A centralized cryptocurrency exchange that provides regulation, management, and launch capabilities for CBDCs and cryptocurrencies. Patex Campus — An educational platform designed to familiarize individuals with the world of Web3 and equip them with the skills to pursue careers within this domain. Patex Network — A Layer 2 blockchain that facilitates the issuance and tracking of Central Bank Digital Currencies (CBDCs) and other cryptocurrencies. $PATEX Token: It provides utility within the C-Patex Exchange and other ecosystem products, allowing users to access exclusive features and earn rewards. Activity Mining: A recurring reward system that incentivizes users based on their transaction activity recorded on the native chain. Patex Wallet: A native non-custodial, cross-chain crypto wallet that enables the secure storage, sending, and receiving of cryptocurrencies within the Patex ecosystem and other networks. Proof of Value: A consensus mechanism that supports activity mining, where users are compensated by Patex Network validators in ETH, utilizing transaction fees as the source. Patex Bridge: A cross-chain token transfer solution that facilitates cross-chain swaps between the Patex and other networks. Patex Explorer: An on-chain analytics platform that offers insights into assets, contracts, balances, and transactions, ensuring transparency within the ecosystem. Patex Hackathon: An innovative event that encourages collaboration and development on the Patex network. What makes Patex Ecosystem (PATEX) unique? Reward system for validators Introducing Patex Proof of Value, where participants contribute to the network's growth and get rewarded. It aligns community support with monetary incentives, ensuring shared benefits. Benefits include earning up to 450 $PATEX per day and a referral program with a 20% commission. Validators receive 50% of transaction fees, while the remaining 50% replenish","links":"https://patex.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/patex/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfd4f2caf941b6d737382dce420b368de3fc7f2d4","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xfd4f2caf941b6d737382dce420b368de3fc7f2d4"}},"is_native":false}