{"name":"Fight Out","id":"fight-out","symbol":"fght","description":"*Introducing Fight Out* Fight Out is building a gaming platform that offers users a unique play-to-earn experience. Players can compete in a variety of game modes and earn rewards for their achievements, including real-world prizes. The platform will tailor bespoke workouts and exclusive ambassador masterclasses to ensure the user is fighting fit IRL and in the metaverse. In addition, Fight Out users will be able to mint their own NFT avatar when creating a Fight Out account. This avatar is soulbound, which means it cannot be sold or transferred. Users’ avatar will be their digital self in the Fight Out metaverse, where they’ll be able to socialise with other members of the Fight Out community. Fight Out’s gaming platform encourages gamers and fitness enthusiasts to train and live healthier lifestyles by providing a more rewarding gaming experience. Data collected from IRL workouts are converted directly into stat points for the user's avatar. When they complete Fight Out workouts, they will level up their digital avatar and earn rewards, which can be used to buy Fight Out merch, private sessions, or NFT cosmetics for their avatar. Users will also be able to complete daily, weekly, or monthly challenges for additional earnings, and compete against other members of the Fight Out community for even greater rewards. *About FGHT Token* $FGHT is the native token of the Fight Out gaming ecosystem. It can be used to purchase in-App currency with additional bonuses. Users can use FGHT to compete in leagues, tournaments, or special game modes with entry fees and prize pools. All purchases in the metaverse can also be made exclusively using $FGHT. $FGHT can also be used in peer-to-peer wagers with friends or through Fight Out’s smart matching engine, on high-profile matches featuring streamers, celebrities, legends, or other exciting showdowns. Simplicity and incentives will drive mass adoption and increase the demand for FGHT tokens.","links":"https://fightout.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fight-out/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe0ffddf8fd7d63cf907e433c9293069704d4d40d"}}}