{"name":"Ignore Fud","id":"ignore-fud_ethereum","symbol":"4token","description":"What is the project about? 4TOKEN A new kind of meme token that supports DeFi and Blockchain innovations. What makes your project unique? 4TOKEN is a hold-to-earn token, where we can earn USDT just by holding it. You need to hold at least 400k 4TOKENs to be eligible. The USDT reflections and rewards earned by holders come from the taxes generated from sold 4TOKENs. 2nd, 4TOKEN has an 8% sales tax. This is to encourage the people to hold on to their 4TOKEN with us for long term while we fulfill the use cases that will benefit the whole community Nevertheless, if they decide to sell, it will still help the community through the sell tax and beneficial to the whole ecosystem. You know why? Because of the 8% sell tax, wherein: 3% goes to reflections or rewards for holders. 2% will be added to 4TOKEN/CORE liquidity. This is an auto-LP mechanism to ensure that we have enough liquidity in the long run. 2% will be burned to help reduce the supply of 4TOKEN. Note that this is an auto-burn mechanism. 1% will be converted to CORE for operational expenses and the growth fund to build utilities. History of your project. The Ignore Fud Project was created to help Coredao, Binance, and the cryptocurrency industry as a whole get more people to use and adopt cryptocurrencies. We provide a community-centric meme ecosystem, a unique hold to earn with exposure to a large and strong community of users What’s next for your project? A meme token at first. But in the future, we will create the following use cases to support DeFi and Blockchain innovations We will build or make a Blockchain Validator/Staking Node like CORE Staking Node, ADA Staking Node, BNB Staking Node, Cosmos Staking Node, New Blockchains with Staking Node, and even other potential Tokens that earn staking rewards. What can your token be used for? Hold To Earn","links":"https://4ignorefud.com/","market_cap":3975.56,"market_cap_rank":12664,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ignore-fud/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8db4beaccd1698892821a9a0dc367792c0cb9940","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x8db4beaccd1698892821a9a0dc367792c0cb9940"}},"is_native":false}