{"name":"YachtingVerse [OLD]","id":"yachtingverse","symbol":"yacht","description":"What is the project about? AI Driven Marine-Themed VR Platform& SuperAPP What makes your project unique? YachtingVerse provides a platform for all parties in the marine industry. Boat owners, captains, crew members, technical service providers, marina operators and even marine enthusiasts can come together and collaborate on the platform. YachtingVerse enables boat owners and other marine professionals to manage their digital assets. This makes it easy for boat owners to rent boats and allows other maritime professionals to promote and sell their services. YachtingVerse allows users to easily charter luxury boats. The platform offers many options to suit users' budgets, vacation plans and boating requirements. History of your project. YachtingVerse was founded in 2021 as a Türkiye-based blockchain startup. The project was implemented to provide a comprehensive platform for the maritime industry and improve security using blockchain technology. YachtingVerse started by focusing on the luxury yacht industry, a market with high potential. The aim of the project is to make transactions in this sector safer, more transparent, and more efficient. Later, however, the purpose of the project was expanded to include other parties in the maritime industry. YachtingVerse has secured, transparent and automated all transactions on the platform using blockchain technology. The project also includes features such as smart contracts and digital asset management. Today, YachtingVerse exists as a platform that provides a comprehensive ecosystem for the maritime industry. What’s next for your project? For YachtingVerse, there are a few important steps ahead: Platform Development Establishing New Partnerships New Boat Charter Options New Tokenomic Features More Marketing and Promotion What can your token be used for? Boat Charter Transactions Reservation Transactions Discounts and Promotions Governance and Dividend Token Burn","links":"https://yachtingverse.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/yachtingverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0f208f5ea1d4fbca61ac6b6754f765950d3840de"}}}