{"name":"Tema","id":"tema_solana","symbol":"tema","description":"$TEMA is the official token representing Tema, the world's most famous raccoon, boasting a massive online following of over 2.7 million on TikTok, 1.7 million on YouTube, and 314,000 on Instagram. This isn't just another meme coin; $TEMA bridges the gap between a globally recognized online personality and the exciting world of Web3, offering a unique investment opportunity tied to a proven, highly engaged audience. By holding $TEMA, you become part of a vibrant and rapidly growing community built around Tema's captivating content and undeniable charisma. This established fanbase, already deeply connected and engaged, provides a solid foundation for organic growth and long-term community development, setting $TEMA apart from fleeting meme trends. We're not just capitalizing on a viral moment; we're establishing a sustainable ecosystem powered by a pre-existing, massive audience. Our team is committed to delivering genuine value and building a thriving community beyond the initial excitement of the token launch. The $TEMA roadmap includes, ensuring the token maintains utility and long-term value. This multifaceted approach fosters loyalty and engagement, strengthening the $TEMA ecosystem. The $TEMA token operates on a system designed to reward holders and promote community growth. To ensure smooth transactions, please use sufficient slippage on exchanges. Investing in $TEMA is not simply a financial opportunity; it's an investment in a thriving community, built around a beloved online icon. Join us in creating a sustainable and exciting Web3 project where the power of social media influence meets the innovative potential of blockchain technology","links":"https://www.temacoin.com/","market_cap":73803,"market_cap_rank":7540,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tema/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"CnfshwmvDqLrB1jSLF7bLJ3iZF5u354WRFGPBmGz4uyf","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/CnfshwmvDqLrB1jSLF7bLJ3iZF5u354WRFGPBmGz4uyf"}},"is_native":false}