{"name":"Vertcoin","id":"vertcoin","symbol":"vtc","description":"Vertcoin is a decentralized currency owned by its users, a P2P cryptocurrency in the same vein as <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> and <a href=\"https://www.coingecko.com/en/coins/litecoin\">Litecoin</a>. Like its two predecessors, Vertcoin exists solely as a currency, and it uses proof of work to reach distributed consensus. Unlike its two predecessors, however, Vertcoin is dedicated to keeping its mining functions decentralized, so contrary to most PoW coins, it’s ASIC resistant. Branding their project as “The people’s coin,” Vertcoin’s team believes that ASIC resistance invites a fairer, more democratized currency for both users and miners. Along these lines, Vertcoin sports its very own 1-click miner, a program meant to make mining more accessible to the general public. The motivation of Vertcoin was the fact that Scrypt-based ASIC mining chip that is used to mine Scrypt derivative coins such as Litecoin and <a href=\"https://www.coingecko.com/en/coins/dogecoin\">Dogecoin</a> is entering the mass market. That coupled with strong mining pool causes the strength of a cryptocoin to drop as it becomes easier for a specific party to pull a 51% attack and even monopolize the network. Scrypt-Adaptive-Nfactor was created to address that issue. Vertcoin is zero premined and as of the current design, only 84 million coins would ever be created. Vertcoin is said to be the next generation of coins due to its unique hashing algorithm. There may be more altcoins created based on this hashing algorithm in order to defend their network against ASIC miners. Like most all pre-2015 coins, Vertcoin took a deathblow after Mt. Gox was hacked, throwing the entire market into a crypto winter. As such, it was relatively inactive until the revival last spring/summer. Since then, it has had steady climb up the market cap ladder. A 2014 International Business Times article mentions Vertcoin as a potential Bitcoin successor. The article notes that it \"\"hopes to offer an alternative. By taking the foundations of Bitcoin and making some adjustments, Vertcoin punishes miners who use powerful machines and work together in 'pools' to monopolise the mining market.\"\" On July 1, 2014, Vertcoin released a wallet supporting Stealth Address transactions. On December 13, 2014 (block 208301), Vertcoin forked from Scrypt-Adaptive-N proof-of-work function to <a href=\"https://www.coingecko.com/en?hashing_algorithm=Lyra2RE&view=market\">Lyra2RE</a> as a proactive defense against emerging Scrypt-Adaptive-N capable ASICs. On August 10, 2015 (block 347000), Vertcoin forked from Lyra2RE to Lyra2REv2 because a botnet was controlling more than 50% of the hashing power of Vertcoin network. On May 7, 2017, Segregated Witness (SegWit) feature was activated in the main network. SegWit update includes the Lightning Network technology that was also demonstrated in action during the same day.\"","links":"https://vertcoin.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vertcoin/logo.png"}