{"name":"BlockCentral Token","id":"stasis-network","symbol":"bloc","description":"What is the project about? Stasis Network is a DeFi Fund made up of on-chain digital assets, with a deflationary utility token as its medium of exchange. With a strict focus on execution, Stasis Network is an ecosystem on a mission to enhance deflationary protocols, attract a new audience to the DeFi space, and improve the baseline knowledge for all users. Led by a professional and experienced team. What makes your project unique? Customize your investment strategy: Stasis Network introduces Dynamic Strategies, an innovative way to automate your portfolio. Yield-Generating Treasury: Expertly managed treasury to produce yield to accelerate the growth and development of the network. NFTS Viking Collection: While NFTs remain very popular among users, traditional NFTs are notoriously illiquid and their floor prices too volatile. The market demands more than just jpegs now. Stasis Network will answer that demand for something new. Stasis Network's 'Liquid Decaying NFTs' will provide maximum long-term value while maintaining a more liquid nature that users desire. History of your project. Both founders of the project have been in crypto for over 18 years combined. We have both had previous successful projects that where sold on in the Masternode space. We got together to create Stasis Network as we seen a great opening for this kind of project. What’s next for your project? StasisU: Stasis Network is a hub of education and curated content providing an incentivized 'Educate 2 Earn' (E2E) platform. Users will gain knowledge in Stasis Network, partner protocols, and the cryptocurrency industry overall, actively creating our 'Smart Network for Smart Users.' What can your token be used for? STS is a utility token that can be used to interact with the contract via our Dapp.","links":"https://www.blockcentral.io/","market_cap":136529,"market_cap_rank":7001,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stasis-network/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x6ccb663dad597058da28b58974e8bdb81323dd09","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x6ccb663dad597058da28b58974e8bdb81323dd09"}}}