{"name":"XSale","id":"xsale","symbol":"xs","description":"Xsale is a decentralized protocol which is built upon the foundation of incentivising successful crypto startups across all major blockchains. Our philosophy is simple. Reward teams who create projects via our launchpad that provide high ROI for the investors. The roll-on effect this has is astonishingly high. The current ICO/presale space is filled with developers who don't care beyond the raise itself. The reason being is that their are fewer incentives for them to really pursue the project. Thus, XSale focuses on the following: 1. Incentives for project owners to create a successful launch 2. Provide a user-friendly experience for all investors 3. Tiered-system for investor confidence 4. Anti-scam measures for investors Our goal is to provide a safe environment for all investors and give countless opportunities for profits to be made. In our pursuit to create a cutting-edge and user-centric launchpad, we conducted a comprehensive analysis of our competitors in the industry. Through this research, we observed various models and pricing structures adopted by other launchpads. As a result, we identified a unique opportunity to differentiate ourselves and provide unparalleled value to our users. After careful consideration, we made a bold decision to offer our launchpad services free of charge for the first 50 presales. This decision was driven by our commitment to fostering a vibrant and inclusive ecosystem for upcoming projects. By waiving the fees initially, we aim to support new and promising ventures, enabling them to launch their tokens without financial constraints. By studying and understanding our competitors, we have strategically positioned ourselves to stand out in the market. We are excited to witness the potential impact of this initiative, as it reinforces our dedication to empowering projects and fueling the growth of the decentralized finance landscape. As we continue to evolve and refine our launchpad, we remain steadfast in our commitment to providing exceptional opportunities and services to the crypto community.","links":"https://www.xsalepad.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xsale/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd139a81d8422bb2ee1f21ce0301e6e28e7696425"}}}