{"name":"Totem","id":"totem-earth-systems","symbol":"ctzn","description":"What is TOTEM // $CTZN? Totem is building New Earth Systems by forging Web3 tools and communities into a single OS. Your totem is your identity, dashboard & toolset, placed within a unified and curated interface. Totem is providing Web3 tools, NFT gated communities, and more, all in one place, to bring real-world utility to Totem’s Citizens as we reveal and enjoy the open metaverse. Totem OS is a dashboard for all your Web3 tools and management of your digital portfolio. The first tools available will have a focus on metaverse integrations and community. The dashboard will allow users of all experience levels to sharpen and leverage their knowledge of Web3 to make the most of this new era of the internet. Totem OS is the operating assembly that will house custom tools curated by the Totem team to empower the community with an exceeding array of applications. $CTZN will be the preferred and interoperable token used across the entire Totem ecosystem, bringing simple solutions to staking, spending, access, and more. It is the value exchange in the collective journey towards true ownership in the virtual economy. What Makes Totem Unique? Totem turns dreams into reality by developing an ecosystem that truly rewards its users and puts the creator community first. Totem is bringing together artists, developers, creators and experts to open the doors to the metaverse in a way that will serve humanity and the Earth. Totem is a leader in the collective journey towards true ownership in the virtual economy. How Many Totem (CTZN) Coins Are There in Circulation? Totem’s Citizen (CTZN) tokens have a total supply of 1 billion tokens. Out of this, around 18.4 million tokens were in circulation as of mid-December 2021. Where Can You Buy Totem (CTZN)? Currently, Totem’s Citizen (CTZN) tokens can be purchased on Uniswap or PancakeSwap.","links":"https://www.totem.earth/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/totem-earth-systems/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa803778ab953d3ffe4fbd20cfa0042ecefe8319d"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa803778ab953d3ffe4fbd20cfa0042ecefe8319d"}}}