{"name":"SocialGrowAI","id":"socialgrowai_ethereum","symbol":"growai","description":"Revolutionize Your Token Journey with SocialGrowAI - the home of DeFAI. Unleash a seamless multi-chain experience with SocialGrowAI, your ultimate hub for trading, launching, and earning tokens. This all-in-one platform integrates Telegram and X, empowering a dynamic array of multi-chain Telegram bots, AI agents, and web apps. With innovative gamified features, SocialGrowAI offers a groundbreaking, AI-optimized platform for multi-chain trading, launching, and earning tokens all in one place. ECOSYSTEM FEATURES: SocialGrowAI Trade Bot Buy and sell on many of the most popular chains including ETH, SOL, BASE, BSC, and TON. Working with a dominating trading platform that is currently under NDA, you can expect the best tools for buying and selling across the entire space. Quick Token Launcher Our $0 multi-chain token launcher provides an easy-to-use flow, to rapidly launch any token via Telegram in minutes. Launch, distribute, renounce, and lock liquidity using the SocialGrowAI Bot. Additional rewards can be earned when using one of our partner Telegram mini apps. Faucet/Reward System Our unparalleled reward system integrated within our partner Telegram apps enables thousands of projects to reward their communities. For the first time, Telegram mini apps will no longer rely on a single airdrop to maintain retention, which has proven through thousands of case studies to drastically reduce a project's life cycle. Our unique faucet system rewards loyalty, participation and allows you to earn additional daily tokens nearing migration via our token launcher. Telegram Mini Apps While a highly saturated ecosystem with copy and pasted mechanics, our unique outlook enable us to create bespoke mini apps for projects with already established communities, removing the reliance of a single airdrop for retention and replacing it with our array of features, including trading, launching and earning to drastically increase user retention and the lifecycle of the integrated projects. Integrated IDO SocialGrowAI provides an integrated decentralized multi-chain IDO feature that provides the tools for projects to fundraise and whitelist easily within the Telegram app. This seamless system will provide additional necessary tools for teams looking to launch a more comprehensive project. AI Integration Across all of our features, AI optimizations will be prevalent. We have a highly experienced development team that specializes in AI. Utilising our AI agent, we will be the first $0 Multi-chain launcher via X and Telegram.","links":"https://www.socialgrowai.io","market_cap":172081,"market_cap_rank":6153,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/socialgrowai/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1c9b158e71bc274ea5519ca57a73e337cac72b3a","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x1c9b158e71bc274ea5519ca57a73e337cac72b3a"}},"is_native":false}