{"name":"EarnyTV","id":"earnytv","symbol":"$earny","description":"Earny.TV is a first of its kind, blockchain powered streaming platform, built to serve content creators, advertisers, the Earny community, and its consumers. We were able to achieve that by leveraging an advanced system of smart-contracts based on the Binance Smart Chain, with a unique watch & earn rewards mechanism, unique utility NFTs, free membership system by simply HODLING $EARNY, dividends to holders from platform profits, governance voting system (DAO), and much more that went into the design of Earny.TV. Decentralized Streaming (DAO) We created a decentralized, censor-free, platform that's actually fair and beneficial to everyone including the viewers. With our experienced team in the film making field, blockchain development, marketing, content creation, we know exactly what it takes to become the Netflix of Web3. Because of the free membership plan we get to show ads to users, 50% of all ad spaces are owned by the owners of the Pixel NFT collection. There are 1000 NFTs, and each NFT owner gets to upload decentralized (IPFS) ad content which will be displayed in rotation with all the other Pixels. This revolutionary system rewards advertisers, Pixel NFT owners (our community), and the viewers. On top of getting free access to Earny.TV, consumers get rewarded for watching films & shows, rating, sharing, and referring other users to Earny. Making this structure a win win for all. Content, Copyright & Licensing We've partnered up with the biggest licensing & copyright networks in the industry to bring our users valuable content that's actually interesting and relevant. We're focusing on bringing a large variety of content to the platform by leveraging umbrella licensing plans. Besides the content you expect, Earny.TV is aiming to become the first crypto-niche network to fund and create films/shows related to blockchain. From documentaries to fantasy, all genres, one niche.","links":"https://Earny.TV","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/earnytv/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x805eddd644c08e4df3acfd2c41b2ce9d2ca1cd44"}}}