{"name":"SquadFund","id":"squadfund","symbol":"sqf","description":"What is the project about? It is a community driven venture capital project that using a 2% tax raised through transactions to raise equity which we invest into other projects. We are also educating members of our community on important skills such as risk management through our Analysts' knowledge. The education is through PDF files with tutorials, livestreams on discord where our analysts go through their unsuccessful and successful trades to review them. What makes your project unique? Our venture capital firm is more accessible to those with lower net worths. We are on the BSC meaning fees are super low, and unlike traditional hedge funds/venture capital firms where salaries has to exceed 100s of thousands a year to participate, we want everyone to be able to benefit from investments made using their money. As it's only 2% of people's spendings on the project through the tax, we believe we offer a low risk solution to this problem. We also are an all rounder after we create History of your project. We started working on the project around a month and a half ago and started by getting a contract made. We then searched for analysts and moderators for our upcoming community and interviewed several of them. After 2 weeks of interviewing potential team members we hired people and our team reached around 9 members before launch (including Analysts, marketers and moderators). We did a presale on the 12th of April through PinkSale and raised 250BNB. We then launched onto PancakeSwap and ever since then we've released our own aggregator DEX, grew our discord to over 1800 members as well as launching a telegram community. What’s next for your project? We are releasing our venture capital dAPP in the next few weeks as well as adding the ERC-20 chain to our aggregator DEX. What can your token be used for? Holding our token grants access to live trading sessions by our analysts as well as access to the profits generated by our investments.","links":"https://squadfund.net","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/squadfund/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x3e89a5e7cf9dfcff5a9aedf19ab6246c6b506582"}}}