{"name":"Justus","id":"justus","symbol":"jtt","description":"What is the project about? Justus is a community driven token that aims to redefine decentralized finance with transparency and sustainable passive income coming from Crypto trading or Real-world business and utilities What makes your project unique? Justus Token is more than just a cryptocurrency: it is a movement to bring justice, honesty, transparency, and sustainable utility development to the forefront of the Binance Smart Chain ecosystem. By establishing an ecosystem that prioritizes the values and needs of its community, Justus Token aspires to inspire positive change and become a symbol of trust and reliability within the crypto industry. Together we embark on this promising journey towards a fairer, more equitable future on the Binance Smart Chain. Our core team values come from the Justus (Latin word) name and are centered on Justice, Honesty and Transparency as a community driven token Core team was formed from the community; 100% fiscal transparency (eg: all treasury expenses are reported); Aims to bring sustainable passive income coming from Crypto trading or Real-world business and utilities History of your project. Justus is a new token formed from the community of SGO token (CA: 0X9321BC6185ADC9B9CB503CC211E17CB311C3FA95), after its previous owner abandoned the community. Due to this, the community formed a new Discord and core team to migrate SGO to an entirely new token CA, named Justus Token. All the SGO trading will be permanently ceased after the migration to Justus. What’s next for your project? There are various registered goals on our Roadmap, some of them includes: Passive income utilities, CEX listing and real-world utilities. Check out the Justus website for more infos: https://justustoken.com/ What can your token be used for? Justus is a BEP-20 token freely trade-able on BSC with future passive income utilities.","links":"https://justustoken.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/justus/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xcdb3d3642fb4d48d2b5e4fb4a014448a2761c063"}}}