{"name":"The Bet","id":"the-bet","symbol":"bet","description":"What is the project about? The BET is a Player versus Player (PVP) sports betting platform designed for Web3. By removing complex odds calculations, The Bet eliminate bookies from the equation and pit BETtors against each other in a bid to determine which team has the better value at any given moment. As odds are determined through the use of independent Liquidity Pools, each game played will be unique and everchanging. These pools and their values are visible to all participants in the protocol and will continually fluctuate until their lock in period closes. The BET’s PVP system allows BETtors to stake for entertainment, while also encouraging the deployment of complex strategies to capture discrepancies between the Liquidity Pools. As more BETtors stake their tokens on Team A, the value of staking on Team B grows. Are these the right odds? Does B have a greater chance to win than people think? These are the questions that BETtors will ask themselves when playing on The BET. In a game where human nature and hubris run rampant, can you beat the odds? Each player will have a personal profile and level that will be utilized throughout TheBET.gg's dApp. Players can gain XP through participation in games on our dApp that will then be used to level up their profile. Each game will give varying amounts of XP per ETH wagered as some will feature faster transactions and game times than others. What makes your project unique? We have a fully on-chain decentralized betting platform/ History of your project. Launched Feb 17th Migrated to Arbitrum March 23rd What’s next for your project? Coinflip Launch 3/24/ What can your token be used for? Betting on our dApp and staking for platform yeild","links":"https://thebet.gg/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-bet/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x9eb6299e4bb6669e42cb295a254c8492f67ae2c6"}}}