{"name":"Axelar Bridged USDC","id":"axlusdc_optimistic-ethereum","symbol":"axlusdc","description":"What is the project about? axlUSDC is a wrapped, multi-chain representation of USDC, a dollar stablecoin. For each unit of axlUSDC, there is a unit of USDC locked in an Axelar Gateway on Ethereum. axlUSDC is secured by a dynamic validator set running delegated Proof-of-Stake, which holds key shares in the Axelar Gateways via multi-party cryptography. Acquire axlUSDC in three ways: Swap via liquid pairs on any of the DEXs listed here. Swap via Squid, a cross-chain liquidity router built on Axelar. Mint via Satellite, a cross-chain bridge built by Axelar What can your token be used for? USDC is the ticker for USD Coin. It's a stablecoin, pegged to the US dollar, issued by Circle, a US company. So, what is axlUSDC, why do we need it, and how can you get it? This post will briefly explain. USDC is issued on Ethereum – but dApps and users in other ecosystems also value the stablecoin's properties. Many of them use axlUSDC, a wrapped version of USDC that can travel between chains, as a multi-chain stablecoin. In brief, axlUSDC is generated via cross-chain bridges. These dApps accept a deposit of USDC at an Axelar Gateway on Ethereum, and mint an equivalent amount of axlUSDC on the destination chain (minus fees). Two key points to understand what axlUSDC is and how it can be used: For every unit of axlUSDC, there is a unit of USDC locked in a Gateway on Ethereum. Once minted, axlUSDC can flow from chain to chain, without going back through Ethereum. Gateway addresses on various EVM chains and the token addresses of axlUSDC on various chains are listed in the Axelar docs, here.","links":"https://axelar.network/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/axlusdc/logo.png","detail_platform":{"optimistic-ethereum":{"decimal_place":6,"contract_address":"0xeb466342c4d449bc9f53a865d5cb90586f405215","geckoterminal_url":"https://www.geckoterminal.com/optimism/tokens/0xeb466342c4d449bc9f53a865d5cb90586f405215"}},"is_native":false}