{"name":"SurfCash","id":"surfcash_solana","symbol":"surf","description":"You earn in crypto and spend in fiat. The gap between the two is costing you money and sanity. 70% of the merchants in developing countries don't accept cards, forcing ATM runs or inconvenient options like PayPal and Moneygram. In case they accept cards, you’ll have to pay up to 10% in fees in countries like Brazil. You are living in Vietnam, contributing to the local economy but still cannot access the local payment networks since they need a bank account for it; and for that, you need permanent residency; for permanent residency, you need a work permit. So you turn to shady underground payment groups. You send crypto to the admins and some strangers pay on your behalf, hoping nothing goes wrong. SurfCash fixes this. You deposit your crypto, scan any local QR Code and pay with your crypto. The merchant receives fiat in their bank accounts. Done. These local QR Codes are already with every merchant in developing countries and deposit money into their bank accounts. You can pay your rent, pay for groceries, split your bills, everything in USDC, while your keys stay with you. Your idle funds earn up to ~15% yield on stables, in-app. When you are traveling, we take care of you and you get perks like Travel insurance, Airport lounge access, Local Coworking spaces deals, etc. Vietnam and Philippines payment integrations are already live and then expanding to Brazil, Indonesia and Thailand. We turn those underground payment admins into ambassadors, do local activations where our users are already facing the pain and penetrate the market one by one.","links":"https://getsurf.cash","market_cap":2585216,"market_cap_rank":2697,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/surfcash_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"SurfwRjQQFV6P7JdhxSptf4CjWU8sb88rUiaLCystar","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/SurfwRjQQFV6P7JdhxSptf4CjWU8sb88rUiaLCystar"}},"is_native":false}