{"name":"Mad Bears Club [OLD]","id":"mad-bears-club","symbol":"bear","description":"What is the project about? Mad Bears Club is a Web3 investment and product company. We launch NFT collections to raise capital and provide income for holders with our native token and farming pool. We make investments in blockchains, tokens, DeFi and build diversified low-risks portfolio. We accept funds for asset management. We run Web3 alpha tools for comprehensive market analysis, Web3 education courses and Web3 media. We have our governance token BEAR. Our mission is long-term investment returns, building products that bring value for Web3 space and our holders prosperity. What makes your project unique? We launch NFT collections to raise capital for our investments and our products developing. Our NFT you can put into staking and get our native token daily rewards which you can put into ⁠farming to earn SOL. Holders of our NFT collections can get special holder roles to have impact to our project and access to our Web3 alpha tools. We're at the forefront of revolutionizing the way investments are made, capitalizing on the potential of blockchain, cryptocurrencies and DeFi. We take advantage of the limitless opportunities presented by Web3 technologies. We aim to identify the innovative projects that are built on the principles of blockchain and participate in the growth of this transformative ecosystem. We accept funds for asset management. Our goal is to empower our investors with the means to achieve financial prosperity through prudent and strategic investments. We are committed to delivering consistent, risk-adjusted returns while prioritizing the preservation of capital and promoting long-term growth. We run great number of Web3 alpha tools for comprehensive NFT, crypto and stock market analysis in private Discord channels for our holders. Also we have Web3 job board and ChatGPT integration. We run our Web3 education website and provide educational courses about crypto, NFT, stock markets and self growth. You can discover a diverse range of courses covering blockchain, DeFi, NFT, learn from industry experts, choose flexible learning paths and connect with a thriving Web3 community. We run our Web3 media with news, analytics, research and educational content about NFT, crypto and stock markets. We publish regular updates with content for investors who passionate about learning, growing and earning in financial world. We have our governance token BEAR. Holders of BEAR token can get bear roles in our community to have impact to our project. History of your project. We build NFT collections almost for year now and we have our governance BEAR token. It's our community token and a lot of our holders really want it be listed on coingecko. We're listed on CoinMarketCap already - https://coinmarketcap.com/currencies/mad-bears-club/. What’s next for your project? We believe in the power of Web3 and its ability to bridge gaps, to link anyone and anywhere to decentralized web of opportunities. We make community-focused project with confidence, consistency and transparency, establishing an elite brand for our community that is here to stay. Our community is the place where unique minds merge, come together and create a respectful and loving place that anyone can call home. What can your token be used for? BEAR governance BEAR farming BEAR lending BEAR flip game BEAR payments BEAR raffles","links":"https://madbears.club/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mad-bears-club/logo.png","detail_platform":{"solana":{"decimal_place":0,"contract_address":"9LmCL3nyvFG95cB9RpaszPTAwaQykVAHcSxQbJ6vNpAU"}}}