{"name":"ConsciousDao","id":"consciousdao","symbol":"cvn","description":"Conscious Network is a public chain infrastructure that deeply integrates AI. It is based on a multi-layer blockchain network architecture consisting of Layer 1 and L2 Rollup, and introduces decentralized storage protocols to build a scalable Web3 AI infrastructure. Conscious Network features: 1. layer 1 + layer 2 2. plus singularity governance model to extend community governance 3. AI artificial intelligence computing platform, based on layer 2 4. User privacy data storage Conscious Network focuses on three major breakthroughs in blockchain technology, making the entire mainnet more efficient, secure, and AI-driven. 1. It has introduced the original AI light node based on MPC technology for big data, laying the technological foundation for the popularization of AIGPT. 2. It has adopted a multi-layer blockchain network structure of L1+L2, achieving a perfect balance of usability, security, and reliability in the AI network era. 3. It has a modular, open-platform architecture that can support the seamless integration and deep integration of various heterogeneous blockchain modules. Its core technology is leading the forefront of AI public chains! The native token of Conscious Network is CVN, which can be used for community governance, ecological construction, voting, payment and mainnet mining. CVN issued a total of 200 million supply: - ConsciousDAO initial total: 150 million - Inflation mining: 50 million - Genesis DAO (early user migration): 5 million (2.5%) - Genesis DAO (cornerstone investment): 5 million (2.5%) - MetaDAO: 40 million (20%) The tokens of the above early participating users are allocated to 50 million pieces, which will be managed by the foundation and locked for 12 months for staking; The output part will be used for market value management and ConsciouDAO ecological incentives; After 12 months, it will be released to the corresponding users linearly in 2 years; - Mining inflation output (1 year): 50 million - DAO ecological incentives:","links":"https://www.consciousdao.com/home","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/consciousdao/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x57f5c1a40f1e847e50ebdd29cb3dbfef777d2d3e"}}}