{"name":"OX Coin","id":"ox-fun_ethereum","symbol":"ox","description":"OX Coin is the native currency of [OX.FUN](https://ox.fun) - a nextgen SocialFi perps exchange. ###What is OX.FUN? OX.FUN is a derivatives exchange where users can trade 200+ coins with up to 50x leverage, including the latest meme tokens. It also supports a diverse range of memecoin collateral, allowing holders to get the most out of their meme portfolios. ###What is the Utility of OX Coin? * OX can be used to stake, earn yield and participate in [OX.FUN Vaults](https://ox.fun/vaults) * OX is accepted as trading collateral on OX.FUN * All fees on OX.FUN are collected in OX * OX is the native PnL currency of OX.FUN ###What are OX.FUN Vaults? Users on the platform can stake in a range of passive strategy vaults, allowing them to earn yield in ranging, upward and downward trending markets. OX.FUN also runs large scale memecoin trading competitions using Battle Vaults, including 16-way competitions between memecoin devs and 1v1's between various Crypto Twitter personalities, and the notorious ongoing Su VS Kyle 3AC trading deathmatch Users can stake into their favourite competitors' vaults, copying their trades and participating in prize pools. ###What makes OX.FUN a SocialFi Exchange? OX.FUN pioneers the Alpha Feed, allowing users to comment and share any of their trades. Other traders may then copy or counter trade them. There’s always an incentive to comment on trades to influence other traders on the platform - the original trader earns fees from those who copy/counter, while (unlike standard copytrading) the rest of the original traders’ account is hidden. The platform’s Battle Vaults also allow users to bet on social media personalities & memecoin devs, copy-trade their strategies, and participate in prize pools. ###Does OX.FUN have a Referral Program? OX.FUN offers a class-leading referral program where users can earn 30% of their referrals' trading fees. New referrals also receive a permanent trading discount - 50% off maker fees and 28% off taker fees. ###What are the Basic Tokenomics of OX Coin? OX Coin was launched on February 15th, 2024 with a maximum supply capped at 9.86B tokens. The current circulating supply of OX Coin is verified and visible above, alongside the total and maximum supply values. All trading fees on OX.FUN are periodically burned, constantly decreasing the total supply. More information regarding fee burn and other OX.FUN statistics can be found on our [Analytics page](https://analytics.ox.fun/).","links":"https://ox.fun/en","market_cap":103945,"market_cap_rank":6930,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ox-fun/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xba0dda8762c24da9487f5fa026a9b64b695a07ea","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xba0dda8762c24da9487f5fa026a9b64b695a07ea"}},"is_native":false}