{"name":"Overnight.fi USDC+","id":"usdc-plus-overnight_base","symbol":"usdc+","description":"Overnight is a cutting-edge decentralized finance (DeFi) platform that offers users innovative solutions to maximize their earning potential. By combining the stability of traditional financial instruments with the advantages of blockchain technology, Overnight revolutionizes the way individuals interact with the financial ecosystem. At the core of Overnight is the concept of stablecoin-based DeFi. The platform introduces stablecoins like USD+, DAI+, USDC+, and USDT+ that are designed to maintain a stable value relative to their underlying assets. These stablecoins serve as foundational building blocks for users to access various opportunities within the DeFi landscape. Overnight.fi is a protocol focusing on asset management, with a specialization in neutral-risk strategies. At the heart of its product line is USD+, which is a yield-driven stablecoin, fully backed by collateral. This collateral for USD+ is rooted in DeFi strategies that generate returns. These strategies encompass lending to platforms like Aave, and include both stablecoin-to-stablecoin and neutral-risk strategies. A risk-minimised USDC-pegged crypto asset backed by an underlying basket of USD stablecoins USDC+ is one of the main tokens of the protocol, ERC20. It’s a rebase token, fully collateralized with assets that can be instantly converted into USDC. A rebase token can experience Profit (positive rebase) when the collateral value exceeds 100% and Loss (negative rebase) when the collateral value falls below 100%. Please note that you assume the risk of all protocols in the USDC+ Collateral. Profit payouts occur through daily rebasing, providing transparent balance and P/L visibility.","links":"https://overnight.fi","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/usdc-plus-overnight/logo.png","detail_platform":{"base":{"decimal_place":6,"contract_address":"0x85483696cc9970ad9edd786b2c5ef735f38d156f","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x85483696cc9970ad9edd786b2c5ef735f38d156f"}},"is_native":false}