{"name":"Inverse Finance","id":"inverse-finance_ethereum","symbol":"inv","description":"Inverse Finance is the decentralized autonomous organization that develops and manages the FiRM fixed rate lending protocol, the DOLA debt-backed, decentralized stablecoin, and sDOLA, the yield-bearing version of DOLA. Inverse on-chain governance uses the INV governance token, which generates revenue sharing for stakers. Originally founded by Nour Haridy in late 2020, the Inverse Finance code base is open source and maintained by the community. What is INV? INV is the governance token for Inverse Finance. How to obtain INV? You can purchase INV on Curve and Balancer What is Inverse Finance? Inverse Finance is a lending and stablecoin protocol. What is FiRM? FiRM, the Fixed Rate Market, is Inverse Finance’s fixed rate lending protocol that implements a new DeFi primitive called DOLA Borrowing Rights. Borrowers on FiRM may borrow at fixed rates for unlimited durations. A novel money market architecture, Personal Collateral Escrows, ensures that different tokens from different users are not co-mingled. What is DOLA? DOLA is a decentralized, synthetic stablecoin pegged to the US Dollar. It is designed to be valued as close to $1 as possible with minimal volatility. DOLA is debt-backed rather than algorithmic, meaning that DOLA is over-collateralized with assets like stETH, WBTC, and others. A yield-bearing version of DOLA, sDOLA, captures revenue from borrowers on FiRM and rewards users who stake their DOLA in exchange for sDOLA. How does Inverse Finance generate revenue from DOLA? Inverse Finance generates revenue from DOLA lending on FiRM and on third party lending protocols like Fraxlend and Llamalend. In addition, Inverse Finance generates treasury operations revenue from the deployment of assets to DEX liquidity pools where the DAO earns a percentage of the swap fees. Where can you buy Inverse Finance? INV tokens can be traded on centralized crypto exchanges and decentralized exchanges. The most popular exchange to buy and trade Inverse Finance is Coinbase. Other popular options include Curve and MEXC.","links":"https://inverse.finance/","market_cap":18457535,"market_cap_rank":1163,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inverse-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x41d5d79431a913c4ae7d69a668ecdfe5ff9dfb68","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x41d5d79431a913c4ae7d69a668ecdfe5ff9dfb68"}},"is_native":false}