{"name":"Beyond Protocol","id":"beyond-protocol","symbol":"bp","description":"Beyond Protocol was started by Silicon Valley-based technologists in January 2018 to harness the explosive power of merging distributed ledger technology with IoT. Beyond Protocol eliminates hacks and facilitates machine-to-machine value transfer. With security as a given, Beyond Protocol allows us to feel comfortable opening up our devices for collaboration. Using them like threads of yarn, the dreamers among us can weave together inventions we would have not thought to conceive. From the smart phone -- a camera, a touch screen, GPS, an internet connection -- applications were built which revolutionized entire industries (e.g. Uber and Instagram). From Beyond Protocol, mega applications can be engineered on top of any combination of IoT devices: from smart pills to satellites. Imagine a Nest smoke alarm paying a drone to put out a fire, and the drone making micropayments to weather towers along the way to determine the best route. Beyond Protocol sets out to be the ethical language of machines. After over a year of R&D, in early 2019, the Beyond Protocol team put forth the first iterations of its novel technology to a handful of partners. The technology allows its partners, with one line of code, to 1. enable secure message brokering between devices through hardware signatures 2. equip devices with a cryptocurrency and fiat based payment gateway. Beyond seeks to build real, practical solutions for device security and payments from consumers to devices, and soon, among an economy of devices. Beyond envisions a future where good triumphs over evil and technology can work to create an exponentially more safe and more beautiful world.","links":"https://beyond.link/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/beyond-protocol/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xdf290b162a7d3e0a328cf198308d421954f08b94"}}}