{"name":"Atlas USV","id":"atlas-usv","symbol":"usv","description":"Atlas is building a DeFi base layer that turns the 2-dimensional (3, 3) game theory notation for a maximum positive outcome between participants into a 3-dimensional play, where in addition to users, the protocol itself also generates value for its users and the rest of the ecosystem. USV (Universal Store of Value) is the base layer token of Atlas. Unlike many other tokens in the DeFi ecosystem, USV is backed by the Atlas treasury, giving it an intrinsic, rising value also known as \"\"the book value\"\". Atlas USV's Treasury is made of 5 components: Stables, USV Liquidity, Passive Growth Tokens, Partner Tokens, and Other Atlas Layers. (1) Stables such as DAI and Frax are required to mint USV. (2) USV Liquidity Pool Tokens are offered through barter contracts and owned by the treasury. (3) The Passive Growth portfolio of tokens is managed by an engine that optimizes the portfolio's formula using a modified version of Markowitz's Optimal Portfolio Theory (Harry Markowitz, \"\"Portfolio Selection\"\" The Journal of Finance, 1952). This feature is coming soon. (4) Atlas USV is built to be the default backbone currency for DeFi. As such, Atlas expects major partnerships with other protocols that will benefit the treasury. (5) The Atlas Project will continue to release more layers with additional, distinct utilities and tokens that build on Atlas USV. The treasury will accumulate these tokens and capture value from these additional layers.","links":"https://www.atlasusv.com","market_cap":731746,"market_cap_rank":2804,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/atlas-usv/logo.png","detail_platform":{"polygon-pos":{"decimal_place":9,"contract_address":"0xac63686230f64bdeaf086fe6764085453ab3023f"},"avalanche":{"decimal_place":9,"contract_address":"0xb0a8e082e5f8d2a04e74372c1be47737d85a0e73"},"ethereum":{"decimal_place":9,"contract_address":"0x88536c9b2c4701b8db824e6a16829d5b5eb84440"},"binance-smart-chain":{"decimal_place":9,"contract_address":"0xaf6162dc717cfc8818efc8d6f46a41cf7042fcba"}}}