{"name":"Aether Games","id":"aether-games","symbol":"aeg","description":"Aether Games is an innovative transmedia development studio that creates immersive gaming and entertainment experiences for both web2 and web3 audiences. Our mission is to build a comprehensive gaming franchise that seamlessly integrates traditional gaming, blockchain technology, and engaging narrative content across various media formats. With over a year of development under our belt, Aether Games has two gaming titles in the pipeline: Cards of Ethernity (in open beta) and Gates of Ethernity (auto battler launching EOY 2023). Our projects are backed by esteemed investors, including Polygon Ventures, GSR, Polkastarter, Ultra, Icetea Labs, Magic Eden, and Mystenlabs. Our transmedia product lineup includes: Cards of Ethernity (CoE): A digital collectible competitive card play-and-earn game that offers an engaging and rewarding experience for gamers and collectors alike. Gates of Ethernity (GoE): A highly addictive strategic autobattler that challenges players to make well-thought-out decisions and build powerful teams to dominate the battlefield. Gates of Ethernity AR Viewer: An augmented reality mobile app that brings your NFTs to life, allowing you to view and interact with them in real-world environments. Aether (Series): A CGI series that expands our franchise to a wider audience, captivating viewers through thrilling narratives and captivating visuals, available on top streaming services. At Aether Games, our focus on transmedia storytelling and innovation sets us apart from traditional game developers. By integrating gaming, blockchain, and multimedia content, we create a rich and cohesive universe that offers endless possibilities for both gamers and investors alike.","links":"https://www.aethergames.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aether-games/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":""}}}