{"name":"Aether Games","id":"aether-games","symbol":"aeg","description":"Aether Games is a transmedia development studio focused on creating immersive experiences through games, series and interactive AI technologies. Aether Games is not only enhancing the gaming experience, but is also empowering players in a way that is also inclusive of traditional gamers. Aether Games have secured the Exclusive Rights to develop the Official Online Trading Card Game for \"The Wheel of Time\" series. Products lineup Aether: Trading Card Game Aether is a Trading Card Game set in the dark fantasy universe. Players use a variety of Adventurers, Creatures and Cards, each with their own unique mechanics, to craft powerful new strategies. Players quest for new cards and battle each other for ranks and rewards, all while customizing their decks and cards to suit their individual playstyles. With real-time online battles, deep strategy, and expansive card sets, Aether offers an immersive and rewarding gaming experience. Aether Saga Fully CGI 3D cinematic dark fantasy series about Holda and Einar, immersing the audience into the world of Aether. Aether Saga is a captivating story set in a mystical Viking world, where ancient Norse mythology intertwines with magical elements. Cards of Eternity: The Wheel of Time Venture into the legendary world of \"The Wheel of Time\" with Aether Games' upcoming title \"Cards of Eternity: The Wheel of Time\". \"The Wheel of Time\" is an epic fantasy masterpiece by Robert Jordan and Brandon Sanderson. Spanning 14 novels, it's a tale of magic, conflict, and destiny that has captivated millions worldwide. Its rich narrative and deep lore have made it one of the best-selling fantasy series ever, securing its place as a cultural phenomenon with a successful TV adaptation on AmazonPrime. Token Utility $AEG: Empowering Aether Games Ecosystem","links":"https://www.aethergames.io/","market_cap":404186,"market_cap_rank":4802,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aether-games/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xe3f2b1b2229c0333ad17d03f179b87500e7c5e01","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xe3f2b1b2229c0333ad17d03f179b87500e7c5e01"},"ethereum":{"decimal_place":18,"contract_address":"0xf0187b76be05c1fcaa24f39c0a3aab4434099c4f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf0187b76be05c1fcaa24f39c0a3aab4434099c4f"}}}