{"name":"HODL","id":"hodl-token","symbol":"hodl","description":"HODL is a pioneering decentralized finance (DeFi) project on the Binance Smart Chain (BSC) that provides a unique earning experience for its holders. Since its inception in May 2021, $HODL has rewarded its holders with over 20,200 BNB. The HODL ecosystem includes multiple features to boost earnings for its holders. These features include project tokens ($HODL and $HODLX), yield farming, staking, NFTs (HODL Hands and Gem Fighter), Play-to-Earn gaming, BNB rewards, reflection earnings, and hyperdeflation. The project employs a sustainable reward pool with capping innovation to maintain stable reward payouts and integrates these features into a single HODL app. HODL's transaction tax model supports investor earnings. Each transaction incurs a 5% tax, divided into 4% for the reward pool and 1% as reflections to $HODL holders. Rewards are distributed weekly, with options to reinvest in $HODL, $HODLX, and HODL Hands NFTs, allowing for reward stacking to offset network costs. Reinvestors benefit from earlier reward claims. The total supply of $HODL is capped at 1 quadrillion tokens, with deflationary measures in place. Over 27% of the supply is held in a burn wallet, which also receives reflections on every transaction. $HODL is accessible on various decentralized exchanges and maintains a strong presence on major social media platforms such as Telegram, Facebook, Twitter, Discord, Instagram, and YouTube, with a community of over 27,000 investors. Future developments in the HODL roadmap include a vault, Texas HODLem poker, and further enhancements to the HODL app, promising continued growth and innovation for $HODL holders.","links":"https://hodltoken.net/","market_cap":1193610,"market_cap_rank":2630,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hodl-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x0e9766df73973abcfedde700497c57110ee5c301"}}}