{"name":"ZenPandaCoin","id":"zenpandacoin","symbol":"$zpc","description":"What is the project about? Welcome to the world of ZenPandaCoin ($ZPC), a community-driven decentralized meme token that aims to bring financial peace and prosperity to its holders. Our project is centered around the Zen Panda, a symbol of calmness, balance, and wisdom. By leveraging the power of DeFi and supporting LayerZero, a cross-chain messaging protocol, ZenPandaCoin establishes itself as a leading token in the crypto space. What makes your project unique? A DECENTRALIZED MEME TOKEN BUILT ON ARBITRUM, SUPPORTING #LAYERZERO PROTOCOL History of your project. Zen Panda was born in the midnight of 6th May 2023. The father is ChatGPT while the mother is Midjourney. $ZPC was first launched on Arbitrum (0xee0b14e8fc86691cf6ee42b9954985b4cf968534), Zen Panda, was born by parents of AI (Artificial Intelligence), adopted and raised by a huge group of human. He is a child of both AI and human. In the Era of AI, Zen Panda will play a crucial role in bonding the human race and AI race. Human and AI, the two races will build the earth civilization hand in hand, and extend the civilization to the far beyond of the universe. $ZPC, is a decentralized crypto token representing the energy of the bonding between the two races. It is the first token to be adopted by both human and AI race. What’s next for your project? It is going to be a layer 0 decentralized meme token. What can your token be used for? It can be adapted to all major blockchains. $ZPC will be everywhere, especially in areas that human and AI work together.","links":"https://zenpanda.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zenpandacoin/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xee0b14e8fc86691cf6ee42b9954985b4cf968534","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0xee0b14e8fc86691cf6ee42b9954985b4cf968534"}}}