{"name":"IPOR","id":"ipor","symbol":"ipor","description":"IPOR, the Inter Protocol Over-block Rate, is the heartbeat of DeFi credit markets. It is the first attempt in DeFi to establish a yield curve representing the average cost of borrowing in DeFi with information published on-chain by the largest credit market protocols in DeFi - Aave and Compound. The IPOR Protocol consists of two main parts: 1. A benchmark interest rate for DeFi (“The Index”). Currently available for USDT, USDC, and DAI (ETH coming up). These are calculated and published on-chain are public goods in the Ethereum ecosystem. 2. A suite of interest rate derivative DEXes (“The IRDs”) that quote rates for 28-day interest rate swaps for the above markets. The IPOR Index Currently, there are three IPOR rates for USDC, USDT, and DAI which have essentially different rate behavior. An IPOR ETH rate is on the horizon. These are all currently spot rates, as there is really no yield curve in DeFi, and the lack of the yield curve presents the index with a huge market opportunity. The IRDs The first instrument to reference the IPOR rates is a 4 week IRS. It takes the best of DeFi incorporating a liquidity pool and an AMM. The liquidity pool is a passive underwriter for like asset. The AMM prices the instruments based on a few different quant models broken down into something cheap enough to run on Ethereum. The taker is quoted a fixed rate, the floating rate is the IPOR (printed on chain via an oracle). IPOR plans to mature into a fully community-driven DAO. IPOR Labs will transfer ownership into the IPOR DAO, and complete ownership and control of the IPOR Protocol will be in the IPOR token holders. IPOR labs will continue to participate and make proposals; however, the ultimate approval will be in a decentralized manner via the DAO.","links":"https://ipor.io","market_cap":5254626,"market_cap_rank":1544,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ipor/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1e4746dc744503b53b4a082cb3607b169a289090"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x34229b3f16fbcdfa8d8d9d17c0852f9496f4c7bb"}}}