{"name":"REL","id":"rel_solana","symbol":"rel","description":"REL is a production-grade infrastructure platform that enables per-request payments for APIs through the x402 protocol, an HTTP extension that embeds payment handling directly into web requests. Acting as a reverse proxy, REL verifies payments on-chain before forwarding calls to the target API. This allows any provider to charge for access dynamically, without relying on centralized billing systems, subscription models, or external gateways. The system was designed to integrate with existing APIs effortlessly. Developers upload an OpenAPI specification, define pricing per endpoint, and immediately enable usage-based monetization. REL handles all routing, payment validation, metering, and error management automatically, maintaining standard HTTP behavior for clients and compatibility with existing development workflows and tools. Technically, the platform focuses on latency under 300 ms, reliability, and full protocol compatibility. It doesn’t alter the underlying business logic of APIs; it simply adds a verified payment layer that operates transparently. The infrastructure supports both individual developers and large organizations seeking transparent, usage-driven billing while retaining full control over their backend, data, and deployment environment. REL’s architecture is stateless, deterministic, and designed for scalability, meaning payments and requests are processed independently without maintaining session state. This makes it suitable for high-throughput systems, enterprise data services, API marketplaces, and AI agents requiring precise, per-call payments. Its purpose is purely functional: to provide a stable, efficient bridge between established HTTP standards and on-chain transaction logic, without friction, unnecessary abstraction, or deviation from standard web infrastructure practices.","links":"https://relai.fi/","market_cap":161483,"market_cap_rank":6245,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rel_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"5AgHPy5UojpGq6TdtQCNobCZ2tkYmZz4d5p1cqr6pump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/5AgHPy5UojpGq6TdtQCNobCZ2tkYmZz4d5p1cqr6pump"}},"is_native":false}