{"name":"Dewae","id":"dewae","symbol":"dewae","description":"What Is DEWAE (DEWAE)? DEWAE is the first bluechip memecoin on PancakeSwap V3. DEWAE pays hommage to the greatest meme ever created: Ugandan Knuckles, Who's signature catchphrase is 'Do u kno DEWAE?'. DEWAE's primary purpose is to empower the crypto community through memes and celebrating Ugandan Knuckles so we can safely show more bruddas 'DEWAE' to crypto, and DeFi. DEWAE tokens will be the key to listing on our launchpad (under development) and of course unlocking exclusive bounty opportunities that will allow our holders to instantly earn & support new projects. This launchpad will be designed to leverage the power of memes and community to make the crypto space, safer and more accessible than ever before. DEWAE is the native utility token that will be used for: - Fees for new projects listing on our launchpad - Access to the Holder exclusive bounties & ability to earn rewards by supporting new projects - Used for governance votes to determine future development & direction of the project. *Whitelist in our PFP NFT collection How Many DEWAE Coins Are There in Circulation? DEWAE had a completely fair launch on May 08 2023, with a fixed maximum supply of 8,008,135,420,690 DEWAE tokens created at genesis. 6.9% of supply has been reserved for future CEX listings and the rest of the tokens are available on the free market. The liquidity for this has been locked indefinitely for over 8000 Quadrillion Years on FlokiFi. We do not have any tax, reflections or any other mechanic to complicate emissions or sell pressure, by holders or the team. Who Are the Founders of DEWAE? DEWAE is the creation of 4 'bruddas' tired of seeing endless rugs bring harm to the reputation of the crypto space. All of whom have made extensive contributions to the DeFi space and represent large active projects. As such, we are all very aware of the risks of doxing and will refrain from doing so unless absolutely necessary to get listed on a CEX.","links":"https://www.dewae.lol/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dewae/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6c13a45101bd70561daf6186da86d7bdb018754f"}}}