{"name":"Pepe 2.0","id":"pepe-2-0","symbol":"pepe2.0","description":"What is the project about? Pepe 2.0's aim is to provide a truly decentralized platform for all investors. Learning from previous tokens mistakes and allowing complete decentralization in all it does. What began as meme token has grown into something much more with future utilities in planning and rolling out in due course. What makes your project unique? The unique concept of truly a decentralized platform, renounced contract and exceptional development team backing the project have seen Pepe 2.0 grow massively and achieve alot of success in a short time frame History of your project. Project was launched on 28 June 2023 and to date has achieved the following including multiple Exchange listings; - we have grown on Twitter to around 16.7k followers - we made massive good calls by Twitter influencers and twitter spaces. - our Twitter view/impression is +20k for each post now. - our holders increased to +9800 and many others waiting for the CG listing to buy more and hold. - our market cap is stable on a good floor between 25 mil to 30 mil with +52 mil ATH. - our volume is massive with + 42 mil daily volume. - our telegram grew from to +9600 members. - our telegram group is very active and our holders are hyped. - we are verified on Ethersan and our social profiles are updated. - our website is always updated. -we will do more partnerships with the most known communities in the crypto space. -Big announcement and banner on Moontok: https://moontok.io/coins/pepe-20-2025 What’s next for your project? The team are currently securing more large marketing partnerships, further large exchange listings and utility development What can your token be used for? Currently trading only, with futures on Lbank in the works. Utility provided will enable this token to be used freely around the world for payment systems.","links":"https://pepe20.vip","market_cap":4308451,"market_cap_rank":2487,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pepe-2-0/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0305f515fa978cf87226cf8a9776d25bcfb2cc0b","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x0305f515fa978cf87226cf8a9776d25bcfb2cc0b"}}}