{"name":"Marvelous NFTs","id":"marvelous-nfts","symbol":"mnft","description":"Bad Days is a blockchain-based interactive trading and battling game. Inspired by Stan Lee’s own hilarious cartoon series on YouTube called Bad Days which can be found on the channel Marvelous TV: https://www.youtube.com/c/MarvelousTV/videos, Bad Days allows players to Collect, Fuse, Battle, and Trade token-based Superheroes. The Bad Days Alpha release includes 12 superheroes, and new characters are available each season. Bad Days Characters come in 5 different rarity scales: common, uncommon, rare, legendary, and Mythic - and 5 attribute Levels measured by and known as the power grid, Each Bad Days Character is a custom ERC-1155 non-fungible token (NFT) with different attributes and strengths and can be entered into PVP, PVE, and 3v3 battles, with each win earning Battle Points (BP), MNFT Shards, and game Items that are used to Unlock superpowers and build player attributes. These characters can be fused together to produce unique player-built battle decks, which can be used in the battle arenas. The Bad Days ecosystem also has its own unique process, known as Fusion. There are two types of Fusion. First is the process of transferring superpowers from one character to another, permanently locking to the character creating a customised and unique NFT character asset. Second is the process of leveling up rarity and power grid attributes. The second process requires a Bad Days Character (BDC) to be burnt, thus reducing the (BDC) supply. Who Are the Founders of Marvelous NFTs (Bad Days)? Bad Days was created in 2020 by Marvelous NFTs — a technology and art-focused game studio co-founded by Damian Rolvink and David Palmer. Damian Rolvink is the current CEO of the platform. Damian has accumulated over 20 years of experience in engineering and project management, specialising in government-funded projects. Being a gaming enthusiast and an early adopter of blockchain starting back in 2014, Damian found himself particularly interested in blockchain gaming and the NFT space, inspiring him to create this project. David Palmer is the current COO and Co-Founder of Marvelous NFTs. David has 25 years of experience as a supervisor and manager of teams, holding the position of Lead Supervisor for a construction company. David was first introduced to the space with day trading crypto and soon enjoyed the opportunity to engage with the industry full time. In 2018, David started producing promotional and marketing videos for a diverse range of blockchain projects and companies, establishing an extensive network of project leaders and team contacts. Being particularly enthused about NFT gaming projects, exploit testing, and assisting Alpha and Beta processes, along with being an avid collector of Marvel comics and memorabilia for many years, accumulating over 20,000 NFTs himself, co-founding Marvelous NFTs was a natural evolution for him. What Makes Bad Days Unique? Each Bad Days character (BDC) possesses upgradable attribute power grids, and each character has its own set of superpower battle moves; the fusion process allows owners to customise their Bad Days Characters (BDC) superpowers producing a variety of strategic battle options and unique builds among Bad Days Characters (BDC), with the frequent addition of new character sets and Battle Cards (BC) an owner can fuse new additional Battle Cards (BC) and create powerful characters. Characters are classed into 6 elements, including - Cosmic, Gravity, Invulnerability, Teleportation, Lifeforce, and Telekinesis, each providing environment and battle advantages. MNFT token holders will soon be able to stake their LP tokens to receive regular rewards. How Many Marvelous NFTs (MNFT) Coins Are There in Circulation? Marvelous NFTs (MNFT) tokens have a total supply of 275 million tokens. Out of this, 10,312,500 million tokens are in circulation at TGE. In total, 3.75 % of the total supply was allocated to participants on the Public launchpad IDO sale (each MNFT token price at Listing price is $0.12), 6.25% was sold in seed, and strategic rounds and 5.75% was sold in a private sale. In addition to this, 5% is allocated for staking rewards, 20% to the play-to-earn pool, 15% to the team, 7% to advisors, 7.75% to the ecosystem fund, and 12.5% to operations and marketing. The remaining 11% is held in the escrow vault. How Are the Marvelous NFTs (MNFT) Secured? The Marvelous NFTs (MNFT) token is an ERC-20 token launched on the Ethereum blockchain. As a result, it is secured by Ethereum’s proof-of-work (POW) consensus mechanism. The Marvelous NFTs (MNFT) token is mapped to polygons Layer-2 protocol where all transactions and NFT minting is processed, with the benefits of reduced gas fees and fast transactions. The Marvelous NFTs (MNFT) token includes a Bridge to Binance Smart Chain. Where Can You Buy Marvelous NFTs (MNFT)? As of January 2022, Marvelous NFTs (MNFT) will be available to trade on numerous exchange platforms, including DEX exchanges like PancakeSwap (BSC), Quickswap (Polygon), Uniswap (Ethereum) Related Links: Game DAap- https://www.baddays.io Medium- https://marvelousnfts.medium.com Website- https://marvelousnfts.com Telegram- https://t.me/baddayscom Discord- https://discord.gg/ch89egzcTf Twitter- https://twitter.com/MarvelousNfts_","links":"https://marvelousnfts.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/marvelous-nfts/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x33be7644c0e489b3a0c639d103392d4f3e338158","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x33be7644c0e489b3a0c639d103392d4f3e338158"},"polygon-pos":{"decimal_place":18,"contract_address":"0xd281af594cbb99e8469f3591d57a0c72eb725bdb","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xd281af594cbb99e8469f3591d57a0c72eb725bdb"}}}