{"name":"3DPass","id":"3dpass","symbol":"p3d","description":"What is the project about? 3DPass is an OpenSource decentralized Layer 1 blockchain-based WEB 3.0 platform for the tokenization of real physical and virtual objects and its transformation into digital assets. Since the early days of 2019 we have put our mind on solving the Real world objects digital transformation challenge. The very first algorithm called Grid2d was suggested by Michael Co in 2020 and has been implemented now as pass3d recognition toolkit serving the basement of 3DPass network consensus called Proof of Scan. The main idea of 3DPass is to make it possible for people to use real world objects in digital within smart-contracts and deals and to take all advantages of that. By means of creation and implementation new recognition algorithms into our network, we are building this bridge between decentralized blockchain digital space and trillions in deals all over the globe. What makes your project unique? Every 3D object, transformed by 3DPass, has its own unique and stable identity called HASH ID the object might be recognized by. In order to encourage users to maintain the network and to solve issues there is a cryptocurrency 3DP Coin which is also required to move the assets. History of your project. 2022 Q1 - Testnet launch Testnet launch (launched) Private sale (launched) Membership launch (done) Source code publishing (done) Q2 - Mainnet launch Official launch mainnet (launched on August 30th, 2022) Web3 light wallet (released) Smart Contract trait implementation (Rust based language ink implemented) 2023 Q4 Core: 2D drawings recognition algorrithm implementation ( in the process) Demo dApp CEX: Tier1 exchange listing ( MEXC is in the process) Foundation: forming up What’s next for your project? MEXC integration What can your token be used for? Adjust the algorithm's recognition parameters to define the ownership rights border which would distinguish the real asset from the fake ones. In order to create a personal asset","links":"https://3dpass.org","market_cap":641369,"market_cap_rank":4201,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/3dpass/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}