{"name":"Separly","id":"separly","symbol":"separly","description":"What is the project about? Separly is the infrastructure for NFT co-ownership. What makes your project unique? Separly is driven by the goal of assisting businesses in seamlessly incorporating NFT co-ownership modules into their platform offerings. History of your project. Separly is a project that has undergone a transformation. Our journey began with the development of a solid business model and the creation of a roadmap outlined in our GitBook (https://separlyfaq.gitbook.io/separly/roadmap/general-roadmap). The first major milestone we tackled was community building, which kicked off in December 2022. Through effective marketing efforts, we successfully amassed over 8,000 members on Telegram, and established a presence on Medium. Additionally, during this community building phase, we partnered with several investors TG communities and enlisted BCA Service as our trusted auditor for our native token (https://github.com/bcaservice/audit-report/blob/main/Separly/Separly.pdf). In terms of progress, we have successfully completed a significant part of the second stage outlined in our roadmap. What’s next for your project? During the forthcoming period, we have strategic initiatives in place to form partnerships with influential figures on Twitter and YouTube. Additionally, we are set to launch an extensive marketing campaign to promote the beta version of Separly. We place immense value on user feedback and plan to thoroughly analyze it during this phase, as it will serve as a guiding force for our ongoing development efforts. Following this assessment, we will open the Separly platform to the public. At this crucial juncture, the roadmap will transition into a decentralized autonomous organization (DAO) framework, empowering the community to actively participate in decision-making and shape the future of Separly. What can your token be used for? DAO, Separly services","links":"https://separly.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/separly/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x78e079b08e5920d6029ec6fe9aa83d611ea60b79"}}}