{"name":"Cudos","id":"cudos","symbol":"cudos","description":"What is CUDOS? CUDOS powers a decentralised compute network that will interoperate with multiple blockchain ecosystems to provide the following benefits: 1. Trusted layer 1 validator network built on the Tendermint protocol - Wasm compatibility, for smart contracts to be deployed on CUDOS using next-generation languages so long as they compile to WebAssembly. I.e. Golang, Rust, Java etc. 2. Cross-chain or Horizontal interoperability thanks to the network’s Inter Blockchain Communication (IBC) integration, allowing Cudos Network smart contracts to interface with multiple networks. 3. 10x lower transaction and gas costs compared to those on PoW networks - A massively scalable network to facilitate more sophisticated smart contract operations 4. Higher performance with anywhere between 200 to 500 Peak TPS on the network - access to a globally distributed layer 3 network of secure cloud, and compute, resources Turing complete solutions for non-Turing complete Layer 1 blockchain networks. With the underlying Cudo platform live in over 145 countries, across enterprise and edge environments, and used by over 250,000 users, CUDOS is the next major release, providing a decentralised computing layer bridging on-chain and off-chain resources. The CUDOS token serves the following clear purposes: Transaction payments, Network governance and operations, a staking mechanism for receiving blockchain and cloud workloads, and a medium of exchange (MoE). What is CUDOS trying to solve? Scaling on blockchain is both expensive and limited in the type of use-cases it can support. CUDOS solves this issue by providing a highly scalable Layer 2 and 3 solution, connecting both on-chain and off-chain consumers to the network via smart contracts and APIs. Who are the founders at CUDOS? CUDOS was founded by Mathew Hawkins, an award-winning entrepreneur, who previously founded C4L, a data center, cloud and network infrastructure provider that grew to support 1% of the UK’s internet infrastructure. Exiting in 2016 for $30m, Mathew started Cudo and the CUDOS network to build infrastructure services in software, what he previously achieved in hardware. The executive team have backgrounds in building and scaling and SaaS with COO Lee Woodham, who has over 25 years split across scaling financial services and tech companies. The board of advisors also includes David Juxon, former MD of Bank of America, Chris Deering, Former President of Sony Entertainment (Playstation), Joerg Roskowetz, Director of Blockchain for AMD and Maggie Fang, early investor in Uber and Alibaba. What makes CUDOS unique? CUDOS is the first decentralised computing network to provide services to both on-chain and off-chain infrastructure consumers. Built on the Cosmos blockchain and utilising the Tendermint protocol for secure BFT consensus, the CUDOS validator network will provide a globally distributed and highly secure network able to allocate more intensive workloads out to the underlying Layer 3 Cudo platform. How is the CUDOS network secured? The CUDOS Network utilises the Byzantine Fault Tolerant Bonded Proof of Stake mechanism featured in the Cosmos SDK, known as Tendermint Core, as its consensus engine. Validators in the CUDOS network stake a given amount of CUDOS in order to earn fees from validating transactions on the network in a secure and highly reliable way. In order to achieve this, the CUDOS Network also leverages the Cosmos SDK’s staking, slashing, and governance modules to incentivise a minimum of 95% uptime and to swiftly eliminate validators known to perform double-signs or other known forms of bad actor behaviours. Who are the major partners of CUDOS? CUDOS is partnered with major and recognised brands across both blockchain and enterprise computing verticals, including AMD, Ultra & Algorand. Strategic backers include Outlier Ventures (OV), Moonwhale, Moonrock, Brilliance Ventures, GBV, Spincrypto, Double Peak, Coinvision, and BMW Capital. How many CUDOS coins are there in circulation? There is a maximum supply of 10 billion CUDOS tokens released over a 10 year period (starting from the 11th January 2021). The total supply of 10 billion CUDOS is distributed via multiple allocations, with 34% Ecosystem & Community Development, 33.78% Reserve, 20% Team (2% released based per milestone achieved. 10 key pre-determined milestones), 5% Advisors and 7.22% to presale token holders. Use of funds will be as follows: 30% Research & Product Development, 10% Administration & Operations, 20% marketing, 10% CUDOS Validator Nodes (CVN), 13% User Acquisition, 10% Community Engagement and 7% Contingency. Where can you buy CUDOS? At the time of writing, the top exchanges for CUDOS trading are Ascendex, KuCoin, Gate.io, Uniswap, Bittrex Poloniex, CoinField, Liquid, ZT Global, and others.","links":"https://www.cudos.org/","market_cap":30458327,"market_cap_rank":1088,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cudos/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x817bbdbc3e8a1204f3691d14bb44992841e3db35","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x817bbdbc3e8a1204f3691d14bb44992841e3db35"},"archway":{"decimal_place":18,"contract_address":"ibc/2AE1ECA44CAD0C933CE178742595CE6796530FA1983E4FA7F4E43FBB5854D505"},"osmosis":{"decimal_place":18,"contract_address":"ibc/E09ED39F390EC51FA9F3F69BEA08B5BBE6A48B3057B2B1C3467FAAE9E58B021B"}}}