{"name":"Sable Coin","id":"sable-coin","symbol":"usds","description":"What is the project about? Sablecoin (USDS) is the LSD-centric, USD-pegged stablecoin used for paying out loans on Sable Finance. At any time, USDS can be redeemed against the underlying collateral at face value. To borrow USDS, users can open a Trove and deposit BNB and Ethereum LSD as collateral, and then borrow USDS up to a collateral ratio of 110%. Sable Finance is a decentralized protocol that offers interest-free loans and is more capital efficient than other borrowing platforms. To guarantee the loans, we have a Stability Pool with USDS, and borrowers act as guarantors for any remaining debt. What makes your project unique? Sable Finance provides interest-free borrowing. To maintain the peg, the borrowing fee and redemption fee will adjust automatically based on the frequency of redemptions. If redemptions occur more frequently, then the borrowing fee will also increase to discourage users from taking out loans. History of your project. The beta version will be launched on Aug 3, offering essential functions of $USDS with BNB as the only accepted collateral. Users can mint the immutable stablecoin and enjoy features like collateral deposit, liquidation, and redemption. Following that, V2 will bring upgraded designs, higher yield optimization, and a user-friendly interface and we aim to launch V2 on Q4. What’s next for your project? Sable V2 will be launched on Arbitrum and BNB Chain, using LSDfi as multi-collateral to meet market needs. What can your token be used for? $USDS can be used to liquidate troves. By providing $USDS to the stability pool, users can receive liquidation gains in the form of collateral (ETH LSD and BNB).","links":"https://sable.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sable-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0c6ed1e73ba73b8441868538e210ebd5dd240fa0"}}}