{"name":"Veno Finance","id":"veno-finance","symbol":"vno","description":"Veno is a liquid staking protocol where you can stake your CRO and receive the auto-compounding, yield-bearing receipt token LCRO. The LCRO token is designed to maximize composability. Just by owning LCRO, you automatically accrue the CRO staking yield value in your LCRO token; LCRO can thus be used freely across the Cronos DeFi ecosystem. Veno’s liquid staking token LCRO offers the most extensive, lowest cost, and most reliable method of utilizing your staked CRO. We are a vertically integrated liquid staking protocol, maximizing the reliability and efficiency of our service; allowing us to provide a price-competitive service in the long term; - Cost savings are achieved by leveraging our own node infrastructure and/or infrastructure of our partners - Reliability is achieved with our enterprise-grade node set-up and deep expertise in running node infrastructure - We also have an insurance module that will help to secure user funds in the unlikely event of a slashing penalty We will aim to maximize the adoption and utility of our tokens across the ecosystem, and we are working with some of the largest ecosystem partners to make this happen; - We want to maximize the liquidity of LCRO in the Cronos Ecosystem and beyond, attracting the largest amount of capital, and attaining the lowest spread, with our high reliability and low-fee promises - LCRO is an auto-compounding yield-bearing token to maximize composability - We can further maximize user liquidity by providing a tradeable NFT after user unstakes their CRO","links":"https://veno.finance/","market_cap":11783203,"market_cap_rank":1103,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/veno-finance/logo.png","detail_platform":{"cronos":{"decimal_place":18,"contract_address":"0xdb7d0a1ec37de1de924f8e8adac6ed338d4404e9"},"zksync":{"decimal_place":18,"contract_address":"0xe75a17b4f5c4f844688d5670b684515d7c785e63"}}}