{"name":"HMX","id":"hmx","symbol":"hmx","description":"What is the project about? HMX is a decentralized perpetual exchange with a cross-margin and multi-asset collateral support on Arbitrum. What makes your project unique? HMX offers the following unique features to users: 1.) Leveraged Trading (Cross-Margin & Multi-Collateral Management Support): Users can open up to 1,000x leveraged long or short positions on many asset classes including Cryptocurrency, Forex, Equity, and Commodities. HMX also accepts various crypto assets as collateral with a cross-margin collateral support, allowing for flexible position and risk management strategies. 2.) Leveraged Market Making (HLP Vault): Users can simply deposit assets into the HLP vault to become market makers on HMX. HLP vault is unique because it is built on top of GMX's GLP token. This means that the liquidity deposited into the vault will be used to market make for traders both at GMX AND HMX. Depositors continue to earn all of the yields from GMX while also earning additional yields from fees generated on HMX. History of your project. The team behind HMX Exchange are experienced traders and DeFi users. We recognize the major pain points faced by our fellow traders with the current available platforms in the market, especially with the failure of many centralized trading platform in 2022. We want to build a platform with great UX/UI, allowing anyone to trade with low-fees, and let participants earn and prosper together with the platform. HMX is backed by DeFi veterans including CoralDeFi, CryptoMind, CompoundCapital and other angel investors. What’s next for your project? Some of the highlights from our RoadMap include: - Cross-chain Expansion: Expand HMX to other chains to grow the ecosystem. Other up and coming L2 chains such as zkSync and Starknet, etc. are our priorities. - Listing additional markets: Expand the selection of assets users can trade on HMX. - Grow HMX Userbase and Community: Grow HMX through various marketing campaign and initiatives - AMAs, paid marketing, trading competitions, etc. What can your token be used for? Below are the current and planned utilities for HMX token: - Earns 25% share of protocol revenue in stablecoins when staked (shared with staked esHMX & DP) - Earns a share of esHMX token emission when staked - Earns Dragon Points (DP) at 100% APR when staked - Receive governance voting rights to help shape key decisions on the development of HMX exchange (coming soon...) - Receive tiered trading fee discount when staked (coming soon...)","links":"https://hmx.org/","market_cap":3155766,"market_cap_rank":1868,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hmx/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x83d6c8c06ac276465e4c92e7ac8c23740f435140"},"ethereum":{"decimal_place":18,"contract_address":"0x83d6c8c06ac276465e4c92e7ac8c23740f435140"}}}