{"name":"RADA Foundation","id":"rada-foundation","symbol":"rada","description":"What is the project about? RADA seeks to transform the traditional sports and entertainment industries by leveraging blockchain technology. The RADA Foundation propels the RADA cryptocurrency into operation as a governance token and employs RADA NFTs for utility objectives. In addition, the foundation intends to launch a Web3 platform dedicated to the RADA DAO community, where DAO members exercise authority by proposing, voting, and making pivotal decisions about the various RADA projects. The vision behind RADA is to pioneer a transformative approach in the world of sports and entertainment. The RADA Foundation has earmarked its first project, which centers on the 'Acquisition and management of a professional European FC in the lower leagues,' complemented by a football talent development initiative. What makes your project unique? The RADA Foundation's primary mission is to reshape the conventional landscape of the football industry, transforming it into a democratic, fan-inclusive ecosystem that transcends borders and breaks down barriers. RADA seeks to create a platform where fans are not merely spectators but vital contributors with a sense of true ownership and belonging. This is not just about changing the club operations—it is about a radical transformation of what it means to be part of a football community, a vision set to create ripples throughout the sport. Moreover, the RADA talent development program offers budding footballers an unparalleled opportunity, aiming to identify and foster talented sports individuals in collaboration with professional sports academies. The program’s holistic approach ensures transparency, comprehensive care, facilities, and a robust training regimen for the player, coupled with secured funding. History of your project. Not all football club management possesses the requisite capabilities to elevate their club's visibility to become one of the prominent FCs in the industry. Recognizing the inherent fusion of sports and technology, RADA is committed to seamlessly integrating real-world business practices with the principles of Web3.0. Moreover, we possess the expertise to identify suitable sponsors and investors for sports ventures. In today's digital landscape, the internet facilitates universal access to project information at any time and from any location. However, with the advent of Web3.0, individuals not only gain access to project details but also have the opportunity to become key stakeholders in the project itself. In this regard, RADA endeavors to facilitate the growth of European FCs by enabling blockchain and Web3.0 enthusiasts to actively contribute to the development of these football clubs. Piloting this ambitious project is a team of experts with rich, diverse experience in sports, technology, and finance. This group of professionals shares a common goal—to fuse their love for football with the transformative power of Web 3.0. Adding to this already strong team is brand ambassador, David Villa, a renowned figure in the football world. As a celebrated World Cup champion, Villa's association with RADA lends the initiative both credibility and an insider's view of the football industry. His valuable insights and global reputation will undoubtedly play a significant role in driving RADA's aim to usher the football industry into the era of Web 3.0. What’s next for your project? For the predetermined project, the RADA team is developing a web3.0 platform based on the DAO community. The RADA Auto-executable SmartContract (RAS) Factory will be developed to complete its unique two-track hybrid voting system. Moreover, the foundation aims to integrate the Explore RADA Asset (ERA) system with Etherscan for transparent fund tracking. Furthermore, a random NFT draw system will be developed based on Chainlink Verifiable Random Function (VRF) to be applied to the DAO community. In pursuit of the first project's execution, they are conducting due diligence on European candidate Football Clubs, including Ambassadors and industry experts, with the goal of acquisition in 2024. What can your token be used for? RADA is a native token in its ecosystem. The RADA Token offers unique financial incentives, steering clear of the traditional PoW and PoS models. Instead, it rewards participants for consuming RADA tokens or active participation in the ecosystem, thereby catalyzing community engagement. By integrating a Metamask wallet with the DAO platform and holding RADA tokens, one can become a member and use tokens to propose and vote. Also, tokens can be used to participate in RADA NFT draws, and some acquired NFTs can be used as voting weights.","links":"https://therada.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rada-foundation/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7aa2f174fbc4d0a17b34adfb9b3e1dc029b46d76"}}}