{"name":"1minBET","id":"1minbet","symbol":"1mb","description":"What is the project about? 1minBET is an online gambling and sports betting platform that leverages blockchain technology to offer a secure, transparent, and user-friendly experience. It provides up to 100 games, including popular casino games and sports betting options on major European football leagues like the Premier League, La Liga, Bundesliga, Serie A, and Ligue 1. What makes your project unique? 1minBET stands out from other online gambling and sports betting platforms because it uses blockchain technology to ensure transparency, fairness, and security. Transactions are decentralized, publicly recorded, and traceable, which promotes trust and accountability. Additionally, the platform uses MetaMask as its exclusive payment method, allowing for fast and efficient transactions while giving users full control over their funds. History of your project. 1minBET successfully raised 60 ETH in a private sale, indicating strong investor interest in the platform. The project's token was also listed on Sushiswap, a decentralized exchange, which can increase liquidity and exposure to a wider audience. $1MB reached an all-time high (ATH) of 0.00153 USD, which is an 84% increase with the dip. Reaching an ATH is a significant milestone for any project and can help generate more interest and attention from investors and users. What’s next for your project? 1minBET will continue to expand its game offerings, partnerships, and user base, as well as exploring new features and integrations. Now 1minBET has 2 dApps available: Football Betting game and Heads or Tails game What can your token be used for? $1MB can be used as a form of payment for betting and gaming on the platform. It can also be traded on decentralized exchanges, such as Sushiswap, allowing for liquidity and investment opportunities for users. As the platform evolves, it may introduce new use cases for the token, such as rewards or incentives for users who contribute to the platform's growth and success.","links":"https://1minbet.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/1minbet/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xbcb90845614747e561ceb9e08a79e22c5d3555e1"}}}