{"name":"PLUMS","id":"plums","symbol":"plums","description":"One-liner description: $PLUMS, for the people, by the people 💎✋ What is PLUMS? PLUMS is a memecoin launched by the people, for the people. Initiated by a group of individuals as a tribute to the Plums internet meme that gained worldwide notoriety from the Ashley Schaeffer (Will Farrell) meme from the Eastbound and Down TV show. The currency is built on the Ethereum blockchain and is designed to be a fun and light-hearted cryptocurrency that can appeal to a wider audience beyond just Bitcoin enthusiasts. What are the project objectives? The project aims to capture the growing popularity of meme coins, which have been on the rise in recent years due to their unique and often humorous marketing strategies, to serve as the safe haven for future Degen liquidity and to create a decentralized network for connecting degens through the power of memes. By leveraging the power of memes, PLUMS will create a network that is not only fun and entertaining, but also has the potential for real-world impact. What makes PLUMS unique? One of the things that makes PLUMS stand out from other meme coins is that it’s supply will not be centralised to individual wallets and its launch involved a $PLUMS airdrop to those who contributed to the initial LP before it reached a hard cap of 20ETH. Moreover, PLUMS has adopted PEPE’s no-tax policy. This means that holders of the currency do not have to pay any taxes on their earnings, which can be a significant benefit for those who are looking to invest in a cryptocurrency that has the potential for high returns. The tokens fun and playful nature makes it appealing to those who are not necessarily interested in the more serious aspects of traditional cryptocurrencies. Related Links: Telegram: https://t.me/+efZpJvv7Y9thODhh… Discord: https://discord.gg/Xkk545eC Website: https://plums.wtf/","links":"https://plums.wtf/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/plums/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x666cbfaa3baa2faccfac8854fea1e5db140fb104"}}}