{"name":"CLever","id":"clever-token","symbol":"clev","description":"1. What is CLever? CLever gives CVX holders a continuous, automated way to harvest bribes and rewards AND allows users to claim their future bribes and rewards today. 2. Why use CLever? ● Automate the process of earning yield with CVX: locking, voting, collecting bribes, even re-locking in Convex as needed! ● Claim your future yields today! You can even swap them to CVX and re-deposit them to earn even more yields. ● Your future yield “loan” is non liquidating, low risk, and has certainty in funding costs 3. How does it work? Users lock their CVX and can immediately claim 50% of their future yields as clevCVX, for zero cost. Users can swap clevCVX for CVX using either the Curve liquidity pool or the clevCVX Furnace. For users that want to create leverage, they may re-deposit their CVX to claim and swap even more, looping as much as they wish to a maximum of ~2X their initial CVX deposit. All CVX locked with CLever will itself be vote-locked with Convex and used to vote for maximum bribe income, with all bribes swapped to CVX and claimable as more clevCVX. 4. What is CLever Token(CLEV)? CLEV will be a CVX producing #RealYield machine — vote-locked CLEV tokens will earn at least 75% of the CLever platform’s fee revenue (the rest goes to the treasury for growth & opex, final % TBA) and they will also boost your yield in the clevCVX-CVX LP. These LP rewards will create a powerful incentive for users to deposit their CVX into the liquidity pool, which in turn will enable instant swapping from clevCVX to CVX and thus allow future-yield-claimoors to take leverage! LPs earn yields on their fully liquid CVX and borrowers lever up their bribe income.","links":"https://clever.aladdin.club/","market_cap":2029071,"market_cap_rank":3243,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/clever-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x72953a5c32413614d24c29c84a66ae4b59581bbf"}}}