{"name":"Eclipse Fi","id":"eclipse-fi_arbitrum-one","symbol":"eclip","description":"What is the project about? Eclipse Fi connects you with top-tier projects building in the Cosmos and up-and-coming EVM blockchain ecosystems. Our extensive network of quality accelerators, incubators, curators and builders brings you the best startups on the market. Our platform provides builders with the tools they need to launch their innovative projects with active and long-term audiences. Our tools enable lockdrops, airdrops, liquidity bootstrapping, auctions, IDO and more. What makes your project unique? We care about our community’s privacy and are the first zero-knowledge KYC project in the world thanks to our partnership with zkMe. We believe that technical experience should not be a barrier for participation in Web3. We’re partnering with innovative wallet providers that provide seamless participation across blockchains without hurdles, empowering a whole new audience to join Web3. History of your project. We have been building since early 2022 and initially targeted the Luna ecosystem however have since partnered with Binance Labs-backed Neutron blockchain to launch the best projects within the Neutron, Cosmos, and emerging EVM L2 ecosystems. What’s next for your project? Beyond our token launch we will continue to attract and curate the best projects and provide them with the tools they need to build their initial user base. What can your token be used for? ECLIP token can be staked to receive Cosmic Essence which grants increased access and allocation in launches. Stake ECLIP to increase lockdrop and LBA vault deposit caps and earlier access to certain launch module whitelists. We intend ECLIP to be used for DAO Governance and community governance for token launches.","links":"https://eclipsefi.io/","market_cap":33509,"market_cap_rank":8830,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/eclipse-fi/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":6,"contract_address":"0x93ca0d85837ff83158cd14d65b169cdb223b1921","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x93ca0d85837ff83158cd14d65b169cdb223b1921"}},"is_native":false}