{"name":"So Cal","id":"so-cal","symbol":"sct","description":"Harnessing the allure and attraction of the exciting Southern CA coastal lifestyle. SO CAL Token ($SCT) serves as a utility token for SCT SURF; a 90’s retro (16 BIT) P2E surfing game Developed on the Binance Smart Chain. Utilizing the Unity Gaming Engine, SCT SURF will offer a unique and nostalgic P2E gaming experience to be played seamlessly on PC, Android or IOS devices. Users will be able to earn $SCT tokens while navigating through various wave breaks, characters and game modes. $SCT’s eye popping custom pre-minted NFT collections, only available on the SCT proprietary DAPP/ Marketplace, offers holders exclusive utility enabling access to special surfboards, skins and endless competitions. $SCT offers 5% rewards in USDT for all holders and dual rewards for those participating in $SCT’s innovative staking program. In addition, the SO CAL Token ecosystem provides weekly Yoga, Sound bath and Crypto education classes taught by licensed professionals. $SCT will also dedicate a 1% sell tax to rejuvenate our coastlines and marine life both locally and abroad. The pinnacle of $SCT will be the Cali-verse; a fully functional world with infinite possibilities that will act as the extreme sports entertainment hub for the Meta-verse. Whether you’re at the Skatepark, ride the coastal waves, snowboarding mountain, or BMX track the Cali-verse will offer fun and invigorating P2E portals into these experiences. The Cali-verse will also afford holders the opportunity to own real estate and operate their prospective businesses in an entertaining communal atmosphere everyone can enjoy. SO CAL TOKEN ($SCT) HIGHLIGHTS • P2E Surfing Game (SCT Surf) • 90’s Retro (16 Bit) • Proprietary DAPP/ Marketplace • Custom Utility NFT’s (1st edition Neon Cali-Kongs) • Innovative staking program • Ecosystem: yoga classes, sound bath and crypto education classes • Charity Beach clean-ups • Cali-verse • Extreme sports games","links":"https://www.socaltoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/so-cal/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x79d8c48da6e3ec769a4d2097a961a9b7f00830be"}}}