{"name":"ITSMYNE","id":"itsmyne","symbol":"myne","description":"Launched by a team of second-time entrepreneurs based in India and Kazakhstan, ITSMYNE is a multi-chain social-plus marketplace for officially-licensed sports NFTs. Read our POV on why the world needs another NFT marketplace: https://itsmyne.medium.com/why-the-world-needs-another-nft-marketplace-94dbe9dceb54 Built as a Web 2.0 product, ITSMYNE is easy to use for both crypto native as well as non-crypto-native users due to integrated custodial wallet as well as the flexibility to pay in fiat or crypto. Pre-requisite knowledge on how to mint, price, and market digital collectibles (NFTs), as well as concerns around the non-eco-sustainable nature of NFTs, are limiting factors for the adoption of NFTs in the supply-side community in sports. We envision eventually expanding this to the world of cinema as well. Similarly, concerns around the origination source of collectibles, the requirement to pay in crypto-currencies or platform-native tokens, and the nature of platforms as being “unfriendly” toward non-crypto-native retail users, are roadblocks in the adoption of NFTs on the demand side community. ITSMYNE is a centralized platform wherein retail users who possess or lack previous crypto experience can buy officially licensed digital collectibles directly from athletes, sports teams, movie stars, and production studios. Unlike other platforms in this space, ITSMYNE is not merely a transactional marketplace, but rather a Reddit-like community where curated fans (of cinema & sports) discuss their favorite topics, engage in social interaction, and buy & trade officially licensed digital collectibles (NFTs) relevant to those topics. Approximately 20% of MYNE were sold in seed, private, and public sale rounds, 17% went to the project’s founders, and the balance for ecosystem development, IP rights licensing, liquidity, staking, and other business functions.","links":"https://www.itsmyne.club/myne","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/itsmyne/logo.png"}