{"name":"ART CAN DIE","id":"art-can-die","symbol":"die","description":"What is the project about? ART CAN DIE is a community-led production company transforming the creation and experience of art. The ecosystem empowers artists and connects them with collectors and art lovers. Together, they produce physical and digital art, and curate exhibitions and in-person (IRL) events. What makes your project unique? ACD curates a catalog of physical and digital art from both emerging and established artists. The decentralized platform will allow members to collaborate, buy, and sell art without intermediaries, resulting in reduced fees and increased accessibility. Fractional ownership of artworks through NFTs also allows investors to own and trade smaller portions of high-value art, making the market more accessible and liquid. History of your project. ACD achieved a $700,000 ICO and reached 116.5% during its IEO on BitForex, gathered thousands of members, hosted exhibitions in Bangkok and New York, produced and sold the works of international artists, organized an expedition to Mount Everest to raise awareness of the environmental issues. What’s next for your project? ACD democratizes the art market and provides opportunities for artists and investors alike by onboarding new artists and growing its community. The ARTWORLD platform will allow members to connect with like-minded people, to vote and to browse the platform’s curated collections, including styles and genres from worldwide artists. The art curation will also be exhibited in both physical and virtual worlds. What can your token be used for? The DIE token is a utility tool to access and govern the ecosystem. Holders vote on proposals that shape the platform’s development, from choosing which artists to support, to setting platform fees, and discussing future initiatives. They enjoy other benefits, including access to the secondary market (DeFi), the metaverse, exhibitions and events, direct contact with artists, participation in a staking program, and receiving rewards.","links":"https://www.artcandie.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/art-can-die/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd1e007d66470d3f775f1d4de52ed158fcc3b7189"}}}