{"name":"Huebel Bolt","id":"huebel-bolt","symbol":"bolt","description":"What is the project about? BOLT ecosystem — next gen meme network developed by TON community & meant to unite all jettons and existing meme tokens. What makes your project unique? BOLT meme token is based on the TON blockchain and was founded by the international crypto community of enthusiasts supporting the development of TON - the brainchild of Nikolai Durov and Telegram as a whole. History of your project. Huebel Bolt, initiated in spring 2022, rapidly gained momentum by developing multiple Telegram channels and attracting a significant audience. As the token’s influence grew, it evolved to support other TON crypto enthusiasts, beginning in fall 2022. Continuously building on the blockchain, Huebel Bolt remains an active force, fostering the community of independent crypto enthusiasts and symbolizing innovation and collaboration within the space. What’s next for your project? At Huebel Bolt, our commitment to innovation never wanes. We are constantly striving to develop new tools that the TON community can significantly benefit from. Our ongoing support for TON enthusiasts drives us to build more public tools for the blockchain, fostering growth and expansion. The future for Huebel Bolt is rooted in collaboration, technological advancement, and a relentless dedication to enriching the blockchain community. What can your token be used for? Huebel Bolt token encompasses a versatile range of applications. It serves as a community way of payment for services, enabling seamless transactions. Additionally, it can be utilized as a means to donate to creators, fostering a spirit of support and recognition. As the first meme token of its kind on our current blockchain, it carries a unique appeal. Moreover, Huebel Bolt can be held as an asset, amplifying its value. The diverse nature of this token ensures that for each user, there exists a personalized application, making it a distinctive and valuable component of our blockchain ecosystem.","links":"https://huebel.art","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/huebel-bolt/logo.png","detail_platform":{"the-open-network":{"decimal_place":9,"contract_address":"EQD0vdSA_NedR9uvbgN9EikRX-suesDxGeFg69XQMavfLqIw"}}}