{"name":"SOLA-X","id":"sola-x","symbol":"sax","description":"SOLA-X | Smart liquidity cross-chain protocol built on Solana. SOLA-X is changing the way AMMs are designed within the Solana ecosystem. SOLA-X has developed flexible and dynamic liquidity pools that enable multiple assets within a pool or features such as unilateral liquidity provisioning, intra-platform liquidity aggregation, and intelligent liquidity management. Furthermore, SOLA-X connects Solana to the most popular EVM ecosystems such as Ethereum, Binance Chain, and Polygon. Which pain point does SOLA-X solve? Providing liquidity to multiple liquidity pools and monitoring them as well as rebalancing liquidity allocations in a way to maximize the APY and reduce downside risks like impermanent loss is a difficult task. SOLA-X solves these pain points liquidity providers are facing using traditional AMMs like Uniswap. Due to SOLA-X’s AMM architecture and protocol-managed liquidity, a liquidity provider does not have to monitor and rebalance single liquidity pool allocations. Within SOLA-X, a feature called smart liquidity manages the liquidity in a way that single pool risks are minimized and the realized APY is the highest possible. A user only has to deposit one single asset in order to provide liquidity to multiple pools. Facts 🔸7,000 + people community 🔸Platform launch in November 30. 🔸TGE in Q1 2023 Partners 🔸Frankfurt School of Finance and Management (strategic partnership) 🔸Solana Prime (advisory & launchpad) 🔸GEM Digital (funding) 🔸vt3 Ventures (funding) 🔸Lithium (launchpad) 🔸consola finance (swap integration) 🔸Handelsblatt (Innovation award winner 2022) Team We are an anonymous, but very experienced team. Our track record: 🔸Ex-CEO of an $80 million valuation crypto startup 🔸Built DeFi protocols with over $1.8 billion TVL 🔸Exit on the Stuttgart Stock Exchange 🔸Advised over 20 different crypto projects 🔸Co-created an IDO launchpad ($35 million token valuation) 🔸Extensive network with over 14k followers on LinkedIn","links":"https://solax.so","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sola-x/logo.png"}