{"name":"MeromAI","id":"meromai","symbol":"aimr","description":"Overview Meromai is a human-powered AI platform based on Open Source models, running on a globally distributed network. Participants receive points for submitting prompts, curating responses, and providing computing power. Points can be converted to $AIMR tokens. The resulting AI models will be included in apps to help people work, shop, play and interact with the world. Background ChatGPT changed the world of AI in the fall of 2022. AI quickly became dominated by large corporations running closed, costly, and proprietary infrastructure. In early 2023, we formed Meromai to become a decentralized alternative to the corporate dominance of AI. During Epoch I, which began in June 2023, the Meromai team designed and built a vertically integrated, decentralized, human-powered Open Source AI platform. The team then pioneered Human-Powered AI, crowdsourcing the curation of Open Source AI data sets for applications across a broad range of topics, with thousands of participants. This was the first major step in MeromAI’s mission to democratize AI networks away from large corporations and into the hands of the global community. Tokenomics The $AIMR utility token, with a max total supply of 1 Billion, is designed to incentivize participation in the MeromAI decentralized AI platform. The $AIMR token is now available. There was no pre-mining, no private token sale, no KOL round, and no ICO. The initial liquidity of 100 Million $AIMR was evenly split between the Ethereum and Base blockchain networks with a low Fully Diluted Value (FDV) of $800,000 to facilitate a fair launch. This approach was used to combat low float / high FDV launches that have removed the opportunity of price discovery for the community, leading to skewed and unfair distribution. For the $AIMR token, we believe our approach was another crucial step towards becoming the largest community-owned, decentralized AI stack based on Open Source in the world.","links":"https://merom.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meromai/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcfd16933cb1579eee9fe6031686534e87353b148"},"base":{"decimal_place":18,"contract_address":"0x741777f6b6d8145041f73a0bddd35ae81f55a40f"}}}