{"name":"PRNT","id":"prnt_solana","symbol":"prnt","description":"What is the project about? Our project, $PRNT, is all about creating a currency that offers the opportunity to be part of a fun, and continually growing community, but backed by serious tools, and a serious team, offering longevity and sustainability, in an ecosystem and time, where that is rare. What makes your project unique? We are backed by a team that built our showcase product, Boost. This product is unique in the sense that it allows our holders to literally print, $PRNT. Holders of our token, can use Boost to increase their $PRNT earnings by 1) Being active in the Discord server 2) Duelling against each other, wagering $PRNT. 3) Burning rugged NFTs, to earn $PRNT 4) Twitter engagement. We are also unique in the sense that we built these tools before the coin actually released publicly, we have a background in Web3, and specifically Solana NFTs, and wanted to bring that to this space. History of your project. We went live with our presale on 9th May, with three phases. Phase 1 sold out in 20 minutes, Phase 2 in 7 minutes, and Phase 3 in 4 minutes. We listed publicly on 10th May on Raydium, and have since (less than 24 hours at the time of writing) accrued $440k trading volume, and reached the number 1 spot for trending Solana coins on the DEX, Birdeye multiple times. What’s next for your project? Our next focus is strategic partnerships, CEX listings (hopefully with yourselves), and building upon Boost. We have secured 3 high-level strategic partnerships with well known Solana NFT projects, to add our coin to games, farms, and Twitter engagement platforms, and are currently working on securing 4 more. For Boost, we allowed holders of our coin to mint an NFT (for free), and use that NFT to stake as their profile picture, for more $PRNT. What can your token be used for? Predominantly noted above, but TLDR - minting NFTs, playing online games, Boosting earnings, purchasing our SaaS - Boost and a purchasing merchandise.","links":"https://prnt.gg/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/prnt/logo.png","detail_platform":{"solana":{"decimal_place":7,"contract_address":"4TUNzcgp2fPD48fcW4seRjyqyDZMrPj4ZubnXFEsKeYk","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/4TUNzcgp2fPD48fcW4seRjyqyDZMrPj4ZubnXFEsKeYk"}},"is_native":false}