{"name":"Sperax","id":"sperax","symbol":"spa","description":"Sperax is redefining financial autonomy through programmable agents that manage capital, optimize yield, and protect against risk, all transparently on-chain. Founded in 2019, Sperax is backed by leading investors including Jump Trading, Polychain Capital, Amber Group. Sperax offers a new standard in automated, user-driven finance. The SperaxOS ecosystem is powered by USDs and SPA on Arbitrum, BNB Chain, and other EVM networks. Anchored by two native assets: USDs, a gas-free, auto-yield stablecoin backed by on-chain collateral, and SPA, the governance and value-capture token. Sperax builds open-source tools that turn idle capital into self-optimizing portfolios. SperaxOS is a cross-chain financial operating system where AI-driven smart agents automate everything from yield farming to payroll, and Demeter, a no-code platform for launching liquidity farms. USDs automatically rebases yield to holders, while SPA lets users register agents, earn protocol fees, and vote on upgrades. Battle-tested through multiple market cycles: Sperax offers individuals, DAOs, and fintechs a borderless toolkit for passive income, risk-managed investing, and fully automated treasury operations, all governed on-chain by its community.","links":"https://sperax.io/","market_cap":23917926,"market_cap_rank":1232,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sperax/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x5575552988a3a80504bbaeb1311674fcfd40ad4b","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x5575552988a3a80504bbaeb1311674fcfd40ad4b"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1a9fd6ec3144da3dd6ea13ec1c25c58423a379b1","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x1a9fd6ec3144da3dd6ea13ec1c25c58423a379b1"},"ethereum":{"decimal_place":18,"contract_address":"0xb4a3b0faf0ab53df58001804dda5bfc6a3d59008","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xb4a3b0faf0ab53df58001804dda5bfc6a3d59008"}}}