{"name":"Doran","id":"play-to-create","symbol":"drn","description":"Play To Create is an emerging company focusing on blockchain and encryption technology. Its main business covers Gamefi, cryptocurrency, NFTs, BaaS platform and other fields. Project team is committed to promoting the innovation and application of blockchain technology, providing customers with safe, efficient and high-quality solutions, providing users with rich, interesting and valuable service experience, and building a more open and transparent decentralized digital Economic ecosystem, opening social metaverse, creating a new era of digital. Shanhai is the game that produced by Play To Create company. It's the first 3D fantasy martial arts massively multiplayer online role-playing mobile game (MMORPG) based on blockchain technology, which combines traditional classic culture and future fantasy elements, and has multiple competitive modes such as single-player dungeons and guild battles. Doran (DRN) is the play-to-earn token of Shanhai Web3 Game. The supply of DRN is fixed at the beginning of the game, and each token is minted when players complete specific tasks in the game. It may be generated as a reward in personal dungeons, multiplayer dungeons(raid content), completing main and side quests, and winning PvE battles. The number of DRN generated per week is limited, and DRN must be used when performing specific tasks. The supply and demand of DRN varies with the number of active users, and we closely monitor the game economy to keep DRN in a healthy balance. DRN can be listed on centralized and decentralized exchanges and freely traded among players.","links":"https://umcrypto.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/play-to-create/logo.png","detail_platform":{"clover":{"decimal_place":18,"contract_address":"0xc09327a5976bfe6263078f3f67de39f3dab88205","geckoterminal_url":"https://www.geckoterminal.com/clover-finance/tokens/0xc09327a5976bfe6263078f3f67de39f3dab88205"}}}