{"name":"sKLAY","id":"sklay","symbol":"sklay","description":"sKLAY is an ownership and liquidity token that is given through smart contracts for KLAY staked through KLAYstation, KLAY’s official staking tool, and can remedy liquidity limitations to grow Klaytn’s Decentralized Finance (DeFi) ecosystem. As a liquidity token that is based on the value of staked KLAY, sKLAY not only injects direct liquidity to the current Klaytn ecosystem, but also allows the holders of sKLAY to utilize their assets for a variety of revenue opportunities offered by Klaytn’s DeFi protocols while maintaining a staking position. At its core, sKLAY is a token that gives KLAY owners staking through KLAYSTATION the power to exercise rights over their staked assets. The reward that nodes receive after verifying blocks will be shared proportionally based on the amount of sKLAY held. Unstaking will also be based on sKLAY. sKLAY adheres to the KCT (Klaytn Compatible Token) standard, making transactions possible. This increases efficiency of assets by allowing withdrawals at any time without having to go through KLAY’s unstaking period (7 days). Note that while sKLAY acquired through delegating essentially has the same value as corresponding KLAY, sKLAY acquired through staking KLAY may have a different price at time of trading. This is due to the presence of a time-difference discount rate applied to the supply and demand of the market and the increase in conversion rate due to staking compensation. Considering KLAY’s value and volatility, sKLAY is a standout, reliable source of liquidity in the Klaytn network in terms of asset value. It particularly is of immense value to users who have been staking KLAY. With sKLAY, these users can take advantage of a variety of investment opportunities offered by DeFi services by additional asset input or liquidation of staked assets.","links":"https://klaystation.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sklay/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0xa323d7386b671e8799dca3582d6658fdcdcd940a"}}}