{"name":"Hydranet","id":"hydranet","symbol":"hdn","description":"What is Hydranet (HDN)? Hydranet is a Decentralized Autonomous Organization building the Hydranet DEX, a Layer 3 trading platform that brings together the worlds of Bitcoin and Ethereum using Layer 2 off-chain protocols such as the Lightning Network and the Connext Vector Network. Hydranet’s novel exchange technology allows users to trade seamlessly between Bitcoin and EVM-based blockchains without relinquishing custody of their funds, with near instant settlement times, and for low costs. The Hydranet DEX includes a limit order book, which is hosted by the Hydranet Network, and a built-in multi-currency light wallet that allows users to store both BTC and EVM-based assets. Trades on the Hydranet DEX are executed off-chain, fully peer-to-peer, and are secured using hashed timelock contracts meaning either both peers or no peer receives the agreed upon funds. Since Layer 2 off-chain protocols are scaling solutions for Layer 1 blockchains, users will always remain in full custody of their private keys. Hydranet released the first version of the Hydranet DEX on the 23rd of September 2023. This version is delivered as a downloadable desktop client and offers a user-friendly interface, seamless trading experience, and robust security features. Hydranet is actively working on an upgraded version of their DEX, a platform agnostic web version which will be readily available from the browser. The web version will inherit all the commendable components of its desktop counterpart as well as Hydranet’s in-house EVM off-chain protocol, Lithium. What powers the Hydranet DEX? The Hydranet DEX is powered by the Hydranet Network, an infrastructure overseen by two distinct actors: TItans and Guardians. Titans take on the responsibility of ensuring the network’s continuous operation. They achieve this by hosting the exchange’s limit order book, offering rental liquidity, and acting as a matchmaking engine between trading peers. Guardians, on the other hand, take on the responsibility of upholding the network’s integrity. They actively monitor the behavior of both traders and Titans to ensure that they comply with the network’s rules, and take appropriate measures to penalize those who violate these rules. Both Titans and Guardians require a collateral in the form of HDN to participate in their respective roles. In return for their services, they become eligible to receive a share of the trading fees generated by the Hydranet DEX. What makes Hydranet Unique? Hydranet effectively addresses the critical challenges associated with self-custody, transaction times, transaction costs, and scalability. When it comes to decentralized trading directly on the blockchain, using Automated Market Makers (AMMs) is a popular choice for trustless trading. However, it often comes with the drawback of high blockchain fees and prolonged transaction times due to the scalability limitations of many blockchain networks. As an alternative, traders can opt for centralized exchanges, which often offer user-friendly interfaces, fast transaction times and low trading fees. The convenience they provide, unfortunately, comes at the cost of relinquishing custody of user funds and leaving them entirely in the hands of the centralized exchanges to do whatever they want with. This issue has been exemplified by the FTX incident, which is reported to have negatively impacted over 1 million crypto users. Unlike today’s centralized and decentralized exchanges, the Hydranet DEX offers a unique solution to the challenges previously presented. First and foremost, the Hydranet DEX operates on a trustless basis, meaning users always retain control of their funds, eliminating the risks associated with third-parties. Moreover, the Hydranet DEX leverages off-chain technologies to enhance transaction times and reduce costs significantly. By keeping the transaction process off the main blockchains, trades are executed near-instantly and for minimal fees, even cross-chain, in contrast to the high fees and slow transaction times experienced using many decentralized exchanges operating directly on the blockchain. Lastly, when it comes to scalability, the Hydranet DEX is designed to scale indefinitely. A key element for this is Hydranet’s decentralized execution of trades. Unlike conventional solutions, where a centralized entity typically executes the trade, in the Hydranet DEX, the trade execution is distributed among the trading peers themselves. The Hydranet Network assists in matching trading peers but leaves the rest in the hands of the peers to automatically execute the trade without user intervention.","links":"https://hydranet.ai/","market_cap":6394045,"market_cap_rank":1685,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hydranet/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x3404149e9ee6f17fb41db1ce593ee48fbdcd9506"}}}