{"name":"Lean Management Token","id":"lean-management-token","symbol":"lean","description":"Lean Management Token (LEAN) builds a space for a distributed community of several millions of professionals in the field of management. They are able to exchange their experiences and improve qualifications through the presence on Lean Global Community platform for the exchange of knowledge and contacts. The Lean Community platform is closely connected with the Lean Global Marketplace, where users can provide original training, webinars, commissioned research, and products such as software, books or industrial solutions for a fee of $LEAN. The team of Lean Management Token developers will make available services related to development within the Lean Global Marketplace, also in Virtual Reality technology (Lean VR), which will revolutionize the implementation processes in workplaces, where at least tens of millions of people are employed. In the created Lean Community, $LEAN will be used as a currency and also accepted as a way of payment, utilized for fundraising or for voting in the community (C2C function). Nevertheless, $LEAN is also used outside of the Lean Community, on the Lean Global Marketplace, as a payment currency for services and products focused on development. Finally, the $LEAN Token will be used by companies as currency for services, software or products (B2B). The Lean Ecosystem will build a comprehensive work environment for people (Lean Community) and companies operating in the area of Management, Education and Development. Lean Community is a global space to share knowledge for people who care about self-development and professional services for business in Virtual Reality and Blockchain. The Lean Management Token is developing a business strategy based on the Utility-Buybacks-Burning model. The UBB model is focused on the continuous increase in the number of channels and methods of using cryptocurrencies (Utility), the redemption of tokens from the market from the revenues generated by business projects (Buybacks), and the continuous reductio","links":"https://leantoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lean-management-token/logo.png"}