{"name":"Hepton","id":"hepton","symbol":"hte","description":"What is Hepton (HTE)? Hepton is a Layer-3 infrastructure project that offers a hyper-scale solution for the Ethereum network. Hepton provides two different scaling solutions which are Hepton PoS (sidechain to Ethereum) and Layer-3 network-based ZK-Rollup technology on top of Arbitrum Orbit (Nitro Stack). HTE is the native utility token that is used for: Gas-Fees for processing transactions and storing data on Hepton PoS. Running validator nodes on the sidechain (Hepton PoS) via staking HTE tokens. Used for governance votes on Layer-3 (Hepton STANDRA) to determine how network resources are allocated. Hepton tools include: Hepton PoS - A PoS Sidechain on top of Ethereum and connected through a two-way pegged model. Hepton ZK-Standra - A Layer-3 based on ZK-Rollup technology on top of Arbitrum Orbit. Who Are the Founders of Hepton? Hepton was founded by Hepton Labs where it was led by Kay Hakimie, Emre Aslan, and Ismail Abinting. Three of them, have extensive experience in programming, entrepreneurship, and financial analysis. The three met while they were just a freelance developers inside the Open-Source Centralized Exchange forum known as Peatio in the middle of 2020. From that time, the three of them already create a developer organisation for any client who wants to hire additional developers for tweak on their Web3 project. In early 2022, the three of them decided to build a decentralized protocol and at the same time bring scaling solutions for Ethereum network. This team became what is now the Hepton Labs, and employs more than 10 developers, including developers across multiple experience and working remotely across different region. Hepton Labs has been incubated by Malaysian Digital Economy Corporation (MDEC) (A Malaysian Government Agency) in 2022 and IceTea Labs, a Web3 startup incubator. Based on this incubation, Hepton Labs has been nominated a Server Grant by Amazon AWS Activate to support the Hepton PoS at its early stage.","links":"https://www.hepton.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hepton/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x80dd74145b8bb10cef01bf914f796bd8b54d7809"}}}