{"name":"MaruTaro","id":"marutaro","symbol":"maru","description":"What is the project about? MaruTaro is a unique utility token on the ETH chain. It has a total supply of 1 Billion and is listed on Dex-Trade exchange already. MaruTaro is aiming to bring about a change through its choice of name and logo. Whilst paying homage to the massive ETH community and the coin which is endorsed by it, we believe in the potential of this project to do well. What makes your project unique? The unique utilities we aim to bring to this project and holders includes: -Play2Earn game - Staking - NFTs - Chain - Wallet - Listing site - Launchpad History of your project. MaruTaro was luanched on the 18th of February and since then has gained traction and a lot of interest in the ethereum blockchain community What’s next for your project? These utilities we bring to the project will be accompanied by viral marketing to ensure the growth and awareness of the project. We are aiming to market this globally and bring in investors to play our play2earn game which will comprise of burning and buyback functions within it. Currently the NFTs are being made which will be used for the game as well so that the ecosystem for MaruTaro is fully functional. What can your token be used for? The token can be used a main currency on the chain, launchpad and other utilities. Furthermore, our vision is to inherently create a project which comprises of virality and humour to ensure that the community will stay interested. We will ensure we market this project such that it brings an atmosphere of joy within all investors. More information will continue to be provided as we reach certain milestones of the project and utilise the budget to further our utilities.","links":"http://MaruTaro.dog","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/marutaro/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xc2456d2118299a2efdfe6522ff79aa48fc5d2b00"}}}