{"name":"FINE","id":"fine","symbol":"fine","description":"“This Is Fine” is unique as a meme for two reasons. One, while sometimes modified, it’s most commonly used in an unaltered state. Second, it’s still popular and used, despite now being nearly nine years old. $Fine is a both a meme and culture coin, meaning it is heavily focused on the use of memes and community engagement. You can get involved with $Fine by purchasing tokens on Uniswap, participating in community discussions on Telegram, Twitter or medium, and spreading the word about $Fine through memes. You can sell your $fine tokens on Uniswap, but the project encourages holding onto them and participating in the community to drive the price up. Longevity and Unaltered State: One of the distinctive aspects of the $Fine token is its association with the \"This Is Fine\" meme. Unlike other memes that often undergo modifications or alterations over time, the $Fine meme is primarily used in its original, unaltered state. This contributes to its enduring popularity and recognition. Enduring Popularity: Remarkably, despite being almost a decade old, the \"This Is Fine\" meme remains popular and widely used. This enduring popularity serves as a testament to its cultural significance and the impact it has had on internet culture. Meme and Culture Coin: $Fine transcends the traditional notion of a cryptocurrency and is categorized as a \"meme and culture coin.\" This designation indicates a strong emphasis on leveraging memes and fostering community engagement as integral components of the project's identity and development.","links":"https://finecoineth.com","market_cap":763265,"market_cap_rank":4565,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fine/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x75c97384ca209f915381755c582ec0e2ce88c1ba","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x75c97384ca209f915381755c582ec0e2ce88c1ba"}}}