{"name":"Bear Scrub Money","id":"bear-scrub-money","symbol":"bear","description":"What is the project about? Scrub Money is a decentralized cross-chain ecosystem driven by the vision to unite seamlessly commerce, trading, betting and gaming. Along with 3 unique NFT Collections and a NFT marketplace, the protocol empowers users by allowing them to purchase goods and services in real life using their funds on chain. Since our migration to Kava Network, we released 3 NFT collections (all sold out) and several protocols with real utilities: - Lion Commerce - commerce.scrub.invest Our store runs cross-chain (Kava, Cronos, Poligon) and empowers users to purchase real-life goods and services with their funds on chain. Giftcards for Amazon, Airbnb, UbearEats and other major brands are available, often at a discount. - Scrub Invest - invest.scrub.money Simply the best Yield Optimizer on Kava, it offers automated farming strategies leveraging other protocols and provides competitive APR due to the autocompound feature. The first vaults leverage Mare Finance and offers the best APR on Kava for stablecoins. - KavaFC - kavafc.bet Our Betting Exchange Dapp, allowing users to bet on all major sport events in a decentralized way. This is not a sports book, users can create and list their own odds for the matches, and the system trustlessly match and pay out the matched bets. It runs completely on-chain, without KYC or account required. We just migrated our liquidity pools on Equilibre - https://equilibrefinance.com/ - BEAR was not listed on CoinGecko because Elk Finance on Kava didn't have suitable endpoints for tracking. As we are gaining momentum on Kava (https://twitter.com/KAVA_CHAIN/status/1649533528109981696?s=20) please help us, listing BEAR. It really means a lot, thanks.","links":"https://scrub.money","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bear-scrub-money/logo.png","detail_platform":{"kava":{"decimal_place":18,"contract_address":"0x38481fdc1af61e6e72e0ff46f069315a59779c65"}}}