{"name":"Mitellor","id":"iteller","symbol":"itlr","description":"What is the project about? iTeller project is aimed at transforming the financial landscape by providing an alternative to traditional financial institutions for sending and receiving money. It involves deploying ATMs all across the world, through which customers can remit funds to any country and exchange crypto with fiat money in real-time. The goal is to eliminate people's reliance on banks and other traditional financial institutions to send and receive money. The project also includes the creation of the iTeller Token, a decentralized open-source digital currency that can be used to pay for overseas payments with fewer charges. What makes your project unique? There are a few factors that make iTeller unique compared to other cryptocurrencies and financial services: Instant Transactions: All transactions via iTeller, such as deposits, withdrawals, purchases, sales, and transfers, are confirmed in 10 seconds. Secure: iTeller's state-of-the-art operational structure is relatively more secure than all other cryptocurrencies and is audited under a Certik license. Furthermore, it is safe for the user and has a large storage capacity. Users have complete control over their funds. User-Friendly: iTeller is designed to be user-friendly, with a wallet that is cross-platform compatible on PC, MAC, and a mobile phone application. Low Fees: Transactions made via iTeller wallet will come at no fees. History of your project. we have started working on iTeller in 2020 What’s next for your project? iTeller continues to focus on making its cryptocurrency more accessible to the general public and expanding its ATM network to allow for easy conversion of crypto to fiat currency and transferring it What can your token be used for? iTeller tokens can be used to pay for services within the iTeller platform. Users can earn iTeller tokens as rewards for performing certain actions on the iTeller platform and people can use it in trading, staking and DeFi DApps","links":"https://iTeller.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/iteller/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7646cbf726b39a5417834aec7fc4d57428111a00"}}}