{"name":"Mirai The WhiteRabbit","id":"mirai-the-whiterabbit_ethereum","symbol":"mirai","description":"Mirai the White Rabbit is a captivating lifestyle brand that embodies the essence of curiosity, creativity, and a touch of magic. Our brand is inspired by the idea that everyday life can be extraordinary, and we strive to bring a sense of wonder and enchantment to our customers' lives. At Mirai, we believe that imagination is the key to unlocking a world of possibilities. We draw inspiration from the curious and creative minds of our audience, crafting unique products and experiences that spark joy and wonder. Our brand is built on the principles of imagination, creativity, and a deep understanding of our customers' needs and desires. Our products are designed to be more than just functional items; they are gateways to new worlds and experiences. From beautifully crafted home decor to imaginative accessories, each product is infused with a sense of magic and wonder. Our designs are modern, yet timeless, and are crafted with the finest materials to ensure that they bring joy and delight to our customers' lives. At Mirai, we believe that experiences are just as important as products. That's why we create immersive experiences that transport our customers to new and exciting worlds. From workshops and classes to events and exhibitions, our experiences are designed to inspire creativity, spark imagination, and foster a sense of community among our customers. Storytelling is at the heart of our brand. We use narrative techniques to bring our products and experiences to life, creating a sense of enchantment and wonder. Our stories are woven into every aspect of our brand, from the design of our products to the experiences we create. We believe that stories have the power to transport us, to inspire us, and to connect us with others. At Mirai, we are building a community of like-minded individuals who share our passion for imagination, creativity, and wonder. Our community is a place where people can come together to share ideas, inspire each other, and explore new possibilities. We believe that together, we can create a world that is more magical, more creative, and more wonderful. If you're ready to embark on a journey through imagination, where the ordinary becomes extraordinary, then join us at Mirai the White Rabbit. Follow us on social media, sign up for our newsletter, and get ready to be transported to a world of wonder and enchantment. Let's create magic together!","links":"http://miraioneth.xyz/","market_cap":19682.44,"market_cap_rank":9816,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mirai-the-whiterabbit_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x81987681443c156f881b70875724cc78b08ada26","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x81987681443c156f881b70875724cc78b08ada26"}},"is_native":false}