{"name":"Art de Finance","id":"art-de-finance","symbol":"adf","description":"[What is the project about?] Art de Finance is a Web 3.0 Art Platform for Digital Arts/NFT & Physical Arts. Art de Finance Provides NFT Marketplace, Blockchain Social Platform, NFT Proof of Authenticity, Art Storage for Physical Arts & Art Financing Service. [What makes your project unique?] ADF is not only an NFT marketplace but also establishing a web3.0 social curation project, physical art promotion & storage service. Each service has its characteristics to support artists and the NFT marketplace and contribute to liquidity. ADF Platform Contains 4 Specialized Platforms which Interconnected with Each Other. 1)ADF 'Main Platform' Provides DeFi-NFTFi, DAO & Governance. 2)Artiside is ADF’s Social Curation Platform. Artists can mint works through the platform, communicate with fans and form fandoms through the service. Artiside supports ‘Seeding’, a unique staking system that can connect emerging artists with the community. The potential value of the artist’s artwork and support it through expressing interest. Artists can reach a high number of Red Labels and gain more exposure as top artists, and they can distribute profits from the artwork sales to the community to actively utilize this feature. Artists can reach a high number of Red Labels and gain more exposure as top artists, and they can distribute profits from the artwork sales to the community to actively utilize this feature. 3) The Flux is ADF’s Marketplace. The Flux is a space for trading arts that have been properly registered, Users can sell or purchase the NFTs and the ownerships of underlying physical and digital arts. Owners can decide to list the items to sell at either a fixed price or at an auctioned price. In the auction system, the owner can set the duration for the auction and others cannot change. Starting price for the auction is 80 percent of the fixed price, which cannot change. Minimum bidding must be at least 5 percent greater than the previous price. On an occasion where the listed item is also being used as NFTFi, the relevant information should be provided to the potential buyers in an easily browsable manner. If default occurs and a subsequent liquidation process is initiated by the lending system, the control of sales is automatically transferred to the liquidation system. 4) Liview is ADF’s Live Streaming Service. Artists can build a Fandom & Communicate with fans in Artiside Community. Physical Galleries can Promote Emerging Artists through Liview Service. Fans can decide the details of Live Streaming content through DAO Governance. [History of your project.] Art de Finance AG was founded on 02 / 03 / 2022 in Zug, Switzerland. On 27-29 / 10 / 2022, Art de Finance participated in Blockchain Week Busan 2022, as an official NFT marketplace developer. Additionally, Art de Finance signed a partnership with the Art Hub Consortium Project at Incheon International Airport on 01 / 12 / 2022. on 25/04/2023, Art de Finance Released NFT Proof of Authenticity for Physical Arts. [What’s next for your project?] ADF Team is preparing for a live streaming platform for art fairs & exhibitions, art financing, NFTFi, Lending protocol based on art, and IRL art events. [What can your token be used for?] -Registration Fee -Seeding -Red Label -Platform Governance Voting -Live Streaming Voting -De-Fi Staking Reward -Limited Edition Events -Exclusive offline Exhibitions -Fee Discount -NFT Whitelisting","links":"https://www.artdefinance.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/art-de-finance/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x6bd10299f4f1d31b3489dc369ea958712d27c81b"}}}