{"name":"CORE MultiChain","id":"core","symbol":"cmcx","description":"CORE MultiChain (Cryptographic Object Resource Engine) is a PoS blockchain 3.0 framework focused on Interoperability, Scalability, and Usability and Privacy. CORE MultiChain provides advantages over existing and legacy blockchains such as sharding, simplistic blockchain creation and implementation, cross-chain capabilities, and high transaction throughput. CORE created a decentralized neighbor selection protocol that continuously strives to create optimal peer connections to decrease confirmation latency. The protocol achieves this through constantly analyzing and learning how nodes interact with their neighbors. How Does the CORE Protocol Attract People? •Lightweight •Compatible with the self-interests of each peer, or ability to select the best neighbors •Robust against adversarial actions: A CORE peer does not need all details about a candidate neighbor to decide whether to connect •Incentivizes peers to relay blocks promptly. •Naturally adaptive to varying hash-power Core Multi-Chain is the next generation of blockchain protocol designed to enable legacy, current, and future blockchains to scale and communicate seamlessly. CORE offers a wide variety of possibilities in the blockchain space due to its sharding, interoperability, and central algorithm. By providing a fair and secure platform, CORE allows users to regain control over their personal information. The project offers a scalable network featuring functionalities that bypass current blockchain limitations. CORE intends to provide an environment-friendly system that is sustainable, interoperable and provides enhanced throughput. Highlights •Network Efficiency – CORE contains an AI model at the core of its blockchain. This AI Model speeds up the network’s collective transaction processing times and also enables the network to operate under attacks or faults. •Security – The AI model helps coordinate the nodes on the network while also strengthening security on the CORE blockchain. This is accomplished through the network’s outlier detection protocol, which monitors for unusual behavior. The AI randomly selects nodes to test and gather data, monitoring network activity outside of the norm. In this phase, any corrupt nodes will be identified. •Transaction Privacy Protection Layer: CORE transaction privacy protection layer (TPPL) adds an extra layer of security and privacy when transacting on its blockchain. This universal layer is applied to every CORE-connected chain and can be applied to the major public blockchains. •Randomness – The CORE Multi-Chain network combines Verifiable Random Function (VRF) and Verifiable Delay Function (VDF) into a single hybrid solution, thus achieving true Randomness within the network. Randomness influences the difficulty in the mining function of PoW blockchains and periodically chooses the validators in a PoS blockchain. •Scalability – To address the scalability issue of Practical Byzantine Fault Tolerance, CORE enhanced the consensus mechanism by reducing the communication complexity within standard PBFT implementations to create the Accelerated Practical Byzantine Fault Tolerance (APBFT) consensus mechanism. Token Usage •Through the CMCX token, users can conduct transactions on the CORE blockchain and pay for all utility fees within the ecosystem. Platform users can use the token to participate in governance, stake, transactions, smart contracts, and reward validators. •Core’s mission is to serve the community. Users can vote for management and developer teams using the native token CORE (CMCX). The CORE community provides projects funding. Users will vote on any proposed changes to the blockchain or platform, creating a community-driven blockchain. •Through CORE, all blockchains, past and present, will be able to scale and communicate seamlessly with one another by utilizing the CMCX token. Multi-Layered framework design: CORE is constructed over three layers; ORIGO, CATENA & AURA. Each layer is designed perfectly to get the job done. ORIGO is the network layer. It is the brain of the system. It handles the formation of the blocks in the blockchain. CATENA is the blockchain layer and is built on the network layer. This is where the actual blocks form and newly formed blocks are appended. AURA is the application layer; this is where the DApps and smart contracts are built. Apeirogon blockchain framework CORE Blockchain combines all the latest frameworks and advanced programming languages into one cutting-edge solution to get more technical. It is built on our in-house Apeirogon blockchain framework, a next-generation framework for enterprise-grade blockchain innovation that is highly compatible with Solidity. Apeirogon is compiled to WebAssembly (Wasm), a super-performant virtual environment that provides a way to run code written in multiple languages on the web at near-native speed. Apeirogon’s ecosystem uses a state-of-the-art peer-to-peer network platform called LibP2P, a modular system of protocols, specifications, and libraries that enable the development of peer-to-peer network applications and is positioned to be the standard for future decentralized applications. Advantages •Extensive research & value proposition to current blockchain limitations: The Whitepaper available on the Multi-chain website provides an in-depth yet accessible presentation of the responses provided by the team to solve current limitations on scalability, network efficiency, overall security, and reward fairness. CORE Multi-Chain Whitepaper accessible here. •Security audits available: An audit of the network performed by CERTIK is currently public on the CORE Multi-Chain website. This research documents the project’s performance in the following criteria: Security, Runtime, Documentation, Testing, General, and Transparency.","links":"https://www.coremultichain.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/core/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5b685863494c33f344081f75e5430c260c224a32"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb2343143f814639c9b1f42961c698247171df34a"},"tron":{"decimal_place":18,"contract_address":"TKg1nGjtWYDcf1HNTSNQtwGwNAuTxd1X2A"}}}