{"name":"BasedHype","id":"basedhype_base","symbol":"basedhype","description":"BasedHype is a community-driven meme token on the Base chain, launched in July 2025 as a symbolic protest against unsustainable tokenomics in the cryptocurrency space. The token features a fixed supply of 10 billion units with built-in deflationary mechanisms, including monthly burns of 200 million tokens starting August 1, 2025, from a vesting pool of 6 billion tokens. This burn schedule, verifiable on Basescan, is designed to reduce circulating supply over time, with the potential to increase to 4% monthly in 2026 based on community consensus. Liquidity, representing 20% of supply (2 billion tokens), is locked until June 30, 2028, via Bitbond, ensuring trading depth without risk of withdrawal. The contract is renounced, standard ERC-20 compliant, with no taxes, minting permissions, or upgrade capabilities post-renounce, as confirmed by DEXTools score of 99/99. Additional allocations include a founder vault (4.5%, locked until January 2028 for ceremonial burn), media/listing reserve (4.5%, unlocking at $500 million market cap), and community vault (1.5% for incentives). BasedHype operates without a formal team or roadmap, guided by a decentralized collective known as the Signal Tribe, focusing on meme virality and on-chain transparency. The Transparency Hub on the project website provides real-time tracking of burns, locks, and vaults, emphasizing verifiable scarcity. Trading occurs on Uniswap V2, with fees (0.3%) distributed to liquidity providers, generating yield without emissions. The project disclaims any investment value, positioning itself as a memetic expression rather than a financial product.","links":"https://basedhype.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/basedhype_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x84a9183c9d11146d8e6a820dfc675a61b11eadeb","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x84a9183c9d11146d8e6a820dfc675a61b11eadeb"}},"is_native":false}