{"name":"IMVU","id":"vcore","symbol":"vcore","description":"VCORE is an ERC-20 metaverse token launching into the IMVU metaverse; an existing community, economy and virtual world ecosystem that has been in market since 2004. IMVU’s existing mobile, desktop and web applications serve a global community from over 100 countries, support 13 languages, enables a creator led economy and allows everyone to connect, socialize and earn. VCORE will be integrated into this economy, the social play/rewards and will give holders a voice in the future of the metaverse. The IMVU Web3 Metaverse * Serve over 700,000 unique users every day and over 4,000,000 unique users every month. * Over 200,000 creators and earners sell 18,000,000 digital items every month via the IMVU marketplace. * There are also millions of monthly peer-to-peer transactions that enable a large service economy inside the IMVU metaverse. * There are already over 1,250,000 active wallets inside IMVU and the digital marketplace is carefully being converted to support NFTs which have been live since late 2022. *VCORE will be an important part of this dynamic ecosystem for all the IMVU users living outside the United States and Canada. The transformation of the IMVU metaverse to a web3 economy involves a very large and existing community of daily users and a dynamic economy built by the creators and earners already on the platform. Often other web3 gaming and metaverse projects are starting with very few users, are still building out their applications/experiences and are in the early stages of building a truly sustainable platform. IMVU’s advantage is that its existing community is very familiar with digital currencies, purchasing digital items/assets and the creator base is very global.","links":"https://www.getvcore.io","market_cap":530882,"market_cap_rank":4542,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vcore/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x733b5056a0697e7a4357305fe452999a0c409feb"}}}