{"name":"Naetion","id":"naetion","symbol":"ntn","description":"Naetion is a decentralized ecosystem utilizing AI, that replaces our centralized, high-friction labor market, and payroll infrastructure. The network operates on the Ethereum blockchain, using a native token named NTN, which users earn by introducing and onboarding clients (demand) and talent (supply) to the network. The Naetion ecosystem runs primarily on four main pillars: Quest, the entry point for talent. Practically, allowing participants to build trusted resumes, automate scheduling and workflows, handle payments and compliance (crypto and fiat), and run anonymous KYC for users to remain publicly trusted. Paeyroll is the entry point for employers helping them go borderless and find proven talent instantly, anywhere. Furthermore, the platform tracks organizations and talent on culture, soft skills, and busiest hours to ensure Naetion is proactive in signaling talent and making the right decisions. Monaey, is the ecosystem's native one-stop banking and DeFi platform for converting, spending, savings, investments, and on/off ramp. NTN, the fourth pillar, allowing not only for user-ownership and hyper-efficient operations of the ecosystem, but also innovations like the Naetion Payroll Protocol, effectively turning payroll into revenue, made possible through immense on-chain commitments from Naetion and the sustainable staking protocols Yearn, Lido, and the more native option introduced with “The Merge”. Clients use NTN to receive talent signals, boost their job postings, set strong incentives, and talent use NTN to enhance their proposals, spend on benefits, software, and hardware - or simply earn more. Moreover, building on the programmable Ethereum blockchain we have established a system that enables users to build on-chain resumés and proportionately ecosystem control. These native token uses offer compelling incentives for clients and talent to benefit from decentralized ownership, building the network, control, and governance of Naetion.","links":"https://naetion.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/naetion/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x56d3d0b333d29b48dd7c01d516a737b8866fbee2"}}}