{"name":"Brewlabs","id":"brewlabs","symbol":"brewlabs","description":"Brewlabs is one of the truest utility projects in the space today and is building and offering products and services that not only smash the boundaries on what's possible in the crypto space, but make it so that any users, experienced or inexperienced, can get involved safely and make significant investment returns while doing so. Two of the core Brewlabs service offerings are contract audits and builds for multiple blockchains, including Ethereum and the Binance Smart Chain. Brewlabs has already designed for an exponentially growing customer base enhanced and detailed contracts for successful projects and, as an audit firm, its brand for trust, comes second to none. This high level of professionalism and brand reputation has now crystallised as the new Brewlabs token which can be used across the entire Brewlabs product suite, as well as providing exclusive benefits to holders, such as the access to the latest exciting token projects through the Brewlabs staking platform. This staking platform, which also includes liquidity pool farming, through a uniquely developed staking contract which allows Brewlabs holders to get both dividends and staking rewards while staking, two forms of passive income. Approximately 40% of the supply is now locked due to Brewlabs holder staking, representing the trust that Brewlabs has built. The Brewlabs token has only just launched and with all the aforementioned developments, its potential to become the number one utility token in the entire crypto space is huge. The developer team's leaders are doxxed and have shown their significant years of commercial experience, having built companies from the ground up. With this background and the technical know how to implement, globalising Brewlabs as a recognised brand, with the Brewlabs token at the centre is the goal. The team also has multiple software engineers and developers, a community manager and a team of community moderators. This is a strong team that is delivering on their promises and bringing something truly new to the crypto space. The following is a list of some of the major products and services both live and coming soon: - Contract builds and audit services that can be requested through the Brewlabs website (Brewlabs.info) - The Golem community bot (automates social postings to a telegram channel and includes channel security, pricing and much more) - The Brewlabs Airdrop tool (air drop your BSC tokens to holders easily and cheapily) - Brewlabs staking and farming - The Brewlabs DEX and IDO platform - The Brewlabs Bridge (ability to trade across blockchains and for a project to transfer their token to other chains) - Bot Yard (The first in the world online market place for bots for Telegram users) - Brewlabs Furnace (ability to destroy dead tokens)","links":"https://brewlabs.info/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/brewlabs/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x6aac56305825f712fd44599e59f2ede51d42c3e7"}}}