{"name":"G8 Coin","id":"g8coin","symbol":"g8c","description":"OneG8.one “Your Data – Your Life – Your Decision” Built to destabilize traditional big tech, OneG8, G8 Coin ($G8C) and a profusion of tools, features and solutions within a Super App are a direct answer to a serious problem: The fact that global technology companies are violating our privacy, harvesting our data without direct permission — and leveraging our valuable What Is OneG8 in Simple Terms? OneG8 does many things — and at its core — OneG8 is an encrypted data management system that uses distributed ledger technology (DLT) to ensure each user maintains total privacy of their data while using a wide range of tools. These include tools for social media, telecommunications, e-commerce, business IT, supply chain management, and more. In even simpler terms, OneG8 is a data privacy superstructure that provides consumers and businesses with all the benefits of modern technology while protecting them from the unfair and manipulative data harvesting practices of big tech monopolies. Here’s an overview of the current features and tools available on the OneG8 Evolution 2.0 App: ● Social Media: What sets OneG8 social media apart is our commitment to privacy and complete rejection of all dopamine-generating mechanisms. No manipulation, no AI analytics, no algorithms, no profiling, no targeted ads, and no hidden agenda. ● Messaging Service: Our integrated messenger has End-to-End mix net military-grade encryption ensuring the privacy and security of all messages. ● Video and Voice Conferencing: The video call center is easy to use and available without time limits, allowing for one-to-one communications. ● Live maps: This feature allows users to locate businesses and other users who choose to reveal themselves on a live, interactive map display. ● Content Creation: OneG8 utilizes a novel “hype button” mechanism to reward creators, influencers and platform participants for high-quality and engaging content. ● Digital Asset Wallet: The Multi-Wallet is a decentralized","links":"https://oneg8.one/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/g8coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}