{"name":"Judge MENTAL","id":"judge-mental_solana","symbol":"mental","description":"A true CLM (Community Led Meme). The idea for Judge $MENTAL came from \"Mike Gee\". It was his concept and his visuals that gave us the idea to push this to market. A true community members idea that we brought to market, showing that $MLMX and its whole ecosystem is driven in part by its community members ideas. 30% of $MENTAL supply is staked on the MLMX Centralized Exchange for 1 year staking periods. This keeps the floor protected at all times and helps build value over time for future value reporting for Legal X Global LLC. In the volatile underbelly of the crypto universe, where moonshots collide with rug pulls and diamond hands tremble under the weight of red candles, there reigns a fearsome arbiter of sanity: Judge $MENTAL. This wild-haired, bug-eyed jurist, with his robe billowing like a bear market cape and his gavel poised to smash delusions, presides over the Court of Crypto Derangement. Legend has it that Judge $MENTAL was once a mild-mannered trader named Judd Mental, who snapped after one too many 100x pumps followed by soul-crushing dumps. His hair fried from staring at charts 24/7, he ascended to the bench, vowing to judge the mental fortitude of all who dare enter the arena. \"Order in the court!\" he bellows, pointing an accusatory finger at FOMO-stricken noobs and overleveraged degens alike. Cases flood his docket daily: The FOMO Felon: A trader who YOLO'd their life savings into a cat-themed meme coin at ATH. Verdict: Guilty! Sentence: 10 years of paper-handing therapy, paid in $MENTAL tokens. The Rug Pull Victim: A hopeful investor scammed by a shady dev team. Verdict: Innocent by insanity! Reward: Airdropped $MENTAL to rebuild their shattered psyche. The HODL Heretic: One who sells too early, missing the lambo. Verdict: Contempt of gains! Penalty: Forced to watch green candles from the sidelines. But Judge $MENTAL isn't all hammer and no heart. His $MENTAL token isn't just currency—it's a measure of mental resilience. Stack enough through wise (or wildly lucky) trades, and you unlock \"Enlightened Insanity,\" where losses feel like wins and dips are just setups for epic comebacks. In a world gone mad with greed and memes, Judge $MENTAL reminds us: Before you ape in, ask yourself—are you mentally prepared? Or will the gavel fall on you next?","links":"https://www.judge-mental.com/","market_cap":2336.32,"market_cap_rank":13008,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/judge-mental/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"AvL9rHWzJA8G8mTeipKJ3Y4XBzdeXMq1P5nNEBt9gem","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/AvL9rHWzJA8G8mTeipKJ3Y4XBzdeXMq1P5nNEBt9gem"}},"is_native":false}