{"name":"Yamfore","id":"yamfore","symbol":"cblp","description":"What is the project about? Yamfore is a decentralized lending protocol. What makes your project unique? Crypto-backed loans with no margin calls, liquidation risk, interest repayments and indefinite loan terms. History of your project. Yamfore is a decentralized non-custodial lending protocol on Cardano. Yamfore is the first community backed lending protocol, providing stress-free “set & forget” crypto-backed loans for anyone & everyone. Yamfore differentiates itself by offering crypto-backed loans with no margin calls or ongoing interest payments and indefinite loan terms. Traditionally, crypto-backed loans offered by either centralized or decentralized platforms / protocols have typically been facilitated between two parties. The borrowers, who seek to keep exposure to their crypto assets, but require access to immediate capital. And the lenders, who supply capital to the borrowers in return for ongoing interest repayments on their lent funds. The issue with this arrangement comes from the significant power imbalance between both parties. The borrower is often presented with unfavorable loan to value ratios, the constant upkeep with interest repayments and the possibility of a margin call at any time due to a sudden market downturn. If the borrower fails to meet any of these obligations, their collateral position is liquidated and their loan position is closed. This model arguably presents substantial risks to any individual seeking a crypto-backed loan and remains a far cry from a “set & forget” prospect. Yamfore instead takes a different approach, and completely removes the lender from the equation. All crypto-backed loans facilitated through Yamfore are directly funded from the protocol's internal stablecoin treasury. This removes many of the counterparty requiremen What’s next for your project? We already made the V1 testnet, pretty close to the V2 testnet, then mainnet. What can your token be used for? You'll need $CBLP to interact with the protocol.","links":"https://www.yamfore.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/yamfore/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"ee0633e757fdd1423220f43688c74678abde1cead7ce265ba8a24fcd"}}}