{"name":"IXO","id":"ixo","symbol":"ixo","description":"The ixo protocol defines a new open standard for producing verifiable claims about changes in the state of the world. Which are the basis for impact creators to mint non-fungible (NFT) Impact Tokens.Sustainable Decentralised Finance (Sustainable DeFi) and Impact Verification applications built on the Internet of Impact have the potential to fundamentally change the state of the world. By transforming how we finance, implement, measure, value and create markets for sustainable impact. Which is relevant to all forms of capital flowing into social, environmental and economic development, as well as Climate Finance and Carbon markets. Community currencies implemented through the Internet of Impact can drive outcomes towards local social and economic development goals, in ways that are inclusive, locally governed, low-risk and sustainable. With great potential to innovate new use-cases, new forms of economic production, new types of incentive schemes, new investment mechanisms, and new economic models for community sustainability and local resilience. Internet of Impact networks will give people everywhere access to the trustworthy information and financial tools they need, to invest and spend their money in more sustainable ways, and to hold public finance accountable. As mandated by the UN Task Force on Digital Finance for the Sustainable Development Goals. Impact Tokens are units of value created through the Internet of Impact. Each Impact Token represents a real-world outcome state that people care about, are willing to invest in, work towards, or spend their money on. Impact tokens will become the new standard for measuring, verifying, reporting and valuing impacts through marketplace mechanisms.","links":"https://www.ixo.world/","market_cap":1750722,"market_cap_rank":2365,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ixo/logo.png","detail_platform":{"cosmos":{"decimal_place":6,"contract_address":"ibc/F3FF7A84A73B62921538642F9797C423D2B4C4ACB3C7FCFFCE7F12AA69909C4B"}}}