{"name":"Friend Room","id":"friend-room","symbol":"friend","description":"What is the project about? For a more human digital community,empowering creation and connection on the blockchain. Friend Room enables web3 users to build, launch and host their own blockchain-based spaces without any coding experience. Users can buy, create, explore & speculate on rooms with friends. What makes your project unique? Rooms can be created in real-world addresses on a global map. The price of each room depends on the country where it is located. The price of a room depends on the GDP of the country. The higher the GDP, the more expensive the room. Users can choose to invest in other rooms through purchasing room shares. The room share price increases gradually. Each time when shares are purchased or sold, there is a 10% fee. 50% goes to the room owner, rest to FriendRoom. History of your project. FriendRoom project began preparations at the end of 2022, and after several tests and audits, the first beta version was launched in August 2023, and the $FRIEND token was cold-launched on Ethereum in August. What’s next for your project? The distribution is based on country’s GDP, the number of shares created in the room, and in the future specific decoration of a room. Platform tax collected from share trading will be used to buy back and burn $FRIEND. What can your token be used for? 1. $FRIEND uniswap taxes will be distributed to room owners. They can choose how much % of this distribution they want to share to their shareholders. Greedy room owners can choose 0%, meanwhile others 100% 2. For room decoration, you need to use $FRIEND to buy the assets. Specific assets will boost the mining power of a room and it will benefit both the room owner and the shareholders.","links":"https://friendroom.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/friend-room/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbde4c4a9057595fa16d38e0bd7871ef119045a84"}}}