{"name":"Unidef","id":"unidef","symbol":"u","description":"Unidef is a global network of member organizations founded in 2022 with a mission to accelerate the world's transition to a decentralized future that empowers all to take full control of their finances, data, and identity. Unidef's unique organizational structure puts its community at the forefront, with interconnected global networks promoting collaboration and integration. At the core, Unidef Global Services will drive the organization's operations to deliver services on — a greater scale. Through this interconnected network of organizations – Unidef Decemount, Unidef Way, and Unidef iLabs –, Unidef enables the world to take control over its finances, data, and identity, paving the way for a decentralized future. And all of this is made possible through \"The Power of One\"; fueled by a common purpose, an unwavering spirit, shared behaviors, greatness of character, and an unyielding commitment to our community. What is U or $U? Unidef (also known by its ticker symbol, U or $U) is a utility token that is used for accessing the entire Unidef interconnected global networks, including Decemount, Unidef Way, and Unidef iLabs, as well as any projects invested under the Unidef umbrella. Additionally, U serves as the governance token within the Decemount’s DAO. As the Unidef ecosystem expands, U’s impact on the new economy and Web3 will become more prominent. What is Unidef Decemount? Decemount is a network of DAOs working together to empower the next generation of organizations with $U-governed initiatives. It is a global community made up of a band of creators, builders, communities, organizations, and ecosystems united by a mutually beneficial pact to bring the world to a decentralized future and beyond. Where can I buy U? $U or U is the ticker symbol for Unidef, which serves as the native digital currency of the interconnected network of organizations with the same name - Unidef. You can buy $U from exchanges or wallets directly.","links":"https://go.unidef.org","market_cap":110923,"market_cap_rank":3986,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/unidef/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x89db9b433fec1307d3dc8908f2813e9f7a1d38f0"}}}