{"name":"Telcoin","id":"telcoin","symbol":"tel","description":"Telcoin is a multi-national fintech company integrating blockchain technology, telecommunications, and digital banking to revolutionize global finance. It aims to provide borderless, instant, and affordable financial services to mobile phone users worldwide. Telcoin offers the Telcoin Wallet, a multi-signature DeFi wallet supporting more than 100 digital assets and remittances to eWallets and bank accounts globally. Telcoin is regulated as a Virtual Asset Service Provider in the EU (Lithuania) and Argentina, a Major Payment Institution in Singapore, and a Money Services Business in the US, Canada, and Australia. Telcoin is designed to complement telecom, mobile money, and e-wallet partners globally with both traditional fiat and blockchain transaction rails that underpin our fast and affordable digital financial service offerings. Telcoin combines the best parts of the burgeoning DeFi ecosystem with our compliance-focused approach to each market, ensuring that the company takes on a fraction of traditional financial counterparty, execution, and custody risks. The Telcoin Association is a Swiss non-profit organization domiciled in Lugano, Switzerland and is governed by a decentralized group of Miner Councils that run the various aspects of the Telcoin Platform, including the management of the Telcoin (TEL) token. Read more about the Telcoin Association [here](https://www.telcoin.org).","links":"http://www.telco.in","market_cap":474530755,"market_cap_rank":185,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/telcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":2,"contract_address":"0x467bccd9d29f223bce8043b84e8c8b282827790f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x467bccd9d29f223bce8043b84e8c8b282827790f"},"base":{"decimal_place":2,"contract_address":"0x09be1692ca16e06f536f0038ff11d1da8524adb1","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x09be1692ca16e06f536f0038ff11d1da8524adb1"},"arbitrum-one":{"decimal_place":2,"contract_address":"0x0419e8bfbbb2623728c3a6129090da4ff4e48113","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x0419e8bfbbb2623728c3a6129090da4ff4e48113"},"polygon-pos":{"decimal_place":2,"contract_address":"0xdf7837de1f2fa4631d716cf2502f8b230f1dcc32","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xdf7837de1f2fa4631d716cf2502f8b230f1dcc32"}}}