{"name":"Shack","id":"shack","symbol":"shack","description":"To summarize, the Starfish Topology provides two major advantages over other swaps: Significant improvement in TVL-utilization by reducing liquidity dispersion Allows onboarding onboarding new tokens with zero collateral other than protocol tokens (e.g. No new USDC is needed to pair with a new token to provide liquidity) However, this topology can be even further enhanced by moving to a Multi-Tier Starfish Topology (MTST) as follows: In MTST, All external tokens supported by the swap are put into 4 buckets and paired with a separate starfish tokens: Tier 1 (Paired with RADIO): Stable Coins (e.g. USDC, DAI, USDT, UST etc) and Native Blockchain Currencies (e.g. ETH, MATIC, AVAX, BNB etc). Tier 1 tokens are paired with RADIO. This is expected to be the least volatile Starfish. Tier 2 (Paired with SHACK): Blue Chips (e.g. LINK, LUNA, USV, AAVE etc). Tier 2 tokens are paired with SHACK. This tier is expected to be more volatile than Tier 1 but less volatile than the remaining 2 tiers. Tier 3 (Paired with BUILD): Mid-stage Protocols (e.g. MANA, GRT, ENJ etc). Tier 3 tokens are paired with BUILD. This tier can be quite volatile over time. Tier 4 (Paired with DREAM): Startups (e.g. ECOMM.io and more). Tier 4 tokens can have even wilder fluctuations than the previous 3 tiers, and are paired with DREAM.","links":"https://radioshack.org","market_cap":82872,"market_cap_rank":4982,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shack/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x6e65ae5572df196fae40be2545ebc2a9a24eace9"},"optimistic-ethereum":{"decimal_place":18,"contract_address":"0x66e8617d1df7ab523a316a6c01d16aa5bed93681"},"avalanche":{"decimal_place":18,"contract_address":"0x9ad274e20a153451775ff29d546949a254c4a1bc"},"cronos":{"decimal_place":18,"contract_address":"0x671d2e0e1a9c8e117a071bfc5763af3fbe9bdf0b"},"fantom":{"decimal_place":18,"contract_address":"0x462fa81050f0ff732d59df121bfd9b8bab072018"},"ethereum":{"decimal_place":18,"contract_address":"0x5f018e73c185ab23647c82bd039e762813877f0e"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe79a1163a95734ccfbd006cbaaba954f3e846beb"}}}