{"name":"Aquarius Loan","id":"aquarius-loan","symbol":"ars","description":"What is the Aquarius Loan? Aquarius Loan or Aquarius is a decentralized blockchain protocol that allows users to lend or borrow selected cryptocurrencies on Core chain. It establishes money markets by pooling assets together and algorithmically setting interest rates based on supply and demand of assets. To supply or lend crypto assets on Aquarius, users will have to deposit their crypto assets into the Aquarius protocol and it will be aggregated into a liquidity pool. Once users have made the deposit, they will receive aTokens in return. Users will start accruing interest by holding the aTokens. Once assets are supplied to Aquarius, users are allowed to use the assets as collateral. Based on the collateral factor of the assets deposited, users can start borrowing from Aquarius. Because Aquarius uses an overcollateralization model, you can never borrow more than what is collateralized. How is Aquarius Loan different from traditional finance? Aquarius behaves similarly to a bank but it is more easily accessible. To use Aquarius, users are not required to provide personal and private information. Anyone with an internet connection could sign up for Aquarius and start interacting with the protocol. All they need is some crypto assets stored on a crypto wallet like Metamask. In addition, the return rates for Aquarius are more attractive compared to traditional banks. For example, if you store money in a savings account, it will only generate a measly 0.05% APY. On the other hand, Aquarius would offer up to 10% APY depending on the assets supplied. History of Aquarius Loan. Aquarius team have launched the project in 2022 and in July 2023, they have made strategic partnership with CoreDAO, a DAO organization that is governing the activities of Core chain. Aquarius Team got official grant from CoreDAO to build the decentralized money market on Core chain. In August 2023, they partnered with SushiSwap to launch the protocol's native token ARS and the protocol started a full scale operation with the token launch. What’s next for Aquarius Loan? After the token launch and start of the full scale operation, Aquarius is now expanding it's ecosystem by bringing more users, utilities and funds to the protocol and to the Core chain from both inside and outside of Core chain. What can Aquarius token (ARS) be used for? ARS token is the platform's governance and utility token. Users are rewarded with ARS token for supplying and borrowing on the platform and they can also participate in governing activities of the protocol with ARS token.","links":"https://www.aquarius.loan","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aquarius-loan/logo.png","detail_platform":{"core":{"decimal_place":18,"contract_address":"0x204e2d49b7cda6d93301bcf667a2da28fb0e5780","geckoterminal_url":"https://www.geckoterminal.com/core/tokens/0x204e2d49b7cda6d93301bcf667a2da28fb0e5780"}}}