{"name":"The Invincible Game Token","id":"the-invincible-game-token_solana","symbol":"iggt","description":"Invincible GG is a web 2.5 mobile game company (based in the United States) focused on delivering the next generation of competitive gaming with skill-based mobile games, real-money play-to-earn gameplay, true in-game entity ownership, and the development of AI-powered athletes (NFTs). Our live events are distributed for legal wagering in casinos, tracks, and betting shops worldwide. Our mobile gaming ecosystem (built on the Solana blockchain) addresses the most significant challenges in web3 mobile gaming and virtual sports entertainment by providing players with true ownership, rewarding skill over luck, and making Web3 gaming intuitive and frictionless. We are a platform technology company that will publish 3rd party AAA games on our mobile and web ecosystem, in addition to our own titles. Owners Club is the launch title and the first expression of the Invincible game platform. This mobile competitive racing game features live stakes races, daily contests, horse training and skills development, performance-based progression, and seasonal contests that regularly reward prize pools of up to $50,000. Owners Club integrates blockchain technology, artificial intelligence, and skill-based gaming to simulate horse racing. The Invincible Token ($IGGT) powers in-game stakes events, exclusive gameplay, all player rewards and will be core to the economy of all our upcoming titles, including brain games, fighting, racing, and team sports games. The Invincible GG Team is over 25 people strong and is deeply experienced in video game development and publishing, sports entertainment and marketing, race and sports betting, AI technology (learning systems), advanced simulation techniques, web3 development and global scaling of mobile products. The team is led by: Founder and CEO, Jonathan Strause - Former McKinsey & Company and serial successful entrepreneur Chief Marketing Officer Glenn Chin - former CMO of Nike Basketball, and member of the founding team at EA Sports and a visionary behind top franchises like EA Big, NBA Live, and the Street Hoops franchise. Chief Operating Executive - Roger Hawkins, former CEO of TCS John Huxley North America. Roger runs IGG’s partner licensed operator in Nevada, Competition Interactive Virtual Sports. More about Owners Club The game enables players to own, train, and race virtual horses represented as non-fungible tokens (NFTs) on the Solana blockchain, providing a digital ownership experience that mirrors real-world horse racing. The game targets both gaming enthusiasts and horse racing fans by offering real-time player-versus-player (PvP) competitions and a marketplace for trading digital assets. Players can acquire virtual horses through in-game purchases, NFT drops, or soon to be on the Owner’s Club marketplace. These horses, powered by AI, possess unique attributes such as genetic traits, learned skills, and performance capabilities that influence their success in races. Owners train their horses to optimize performance for specific race conditions, such as track surfaces, distances, and weather, adding a strategic layer to the gameplay. The platform replicates historic racetracks and operates 24/7, allowing players to participate in races at any time. Race outcomes are determined by a combination of horse attributes, owner tactics, and algorithmic simulations, ensuring varied and competitive results. The game uses the Solana blockchain to secure NFT ownership, enabling players to buy, sell, or breed their horses in a transparent and verifiable manner. The marketplace supports both standard horses, which can be trained and minted as NFTs, and premium horses, which are pre-trained for immediate racing but cannot be minted. The maiden NFT drop in 2023 included 1,234 horses of varying rarity, with some considered highly valuable due to their unique attributes or colors. Players can earn rewards through race winnings, breeding fees, or trading, with transactions facilitated by the platform’s native cryptocurrency integration. The game also complies with U.S. and international gaming regulations, ensuring legal frameworks for real-money contests. Owner’s Club emphasizes community engagement, offering players access to exclusive updates, race broadcasts, and social features through platforms like Discord, X, and Reddit. The game offers immersive experiences, including virtual stable management and the opportunity to compete in scheduled races broadcast to casinos, tracks, and licensed venues. Invincible GG’s patented “Winner’s Circle” technology enhances the platform by simulating real-world racing conditions, making the experience accessible to a global audience without the high costs of physical horse ownership. As of July 2025, Owner’s Club has attracted tens of thousands of players, with a growing community of NFT owners and active participants in its marketplace. The platform has partnered with global leaders in the Gaming and Blockchain technology companies to expand its ecosystem, with plans to introduce additional features like leagues, governance system, and breeding in the near future.","links":"https://ownersclub.invinciblegg.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-invincible-game-token/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"iGG7XyyxGKSR6x5j365S9kcSy6o5kDP3XdqkuayGex6","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/iGG7XyyxGKSR6x5j365S9kcSy6o5kDP3XdqkuayGex6"}},"is_native":false}