{"name":"Next NXT","id":"next-token","symbol":"nxt","description":"What Is Next Token [NXT]? The Next Token is above all the token of a platform (market place) in the course of development of putting in relation between professionals and influencers. Its function at the heart of the platform's ecosystem is to allow token holders to benefit from advantages up to free under the condition of stacking NXT on it. It will facilitate the search for relevant influencers for all companies through an intelligent algorithm based on a rating system, engagement rate and many other metrics. How Many Next Token Are There in Circulation? 100% of the circulation so 100 000 000 000 NXT were issued at the fairlaunch on September 18, 2021. The goal is to make regular burns with the process of Buy Back to Burn which consists in buying back supply with the BNB that we take on taxes, to reinject them and burn definitively the Next Token. The first burn of the Next Token was done in Buy back and burn of a value of 100 BNB equivalent to 500 000 000 of NXT on the wallet 0x00000000000000000000000000000000000000000000dead. Circulation supply: 99,500,000,000 NXT Total supply: 99,500,000,000 NXT Max supply: 100,000,000,000 NXT These fees are distributed as follows. 15% at purchase: * 10% for the liquidity pool * 5% for marketing, development. On the sale side, 17% of which 2% is added as follows * 2% for the liquidity pool Who is the Founder of Next Token? The founder has done a KYC at interfi.finance. Here is the link to the certificate: https://github.com/interfinetwork/kyc-verification-certificates/blob/main/Next_KYCReport_InterFi.png Where Can I Buy Next Token (NXT)? At the moment, NXT is available as BNB/NXT on the Dex Pancakeswap. Here is the link: https://pancakeswap.finance/swap?outputCurrency=0x8e428aa75b271ebf905db7e3f2970453e976481e","links":"https://nxt-token.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/next-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7601157e00750e2adc28b2cb2a51419bdca53ac9"}}}