{"name":"LEGAL","id":"legal_ethereum","symbol":"legal","description":"Building a real-world accountability framework 4 digital offenders. RWA's driving revenue to our holders. How did Legal X come into existence? It is widely acknowledged that the cryptocurrency sector has been infiltrated by unscrupulous individuals, a fact substantiated by on-chain data. 🔹Our objective is to serve as a deterrent against such malfeasance. While we cannot eliminate every fraudulent actor from deceiving their communities, we aim to cultivate a community and establish processes that will act as a protective barrier. As Legal X solidifies its reputation within the cryptocurrency industry, our legal expertise will serve as a hallmark of our identity. 🔹We will advocate for crypto investors who have fallen victim to scams by financing civil or criminal litigation against the wrongdoers in this domain. This encompasses creators, founders, developers, key opinion leaders, and influencers. 🔹Pursuing legal action against any of these parties can be prohibitively expensive for individuals, which is why we are developing a self-funding mechanism. In addition to the legal initiatives of Legal X, we will also create our own cryptocurrency technology and real-world assets to generate revenue for holders of the $LEGAL token. 🔹Having grown accustomed to crypto platforms draining liquidity from our market, we intend to utilize that liquidity to benefit our token holders. Our ultimate ambition is to become a publicly traded company, and once stock tokenization is legalized, we will venture into that arena. 🔹In the meantime, Legal X Global LLC is dedicated to the company's growth, encompassing both the cryptocurrency sector and the pursuit of public company status.","links":"http://www.legal-x.io","market_cap":16602.12,"market_cap_rank":10135,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/legal_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa3b71add41c9e4e1034fe665f946baebfe9c07c4","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xa3b71add41c9e4e1034fe665f946baebfe9c07c4"}},"is_native":false}