{"name":"BlueMove","id":"bluemove","symbol":"move","description":"## What Is BlueMove (MOVE)? Launched in August 2022, BlueMove is a community-oriented NFT marketplace that operates on Aptos and Sui Blockchains. It rewards traders, collectors, and creators for their participation, providing a platform for creators to easily create and list their NFT collections for buying, selling, and trading. With full functionality and seamless web and mobile experiences, BlueMove is a comprehensive, all-in-one platform for NFT enthusiasts. MOVE is the utility token that is used for: + Staking Incentives + On-chain Governance + Free-mint/Whitelist Pool + Product development + Unique membership rights ## What Makes BlueMove Unique? BlueMove is a platform that offers a comprehensive and convenient NFT trading experience. One of the key features that sets BlueMove apart is its support for mobile devices with an in-app wallet, making it easy for users to access and trade NFTs on the go. It provides a seamless experience for users of both web applications and mobile applications As a multiple-chain NFT marketplace, BlueMove allows NFTs built on different blockchains cancan be traded on the same portal. It makes it easier for users to buy and sell NFTs as they can trade different NFTs from the same interface It is designed to be user-friendly and intuitive for both traders and developers. The platform bundles all-in-one functions to bring the best experience for the customers. The notable functions include launchpad, staking NFT, bulk transactions (bulk buying/bulk listing), automated trading, mint tracking, NFT lending, NFT order book","links":"https://bluemove.net/","market_cap":4724505,"market_cap_rank":1696,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bluemove/logo.png","detail_platform":{"aptos":{"decimal_place":8,"contract_address":"0x27fafcc4e39daac97556af8a803dbb52bcb03f0821898dc845ac54225b9793eb::move_coin::MoveCoin"},"sui":{"decimal_place":9,"contract_address":"0xd9f9b0b4f35276eecd1eea6985bfabe2a2bbd5575f9adb9162ccbdb4ddebde7f::smove::SMOVE"}}}