{"name":"MTOE","id":"mtoe","symbol":"mtoe","description":"Move To Earn (MTOE) is an innovative user location-based advertising and rewards platform. It is a new kind of blockchain-based advertising platform that allows users to earn by providing information about their current location and movements, and earn by viewing ads or participating in missions. MTOE leverages users' location information to data their movements over distance and rewards them with more targeted marketing through AI. Our goal is to create a new concept of reward platform where all users are rewarded for their movements and location information, whether they are making deliveries, performing complex logistics transportation, or simply moving around, using any mode of transportation such as cars, motorcycles, public transportation, bicycles, etc. and can earn additional rewards based on the distance traveled and participate in various advertisements based on their location information. At the same time, we want to provide advertisers with innovative tools for targeted marketing through big data based on the user's location, making it a new kind of advertising platform where advertisers can reduce advertising cycles and costs. In addition, the MTOE platform is based on the user's location, providing a network for finding, interacting with, and organizing gatherings with a variety of people in close proximity. This feature can provide a variety of services to many people, such as gathering people who commute to the same place to commute together, or organizing social gatherings with like-minded people who live in the same area. This is the end goal of the MTOE platform: to organically mix and meet more people through your location and make your life more fulfilling.","links":"https://mtoe.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mtoe/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9600d01f58ecf00bf5743f630a6d5466e8122e00","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9600d01f58ecf00bf5743f630a6d5466e8122e00"}}}