{"name":"League of Ancients","id":"league-of-ancients","symbol":"loa","description":"What Is League of Ancients (LOA)? League of Ancients is the fastest growing eSports, Free-to-Play, Play-to-Earn MOBA NFT GameFi in Binance Smart Chain. Inspired by LOL and DOTA, bringing the best 5v5 PVP Metaverse gaming experience to Android and iOS users LOA tokens can be obtained by: * Playing League Of Ancients * Staking into Ancient Realms What is the League of Ancients Gameplay? 10 players will be thrusted into the Ancient Realm tile set map where they will engage in a 5v5 PVP team battle. The map is divided into two sides, the Luminous and the Dark Souls. The objective of the game is to destroy the base of the opposing team. Though it sounds simple, there are several layers of complexity to this. The map is vast and is focused around controlling lanes. Each lane leads to the opposing team's base and is guarded by endless waves of enemy minions and powerful turrets. Surrounding these lanes is the jungle and river which players can utilize strategically to hunt powerful creatures, escape, ambush and or navigate the map covertly. This PVP game style has been tried and tested for over 20 years, proving to be endlessly entertaining and exciting There are 3 Game Modes: Normal Match Normal Match is the first and earliest game mode in League of Ancients. All other game modes use the mechanics of Normal Matches as their base. It is an UNRANKED 5v5 PVP experience. This means that players do not lose rank titles if they did not win the game. This mode is suitable for beginners who need to familiarize themselves with the gameplay mechanics. You are free to choose any hero to play with. However, you are not allowed to have more than one of the same hero on your team. The opposing team however, CAN pick the same hero that is chosen on your team. Players can earn in-game currency by completing each normal match. NFT Match NFT Match is a competitive seasonal game mode that runs for a specific period of time. You will be competing with other players sharing your ranked division bracket. Players will have access to play all the heroes as long as they have a certain number of NFT skins at any rarity level. The rank titles from lowest to highest are Sentinel, Royal Knight, Zealot, Duke, Arch-Duke, Lord, Overlord. Sentinel is the lowest division, whereas Overlord is for the best of the best. Every time you win a Ranked match, you will gain MMR and in-game currency. The amount of in-game currency will be higher compared to playing a normal match. When the season ends, the rankings will be reset accordingly and a new season begins. Tournaments Tournaments is a feature of the game that allows organizers to host in-game tournaments. It will be supervised by League of Ancients. Each participating team has to pay a registration fee, where 5% of the total registration fee collected will be for the tournament organizer to cover for the administration purpose. The teams will challenge each other for the total prize pool allocated for that specific tournament. Prize pool consists of $LOA tokens How Many LOA tokens Are There in Circulation? LOA token is scheduled for a TGE on December 12,2021 with 1 billion LOA tokens created at genesis with the following allocations: *Play-to-Earn: 25% *Staking: 15% *NFT Staking: 8% *Liquidity: 1% *Centralized Exchange: 5% *Ecosystem Fund: 3% *Marketing: 5% *Advisors: 4% *Community: 2% *Team Tokens: 20% *Private Sales: 10% *Pre-Sales and Initial Dex Offering: 2% Who Are the Core Team behind the League of Ancients? Dwayne Ong - Governor (Project Lead) A crypto enthusiast and entrepreneur with experience in multiple startups of various industries. A failed professional DoTA 2 grinder who ended up with decent MMR ranking. Kenneth Choong - Overlord (Community Manager) Ex-Professional DoTA 2 player. Having graduated with an MBA and a corporate career, fell in love with the positive vibes of the crypto community and decided to give up everything to be part of the crypto world. Abdul C - Paladin (Smart Contract Developer) A Full stack and Smart contracts developer with more than a decade of software development experience. Founded multiple startups and enjoys learning and coding. John Lim - Prophet (Marketing Director) Founded a marketing agency with more than 10 years of design and communications experience. Served clients from various industries, including eSports, Technology and Consumer brands. Gavin Liu - Chieftain (Game Director) Specializes in character gameplay animation, move set ideation and well versed in the video game production pipeline. A Passionate fan of Japanese anime, movies, music, fashion and all facets of pop culture. Luso - Warlord (Art Director) Has produced multiple games throughout his career and has worked with numerous independent startup projects. Always willing to take on a new idea and challenge . His favorite quote, \"Life is a game!\". Chien - Archpriest (Concept Artist) A mural artist who performs his work by getting inspiration from playing DoTA 2. Eats, sleeps and dreams illustration work, Chien prides himself on his creativity and burning passion for art. Peter Joseph - Dragonlord (Partnership Relation) Huge football fan, enjoys meeting people around the world. Strong believer of \"Tomorrow is always a better day, never say never!\" Weng Hong -Templar (System Support) Enjoys taking orders and executing them when the command is given. Enjoys working as a team and would have enlisted to become a soldier if it were not for LOA","links":"https://leagueofancients.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/league-of-ancients/logo.png"}