{"name":"Pinnako","id":"pinnako","symbol":"piko","description":"What is the project about? Pinnako stands as a pioneering decentralized perpetual trading platform, offering a diverse array of markets bolstered by substantial liquidity. Here are some notable features of Pinnako: An array of markets, encompassing Crypto, Forex, NFT, and Indices Leverage up to 100x High yield liquidity provision without impermanent loss Advanced risk management What makes your project unique? At the heart of Pinnako is a unique fusion of a Hybrid Liquidity Mechanism and Smart Router. This pair operates synergistically with a dynamic collection of Oracle-based Settlement Algorithms. The product of this innovative combination is a suite of significant benefits: Absence of price impact Minimal to zero slippage Instantaneous settlement High capital efficiency for liquidity providers Support for markets void of physical inventory History of your project. What’s next for your project? Pinnako's development roadmap is designed in two distinct phases: 1. Phase 1 revolves around the hybrid liquidity solution and has been successfully executed. Pinnako's unique hybrid liquidity engine allows Liquidity Providers (LPs) to select their preferred liquidity pool through our intelligent routing system. Moreover, it provides users with the flexibility to trade a wide range of assets. 2. Phase 2 is concentrated on the development of a permissionless decentralized perpetual platform. This innovative platform calculates the prices of crypto assets internally, thereby eliminating the necessity for external price oracles and enhancing capital efficiency for spot trading. The ultimate goal of Pinnako is to create a platform that not only offers a broad range of derivative options but also ensures a user-friendly interface and smooth user experience. The aspiration is to promote on-chain, high-frequency quantitative trading, thus transforming the way users engage with derivatives trading. What can your token be used for? platform's utility token","links":"https://pinnako.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pinnako/logo.png","detail_platform":{"zksync":{"decimal_place":null,"contract_address":"0xf8c6da1bbdc31ea5f968ace76e931685ca7f9962"}}}