{"name":"Mover.xyz","id":"mover-xyz","symbol":"mover","description":"About Mover Mover is the first bridge between EVM networks and Aptos. Mover operates as a decentralised, permissionless, and trustless network of nodes capable of locking assets on one chain and swapping them for asset on another chain or minting one-to-one pegged representations of them. The innovation behind Mover is its hybrid architecture: light client verification and a network of nodes performing secure multi-party threshold signing are used interchangeably to achieve maximum security and allow for faster addition of new blockchain to the bridge. The former allows for maximum security on supported chains while the latter gives us the ability to easily integrate new target chains into Mover. Form the beginning, Mover bridge will use light client to perform cross-chain messaging with the supported EVM blockchains. For non-EVM chains, swap transactions to and from will be executed through the network of nodes performing secure multi-party computation (MPC) to reach a threshold consensus. MPC nodes will verify and collectively sign transaction. Shortly after the initial launch, MPC nodes will be operated by different entities including core developers, community and other stakeholders in Aptos ecosystem. How Mover Works? Mover operates as a decentralised, permissionless, and trustless network of nodes capable of locking assets on one chain and swapping them for asset on another chain or minting one-to-one pegged representations of them. The innovation behind Mover is its hybrid architecture: light client verification and a network of nodes performing secure multi-party threshold signing are used interchangeably to achieve maximum security and allow for faster addition of new blockchain to the bridge. The former allows for maximum security on supported chains while the latter gives us the ability to easily integrate new target chains into Mover. Form the beginning, Mover bridge will use light client to perform crosschain messaging with the supported EVM block","links":"https://mov3r.xyz/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mover-xyz/logo.png","detail_platform":{"aptos":{"decimal_place":8,"contract_address":"0x14b0ef0ec69f346bea3dfa0c5a8c3942fb05c08760059948f9f24c02cd0d4fd8::mover_token::Mover"}}}