{"name":"JOOPS","id":"joops","symbol":"joops","description":"Joops will launch with 300 electric rental scooters nestled in the vibrant streets of the U.K. After each successful launch we will continue to deploy our scooters in every major city across the globe. When we build each scooter we will create a unique NFT that represents proof of ownership for that specific scooter. This isn't your ordinary NFT; It has been programmed with a smart contract that funnels 50% of the assigned scooter's monthly rental revenue directly into the pockets of the NFT holder. Each unique NFT represents proof of ownership and demonstrates a forward-thinking approach that blends the physical and digital worlds. This revenue-sharing model transforms NFT holders into business partners, fostering a sense of community and shared success​ ​ For example, you could live in the U.S. and earn money from a scooter rented out in London by simply owning a Joops NFT. We take care of all the logistics, making it a hassle-free way for NFT owners worldwide to earn a passive income. ​ JOOPS Token Joops introduces a multifaceted utility for its token. From acting as a share in the revenue to being accepted as payment for rentals with exclusive discounts, the token provides real-world benefits. The deflationary model with buybacks and burns funded by profits adds an additional layer of investor-friendly dynamics. ​ Staking and Governance The opportunity to stake Joops tokens and earn up to 100% A.P.Y. creates an attractive incentive for long-term investors. Furthermore, the inclusion of governance votes allows token holders to actively participate in shaping the Joops ecosystem. ​ Fair Token Distribution Joops' commitment to a fair and impartial token distribution, avoiding traditional funding mechanisms like VC or seed sales, demonstrates a dedication to inclusivity and community involvement.","links":"https://www.joops.app","market_cap":11140.94,"market_cap_rank":4986,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/joops/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe3b933caed104db24542249c7331584d5a05972f"}}}