{"name":"Chains of War","id":"chains-of-war","symbol":"mira","description":"$MIRA is the Official Chains of War Token for utility and (in-game) ecosystem. The Chains of War ecosystem thrives on the oxygen-absorbent mineral M-S3, known as “Mira”. With the demand for Mira skyrocketing after the collapse of Tyrrha’s ecosystems, Mira is known to be elemental for the political status quo as it became crucial for survival in the oxygen deprived world of Tyrrha. Chains of War is developing a fantasy saga that carves a new world on the Cardano blockchain by means of storytelling, artworks, 3D assets and gamification. Ultimately, Chains of War aims to become a multi-platform fantasy franchise, pioneering on the Cardano blockchain. The Chains of War Genesis Heroes is an NFT collection of 10,000 3D based Heroes, both male & female, representing the four known species of Tyrrha and their division into multiple clans and tribes. The Genesis Heroes collection is the centerpiece in the utility phase and the foundation for gamification, including information about classes, basic statistics, gear and weapons. As a game fanatic team and from a game designing stand point looting games are probably the most rewarding, addictive game types out there. Next to that there’s the surviving Battle Royale aspect that really triggers your senses. Being the last man or team standing after a tough fight gets the adrenaline pumping. The game we’re designing aims to have all of this, with the working title ‘Chains of War: Escape from Tyrrha’: Drop into the world of Tyrrha, survive and escape. The Chains of War game will be available for anyone to play. Therefore, during the gamification phase a new collection of Heroes will be released. In this collection everyone can make a Hero by using the NFT forge. The NFT forge also makes it possible to customize your hero with gear or weapons that you earn while playing the game. In a time of increasing digital experiences, Chains of War offers opportunities to add value to the conventional gaming industry.","links":"https://www.chainsofwar.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chains-of-war/logo.png","detail_platform":{"cardano":{"decimal_place":2,"contract_address":"160a880d9fc45380737cb7e57ff859763230aab28b3ef6a84007bfcc4d495241"}}}