{"name":"JELLY TIME","id":"jelly-time_solana","symbol":"jelly","description":"Peanut Butter Jelly Time ($JELLY) is a community-driven cryptocurrency project inspired by one of the earliest and most recognizable internet memes. The origin of the meme dates back to 2001, when a short Flash animation of a cartoon banana dancing to the 1996 song “Peanut Butter Jelly Time” by The Buckwheat Boyz began circulating online. Initially shared on personal websites and niche communities, it gained massive popularity on early internet platforms such as eBaum’s World, Newgrounds, AlbinoBlacksheep, and YTMND. The looping animation, combined with the repetitive and absurd lyrics, made it a defining example of early internet humor and one of the first memes to achieve widespread recognition. The $JELLY project is designed around collective ownership, community governance, and cultural preservation. By leveraging the meme’s high recognizability and nostalgic appeal, $JELLY aims to unite participants who share an appreciation for internet history and meme culture. The project operates as a decentralized, community-led initiative, with token holders empowered to influence project direction, creative output, and collaborations. $JELLY is more than a token; it is a cultural artifact on-chain. Its design incorporates the ethos of Web3—permissionless participation, transparent governance, and open creative collaboration—while maintaining the playful spirit of the original meme. The token serves as a medium for digital collectibles, meme-based media initiatives, and cross-community partnerships. Future development plans include the integration of $JELLY into meme-related content, online events, NFT collections, and collaborative marketing campaigns with other crypto projects. The cultural footprint of Peanut Butter Jelly Time extends beyond internet forums and Flash animation websites. The meme has appeared in mainstream media, most notably in the Family Guy episode “The Courtship of Stewie’s Father” (Season 4, Episode 16, aired November 20, 2005), where the character Brian dresses as the banana to cheer up Peter. The meme was also popular during the MySpace era, often embedded in user profiles and blog posts, further cementing its role in early social media culture. Its enduring appeal lies in its simplicity, absurdity, and the shared nostalgia it evokes for those who experienced the early days of the internet. The project’s roadmap emphasizes sustainable growth and active community involvement. Key goals include: Encouraging creative contributions from the community in the form of artwork, videos, and memes. Hosting community-driven contests, events, and social media campaigns to maintain engagement. Preserving and documenting internet culture through archival efforts and educational content. $JELLY operates on the principle that strong communities drive lasting value. By grounding the project in a cultural phenomenon that has already demonstrated global reach, the team aims to create a space where humor, history, and blockchain innovation intersect.","links":"https://jellytime.fun/","market_cap":9541.06,"market_cap_rank":11275,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jelly-time_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"EmNFqmSi5DvwGjW57LJ7J5i8R6T155JrNf6GNFaupump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/EmNFqmSi5DvwGjW57LJ7J5i8R6T155JrNf6GNFaupump"}},"is_native":false}