{"name":"Manifest","id":"manifest-2","symbol":"mfx","description":"Manifest Network is a decentralized infrastructure protocol designed to support high-performance, sovereignty-focused cloud services for Web3 and AI applications. The project provides a hybrid (centralized + decentralized) Infrastructure-as-a-Service (IaaS) and Platform-as-a-Service (PaaS) stack, enabling users to deploy compute, storage, and AI workloads with greater control over data, execution environments, and cost structures. Manifest’s core offering is the Sovereign Cloud, a distributed infrastructure layer built to deliver enterprise-grade reliability, modular deployment options, and blockchain-native interoperability. Key services include bare metal compute, GPU-based workloads for AI/ML, object and immutable storage (including S3-compatible and on-chain Ghostcloud options), Kubernetes orchestration, and a Web2/Web3 bridging layer. The network is secured by the Sovereign Authority Consensus (SAC) model: a Proof-of-Authority mechanism run by a consortium of verified data centers and infrastructure partners. This model emphasizes predictable performance, low-latency validation, and operational transparency, with a roadmap toward more decentralized governance through its native MFX token. Manifest targets a broad set of users, including Layer 1 blockchain networks, AI startups, decentralized application (dApp) developers, channel partners (MSPs, VARs, SIs), and enterprises exploring decentralized technologies. By abstracting the complexity of managing decentralized infrastructure, Manifest offers familiar developer tools (APIs, SDKs, dashboards) and interoperable interfaces to support both Web2 and Web3 environments. The project’s design addresses key challenges in existing infrastructure models, such as data sovereignty, centralized cloud dependency, opaque pricing, limited physical control in consumer-grade DePIN networks, and lack of scalable decentralized AI support. Manifest's architecture offers verifiable infrastructure, token-stabilized costs, and native support for autonomous AI agents via secure compute and blockchain-based payments. Currently, users can access the network via public onboarding through the Alberto wallet platform, or through managed deployment cohorts coordinated by The Lifted Initiative. Future plans include a hybrid self-onboarding model and potential on-premises deployments via hardware partnerships. The Manifest Network operates with a long-term vision to enable secure, composable, and user-owned infrastructure for the next generation of cloud computing, AI, and decentralized systems. Note that block time is actually .1 minutes: your system only allows integers.","links":"https://manifestai.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/manifest-2/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}