{"name":"Doge Protocol","id":"doge-protocol","symbol":"dogep","description":"What Is Doge Protocol? Doge Protocol is an upcoming platform consisting of decentralized networks, smart contracts and apps. The primary component of this platform will be a quantum-resistant blockchain that supports smart contracts, satellite chains & tokens. In order to secure Bitcoin, Ethereum, Dogecoin from quantum computer threats (Y2Q problem), Doge Protocol will multi-fork these blockchains along with the DogeP tokens, to create one large quantum resistant blockchain. Doge Protocol is a community driven initiative. What is the vision of Doge Protocol? Please check the Vision Paper https://dogeprotocol.org/whitepapers/Doge-Protocol-Vision-Paper-1.pdf for details on the aspirations & vision of Doge Protocol. * Protect Bitcoin, Ethereum, Dogecoin from Quantum Computer threats (Y2Q problem). * Create a platform for decentralized apps that provides a solution for real world problems. * Ability to add satellite chains that provide solutions for specific use-cases such as streaming. * Community driven development. What is the technology behind the Doge Protocol Platform? Since its inception in 2021, the Doge Protocol community has released several whitepapers detailing the technology behind Doge Protocol. More whitepapers will be published as the platform keeps evolving. * Quantum Resistance Whitepaper https://dogeprotocol.org/whitepapers/Doge-Protocol-Blockchain-Quantum-Resistance-Whitepaper.pdf * Consensus Whitepaper https://dogeprotocol.org/whitepapers/Doge-Protocol-Blockchain-Quantum-Resistance-Whitepaper.pdf * Data Availability Whitepaper https://dogeprotocol.org/whitepapers/Doge-Protocol-Blockchain-Data-Availability-Whitepaper.pdf * Blockchain Allocation Whitepaper https://dogeprotocol.org/whitepapers/Doge-Protocol-Blockchain-Allocation-Whitepaper.pdf What are the achievements of Doge Protocol? Since its inception in 2021, Doge Protocol community has delivered the following items: * 3 Testnets have been released so far, the latest being T2.","links":"https://dogeprotocol.org","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doge-protocol/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe7eaec9bca79d537539c00c58ae93117fb7280b9","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe7eaec9bca79d537539c00c58ae93117fb7280b9"}}}