{"name":"GreenWorld","id":"greenworld","symbol":"gwd","description":"It was founded in 2022 with the idea of enabling its community to fight climate change by promoting actions related to the protection of the environment and endangered species, sustainability, and the protection of regions most disadvantaged by pollution. GreenWorld leads this fight through several lines of action, always involving its community allowing them to participate in all decisions in the form of voting and accepting proposals. The organization focus on three main areas. 1. Green Missions, leading movements with a direct impact on our ecosystem, such as organized plastic collections, installation of solar panels in developing countries or tree plantations. In these missions, the GreenWorld community has active participation since it is the community itself that can propose missions to be developed. 2. Traceable donations in GWD or Ethereum, different types of entities such as NGOs, non-profit organizations, or charities that fight climate change, protect endangered species, or contribute positively to the planet. Through these donations, other actors are supported in the active fight against climate change in various fields of action. The community plays a very active role in this line of action since it is the community that decides by vote to which entity the funds are allocated. 3. Awareness creation through different types of educational campaigns and awareness actions. The goal is to help educate people about climate change, sustainable habits, green mobility, and renewable energies, among others. The community is always invited to be part of these actions, from helping to organize them to simply attending them. A peculiarity of GreenWorld is that all transactions have a small commission, the Charity Fee, which is automatically sent to the Charity Wallet. This wallet is public and auditable and is used to finance the actions mentioned above.","links":"https://www.gwdtoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/greenworld/logo.png"}