{"name":"Zano","id":"zano","symbol":"zano","description":"What is Zano? Zano is an open-source cryptocurrency (layer-1) and ecosystem with enterprise-grade privacy, security, and scalability that operates as a robust platform for confidential assets and decentralized applications (dApps). Confidential Assets Anyone can easily issue user-creatable privacy tokens on the Zano chain; assets secured by the same mechanisms that make Zano so much more secure than first-generation cryptocurrencies, namely because of hidden addresses and hidden amounts. This unique technology can be used to create private stablecoins, shielded versions of existing assets, and much more, without the overhead of having to create, manage, and secure your own blockchain. Untraceable Transactions with hidden amounts The transactions between Zano network members are made untraceable with the help of several technologies, most importantly d/v-CLSAG Ring Signatures and Stealth Addresses. Also, the way transaction data is stored on the blockchain allows access by parties who authorized the transactions only, and none of the private data is ever publicly published. A secure scheme with a set of proofs allows for the concealment of the amount of coins transferred. The Bulletproofs+ technology is used for these proofs, enabling the creation of both performance-eective and size-eective proofs. Burning of all fees On Zano, all network fees are being burned. With enough network usage, the daily fee burning could surpass the emission from block rewards, resulting in supply becoming deflationary over time. This combination of small, minimalistic daily emissions, together with daily burns, results in little to no sell pressure on the exchanges.","links":"https://zano.org","market_cap":113285951,"market_cap_rank":408,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zano/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"zano":{"decimal_place":12,"contract_address":"d6329b5b1f7c0805b5c345f4957554002a2f557845f64d7645dae0e051a6498a"}}}