{"name":"Hold2Earn","id":"hold2earn","symbol":"h2e","description":"H2E is a community-driven project that's goal is to provide an ecosystem for anyone to earn and interact with crypto and DeFi at their own pace. H2E offers beyond the wall of the just blockchain we want to use both powers of crypto and potential projects launched through our launchpad. What H2E intends to do is merge those two concepts and allow for a more free and brighter future with a byproduct of crypto earning and adoption. Our goal is to provide generational wealth to all of our loyal holders with reflection functionality, real estate renting, and investment in the project launched through the launchpad. We redistribute 7% of every buy and sell transaction fee to H2E holders. Our mission is to provide actual value and real-world use cases to make H2E a leader in the DeFi space, by developing a complete ecosystem. The ecosystem will consist of our crypto-powered launchpad, crypto token, real estate investment platform, and other financial offerings, with more to follow, as the H2E takes shape. By combining the power of blockchain and cryptocurrency we created a token that is better than any other token available in the market, with a higher automatic reward. H2E is the first reflection project with an actual utility on top of the community's efforts to hold and grow. You probably already know this, but with $H2E you will have higher profits than any other reflection token out there. We made it better. H2E’s mission is to bring popular cryptocurrency concepts to the mainstream. Unlike older, comparable projects, H2E introduces holders to next-gen concepts such as participation rewards, hold to earn, and more. H2E’s mission is to bring popular cryptocurrency concepts to the mainstream. Unlike older, comparable projects, H2E introduces holders to next-gen concepts such as participation rH2E’s long-term goal is to establish itself as an industry leader in the emerging Decentralized Finance sector. The management at H2E believes that the underlying factor that will continue to define Blockchain products are the ability to give people and businesses more power and control over their finances. This is the driving force behind H2E, i.e., providing a platform to the people where they can freely utilize their crypto assets in a fully secure, seamless, and affordable online environment, rewards, hold to earn, and more.","links":"https://hold2earn.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hold2earn/logo.png"}