{"name":"Zone of Avoidance","id":"zone-of-avoidance","symbol":"zoa","description":"After millions of years of conquest and evolution in space, three interplanetary races now dominate the universe: Humans, The Syndicate and the Raddans. Technological advance or complete annihilation; they battle to maintain control over an overpopulating universe. And even adventurers who land on faraway and inhospitable planets can no longer expect solitude; life has crawled from the primordial swamps out into the farthest reaches of the universe and brought with it war. Now there is a new frontier, inhospitable and massive. Humans call it the Zone of Avoidance, a shattered galaxy-turned-battleground hosting an all-out war between the three rival factions. New planets, new resources: claiming a strategic stronghold in The Zone of Avoidance may once and for all tilt the balance in favor of a victor in this war as old as time. Now it is time to pick your faction, recruit your army and make your claim to the universe. ZoA is a PVP/PVE, Play-to-Earn, NFT-based auto battler in which the universe becomes your campaign ground. Buy your NFT spaceship, fill it with heroes and embark on your mission out of the New Milky Way toward the Zone of Avoidance. As you hop between planets you’ll discover valuable commodities and fight the inhabitants willing to do anything to protect them. Synergize your squad, arm them with powerful items and then choose your strategic battle formation. Then sit back and watch as the explosive battles play out live. As you progress, upgrade your army and battle for the top spot in the ZoA online rankings, earning galactic glory and tantalizing rewards. Zone of Avoidance is an auto-battler that pits players against their enemies. Players control a spaceship that holds their heroes, with some being upgradable with items. The core objective is simple: beat your opponent with superior tactics and abilities, collect resources and upgrade your crew. Spaceships, heroes and items are all connected to NFTs, meaning players can buy and sell them on marketplaces. The best heroes and items will be sought by top players, creating an active economy surrounding the game. These NFTs themselves originate from Card Packs purchasable through ZoA. The rarer the pack, the better the chance of drawing powerful heroes. Battles themselves are simulated. Players choose their heroes and items, place them in attack and defense formations, and begin playing either PVE or PVP modes, each with distinct advantages and rewards. Regardless of the opponent, every battle requires the player to use Fuel—a resource that automatically regenerates after a regular interval. Once the player runs out of Fuel they need to wait for it to replenish before they can battle again. The PVE game follows the player on a loose campaign as they travel towards the Zone of Avoidance in search of tokens. Players encounter enemies of increasing difficulty who they must defeat for $ZOA and $ZGO tokens. Players also earn tokens through special events, the NFT marketplace and through renting out heroes and spaceships to other players.Tokens ahve various use case including: crafting, upgrades, stacking and pharming programs, purchase of NFTs at a discouted rates ,etc. The PVP game pits players against each other. ZoA automatically matches players and simulates the battle—the user actively oversees their attacking team while battling another player’s defending team. Defending players don’t need to be online for this part of the game, and their defending formation will automatically resolve the game even while they’re away. Winning players earn tokens and increase their rank. Both $ZOA and $ZGO tokens are necessary to progress in the game. Certain smaller upgrades can be completed with $ZGO, while major upgrades require $ZOA tokens to be spent as well. ZoA will also have a second token which will primarily be used for governance—a dual token model like this allows the in-game economy to run independently without impacting the value of the tokens held by investors. Governance tokens unlock a range of benefits within the broader ecosystem, and also need to be burnt for certain ultra-Elite upgrades.","links":"https://zoa.game/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zone-of-avoidance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb2e841894b1c3d638948517f6234c6e06d3b8e1c"}}}