{"name":"LockTrip","id":"lockchain","symbol":"loc","description":"\"Disrupting the Travel Industry LockTrip.com is a blockchain-based travel marketplace that allows users to save up to 60% on their bookings by cutting out middlemen and their commissions. Choose among various payment methods such as credit card, popular cryptocurrencies and the native LOC token to bypass payment fees. More than 2.1 Million Hotels & Properties LockTrip is working with the strongest brands in the travel industry to offer its customers first class inventory around the globe. Thanks to our vast network of partners, we are not only fulfilling the needs of our customers, but also let the strongest brands compete with each other. Thanks to our unique reverse-auctioning model, customers will always be presented the lowest price possible. More than 1,000 Airlines to Choose From With more than 1,000 Airlines to choose from globally, LockTrip is better connected than any other marketplace in the industry. Both Hotels & Flights are bookable from the same marketplace in a one-stop shop solution. About the LOC Token LockTrip's unique business model funnels the entire economy through the LOC token. Each booking made on the marketplace results in 3% of the booking value being used to buy LOC from exchanges and burn them. The process is fully automated and can be verified transparently on the blockchain. Deflationary Model Contrary to most other tokens and coins, the LOC supply is not growing or remaining constant. Indeed it is shrinking with each booking and it's subsequent burn. This mechanism will continue indefinitely as there is no limit in time or number of LOC to be burnt. LockTrip is powered by the Hydra chain, which emerged through the combination of the best features of Bitcoin, Ethereum and Qtum chains. It thus presents cutting-edge technology with unique economic features.\"","links":"https://locktrip.com/","market_cap":2701302,"market_cap_rank":2092,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lockchain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5e3346444010135322268a4630d2ed5f8d09446c"},"hydra":{"decimal_place":8,"contract_address":"4ab26aaa1803daa638910d71075c06386e391147"}}}