{"name":"Xen Crypto (EVMOS)","id":"xen-crypto-evmos","symbol":"coxen","description":"XEN is a community building crypto asset that connects like minded people together. If you are a seasoned OG or simply Crypto curious, XEN has the lowest barrier to entry through its unique tokenomics. Fair Crypto Foundation designed XEN as a universal cryptocurrency to achieve the original mission of Blockchain, following the Blockchain Tenets of decentralization, transparency, counterparty risk resistance, peer-to-peer value exchange and self-custody. XEN is based on the ERC20 token standard with a minimum amount of code. There are no pre-minting, hidden doors, admin keys, or origin (OA) wallets. All XEN ecosystem participants mint their own coins using their own ethereum compatible wallets. XEN cryptocurrency is Free as it does not require participants to deposit any funds to start minting their XEN crypto. XEN starts with zero supply and will only be minted by the participating community. XEN does not have a maximum cap on the supply, is inflationary in the beginning, becoming disinflationary as adoption increases. XEN is a digital asset which has no backing by investors or starts with any intrinsic value. XEN is immutable, and can not be changed or stopped by anyone. With its open source code it is truly trustless through consensus and belongs to the people. XEN does not have a controlling or management team, it is simply a segment of an immutable code secured by the Blockchain. XEN is neither a proof of stake or proof of work token, however it is a Proof of Participation (PoP) crypto. Whoever participates in XEN creation has full rights of ownership through self custody. XEN smart contract uses a fair system of new token distribution. All participants are subject to the same immutable rules secured by Blockchain. XEN continuously manages token rewards through minting based reward time locks and the total number of participants.","links":"https://xen.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xen-crypto-evmos/logo.png","detail_platform":{"evmos":{"decimal_place":18,"contract_address":"0x2ab0e9e4ee70fff1fb9d67031e44f6410170d00e"}}}