{"name":"Viddli","id":"viddli","symbol":"mty","description":"## What Is Viddli (MTY)? With Viddli, you can turn your browsing time into real money. Users are rewarded with eMTY, which are virtual points within the app that are automatically converted to MTY, a publicly available BEP20 token on the Binance Smart Chain, on a monthly basis. MTY is the native governance utility token that is used for: * Rewarding users by converting their in-app rewards. * Payment by companies that wish to book ad space on our social media network. ## How Many MTY Coins Are There in Circulation? MTY was fair launched on Pinksale on March 27, 2023 with a total of 75 Million tokens distributed amongst 359 Contributors. On April 03. ### Who is the Founder of MTY? MTY Token is the invention of serial entrepreneur Ismail Ramadan who has extensive experience in various fields of in online commerce, crypto trading and entrepreneurship. He is also a Binance Live streamer, streaming on the newly developed Binance Live Platform with over 150k with his company alias EarlyMinter. Having established successfully different online ventures in Web2 that generate millions of dollars in revenue each year, he joined the crypto space in 2016 and since then blockchain technology is his passion. Ismail Ramadan has been also a content creator for several years, after years of struggle in creating revenue with his content due to restriction and limited possibilities set by centralised social media companies, he decided to come up with Viddli. He aimed to decentralise social media by giving content creators and users a fair share of the revenue generated by the app and distribute it to users using the MTY token. He believes that the only value social media companies can offer are the users who use the app and in a fair world creators and users should be rewarded as they are the ones who create the value. This is how Viddli and the MTY token was born. ### Where Can I Buy MTY? MTY can be bought currently on the DEX Pancakeswap. It's trading pair is BNB. htt","links":"https://www.viddli.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/viddli/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xde27c2c13d1eeb87744bf3c2a9168c1cbd62ee81"}}}