{"name":"Ecochain","id":"ecochain","symbol":"ecoc","description":"About ECOChain What is ECOChain? ECOChain, also known as a decentralized public chain, describes itself as a permission-less, secure, scalable blockchain. It aims to offer all advantages of a public blockchain: immutability, transparency, transaction capability. Additionally, embedding a virtual machine (VM), it makes it a platform to host Turing complete code (smart contracts). It is the bridge that connects applied technology and real-world markets based on blockchain. It aims to offer a brand-new solution for the economy and businesses. ECOChain was initiated by an international blockchain team that uses blockchain technology as a basis to explore the integration of the global economic market and the blockchain world and also build a global decentralized distributed ecosystem. What is the Value of ECOChain? ECOChain is a decentralized public blockchain which aims to provide security and scalability, running Proof-of-Stake consensus and supporting smart contracts by using Virtual Machine (VM) as executor. Moreover, it reportedly offers high transaction speeds (560 TPS) & short block creation times (32 seconds) for faster confirmation of transactions. ECOChain aims to work as the bridge which connects applied technology and real-world markets on blockchain technology. How do you mine ECOC? ECOC is based on a Proof-of-Stake system (PoS) which encourages more nodes to take part in the consensus algorithm and makes blockchain more decentralized as it has no mining cartels. Blocks are created on the blockchain every 32 seconds and a winning node receives 50 ECOCs as a block reward. Staking is necessary to motivate coin holders to run a full node. Running a node decentralizes it and makes it more secure. There is a small cost to run a node (server cost), so the reward must be greater than this. The staking reward is also a compensation for the risk of the investor. How do you buy ECOC? You can buy ECOC through any cryptocurrency exchange that supports ECOC or visit (http://ecoc.io) to see the list of trading venues for this asset.","links":"https://ecoc.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ecochain/logo.png"}