{"name":"AUKI","id":"auki-labs","symbol":"auki","description":"About The Posemesh \"The eyes and ears of spatial AI\" Without spatial awareness, AI is confined to the internet and blind to the world around it. Spatial computing and machine perception bring AI's power to the physical world. The posemesh is a decentralized spatial computing and machine perception network for the next 100 billion people, devices and AI. Traction & Milestones - 700+ posemesh domains around the world; anyone can create their own domain by grabbing a portal kit and setting it up within minutes. We have another app called McKenna for decorating domains with NFTs, images, videos, 3D assets, and text notes. - 6+ month pilot with Coop (a major grocery retailer in Sweden) integrating spatial AI and staff productivity, saving them more than 15 minutes per employee per day and increasing their self-sufficiency. - 2+ month multi-store pilot with another major Swedish grocery retailer that has committed to doing a complete rollout in the coming 12 months, plus a number of others in Hong Kong. - Top 10 global retailers are interested in Spatial AI to do empty shelf detection and planogram compliance; they’ve also expressed strong interest in ESL positioning and realograms (having a detailed understanding of where items are in their stores). - Pre-pilot planning with more of Europe and North America's largest grocery retailers; a combined total of 40,000+ stores and hundreds of thousands of employees. - Real-time indoor navigation and friend finding at a number of large events and venues. - 40k DePIN app users on TG - 300+ DePIN servers around the world (purposely capped to avoid over-provisioning) - 450+ app developers using the posemesh SDK for building shared and persistent AR experiences","links":"https://www.posemesh.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/auki-labs/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xf9569cfb8fd265e91aa478d86ae8c78b8af55df4"}}}