{"name":"Glory Token","id":"glory-token","symbol":"glr","description":"What is the project about? GloryFinance focuses on blockchain technology and its applications across the financial industry. We provide integrated solutions, including applications, platforms, workforce development, and consulting services to accelerate the rate of DeFi adoption and contribute to creating a trustless and decentralized financial system. GloryFi: Simplified DeFi with Cross-chain services and UI innovation. GloryFi Labs: Blockchain infrastructure provider & DeFi Innovation center. spinUp: Upskilling Tech and Blockchain Academy. What makes your project unique? The Platforms provides a wide range of products responding to the need of all kinds of DeFi users while offering an unprecedented user experience through a genuine and unique customizable UI. History of your project. https://docs.gloryfinance.io/about-gloryfinance/introduction What’s next for your project? Check out the master roadmap of GloryFinance on: https://docs.gloryfinance.io/roadmap-and-f.a.q/roadmap What can your token be used for? GLORY (GLR) is the native super-utility and governance token of the GloryFinance Ecosystem that serves as its ultimate backbone. With GLORY, users can diversify their portfolio with one token and earn a share of the entire Ecosystem's revenue. Holders can take part in the platform’s governance and participate in shaping its future along with many other benefits. Real Yield 2.0: GloryFi distributes the protocol revenues to holders. You can become a real stakeholder in the project by staking GLORY and sharing revenues in Stables. Glory Governance: Stake your GLORY tokens and receive gGLORY, which gives you a say in the future of GloryFi. You can vote on all future changes to the protocol and even suggest your own. Ecosystem token: GLR will be the backbone of GloryFinance making the ultimate currency of the Ecosystem, all transactions, payments and rewards will be in GLR","links":"https://gloryfinance.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/glory-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1fc71fe3e333d5262828f3d348c12c7e52306b8a"}}}