{"name":"BaseSwap","id":"baseswap","symbol":"bswap","description":"The First Native DEX on BASE. By Based Team for Based You. The liquidity marketplace from simplistic to advanced we have it all. aseSwap is a pioneering decentralized exchange (DEX) that introduces a groundbreaking concept by allowing users to not only trade assets but also earn protocol-generated revenue from fees. This innovative feature is made possible through the $BSWAP & $BSX tokens, enabling users to directly earn cryptocurrencies from swap fees. Utilizing a sophisticated Smart Order Routing system, BaseSwap ensures optimal prices while minimizing gas fees. The evolving system guarantees competitive swap rates across its matrix of pools, enhancing user trading experiences. With trading fees lower than leading decentralized and centralized exchanges, BaseSwap provides exceptional cost savings. Its user-friendly UI simplifies DeFi interactions, enabling easy token swaps, liquidity provision, and farming participation. Chosen for its robust security and cost-effectiveness, BaseSwap is integrated with the Base Network, an Ethereum Layer 2 solution incubated by Coinbase. This partnership offers security, scalability, and seamless interoperability, aligning with BaseSwap's commitment to user-centric and economically efficient trading. Benefiting from the Base Network's economical EVM setting and priority access to Ethereum functionalities, BaseSwap maintains minimal trading fees and a superior trading experience. Supported by Coinbase's user community and fiat onramps, BaseSwap is positioned for success in the evolving DeFi landscape.","links":"https://baseswap.fi/","market_cap":645884,"market_cap_rank":4190,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/baseswap/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x78a087d713be963bf307b18f2ff8122ef9a63ae9","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x78a087d713be963bf307b18f2ff8122ef9a63ae9"}}}