{"name":"Honeyland","id":"honeyland-honey","symbol":"hxd","description":"Honeyland is a fun-first, play and own casual strategy game from Hexagon Studios. The Honeyland ecosystem of mobile games begins with Honeyland and will be followed by 8 more casual games with solo, PvP, and tournament play in 2023. All powered by a single deflationary token ($HXD), with Honeyland being the core token-emitting game. Players of Honeyland build their colony of bees to send them out to harvest Honey ($HXD) or hunt in-game consumable NFTs like power-ups, defensive items, or even playable characters. They can also risk their own $HXD to attack other players' hives in an intense auto-battler loop. Our belief is that in order for web3 games to succeed, they need these three things: 1) Insanely fun to play 2) Ownership that creates value 3) Sustainable economy Honeyland proudly holds the esteemed Verified By Machinations seal, the gold standard in healthy game economics that verifies we have created a balanced, sustainable and unexploitable economy. Traction - $1m in pre-game revenue through NFT sales throughout the bear market. - Most recent mint in December 2022 sold out 6,000 NFTs on Magic Eden in 7 minutes. - Playable alpha launched in November with over 4,500 wallets connected. - Partnership with Samsung in place to get 500,000 game downloads over the next 6 months minimum. - Verified by Machinations game economy audit completed. Read the full 103 page report here: https://drive.google.com/file/d/1wTknRiKTVSiM5Xg8dM9cswz-jtXpLg7z/view?usp=sharing - Launched HiveMind v1 webapp in February 2023 that enhances gameplay by creating a desktop companion to mobile game for players to strategize, analyze, manage, and stake their Honeyland assets. - Launched Honeyland NFT Explorer iOS/Android app with custom rarity and ranking scores for all our NFT collections. - Partnership with Solana Mobile to be featured in the Solana Saga dApp store.","links":"https://honey.land","market_cap":8896928,"market_cap_rank":1336,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/honeyland-honey/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"3dgCCb15HMQSA4Pn3Tfii5vRk7aRqTH95LJjxzsG2Mug"}}}