{"name":"GM Holding","id":"gmcoin","symbol":"gm","description":"GM Holding tokens are digital assets that represent ownership in GM Holding, a company focused on tokenizing businesses and creating value through capitalization. These tokens are designed to be used within the GM ecosystem, which includes GM Bank, GM Holding, GM Stock, and GM Store. The GM Holding token serves as the primary currency within the ecosystem and can be used to purchase shares in tokenized companies, access services offered by GM Bank and GM Store, and participate in the GM Stock platform. The tokenization of businesses through GM Holding allows for increased liquidity and accessibility, as well as potential appreciation in value as the tokenized companies grow and generate revenue. The GM Holding token serves as a bridge between traditional finance and the new world of tokenization, providing an opportunity for investors to gain exposure to a diverse range of businesses and industries. GM Bank is a Fintech platform that offers digital financial services in Colombia. Its goal is to help unbanked individuals easily access the financial system. Additionally, GM Bank groups tokenized companies so they can offer initial offerings using a crowdfunding model that incorporates digital assets to provide digital-based collateral for the companies. The platform also provides access to Visa and Mastercard monetization solutions, and users can verify their identity through the KYC process to access the initial offerings of tokenized productive assets. In summary, GM Bank is an innovative Fintech platform that provides digital financial services to facilitate access to the financial system for unbanked individuals and offers monetization and crowdfunding solutions through digital assets. In summary, GM Holding tokens are a digital asset that can be used to participate in the GM ecosystem, including tokenized companies, GM Bank, GM Stock, and GM Store, which in turn allows greater access to liquidity and potential appreciation in value of the tokenized companies.","links":"https://gmholding.info/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gmcoin/logo.png"}