{"name":"Planet Sandbox","id":"planet-sandbox","symbol":"psb","description":"Planet Sandbox is a physics-powered NFT sandbox shooting game that allows players to build and own arenas to fight other players in different game modes using their own NFT weapons and accessories. Powered by the $PSB and $PULV tokens, Planet Sandbox has created multiple play-to-earn opportunities within their Metaverse. For example, Sandbox owners can customise their land with limitless building items and design game modes for others to join and play. The land will become a business where players can sell or earn passive income through the shop. The land system provides creators with various possibilities to build on diverse sceneries and landscapes such as Grass, Desert, Mountains, Toxic Wastelands, Arctic, etc. Eventually, the game will include other planetary environments. Aside from the builder tool, there are Multiplayer game modes that allow players to choose their favorite sandbox and compete with others in intense fighting games (such as deathmatch and hunting prop) to earn prizes. The beta version of this game is expected to be released this November. * Empower players: We provide the tools, You can build your own world & rule your game. * PlanetSandbox is developed as a Metaverse, with upcoming features of AR/VR integration. * Multiplatform: The game will first launch in Web version. According to the roadmap, the Mobile/PC platforms will be released next year. * Two tokens: $PSB - main token, governance token, buy/sell nft; $PULV - ingame token, inflationary token, mint/burn.","links":"https://planetsandbox.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/planet-sandbox/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x36bfbb1d5b3c9b336f3d64976599b6020ca805f1","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x36bfbb1d5b3c9b336f3d64976599b6020ca805f1"}}}