{"name":"Orbitau Taureum","id":"orbitau-taureum","symbol":"taum","description":"Orbitau - Seven Deadly Sins is a fantasy game inspired by Norse Mythology and the Seven Deadly Sins, and provides players with new experiences based on well-known legends. In Orbitau, players will directly participate in the Demon - God war with the familiar role-playing and turn-based strategy gameplay in a magical land of mixed reality and fiction created by blockchain technology. And the rewards are materially valuable, not just symbolic victories. Players will take on the role of different heroes to conquer highly challenging but rewarding quests. Players can also join together to do co-op quests, form guilds, and battle each other. The national war PVP feature allows players to engage in combat with players from all over the world, and joining a Clan increases the scale of PVP battles, which will continue until a winner is determined. And, of course, the reward chains will be highly proportional to victory in the tournament, Battle Pass, or Season ranking. In addition to the inherent strengths of an NFT game and the success and failures well-learned from predecessors, Orbitau also provides exciting plots, outstanding sound and graphics, and a rich NFT collection backed by a larger ecosystem. The game itself also presents to players a unique game with pre-metaverse experiences. Along with trading, in-game items and tokens can be used to participate in De-Fi or serve as a repository for trusted assets in the digital world. With the monetization mechanism thoroughly embedded into the Orbitau world, the engagement and competitiveness of the game will be on another level. Taureum (TAUM) is our governance token for all the games in our ecosystem. The token is utilized throughout to purchase products and services in the ecosystem as well as the Orbitau NFT marketplace. TAUM holders will have the voting right on the Taureum-related projects. Highlight Features Orbitau will be an NFT game that allows players to truly \"\"Play-and-Earn\"\" while balancing entertaining experiences with opportunities to earn real money, with a smooth combination and progression between storyline and game features. Storyline: A good storyline will pique players' interest since it is impossible to predict what will happen next, coercing them to continue the journey to reach the final destination. In essence, Oribitau’s storyline is based on a combination of Norse Mythology and the Seven Deadly Sins. What happens when Thor, Odin, and Loki from Norse mythology fall into a twisted timeline leading straight to hell where the Seven Deadly Sins rule? Perhaps it is where Good does not triumph over Evil. It makes players wonder when plot twists unfold in such a way that nothing is quite righteous. In this game, the seven greatest sins of men - pride, greed, lust, gluttony, envy, wrath, and laziness - are represented by the Seven Princes of Hell, including Lucifer, Mammon, Asmodeus, Beelzebub, Leviathan, Behemoth, and Belphegor. Game features: No matter how good it is, everything can easily fall apart if the storyline is not expressed through unique features that are reasonably added alongside. Stat development will play a vital role not only in combat strength but also in the storyline as the gods increasingly overwhelm hellish devils or as the player receives a level penalty when losing to a surprise ambush. The weapon and upgrade system is not pre-programmed; players will instead get them at random through rewards from main or extended side quests. Of course, the quest system will reveal concurrently with the plot, so the extras are the consequence of unexpected variables arising from plot twists. Beside immersive PvE experience where users can enjoy the mythical world of Orbitau as combining and upgrading hero, pet and pet upgrade system, PvE quest, tower training, NFT marketplace, we also build up communities with many features for players to work together or compete to dethrone the king as guild quest, PvP and dungeon co-op, land ownership and tax syste. We have a handful of maps with distinctive characteristics in terms of elemental effects, cultural identities, unique skills improvement hub, coupled with lots of decorative tools to optimize players’ personal experience within the Orbitau world.","links":"https://orbitau.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/orbitau-taureum/logo.png"}