{"name":"Bitoro","id":"bitoro-network","symbol":"btoro","description":"Bitoro consists of BitoroCore, a cutting-edge Layer-1 blockchain, and its flagship app, the Bitoro Network—a decentralized exchange (DEX) built to redefine trading. Together, they form a comprehensive ecosystem for professional traders, developers, and institutions. BitoroCore is engineered for the future of decentralized finance (DeFi). Built on the Cosmos SDK, it provides unmatched scalability, liquidity, and composability. Optimized for perpetuals, options, and prediction markets, it empowers seamless trading with features like EVM compatibility, gas-free transactions, and a single margin account. Secured by CometBFT's proof-of-stake consensus and powered by BTORO, the native token, BitoroCore delivers decentralization, speed, and reliability. Since its launch just seven months ago (March 2024), Bitoro Network has achieved remarkable milestones: over $5.6 billion in trading volume, nearly 70,000 active users, and 75 million BTORO tokens staked—representing nearly half the circulating supply. This success lays the foundation for BitoroCore’s evolution into a full-stack decentralized ecosystem. BitoroCore bridges digital and real-world assets (RWAs), creating a modular, open-source framework for community-driven innovation. Its high-throughput, low-latency performance is tailored to meet the demands of institutional-grade trading. Moreover, its design ensures that all aspects of the ecosystem — from trading to governance — operate transparently on-chain, putting power into the hands of BTORO holders. Join the movement shaping the future of finance. Whether by staking BTORO, participating in governance, or building the next generation of DeFi applications, the possibilities with Bitoro are limitless. The future of trust, transparency, and financial empowerment begins here.","links":"https://bitoro.network","market_cap":206808,"market_cap_rank":5446,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitoro-network/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xb6212b633c941e9be168c4b9c2d9e785f1cd42fb"}}}