{"name":"Alpha Radar AI","id":"alpha-radar-bot","symbol":"arbot","description":"What is the project about? Alpha Radar AI (arbot) is an AI-powered Telegram bot that automatically identifies potential alpha from hundreds, thousands of new projects every day. The bot screens and accurately identifies potential projects 24/7, making it the #1 assistant for both experienced crypto investors and newcomers in finding potential investment opportunities! What makes your project unique? 1. Alpha Radar Bot tirelessly searches for and analyzes projects 24/7, something that human researchers cannot achieve 2. The bot extensively search through multiple data sources (eg. X, blockchain explorer, audit report, community activeness) making it easy to identify abundant new projects before they are well-known. 3. The Bot is powered by AI model that is trained with abundant project data, and can identify signals of a project becoming alpha at the very beginning. History of your project. Alpha Radar AI team composed of experienced data scientists, AI experts and cryptocurrency experts. With years of dedication in the Fintech, the team have achieved remarkable success in the web 2.0 Fintech area with solid capabilities in quantitative trading, platform development, data analysis, and more. What’s next for your project? After the successful bot launch, we'll continue to build the \"Alpha Radar Universe\": $ARBOT: holders can enjoy staking rewards, unlock advanced trading features and boost potential alpha candidate they desire AI & data: our core strength to detect alpha through data collection, and our AI determine accurate alpha score Alpha tools: Include alpha new liquidity scanner, alpha radar bot and Alpha Sniper What can your token be used for? - receive staking rewards from tax revenue and subscription fee - boost projects on alpha list and reap rewards upon attainment of genuine alpha - unlock sniper function (similar to Unibot, banana gun)","links":"https://alpharadarbot.xyz/","market_cap":149211,"market_cap_rank":5774,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alpha-radar-bot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x723696965f47b990dff00064fcaca95f0ee01123"}}}