{"name":"GoldPro","id":"ipmb_polygon-pos","symbol":"gpro","description":"What is GoldPro about? Launched by IPMB, the GoldPro Token (GPRO) is a gold-backed token that combines the stability of gold with the speed and efficiency of blockchain technology. Each GPRO is backed by 1 gram of 22-carat gold, offering users a tangible and reliable asset for payments, savings, and investments. Designed to provide a modern alternative to fiat-based stablecoins whilst not being a stablecoin itself, GPRO helps users protect their purchasing power and unlock the benefits of a stable, gold-backed digital currency. What makes GoldPro unique? GPRO stands out as an asset-backed token whilst not being a stablecoin. Its gold-backing ensures that every token holds intrinsic value, providing a hedge against inflation and fiat currency devaluation on the smart contract level. This means that when GPRO tokens are staked, they can always be converted to GEM NFTs with a discount on the weight of each token (1 GPRO = 1 gram of Gold). For example, if GPRO is below the price of 1 gram of gold, IPMB guarantees 1:1 conversion from GPRO to GEM, maintaining GPRO’s intrinsic value of 1 gram of gold and protecting token holders. If the price of GPRO is above the price of gold, then the conversion rate is floating to maximise the conversion incentive and not to draw downward pressure on GPRO. This means that if GPRO is worth twice as much as 1 gram of gold, and you would like to convert to 100 grams of GEM, you would only need to tender 50 GPRO tokens – this example assumes no discounts unlocked through staking, with an 11% discount on GEM, in this case you would tender just 44.5 IPMBs for a GEM100. Yet, as the IPMB Ecosystem grows, the utility of GPRO will grow and could cause a premium to develop above the gold backing of the token. GPRO is deployed on the fast and cost-effective Polygon blockchain, enabling transactions with near-instant settlement and fees as low as $0.01. Enhanced security features, interoperability across EVM-compatible chains, and compliance with regulatory frameworks make GPRO a versatile and trusted asset in the crypto ecosystem. Additionally, users can stake GPRO to unlock discounts on IPMB’s GEM NFTs (tokenized 24-carat gold), offering even greater utility. The primary utility of GPRO is that staking GPROs allows discounts to be unlocked on tokenized gold NFTs. GEM NFTs are stable-NFT assets which are backed and pegged to investment-grade gold. Staking GPRO can unlock up to an 11% discount on GEMs, essentially an 11% on gold. What's the history of GoldPro? The GoldPro Token was launched in 2024 as part of the IPMB Ecosystem - taking over from the previous IPMB Token. The IPMB Ecosystem is an innovative platform that merges gold-backed assets with blockchain technology. Backed by over 8 tonnes of gold, regularly verified through Agreed Upon Procedures by leading global firm Grant Thornton, GPRO was designed to address the need for a stable yet accessible token that can still rise in price. Its initial listing on Coinstore and Bitmart has made it widely available to a global audience. GPRO represents IPMB's commitment to modernizing the way people interact with gold and can provide discounts at select stores, offering seamless access to gold and other values through digital means. What's next for GoldPro? The future of GPRO involves expanding its use cases and integrations within the IPMB ecosystem and beyond. Upcoming initiatives include: Integration with IPMB Marketplace: Users will soon be able to purchase retail spending cards and receive discounts at leading global retailers using GPRO. Expansion of IPMB Vantage: More premium businesses and retail partners will begin accepting GPRO for payments with exclusive discounts. New Exchange Listings: Increasing accessibility and liquidity by listing GPRO on additional major exchanges. DeFi Innovations: Leveraging GPRO in decentralized finance applications, including lending and liquidity provision. What can GoldPro be used for? Gold-Backed Wealth Preservation: Use GPRO as a store of value to protect against inflation and market volatility. Hedging on the weight of each token: Staking GPRO guarantees the conversion to GEM NFTs at least to the weight of each token, together with the potential for more upside depending on the market conditions. Staking Rewards: Stake GPRO to earn up to an 11% discount on GEM NFTs, which represent 24-carat gold. Crypto Payments: Make payments with GPRO at a growing network of merchants via the IPMB Vantage program. Retail Discounts: Purchase spending cards and receive discounts at top global retailers. Portfolio Management: Use GPRO as a stable asset during market downturns, offering an alternative to fiat-based stablecoins.","links":"https://ipmb.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ipmb/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xace7eb41d6bad44907cda84a122f052c74cb7826","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xace7eb41d6bad44907cda84a122f052c74cb7826"}},"is_native":false}