{"name":"Ethereum Message Service","id":"ethereum-message-service","symbol":"ems","description":"What is the project about? Ethereum Message Service (EMS) has come to save the day with a easy-to-use fast UI that makes sending instant messages on-chain that much better! Add emojis, paste ascii art or just meme the night away. The possibilities are endless with EMS, built with automatic hexadecimal translation, writing a message to anyone has never been easier. What makes your project unique? Ethereum Message Service is a unique project in the sense that it has a purpose, it makes things easier for the user. Ethereum transactions can contain all kinds of different things but the one thing that always gets forgotten is the fact that you can send a permanent & transparent message on-chain. The issue that we saw was that it wasn't easy for the average user. So what did we do about it? We added a simple UI and added some emojis, now all the user has to do is type their message in plain text, add the receiver address and press send. History of your project. Most of the above question can probably explain the history of the project, we saw a gap in the tech and decided to fill it. Overall we have been working on EMS for a fair few months now and have no plans to halt any of the development. What’s next for your project? With V.1.0 of our dApp already out and free-to-use for all, the obvious next step is improving. Our motto is onwards & upwards (that might or might not be from movie haha). We are hoping to add whatever the communities heart desires (within reason) but the next update will feature a library of ascii art for them to choose from when sending a message. What can your token be used for? The EMS token—the governance token of the Ethereum Message Service—allows those who hold it to vote on changes to the Ethereum Message Service dApp. Note that anyone, not only EMS holders, can submit proposals for an EMS vote.","links":"https://emservice.gg/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ethereum-message-service/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x247dc9cbbaadabce6e30e2a84ec6c53a419913ad"}}}