{"name":"CENNZnet","id":"centrality","symbol":"cennz","description":"What is CENNZnet? CENNZnet is a New Zealand built public blockchain network which powers decentralised applications (DApps) and the crypto currency CENNZ and CPAY. It's a user-first dapp platform which makes blockchain based services accessible for first time builders and end users so that everyone can enjoy the increased network transparency, data privacy and reliability that decentralisation offers. How does CENNZnet work? The dual token economy CENNZnet uses a unique dual token system in order to help developers, users and token holders get the best from the network. CENNZnet has 2 tokens: CENNZ - the staking token which works separately to block rewards. This means it can increase in value without impacting the cost of using the network. This is important so the price of CENNZ can continue to increase without impacting the amount developers and users pay to use DApps. CPAY is the gas in the network and is used to pay transaction fees. It is also a block reward payment in staking. It’s designed to be algorithmically stable, so it will retain a steady value. This means developers creating DApps on the network can easily predict the cost of their application, and stakers can easily predict the value of their stake. Consensus mechanism: Proof of Stake CENNZnet uses a Proof of Stake consensus mechanism. This is where node operators hold, or stake, their tokens in a particular wallet as collateral against their promise to perform their duties correctly. If they do perform their duties correctly they receive a reward in our CPAY token. If they do not then the staked tokens are slashed, or fined. Other token holders can also stake their tokens against node operators (validators) of their choosing in order to receive a portion of the CPAY reward. This system helps to secure the network by incentivising the community to follow protocol and prevent attacks. Governance CENNZnet functions 100% on-chain using blockchain’s built in voting mechanisms. In CENNZnet governance, validators and node operators are required to vote on proposals using a direct voting mechanism (similar to direct democracy) to achieve consensus. Voting results are governed algorithmically and their automatic execution is built directly into the protocol. The winning decisions then automatically integrated into the chain. CENNZnet pre-built runtime modules DApp builders have access to core CENNZnet modules which provide the building blocks to common functions required for DApp users. NFT Using the CENNZnet NFT module users can mint and sell NFTs on CENNZnet without ever needing to touch a smart contract. Instead, they can create custom NFTs using just a Javascript API or point and click with a UI. CENNZX CENNZX is a spot exchange module which enables a seamless fee payment experience on CENNZnet and makes token exchange instant and easy. The CENNZX Spot eliminates rent extraction and centralised services while prioritising decentralisation, usability and security. Generic Asset Generic Asset protocol enables CENNZnet’s multicurrency economy. The module allows transaction fees to be paid in any asset, provided there’s liquidity in the CENNZX in-chain GAS exchange. CENNZX will then seamlessly convert the asset into the official gas token, CPAY. This streamlines onboarding and in-app experience by eliminating the need for new users to learn about different token types and simply opting for their favoured currency. Doughnut The Doughnut module is the secret sauce of the CENNZnet blockchain. Doughnuts are proofs of delegation between two or more cryptographic keypairs. They allow us to prove that one address delegates something to another address and allows permissions and rules to be carried between different networks without the need for a centralised server. This supports user data privacy whilst maintaining a good user experience.","links":"https://cennz.net/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/centrality/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1122b6a0e00dce0563082b6e2953f3a943855c1f"}}}