{"name":"AstroSpaces.io","id":"astrospaces-io","symbol":"spaces","description":"What is AstroSpaces.io? AstroSpaces.io is building a Web3 integrated social network for all crypto communities! The platform is split into two main products: Coin spaces and community platform. Coin spaces are information board rooms where users are able to chat live with each other, find information about the specific coins and the teams behind those coins. The community platform What benefits does holding SPACES add to holders? As with any social network platform the platform will generate revenues from advertising, listings, account upgrades etc. On AstroSpaces the currency for any and all transactions are bound to the SPACES token and therefore directly reflected by tokenomics. As the token utilise rewards mechanism to reward holders in BNB, holders should continue to increasingly be rewarded as the platforms activity and engagements grow. Holders holding $SPACES in a Web3 compatible wallet will be able to upgrade their account, remove ads and enable unique holder-features including lowered swapping fees when swapping tokens in the coin-spaces! What platform features are currently live? Integrated account upgrades OpenSea NFT integration Communication spaces for listed coins Team profile connection KYC verification with Veriff integration 0x project swap integration Referral system Live portfolio tracker Rewards trackers Audit partner dashboard for auditing firms Community driven supported fuel station Everything expected on a social network Tokenomics: 7–10% rewards (7% for buy and 12% for sell) 4% marketing 1% development Rewards from the tokenomics are distributed once a day depending on volume, as each transaction is limited to a set count of distributions to keep gas at a minimum. There’s no need to claim rewards manually but you could do so from your account if needed. Who are the founders of SPACES? AstroSpaces.io is developed by Jonathan Stoker. The platform is owned by AstroSpaces LLC which was incorporated on January 1st 2022 by Jonathan Stoker and Frederik Filskov. Frederik came on to the project as a passive investor to secure funding for the early and ongoing development process.","links":"https://astrospaces.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astrospaces-io/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x156df0dd6300c73ac692d805720967cf4464776e"},"proof-of-memes":{"decimal_place":18,"contract_address":"0x90242d0a1bc0aace16585848e3a032949539bbcc"}}}