{"name":"MoonTrustBSC","id":"moontrustbsc","symbol":"mnttbsc","description":"\"In MoonTrust, only token holders are allowed to chat, and it will show the actual holding amount at the time of the message. Users are also able to create custom chat channels with customizable token holding requirements. This will help community managers manage their “dolphin” and “whale” holders. MoonTrust system will automatically remove holders who no longer meet the token requirements. MoonTrust also supports payments between friends. When transferring tokens between friends, you no longer need to remember their public address. Simply find your friend using their unique username and send or request as you would just like Venmo. Final confirmation is done via your software wallet. MoonTrust also supports private messaging between friends. Users can also find common tokens held between each other. This allows users to find new friends who have similar token interests. MoonTrust group chat system is a heavily needed system in a space where there are tons of rug pulls making headlines every week. Scammers like to airdrop phishing/scam tokens to random address, but with MoonTrust, the community can warn each other in the specific token group chats. Projects that create fake hype by employing influencers, shillers, or bots, will also be exposed with this chat system. Currently, it is also common that communities are managed by mods who do not own tokens in various Telegram and Discord project groups. These mod services are typically paid in stablecoins, ETH, BNB or BTC, but never the specific project token. In MoonTrust, these types of situations will not happen as holders' token value is displayed and only holders can moderate each other. Any bots or scam offenders banned in MoonTrust will have a direct cost of business to scam groups via gas fees of specific blockchains. Currently banning scammers or bots in Telegram or Discord is free. Malicious actors can easily create thousands of accounts. However, in MoonTrust users can only enter a chat group if they have the tokens. This means for every new account, malicious groups need to send tokens to that address, thus costing them money. MoonTrust is dubbing this “Proof of Gas” mechanism. Just imagine the cost of business for these scam groups when using MoonTrust for the ETH chain. \"","links":"https://moontrust.info/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/moontrustbsc/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe9406b73d4f54572e27d60479905723de08e689e"}}}