{"name":"Smart Money Coin","id":"smart-money-coin","symbol":"smc","description":"\"SMART MONEY COIN is a digital payment system in SMART CITY METAVERSE, a REAL ESTATE NFT RENTAL GAME with Staking, Exchange and Crypto debit card. • SMART MONEY COIN- can be used to to purchase virtual land as well as other goods and services. • SMC is the native token of the project. The current use case for SMC include: o Payment currency: Functions as digital cash and enables users to use SMC as a means of currency to exchange characters, lands, goods and services on SMART CITY METAVERSE. • The project consists of the following major components working in conjunction: o CRYPTO DEBIT CARD: SMC can be used to top up SMC CRYPTO MASTERCARD/ VISA DEBIT CARD so users can withdraw and spend their rewards from the game o SMART MONEY COIN STAKING: A system where we distribute rewards for the members. We have option to allow users to withdraw using SMC or BUSD. SMART EXCHANGE: Smart exchange is a hybrid centralized and decentralized exchange where users can connect using WEB3. We are currently using our KUCOIN Account Liquidity for this exchange project so our users are directly connected for fast processing of deposits and withdrawals. o REAL ESTATE NFT MARKETPLACE: This mainly purpose is for the game. We are allowing users to buy and sell characters from SMART CITY METAVERSE. And users are allowed to buy 3 types of Real Estate Property Unit: 1. Small Apartment 2. Condominium 3. Hotel o GO SHOPPING: An Ecommerce Platform where we will use SMC. It will be partnered with our local company SMC FRESHPLUS in Thailand as our digital partner and marketing arm. Currently the community have 40,000 members. And we will use SMC as our main currency to give rewards and salary for our members. • As at May 29,2022, the total and maximum token supply of SMC is 500,000,000. The current circulating supply is 300,000,000 (~60% of the total token supply). • Learn more about the token distribution of SMC in our website: https:// smartmoneycoin.io Where can I buy SMART MONEY COIN (SMC)? is available for trading on a growing number of exchange like dex-trade, bankcex. And the popular DEX. Pancakeswap and apeswap under Binance Smart Chain.\"","links":"https://www.smartmoneycoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/smart-money-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":8,"contract_address":"0x4d00ddcc526c14fd353131f289b1e62c856e9737"}}}