{"name":"Agritech","id":"agritech","symbol":"agt","description":"What is the project about? AGRITECH is a blockchain project aimed at addressing the global food security problem in the $15 trillion agriculture sector. It integrates agriculture, blockchain, Web3, and AI technology in a single platform. The project uses proprietary traceability and peer-to-peer marketplace technology to connect producers and suppliers with customers globally, ensuring sustainable and scalable supply lines while mitigating fraud and scams. What makes your project unique? AGRITECH is unique because it combines blockchain, Web3, and AI to tackle the global food security problem. The project follows a decentralized wealth model, allowing communities to participate in equity ownership and revenue share of 100% of net income. This approach garners support and acceptance from governments and residents in the communities the project aims to help. History of your project. AGRITECH emerged in response to the COVID-19 pandemic's impact on food supply chains. It implemented proprietary traceability, agriculture AI, and a peer-to-peer marketplace to directly connect producers with buyers, making farming more profitable and sustainable. What’s next for your project? AGRITECH will focus on deploying its traceability and marketplace platform globally, starting with the most vulnerable communities before expanding smartly to maximize support. The project will continue to inform and educate farmers about the benefits of blockchain in agriculture. AGRITECH plans to list on Coin Market Cap, Coin Gecko, and other listing services for maximum market reach. What can your token be used for? AGT tokens can be used throughout the ecosystem, including resorts, retail relationships, and daily transactions on the platform.","links":"https://www.agri-tech.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/agritech/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":19,"contract_address":"0xa9e22e82d5a497c764a9fcd566bc8df933b74fbe"}}}