{"name":"PymeDAO","id":"pymedao","symbol":"pyme","description":"Introduction Pyme is the governance token of PymeDAO, a web3 ecosystem that accelerates the growth of early stage crypto companies. Through their crowdfunding launchpad, pre-launch accelerator and incubator, Pyme is leading consumer adoption in web3. Pyme is a community-led and built ecosystem with a strong belief in supporting projects at their earliest stages and giving its members, from all over the world, access before institutional investors. By holding Pyme, you are supporting and investing in the wider web3 ecosystem with a specific focus on finding mass user adoption and solving real problems through crypto products. Highlight/Vision By holding Pyme, you are investing in tomorrow's web3 breakout stars. As those companies grow, so does the value of Pyme. At PymeDAO, community is key. We give you the biggest rewards for helping launch and scale the leading web3 companies. We do this by working with the best companies, teams and communities at the earliest stages. Technical Overview Pyme is leading consumer adoption of web3 technology. They support projects through Kikx, their crypto native crowdfunding platform, Supapowr, their pre-launch accelerator and Day Zero, an incubator for testing new ideas. All of the ecosystem returns value to the DAO and token. Token Utility and Economics The PymeDAO (PYME) token serves as both a tradable asset and a voting tool within the ecosystem, allowing members to propose and vote on initiatives. Pyme invests, accelerates and launches web3 consumer products. In return, the DAO gets tokens in the projects it supports. The DAO exists to grow DAO assets, help portfolio companies scale and develop the wider Pyme ecosystem.","links":"https://pymedao.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pymedao/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3408636a7825e894ac5521ca55494f89f96df240"}}}