{"name":"Takamaka","id":"takamaka-green-coin","symbol":"tkg","description":"Our blockchain provides native support for two crypto coins. TKG which is a normal, variable value crypto currency like ETH or ADA, that is used for governance as well as paying transaction fees. Half of the TKG supply was introduced in the first block of the blockchain and the remaining half is to be mined through the creation of blocks that are set to be generated every 30 seconds. The second crypto coin is TKR(Takamaka Red) which is a stable coin. All the supply of TKG was created in the first block of the blockchain and cannot be generated anymore through mining or any other means. Blocks are generated by the mining nodes who in turn are decided by the amount of TKG that it’s holders have staked on the individual mining nodes or mining pools. The staking process functions as a voting process in which the stakeholders decide the nodes that will be enabled in the creation of blocks for an epoch. Epochs are time sections of 24000 slots each and every slot is 30 seconds. A slot is the window of time in which a mining node may generate a block and transmit it to the rest of the network. Only the nodes that have been assigned a certain slot may create a block in that timeframe. Blocks created by anyone else would be discarded as invalid. At the beginning of every new epoch, coins paid as fees for the inclusion of transactions in a given block are divided between the node and the stakeholders who voted the node that created that block on a 20/80 basis, where 20% of the coinbase for the generation of the block and the fees for including transactions are given to the node and the remaining 80% go to the stakeholders and are divided amongst them proportionately to their respective amount of stakes. Staking on a node does not freeze that amount and it can be freely used. Stakes for the next epoch are calculated by the balances available at the end of the first third of the current epoch.","links":"https://takamaka.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/takamaka-green-coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}