{"name":"Sekuya Multiverse","id":"sekuya-2_base","symbol":"skya","description":"Sekuya: Revolutionizing Gaming, Racing, and Entertainment in Southeast Asia and Beyond Born from a passionate community, Sekuya is a groundbreaking gaming and entertainment company headquartered in Singapore & Indonesia. With a mission to inspire dreams with passion, Sekuya blends cutting-edge Web3 technology, AI innovation, and world-class creative storytelling to deliver unique experiences in gaming, racing, and entertainment. Flagship Project: Sekuya Saga & Sekuya Multiverse (Upcoming PC Title) Sekuya Saga is a genre-defining Epic Fantasy MOBA RPG that seamlessly combines two of the world’s most popular gaming genres. (Mobile) Set in Novae Terrae, a vast 10-world universe, players, known as \"Jumpers,\" can: Participate in exhilarating 3v3 3 minutes Anime MOBA combat, using favorite heroes, anti heroes, or villains from gacha box. Built in collaboration with Agate Studio, featuring veterans from World of Warcraft and Vainglory, Sekuya has won over 10 industry awards and continues to redefine gaming. Web3 Integration With the introduction of the $SKYA currency, Sekuya champions decentralized ownership and AI-driven co-creation. Web3 features include: True ownership of heroes, items, skills, and pets. Tokenomics that distribute 50% of the final supply to 10 million EVM-compatible wallet holders. Beyond Gaming Sekuya’s vision extends beyond gaming into racing and entertainment: Sekuya Racing: A high-speed racing team featuring talents from Indonesia, Japan, and South Korea. Sekuya Family: A network of 250+ communities with over 10 million collective members. Sekuya Generation: Bridging gaming characters with real-life lifestyle movements. Recognized by the Indonesian Ministry of Creative Economy, Sekuya is a government-supported initiative driving innovations in Indonesia Game Week 2025, Web3 Racing Legends, and Indonesia Legends. From Tokyo Game Show showcases to being named by Coinvestasi as a project founded by one of Indonesia’s most impactful figures, Sekuya invites everyone to join the Sekuya Generation and become part of a movement to redefine entertainment and Web3 culture. Welcome to the Sekuyaverse—where your imagination meets infinite possibilities.","links":"https://sekuya.io/","market_cap":948242,"market_cap_rank":3811,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sekuya-2_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x623cd3a3edf080057892aaf8d773bbb7a5c9b6e9","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x623cd3a3edf080057892aaf8d773bbb7a5c9b6e9"}},"is_native":false}