{"name":"Cronos ID","id":"cronos-id","symbol":"croid","description":"Cronos ID is a decentralised identity and communication layer built on Cronos chain. On a broad level, Cronos ID will give users the ability to send and receive information on-chain, powered by human-readable identifiers. To achieve this, Cronos ID is powered by 3 key subprotocols: * Starting with our Domains, every user will have a unique on-chain identity, allowing you to find friends and exchange crypto with ease * The Notifications service will help the community keep track of key protocol events, alerts, NFT bids and more - gone are the days of manually checking your DApps for bids or collateral factors. * Finally, by leveraging Messaging, users and projects will be able to connect and communicate with each other in a safe and verifiable environment. Tokenomics & Utility $CROID is Cronos ID’s native and governance token to be utilised in Cronos ID’s broader ecosystem. 1. Domain Subscription Module Users may utilize this module to register or extend their ownership over specific domains. Users will pay in $CRO or $CROID, the native underlying chain and native protocol tokens respectively, and may receive discounts based on the durations of their domain registrations 2. Rewards Pool Cronos ID domain holders can deposit their $CROID into maturity vaults to earn $CROID rewards. Users can choose between a 1-month, 9-months, 24-months, and 48-months maturity vaults to lock their $CROID. They will be rewarded with $CROID and $wCRO as staking rewards. Cronos ID concluded its public sale on Nov 17th and started its emission on Nov 18th. $CROID is currently available for trading on VVS Finance at https://vvs.finance/swap Read more about Cronos ID at https://docs.cronosid.xyz/","links":"https://cronosid.xyz/","market_cap":22998889,"market_cap_rank":1018,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cronos-id/logo.png","detail_platform":{"cronos":{"decimal_place":18,"contract_address":"0xcbf0adea24fd5f32c6e7f0474f0d1b94ace4e2e7"}}}