{"name":"CZUSD","id":"czusd","symbol":"czusd","description":"CZUSD is a centrally managed currency with a dollar peg, created to facilitate seamless exchange within the CZODIAC ecosystem. The project focuses on unlocking liquidity for users by offering an easy way to convert BNB into CZUSD, transfer assets, and access a variety of products and services within the ecosystem. CZUSD operates differently than traditional stablecoins, as it functions more like a centrally managed currency with a dollar peg, allowing for greater control over its monetary policy to support growth within the ecosystem. One of the unique aspects of CZUSD is the implementation of both capital controls through the CzusdGate and a flexible exchange rate through the ScorchPeg technology. While the general goal is to maintain a 1:1 peg with BUSD, CZUSD may trade at different rates, and it should not be viewed as a strict rule. This flexibility ensures that CZUSD can adapt to market conditions and maintain a stable value in relation to USD. In the future, CZUSD plans to continue evolving and expanding its offerings within the CZODIAC ecosystem. This includes adding more BEP20 tokens, NFTs, and DeFi products for users to access and trade. The project's focus remains on providing a reliable and secure gateway for users to unlock liquidity and interact with the growing ecosystem. CZUSD can be used for various utilities within the CZODIAC ecosystem. Users can purchase a wide range of BEP20 tokens, such as LSDT, DGOD, LRT, and more. Additionally, CZUSD can be utilized to acquire NFTs like USTSD Silver Dollar NFTs and participate in DeFi products like CZUSD Notes. By offering these utilities, CZUSD aims to provide users with a comprehensive and versatile platform for accessing and trading various products and services within the CZODIAC ecosystem.","links":"https://czodiac.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/czusd/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe68b79e51bf826534ff37aa9cee71a3842ee9c70"}}}