{"name":"Brrr de Money","id":"brrr-de-money","symbol":"brrr","description":"BRRR Token is the heart of the Brrr de Money ecosystem, a community-driven meme coin that combines the power of humor, blockchain technology, and financial innovation. Designed to be the coin of the people, BRRR is all about creating wealth through fun, community engagement, and decentralized governance. The tokenomics of BRRR include 100% liquidity allocation, ensuring a fair and transparent approach to its distribution, with no team allocation. This allows all holders to benefit equally from the token's growth, while empowering the community to drive key decisions through governance. The BRRR Sniper Bot is a cutting-edge, high-speed, multi-chain trading tool designed to enhance the BRRR ecosystem. Optimized for experienced traders, the bot offers fast, efficient, and customizable trade execution across multiple blockchains such as Ethereum (ETH), Binance Smart Chain (BSC), Solana (SOL), Base, and SUI. With advanced features like real-time transaction monitoring, price and volume alerts, and copy trading, the BRRR Sniper Bot allows users to automate their trades, track top-performing strategies, and make quick, informed decisions. With BRRR Token driving the community and BRRR Sniper Bot delivering cutting-edge trading tools, the ecosystem is designed to make meme-based wealth creation a reality while empowering holders to actively participate in governance and decision-making. Together, they form the foundation of a decentralized, community-first platform where every member has a chance to shape the future of crypto in their own way.","links":"https://www.brrrdemoney.com","market_cap":91215,"market_cap_rank":6765,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/brrr-de-money/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7dd7d5ca67df3e0f5a7f004af3653444b1fcfb76","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x7dd7d5ca67df3e0f5a7f004af3653444b1fcfb76"}}}