{"name":"Spores Network","id":"spores-network","symbol":"spo","description":"Spores Network is building a multi-chain interoperable NFT marketplace and DeFi protocols for Creative Industries: Animation, Collectibles, Digital Artworks, Fashion, Gaming, Sport Cards. Spores Network founders deeply believe that a digital “metaverse” is being built today that will revolutionize our thoughts and behavior with respect to living, owning, sharing our physical and digital lives. Crypto enables two exciting and eventual two paths: Decentralization of Ownership, Frictionless Redistribution of Capital. Spores seeks to empower creators to create, exchange, and communicate their life’s work. Our Core Values are defined as: Creator Centricity, Frictionless, Borderless, Community. The native digital cryptographically-secured fungible (i.e. ERC20 / BEP20) token of the Spores platform (ticker symbol SPO) is a transferable representation of attributed governance and utility functions specified in the protocol/code of the Spores platform, and which is designed to be used solely as an interoperable utility token on the platform. SPO is designed to be NFT-creator-centric and DeFi-community-driven, and to incentivize all contributors and participants across the whole Spores ecosystem. As the economic incentive for network participation SPO token incentives will be distributed to incentivise users to participate in community governance, reward contributors on the platform and other utility purposes including platform fees discount. Community incentives (NFT minting, trading, LP mining and other DeFi rewards):  Reward for NFT creators for each newly minted NFT on Spores platform.  Reward for buyers and sellers per confirmed transaction (auction, exchange, etc).  Reward for LPs to provide liquidity on the platform supporting transactions related to SPO.","links":"https://spores.app/","market_cap":212295,"market_cap_rank":6349,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spores-network/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcbe771323587ea16dacb6016e269d7f08a7acc4e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xcbe771323587ea16dacb6016e269d7f08a7acc4e"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x8357c604c5533fa0053beaaa1494da552cea38f7","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x8357c604c5533fa0053beaaa1494da552cea38f7"}}}