{"name":"Cosmos Hub","id":"cosmos_binance-smart-chain","symbol":"atom","description":"The Cosmos network consists of many independent, parallel blockchains, called zones, each powered by classical Byzantine fault-tolerant (BFT) consensus protocols like Tendermint. Some zones act as hubs with respect to other zones, allowing many zones to interoperate through a shared hub. The architecture uses classic BFT and Proof-of-Stake algorithms, instead of Proof-of-Work. Cosmos can interoperate with multiple other applications and cryptocurrencies, something other blockchains can’t do well. By creating a new zone, you can plug any blockchain system into the Cosmos hub and pass tokens back and forth between those zones, without the need for an intermediary. While the Cosmos Hub is a multi-asset distributed ledger, there is a special native token called the atom. ATOM have three use cases: as a spam-prevention mechanism, as staking tokens, and as a voting mechanism in governance. As a spam prevention mechanism, ATOM are used to pay fees. The fee may be proportional to the amount of computation required by the transaction, similar to Ethereum’s concept of “gas”. Fee distribution is done in-protocol and a protocol specification is described here. As staking tokens, ATOM can be “bonded” in order to earn block rewards. The economic security of the Cosmos Hub is a function of the amount of ATOM staked. The more ATOM that are collateralized, the more “skin” there is at stake and the higher the cost of attacking the network. Thus, the more ATOM there are bonded, the greater the economic security of the network. Atom holders may govern the Cosmos Hub by voting on proposals with their staked ATOM.","links":"http://cosmos.network/","market_cap":954575200,"market_cap_rank":100,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cosmos_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0eb3a705fc54725037cc9e008bdede697f62f335","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x0eb3a705fc54725037cc9e008bdede697f62f335"}},"is_native":false}