{"name":"FIAS","id":"fias","symbol":"fias","description":"Fias is a multi-purpose layer 1 token built natively on the DevvX blockchain and bridged to Ethereum. The primary function serves as the intermediary and liquidity mechanism for metaverse & digitally native digital assets such as video game items on devv.exchange. Developers can utilise the innate utility and functionality of Fias and explore a deeply connective and interoperable “Digital Financial Ecosystem” within their own applications and designs, including infinite TPS, sub - second finality and a simple web2 to web3 bridge which can port any existing item inventory into the ecosystem and back to a game server with a simple API integration. No blockchain experience is required. Fias will also be used for liquidity contributions to create treasuries and grow communities that operate across the DFE and earn rewards for participation. DevvExchange is setting the new gold standard of value exchange between all forms of digitally native assets & RWAs. DevvExchange is a fully non-custodial settlement layer, with Contingent Transaction Sets for Mathematically Instant Settlement. Its unique sharding architecture enables complete local, cross jurisdictional and operational compliance measures for enterprise grade applications and globally connected gaming and social media economies. The DFE is not just a marketplace, it's a core piece of infrastructure that enables marketplaces. The technological overhang of Fias has the capacity to catapult new and existing metaverse applications by combining globally compliant peer to peer transactions, with limitless scalability and simple onboarding for any existing titles within our “Digital Financial Ecosystem”, and is the first of its kind in the blockchain industry.","links":"https://devve.io/fias/","market_cap":1720337,"market_cap_rank":3059,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fias/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8e4f1ce473b292d56934c36976356e3e22c35585"}}}