{"name":"Bitcoin Black Credit Card","id":"bitcoin-black-credit-card","symbol":"bbcc","description":"The Bblack Black Card project aims to revolutionize how the crypto elite manage and spend their digital assets by providing an exclusive high-limit crypto card. Our purpose is to offer a seamless bridge between the crypto world and traditional finance, enabling effortless crypto-to-fiat conversion and instant spending in over 140 countries. With only 10,000 memberships available globally, we ensure a high level of exclusivity and provide our members with unparalleled financial freedom and luxury. Functionally, the Bblack Black Card allows users to convert various cryptocurrencies into fiat seamlessly, making it ideal for both everyday purchases and high-end transactions. The card is supported by a user-friendly mobile app, which offers 24/7 customer support and access to a range of exclusive benefits. Members can enjoy bespoke concierge services, private jet bookings, and invitations to private events, all designed to enhance their lifestyle and offer them the highest standards of comfort and convenience. The Bblack Black Card stands as more than just a financial tool; it is a symbol of prestige and privilege. Our partnerships with multiple banks ensure the security and privacy of our members' funds, and the card itself can be resold as an asset, adding another layer of value. By integrating the $BBCC token into our ecosystem, we offer a unique gateway for members to acquire the card and participate in our financial revolution. Our goal is to set a new standard for crypto excellence and prestige, providing our members with the ultimate financial experience.","links":"https://www.bblack.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitcoin-black-credit-card/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbbcc7c16d56fc3b0c0a9a2ced36c74bcf73e683e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xbbcc7c16d56fc3b0c0a9a2ced36c74bcf73e683e"}}}