{"name":"NX Token","id":"nx-token","symbol":"nx","description":"NX Finance: A Comprehensive Yield and Point Leveraging Protocol on Solana Launched in Q2 2024, NX Finance is a decentralized yield and leverage protocol designed to offer a wide range of financial strategies within the Solana ecosystem. The platform integrates both yield aggregation and PointFi mechanisms, allowing users to maximize returns through leveraged positions, yield farming, and point-based rewards. As a composable leverage protocol, NX Finance supports multiple strategies tailored to different risk tolerances, enabling users to optimize their financial returns in a manner aligned with their specific investment goals. Key Features Leverage Strategies: NX Finance provides several leveraging options to enhance yields. The platform allows up to 10x leverage on interest-bearing assets through its Fulcrum Strategy, which uses Jupiter Liquidity Pool (JLP) as the underlying asset. Users can also leverage their positions up to 10x through the Gold Mining Strategy, which focuses on point farming and maximizing airdrop rewards. Diverse Collateral Options: The platform currently supports the use of Solana-based liquid staking tokens (LSTs) like vSOL and jupSOL as collateral, with plans to expand collateral types further. This flexibility allows users to choose collateral that aligns with their risk appetite and market outlook. No Active Management for Lenders: Lenders on NX Finance can deposit assets such as SOL or USDC into lending vaults without the need for active management. The platform’s automated strategies handle yield generation while protecting the principal, ensuring steady returns without requiring continuous user intervention. Fee Structure: NX Finance adopts a transparent fee model. A 10% performance fee is charged only on profits, with no fees applied in the event of losses. This contrasts with competitors who charge fees regardless of performance, creating a more favorable environment for users.","links":"https://nxfinance.io/","market_cap":2565399,"market_cap_rank":2952,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nx-token/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"BAsnXPVYuvZDfEFR7tmu9sG9gPyHy58Jpjs2AuUw1FLx"}}}