{"name":"Minnapad","id":"minnapad","symbol":"minna","description":"What is the project about? Founded in 2022, Minnapad is a pioneering DAO launchpad on the Polygon chain. Based in Japan and Singapore, the platform brings together creators and fans of Japanese legends and icons to co-create groundbreaking intellectual property (IP). Notable industry figures, including Keiji Inafune (the producer of Mega Man series) and Seiichi Ishii (the director/main designer of TEKKEN series), each spearhead a DAO on Minnapad. Minnapad announced the backing of the Japan External Trade Organization (JETRO), one of the arms of the Japanese government in July 2023. What makes your project unique? Minnapad is the only DAO launchpad dedicated to giving power back to the creators and fans of Japanese legendary icons. It stands out as a revolutionary Create-to-Earn DAOs' Launchpad and NFT Marketplace, unlocking unprecedented opportunities for the expansive entertainment community. Enthusiasts now have unprecedented access to legendary Japanese creators and icons, ushering in a new era of collaboration and immersion. As trailblazers in the content creation domain for Japanese pop culture, Minnapad is spearheading a movement that empowers artists, storytellers, and visionaries alike. By providing a trusted and innovative platform, we foster an environment where creators and fans can co-create the next phenomenal intellectual property (IP). Where can you buy Minnapad (MINNA)? MINNA tokens can be traded on centralized crypto exchanges and decentralized exchanges. The most popular exchange to buy and trade MINNA is Coinstore and MEXC. How to add Minnapad (MINNA) to MetaMask? Adding Minnapad (MINNA) to MetaMask allows you to view your token holdings, trade on centralized exchanges, and more. To add them, you’ll need to import MINNA as a token. You can copy MINNA’s contract address (0xB3AfB63A5EC74ab2dE7e33198af285A79f99E0CB) and import it manually, or if you've installed MetaMask's chrome extension, add MINNA to MetaMask with one click on CoinGecko. History of your project Established in Singapore in 2022, forming a core team from Tokyo and South East Asia, and successfully launching MVP and the first two DAOs — Mega Man’s Keiji Inafune and TEKKEN’s Seiichi Ishii in July 2023. What’s next for your project? Strategically expanding our roster of renowned creators to enable the launch of 10 DAOs annually. Each of these DAOs will provide inclusive spaces where individuals can collaborate with esteemed icons to create manga, anime, and games. By actively contributing, members can earn rewards generated from the content they produce. What can your token be used for? MINNA token serves as an utility token on Minnapad. MINNA token provides users with early access and discounts to new DAOs, rewards from Minnapad revenue, ultimate rewards in the Metaverse, and discounts on all DAO-created items. Holding MINNA tokens grants exclusive privileges and incentivizes participation in the ecosystem. It is a valuable digital asset that adds significant value to decentralized autonomous organizations.","links":"https://minnapad.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/minnapad/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xfbe59ebf7a188045c87c4a65093ed1e50520408b"}}}