{"name":"XOO","id":"xoo","symbol":"xoo","description":"The XOOCITY project aims to create a virtual land NFT platform that replicates real-world cities, starting with Hong Kong, in the metaverse. The platform allows users to sell, stake, and develop NFT-based applications on virtual land. The initial offering includes over 300,000 virtual land plots, with plans to expand to other major cities like Tokyo, New York, London, and Paris in the future. Key aspects of the project include: 1. **Virtual Land Ownership**: Users can purchase virtual land NFTs to build various structures such as games, office buildings, clubhouses, business facilities, expo centers, and shopping malls. 2. **Metaverse Development**: XOOCITY aims to build a comprehensive metaverse ecosystem that integrates blockchain, NFTs, augmented reality (AR), virtual reality (VR), and 3D engines to enhance user experiences. 3. **Economic Opportunities**: The platform provides opportunities for virtual tourism, social connections, gaming, shopping, and business activities. It also aims to democratize access to metaverse development and create new jobs and economic opportunities in the metaverse/web3 creator ecosystem. 4. **Token and Marketplace**: The XOO token is the native currency of the platform, facilitating transactions and enabling users to earn and spend within the metaverse. XOOCITY is also developing an NFT trading market to allow users to trade and exchange NFT assets. 5. **Community and Partnerships**: XOOCITY is building a community of users and strategic partners to support the development and growth of the metaverse. This includes collaborations with government agencies, technology companies, and investment institutions. Overall, XOOCITY aims to revolutionize virtual real estate and provide a platform for immersive digital experiences, blending elements of gaming, social interaction, and business in a metaverse environment.","links":"https://www.xoocity.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xoo/logo.png","detail_platform":{"polygon-pos":{"decimal_place":2,"contract_address":"0xcf2d710d8ebeb62e67a4e50e9933551121c2316e"}}}