{"name":"Agentory","id":"agentory_ethereum","symbol":"agnt","description":"Agentory is a no-code AI automation platform for building intelligent agents across communication, workflow, and business layers Agentory offers a unified solution that integrates voice, text, and task automation through a modular and scalable architecture. Interactive Voice Agents Interactive Voice Agents are one of Agentory's most dynamic modules. These agents are built to make two-way, AI-driven voice calls that simulate natural conversations, perform defined tasks, and adapt to user responses. Unlike traditional voice bots with rigid scripts, Agentory's voice agents are context-aware and designed for real-world performance. WhatsApp Automation Agents WhatsApp Automation Agents in Agentory are designed to automate customer communication workflows on one of the most widely used messaging platforms in the world. These agents manage conversations at scale, handle logic-based message flows, and ensure high responsiveness without human intervention. Text and Content Agents Text and Content Agents in Agentory are designed to assist users in generating structured, intelligent written content across various formats. These agents can draft emails, write product descriptions, personalize outreach messages, or produce long-form articles with speed and accuracy. Business Logic Agents Business Logic Agents are built to handle structured, internal workflows that follow predefined rules and operate across multiple systems. These agents specialize in automating tasks such as order processing, expense logging, report generation, and data syncing between departments or tools.","links":"https://agentory.net/","market_cap":8614.34,"market_cap_rank":11468,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/agentory/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1492f93d9df1d01c92d753ce55d09d9d3e5ccc9d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x1492f93d9df1d01c92d753ce55d09d9d3e5ccc9d"}},"is_native":false}