{"name":"Pumpopoly","id":"pumpopoly","symbol":"pumpopoly","description":"Pumpopoly is a virtual real estate simulator reminiscent of classic real estate board games. Playable on all devices, the game features pixel art on an animated HTML5 canvas. The design objectives are simple: Provide players and promoters a fun and entertaining way to collect tokens passively. Player movement: Players collect a salary from the treasury on every move. However, if they arrive at another player's land they must pay rent to the owner for the privilege of parking. Parking is free at all lands owned by the City of Pumpopolis. Philosophy: Pumpopoly features a dynamically expanding game world. Land is an unending resource for players to improve upon. New city owned land is added an exponentially higher price for your satisfaction. Pumpopoly's dynamic game expansion ensures that in-game movements always have a lower average cost relative to the salary provided by the treasury. Buildings: There are currently five property types within the game: vacant, hovel, small townhouse, large townhouse and executive tower. All property types have 256 pixel art variations. City lands are sold as vacant lots. Players may upgrade their land by building improvements. Each improvement provides an exponential increase in rent. Level up: Players must have a qualifying in-game credit score to build improvements on their land. In-game credit scores are determined by the number of lands owned and the total number of active invitees. Additionally, players earn 50% commissions on all city land purchased by their invitees. Tokens: Pumpopoly players can choose to sell their land on the in-game market or export their property to a non-fungible token. All purchases within the game are denominated in native PUMPOPOLY fungible tokens. PUMPOPOLY is issued solely from the game contract. Similar to land prices, the price of PUMPOPOLY tokens sold by the game contract increases at an exponential rate as they are issued.","links":"https://pumpopoly.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pumpopoly/logo.png","detail_platform":{"near-protocol":{"decimal_place":24,"contract_address":"token.pumpopoly.near"}}}