{"name":"TrumpCEO","id":"trumpceo","symbol":"trumpceo","description":"Trump CEO is a new cryptocurrency token that has been growing organically and the community has been building daily along with its popularity. It set out to be a true community driven project where the holders choose the direction of the project. This will be done through voting and communications with our community cross the social platforms. The team behind Trump CEO is made up of experienced developers and blockchain enthusiasts who are committed to creating a secure, transparent, and decentralised platform. Trump CEO is meme token that gives holders USDT rewards from holding at 4% of each transaction. Trump CEO has a total supply of 420 quadrillion tokens, of which 58.99% have been burned, along with the supply reducing through an automatic burn on each transaction within the contract to give Trump CEO an always reducing supply.To ensure the community that it is fully a community project the contract was also renounced shortly after launching onto Pancakeswap. Trump CEO will aspire to offer several features and benefits to it’s valuable users. The holders of Trump CEO will be able to vote on utilities and already have huge demand and agreement for a NFT collection. The team will use their skills and knowledge to deliver utilities the community vote for and will always let it be the communities decision. The holders of Trump CEO also benefit from receiving automatic rewards in USDT from transactions of the token. There is a 4% reward of USDT rewards along with 2% Auto burn on each transaction. There is also 4% which goes to the marketing and development wallet for the project to enable a long sustainable future. The team has set up various social media channels where users can interact with each other and with the developers. There is already a growing community of people in the global telegram group and also within the international community groups to allow a space for people to interact. The community is encouraged to suggest ideas.","links":"https://trumpceo.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trumpceo/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x1f76aadeaba6a6a39fae849c20c5c5638058b4c2"}}}