{"name":"MetaLandmap","id":"metalandmap","symbol":"mland","description":"By working in partnership with graphic designers, game developers and Architects, you will be able to purchase and use real estate projects that we have made with MLAND. MetaLand is a virtual reality platform powered by the Binance Smart Chain blockchain. Users can create, experience, and monetize content and applications. Land in MetaLand is permanently owned by the community, giving them full control over their creations. Users claim ownership of virtual land on a blockchain-based ledger of parcels. Landowners control what content is published to their portion of land, which is identified by a set of cartesian coordinates (x,y). Contents can range from static 3D scenes to interactive systems such as games. Land is a non-fungible, transferrable, scarce digital asset stored in an Ethereum smart contract. It can be acquired by spending an BEP20 token called MLAND. MLAND can also be used to make in-world purchases of digital goods and services. People are spending increasingly more time in virtual worlds, for both leisure and work1. This occurs predominantly in 2D interfaces such as the web and mobile phones. But a traversable 3D world adds an immersive component as well as adjacency to other content, enabling physical clusters of communities. Unlike other virtual worlds and social networks, MetaLand is not controlled by a centralized organization. There is no single agent with the power to modify the rules of the software, contents of land, economics of the currency, or prevent others from accessing the world. This document lays out the philosophical underpinnings, technical foundations, and economic mechanisms of Decentraland. The adjacency of land makes MetaLand parcels unique from web domains. New land parcels must be contiguous to existing ones. This adjacency allows for spatial discovery of new content and the creation of districts devoted to a special topic or theme. While each web domain can have an unlimited number of hyperlinks to other content, parce","links":"https://www.metalandtoken.info","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metalandmap/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x349a1b99944914628d13963e2905d6da95695f3b"}}}