{"name":"Offshift anonUSD","id":"offshift-anonusd","symbol":"anonusd","description":"# What is Offshift anonUSD (anonUSD)? Offshift is pioneering Private Decentralized Finance (PriFi) with an ecosystem of Private DeFi Applications that confer and protect various elements of privacy, anonymity, and confidentiality on Ethereum Layer 1. All Offshift Ecosystem PriFi Applications are powered by XFT. Offshift anonUSD is an algorithmic stablecoin that is created when a user Shifts XFT on Offshift’s fully on-chain, non-custodial platform [Offshift anon](https://app.offshift.io/). Offshift anon dissolves the existing tradeoffs between privacy and yield generation by dissociating users from their assets via the Mint-and-Burn Tokenomics native to the Offshift Ecosystem. Offshift anon’s Burn-and-Mint Mechanism burns a user’s XFT and mints an equal value in anonUSD. At any point, a user may also Shift from anonUSD back into XFT, and the process reverses. A full description of Offshift anon can be found in the [Offshift anon Litepaper](https://open.offshift.io/offshiftXFT/new-papers/-/blob/main/Offshift%20anon%20Litepaper.md). # What is the Role of anonUSD in the Offshift Ecosystem? anonUSD is Offshift’s first anonAsset. It allows users to explore opportunities to engage DeFi applications while remaining fully anonymous, so they can both invest in the technologies they support and generate yields without the drawbacks related to exposure and public profiling. # How Many anonUSD Tokens are in Circulation? The circulating supply of anonUSD varies as users burn XFT to mint anonUSD, and burn anonUSD to mint XFT. # Who are the Founders of Offshift? Offshift Core is the anonymous team developing the Offshift Ecosystem. Offshift Core has developed a trusted reputation for its thorough privacy research, development, and execution. # Where Can I Buy anonUSD? anonUSD is available for trading on a growing number of DEXs, including [Uniswap](https://info.uniswap.org/#/pools/0x12ded3d75fae8b27cd7f2b1a469fe088a3711dde).","links":"https://offshift.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/offshift-anonusd/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5a7e6c8204a1359db9aacab7ba5fc309b7981efd"}}}