{"name":"ProtoKOLs","id":"protokols","symbol":"kol","description":"ProtoKOLs is a data-driven platform designed to track and analyze the influence of Key Opinion Leaders (KOLs) within the Web3 and cryptocurrency sectors. It offers a comprehensive set of tools for users to monitor KOL activities, such as token mentions, engagement rates, and the performance of their token-related calls. The platform integrates both on-chain and off-chain data to assess the influence of KOLs, providing metrics like audience size, wallet size of followers, and the average KOL score of their audience. One of ProtoKOLs' key features is the ability to track the performance of KOLs based on their token mentions. The platform provides insights into the return on investment (ROI) of tokens called by KOLs, offering users a historical and current view of how well these calls have performed. This feature is complemented by AI-driven analysis of engagement, which assesses the quality of replies and interactions a KOL receives on their posts. ProtoKOLs also allows users to create custom lists of KOLs to track, enabling them to monitor specific influencers more closely and receive notifications in real time when these KOLs mention certain tokens or projects. Additionally, the platform provides insights into trending KOLs and projects, offering users a broader view of what is currently relevant in the Web3 space. By combining real-time tracking, in-depth data analysis, and customizable KOL lists, ProtoKOLs helps users make informed decisions about the KOLs they follow and the projects they engage with. The platform is designed for individuals and businesses looking to navigate the fast-paced, data-driven environment of cryptocurrency and blockchain influence.","links":"https://www.protokols.io/","market_cap":13822655,"market_cap_rank":1590,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/protokols/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd888a5460fffa4b14340dd9fe2710cbabd520659"}}}