{"name":"Alpha Gardeners","id":"alpha-gardeners","symbol":"ag","description":"What is the project about? The all-in-one alpha discord & telegram with a complete toolkit for successful shitcoins and NFTs trading What makes your project unique? We have diligently dedicated over two years to developing our cutting-edge tool, which now boasts comprehensive features for monitoring tokens on both Discord and Telegram platforms. History of your project. After six months of intensive development, we successfully launched our bots on the SOL chain, incorporating NFT functionality that we had been building for an additional half year. Subsequently, we introduced ETH-based NFTs, focusing on monitoring bots. However, during that period, our efforts seemed to go unnoticed, and we faced challenges in gaining recognition for these tools. Nevertheless, we persevered and made strategic adjustments, shifting our focus towards supporting various shitcoins. As a result, we now have a diverse portfolio of shitcoin bots. Today marks a significant milestone, as we just launched our very own TOKEN, which has quickly gained traction, reaching a valuation of around $2 million. We are excited about this positive progress and look forward to continued growth and success in the future. What’s next for your project? We never stop building we have so many ideas which takes lot of time to make them real, but we chose this slow organic way so we cant complain hahah What can your token be used for? we have specific tiers Tier-1 (5,000,000 AG) New-contract - Recent smart contract creation New-pair - Fresh token pairing Locked-pair - Liquidity locked pair Liquidity-added - Liquidity pool created Bullish-deployer - Promising project creator Degen-pulse - Alert for profitable opportunities Tier-2 (10,000,000 AG) Ape-alert - Eth Mempool Monitoring Fresh-wallets alert- Trigger-based on insiders Tier-3 (15,000,000 AG) Alpha Tracker - Comprehensive wallet monitoring tool Threesome Alert - Tracker wallets with combined alpha Hall of Whales - Elite crypto insights community","links":"https://alphagardeners.xyz/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alpha-gardeners/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcc8e21f599995d1c8367054841b8af5024ddf01b"}}}