{"name":"JoyStick","id":"joystick-labs_binance-smart-chain","symbol":"jsk","description":"Launched in Q3 2025, Joystick Labs is a Web3 gaming infrastructure project focused on bridging traditional gaming with decentralized technologies. The project is developed by an international team with core contributors based in Europe and Asia, and aims to create a unified environment where players, developers, and content creators can interact, build, and engage in gaming experiences powered by blockchain. At the core of the ecosystem is the Freetyl platform, a decentralized application (DApp) that functions as a social and functional hub for Web3 gamers. Freetyl allows users to discover games, play, stream, earn, and connect with their communities. Designed as a multi-purpose interface, Freetyl integrates game aggregation, content streaming, player interaction, and monetization tools into a single platform. The ecosystem also includes Joystick Labs Games (JLG), an internal game development initiative that produces 2D and 3D games. These titles are designed to integrate blockchain features such as asset ownership, in-game economies, and tokenized reward systems, and are built to work natively within the Joystick Labs ecosystem. To support learning and innovation in the Web3 gaming space, Joystick Labs has developed BackRoom Academy, an educational arm of the platform that offers structured programs, courses, and workshops. Topics include blockchain game development, GameFi, esports, and community building, targeting both newcomers and professionals seeking to adapt to Web3 technologies. The native utility token of the platform is $JSK, deployed on Binance Smart Chain (BSC) with the contract address: 0xB85447b4854e848904471728e6106356bCb4861B The maximum supply is capped at 1.5 billion tokens, with distribution allocated across several segments including public sale, team and advisors, ecosystem rewards, staking, treasury, marketing, liquidity, and partner incentives. The $JSK token is used to: Facilitate transactions and in-app purchases within the ecosystem. Enable access to premium platform features and exclusive game content. Participate in governance mechanisms such as voting on future developments. Incentivize active users, developers, and content creators. Joystick Labs is built with support from the NEAR Protocol, and is technically integrated with several partners including Livepeer (for decentralized video infrastructure), Trikon, Bandzai, Nexal, and Ninja Game Build, enabling scalable, modular, and decentralized application deployment. The project roadmap consists of multiple stages: concept development, MVP release, token generation and distribution, product launches, CEX/DEX listings, community scaling, and further ecosystem expansion through staking, creator tools, and advanced interoperability. Joystick Labs is designed to support the evolution of a transparent and creator-driven gaming economy, powered by blockchain-native infrastructure and governed by the community. Its modular approach to game development and content delivery allows for scalability, sustainability, and continued innovation in the Web3 space. Additional technical and project documentation can be found on the official website: 👉 https://www.joysticklabs.io","links":"https://www.joysticklabs.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/joystick-labs/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb85447b4854e848904471728e6106356bcb4861b","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xb85447b4854e848904471728e6106356bcb4861b"}},"is_native":false}