{"name":"X Community","id":"x-community_solana","symbol":"x","description":"The X Community is a groundbreaking memecoin project that aims to blend meme culture with the rapidly growing cryptocurrency ecosystem. Launched on Solana on December 30, 2023, $X is the first-ever single-letter memecoin, named after the letter “X.” The simplicity and universal appeal of “X” make it a powerful symbol in both the crypto world and popular culture, distinguishing $X from other memecoins. Initially introduced by a group of international enthusiasts, $X quickly gained attention for its unique concept. In November 2024, the project underwent a pivotal shift, with control transitioning to a passionate, community-driven leadership. This new focus on decentralized governance and community involvement led to rapid growth. Within just a month, $X’s market value surged to over $10 million, and the user base grew to an impressive 180 million individuals. The X Community is currently the leading DeBox community with 55,000 active members, and its growth is fueled by exciting partnerships. A significant collaboration with the OKX-Web3 wallet for giveaways has already attracted over 42,000 participants, and the project aims to reach 100,000 active users by January 2025. The core vision of the X Community is to help 100 million people embrace memecoins and make meme culture a central part of the crypto world. By creating a fun, engaging, and inclusive environment, the project aims to bridge the gap between entertainment and financial empowerment. Looking to the future, the X Community plans to expand the utility of $X through staking, yield farming, and deeper integrations within the decentralized finance (DeFi) space. The project also aims to broaden its partnerships and create new use cases for the token, ensuring its place as a fun yet valuable asset in the crypto ecosystem.","links":"https://xcommunity.vip/","market_cap":174759,"market_cap_rank":6098,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/x-community/logo.png","detail_platform":{"solana":{"decimal_place":5,"contract_address":"EhkDgP8e5sz16AFCWUCYJzVug1zvpDLTEHxH4WAFpBFA","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/EhkDgP8e5sz16AFCWUCYJzVug1zvpDLTEHxH4WAFpBFA"}},"is_native":false}