{"name":"XMetaversal","id":"xmetaversal","symbol":"xmeta","description":"XMetaversal’s Mission Statement: In the simplest terms for those new to Crypto and NFTs – Web. 3.0 is going to move as fast as information and social media do now across the internet, but now instead of the internet, metaverses will be built to move your Digital currencies and assets around the world as fast as information does like your email using various protocols and blockchain technology. Eventually, you will be immersed into this augmented reality the same way you are with social media web 2.0. Xmetaversal’s Mission is to bring the decentralized metaverse to the people using the XRP Ledger/Blockchain for speed of payments and Zero gas fees for NFTs within XGalaxies Metaverse ECO system we call XPlanets. We will be Launching different ecosystems within each XGalaxy and on Each XPlanets. From Gaming to Art in all types of Forms and Styles, from simple pixel virtual to 3d augmentation reality for all imaginations but that’s not everything XMetaversal is all about. We will be launching Social Network XPlanets, Defi XPlanets, Music XPlanets, Casino, and Nightlife XPlanets everything needed for a thriving online Metaverse Ecosystem, which in time will turn into a real Augmented ecosystem on the blockchain decentralized. With many Artists, Developers, Entrepreneurs, and other projects building on top of it. Eventually, all these blockchains will cross-chain into one Metaverse. The Metaverse will be much larger than just playing to earn games. It will expand into all parts of your life where there will be a place for many to earn in many ways in the metaverse from Chefs, Fitness, weight loss, crypto banking just about everything that’s on the internet today it will just be on decentralized blockchains – like XGalaxies. We will be launching all these Eco-Systems into our Metaverse in a way where it will be simple for everyday people to digest. For the most, it’s out of the realm to create and they don’t see the vision just yet. Therefore, we are compartmentalizing it into XGalaxies and XPlanets for our XMetaversal ecosystem, XMetaversal will create the vision and eco-system and build out the road map that everyone will be welcome to build on top of creating their own business and ecosystems in a decentralized metaverse where there will be no borders like there is in the real world. XGalaxies NFT’s Coming Soon . NFT’s that we will create In-house to get started Futuristic XGalaxies NFTs broken down into 1000 fractional pieces XPlanets in each Galaxy Broken down into 100 Fractional Pieces XSpacecrafts broke down into 10 Fractional Pieces – XGalaxians Minted XSub-Humans Minted XAliens Minted XFuturistic Buildings Minted","links":"https://xmetaversal.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xmetaversal/logo.png"}