{"name":"dForce","id":"dforce-token_binance-smart-chain","symbol":"df","description":"dForce is advocating for building a full suite of DeFi protocols covering assets, lending, trading, staking, and bridge, serving as DeFi infrastructure in Web3. dForce DAO is a community-driven project, with major protocol changes driven by the community and jointly decided by DF token holders through governance. Stablecoin USX USX is the most important DeFi primitive within dForce’s protocol matrix. As a decentralized and algorithmic stablecoin, USX implements a dual model (pool-based & vault-based) with hybrid interest rate policy, making it highly efficient and flexible to support collaterals of different risk profiles in isolation. USX is powered by protocol-controlled liquidity to facilitate protocol-to-protocol integrations, as well as cross-chain bridge that allow users to move USX across supported blockchains with zero slippage and uncapped limit. dForce Lending dForce Lending is a pool-based multi-sided lending protocol which supports multiple collaterals with a market-driven dynamic interest rate model. dForce Lending has undergone extensive code reviews and security audits by Trail of Bits, ConsenSys Diligence, CertiK, Certora (formal verification), with a bug bounty launched through Immunefi. dForce Lending has been deployed for over 1 year and is well battle-tested. dForce Staking dForce introduces a hybrid model featuring both Free Staking and Lock-up Staking. Staking unlocks a new approach for DF token holders to capture fee income across dForce network. Participants in Free Staking can unstake at any time, whilst those committed to Lock-up Staking will earn higher yield and voting power. In addition, most of DF purchased in the secondary market will be rewarded to participants in Lock-up Staking. dForce Trading Peer-to-peer marketplace with aggregated liquidity across different platforms with the best price. dForce Bridge A cross-chain bridging tool facilitating instant and low-cost transfer of USX and DF across all supported L2s and blockchains.","links":"https://dforce.network/","market_cap":10887670,"market_cap_rank":1495,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dforce-token_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4a9a2b2b04549c3927dd2c9668a5ef3fca473623","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x4a9a2b2b04549c3927dd2c9668a5ef3fca473623"}},"is_native":false}