{"name":"Nexon","id":"nexon","symbol":"nxn","description":"What is the project about? Nexon is Low Risk & Capital Efficient lending protocol on zkSync Era. What makes Nexon unique? Nexon is designed to maximize capital efficiency while minimizing the risks associated with the dependency on external liquidity & oracles. This will allow users to lend and borrow crypto assets more efficiently than any existing solutions in the market. The protocol is powered by zkSync, one of the most secure ZK rollups with instant and super-cheap transactions. What is Nexon's Vision? We are building Nexon around solving the most common and significant challenges currently facing the DeFi ecosystem. To encourage mass adoption, the aim is to improve capital efficiency and streamline the UX. History of your project. On December 19th, 2022, Nexon launched its closed testnet on the zkSync Era Testnet. Over 50,000 users have subscribed for early access, and as of March 16th, more than 40,000 users have already tested the protocol since its public testnet launch on February 8th, 2022. What’s next for your project? Our Pooled v1 protocol is set to launch on zkSync Era Mainnet in early Q2 2023. This is just the beginning of an exciting journey as we have a lot planned, including a DAO transition, Pooled v2, and a P2P lending protocol. You can learn more about our roadmap by checking out our whitepaper. What can Nexon's \"NXN\" token be used for? The token will be used for different functions in the ecosystem: 1. Governance: The Nexon token will be used as the governance token wrt important decisions related to user incentives, grants & protocol parameters that will be taken by the governance process. 2. Revenue Sharing: The Nexon token will also be used for sharing a part of the protocol revenue. This will incentivize the long-term backers of the project.","links":"https://www.nexon.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nexon/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}