{"name":"Zenland","id":"zenland","symbol":"zenf","description":"What is our project about? We at Zenland have created a smart contract platform that aims to facilitate peer-to-peer transactions without the need for a middleman. We use blockchain technology to ensure the security and transparency of transactions. Our platform is designed to be user-friendly, allowing anyone to create and deploy smart contracts without needing to understand the technicalities of blockchain. What makes our project unique? What sets Zenland apart is our approach to democratizing access to smart contracts. We provide a no-code platform where users can create, deploy, and manage smart contracts for their transactions. This allows for a level of transparency and security that is often lacking in traditional peer-to-peer transactions. Additionally, we have our own utility token, ZENF, which offers various benefits to its holders and is integrated into our platform's ecosystem. History of our project. The idea for Zenland was conceived in Q3 2021. Our team conducted research on smart contract escrow and began developing the concept. By Q4 2021, we had started designing and prototyping the MVP. The Ethereum smart contract model was implemented in Q1 2022, and by Q2 2022, we had developed the MVP and launched our official website. Our project has since undergone multiple phases of beta testing, and we minted the ZENF token in Q1 2023. What’s next for our project? We at Zenland have a roadmap that extends into Q4 2023. In Q2 2023, we plan to develop a pre-approved model, optimize Zenland for mobile, and launch the ZENF token IDO. In Q3 2023, we plan to enhance profile security and analytics, improve our platform's multichain compatibility, and update our whitepaper to version 2.0. By Q4 2023, we aim to achieve full EVM-compatibility, integrate more networks, support more stablecoins/tokens, and launch our marketplace. What can our token be used for? The ZENF token has several utilities within the Zenland ecosystem. It can be used to pay for service fees.","links":"https://zen.land","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zenland/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe9b7b5d5e8d2bcc78884f9f9099bfa42a9e5c1a5"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xa6099b214e8d069911702bc92ef274f63c476c5a"},"xdai":{"decimal_place":18,"contract_address":"0x07279343ce61c11cb091142c8a20a1f8194d0ca8"},"polygon-pos":{"decimal_place":18,"contract_address":"0x3a79241a92a4f06952107308057da1991792d372"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x382ec3f9f2e79b03abf0127f3aa985b148cef6d7"}}}