{"name":"BTAF token","id":"btaf-token","symbol":"btaf","description":"BTAF token is the native utility token for BitcoinTAF.com. The goal is to create global DeFi ecosystems that allow the purchase of digital products securely, easily, and quickly with minimal fees. BitcoinTAF will supply a safe and secure platform for token holders to use tokens to access products; creating savings by utilizing faster transactions from many global payment systems and reducing costs on transactions fees by using the BTAF tokens instead of fiat or other credit payment systems. It endeavours to provide more opportunities for cryptocurrency holders, traders, and users to be able to access products without the uncertainty of financial fiat delay and denial issues. Its decentralized approach ensures quicker, cheaper transactions, greater efficiency, and increased transparency. Based on the Binance Smart Chain, BTAF is also positioned for the future with endless possibilities in the DeFi, Metaverse, and NFT age to connect with projects that desire alternative funding options and want to use the utility BTAF token on their platforms. Since 2016 Bitcoin Trend & Forecast (“BitcoinTAF”) has been one of the most trusted sources for thousands of traders who look to the company to provide training, technical trend data, and fundamental research reports at every skill level. BTAF token is the brainchild of one of its founders, Marius Landman, who wanted to supply the world with an easier, more robust and secure way to pay for digital goods and services. BTAF is available for trading on a growing number of exchanges, with several pairs currently available on Pancakeswap and DexTools : https://www.dextools.io/app/en/bnb/pair-explorer/0x7ac443da58259a664e9bb7f4c85ed913d222a8ee https://pancakeswap.finance/swap?outputCurrency=0xcAE3d82D63e2b0094bc959752993D3D3743B5D08 Check out the website www.btaftoken.io for more information.","links":"https://btaftoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/btaf-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xcae3d82d63e2b0094bc959752993d3d3743b5d08"}}}