{"name":"DeeLance","id":"deelance","symbol":"$dlance","description":"What is the project about? DeeLance is a decentralized platform revolutionizing how freelancers connect with potential employers in Metaverse. DeeLance's main focus is on the virtual world where users can Socialize, Work and Earn. The Metaverse, NFT marketplace, recruitment, and seamless freelancing platform create the ultimate ecosystem for the users. At the core of DeeLance's groundbreaking approach is the tokenization of freelance work products into NFTs, allowing for a secure and reliable transfer of work ownership to recruiters What makes your project unique? DeeLance is unique due to its micro-communities concept in the metaverse, decentralized approach, and Content Ownership via NFTs, Metaverse, and NFT marketplace. In the Freelancing platform, there is a low commission fee, instant withdrawal, no limit on task size, a scalable dispute system, and a simple signup process. History of your project. The initial project plan was conceived by Dommetti -CEO of DeeLance - in Q4 2022. Then whitepaper was released, the website gets live and initial smart contracts deployment happened in January 2023 and further development and marketing along with Contract Testing continue in Q2 2023. What’s next for your project? The DeeLance Freelancing platform prototype and Metaverse demo (Alpha) version are ready. In Q3 and Q4 2023, DeeLance is focusing on the development of Metaverse, and launching NFT Marketplace and NFTs. Moving forward, DeeLance plan to expand its reach by hosting webinars, partnering with other projects, attending events, and visiting universities. What can your token be used for? $DLANCE is the native token used in the DeeLance Ecosystem available on the Ethereum blockchain. $DLANCE tokens are used within the ecosystem to purchase NFTs, buy lands and offices, lease office space, for advertisements, get discounts on gig deals, and unlock the VIP Experience within Metaverse.","links":"https://deelance.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/deelance/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7d60de2e7d92cb5c863bc82f8d59b37c59fc0a7a"}}}