{"name":"TLChain","id":"tlchain","symbol":"tlc","description":"What is TLChain (TLC)? TLChain is tremendously fast, performing 100,000+ transactions per second (TPS) (testnet) with a confirmation time of 3 seconds. This ultra-fast speed is meant to meet today’s mainstream needs. TLChain team built an environment with layers upon layers of protection. Keeping the blockchain hack-free with a delegated proof-of-stake network and deterministic master node list that’s derived from on-chain transactions. In this way your assets always stay safe. With their collaborative effort across multiple time zones and cross-functional teams, they help the world move toward a more profitable future. Currently, they have offices in Abu-Dhabi, Bucharest, Gibraltar, and Dubai. Deal directly with other traders. TLChain is censorship-resistant, so you don’t need to deal with a third party. You can conduct peer-to-peer transactions on a network that’s not controlled by central authorities like banks. Governance A decision regarding the TLChain Network and ecosystem cannot be made by the CEO or the management without the board's approval. Major decisions are voted on by 21 people until the DAO is introduced. There is a requirement that 51% of votes be cast in favor of a proposal in order for it to pass. Interoperability Do you have investments in other blockchains like Fantom or BNB Chain? Migrate assets like tokens from other blockchains using the TLChain Bridge. Now you don’t need to use separate software to interact with other applications. This option allows transferring funds between the 13 networks. All you have to do is to select the direction of a transfer, a token you want to transfer, and amount. Ecosystem Tokens: TLChain Standard Token (TL20), embedded in protocol, fast & inexpensive to mint & transfer, FT, SFT, NFT A collection of digital applications or satellite projects built on the TLChain infrastructure and intended to contribute to the development of the ecosystem Mint, Stake, Swap, Lend, Borrow, Build, Level up with Metaverse an","links":"https://tlchain.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tlchain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xcd6a8c968f6820f7163e7fb41f75048b92e4318d"},"elrond":{"decimal_place":18,"contract_address":"TLC-1a2357"},"avalanche":{"decimal_place":18,"contract_address":"0xd97136b7cab42058f75e05e3d8c5c87cceac8bc3"},"polygon-pos":{"decimal_place":18,"contract_address":"0xdc7858415244b20c903e0cd857ac58b7225f046f"},"fantom":{"decimal_place":18,"contract_address":"0x2578850d2a34e7dce51355895db05f3bbe562822"}}}