{"name":"Outlanders","id":"outlanders","symbol":"land","description":"Outlanders, an open-world, low-poly style MMORPG, is onboarding Web2 gamers to Web3 without the need for prior blockchain education. Play, conquer, and earn immediately in the most hyped game genre in the gaming market. Outlanders is set to revolutionize the world of MMORPGs as one of the pioneering open-world games utilizing blockchain technology. By onboarding the masses to MMORPG blockchain gaming, Outlanders stands out with its unique \"Open World\" concept, where there is no set beginning or end. Players have the freedom to start at any stage, tackling tasks in any order while scoring points. Outlanders aims to deliver an immersive gaming experience while leveraging blockchain technology to provide lucrative play-to-earn opportunities and user ownership of in-game assets. This innovative approach allows players, regardless of their blockchain knowledge, to start playing just like traditional MMORPGs and immediately begin earning in-game assets. Gamers can then educate themselves at their own pace on setting up a Web3 wallet to access these assets, making Outlanders accessible and appealing to a wide audience. The gaming environment of Outlanders is built using Unity and WebGL, powerful frameworks that deliver real-time experiences for browser-based games. Unity enables the creation of stunning graphics for mobile, desktop, and high-end consoles, while WebGL powers 3D gaming environments accessible through HTML5 using JavaScript. Focusing on browser-based gaming ensures that Outlanders is immediately accessible upon release to the growing market of browser-based games, with plans for broader system rollouts on Windows, Android, and iOS to follow. Outlanders will integrate blockchain-based infrastructure through the BNB Chain, which is already home to several top play-to-earn gaming projects and communities. This integration will further enhance the game's play-to-earn opportunities and solidify its position as a standout in the realm of blockchain MMORPGs.","links":"https://www.outlanders.com/","market_cap":630070,"market_cap_rank":4809,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/outlanders/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1e34fcc9a67e05d4beed8c6a70f98c3e4d1e1e96","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x1e34fcc9a67e05d4beed8c6a70f98c3e4d1e1e96"}}}