{"name":"Flare","id":"flare-networks","symbol":"flr","description":"Flare is a blockchain for building applications that are interoperable with other blockchains and the internet. ## What is Flare (FLR)? Flare is an EVM-based Layer 1 blockchain designed to allow developers to build applications that are interoperable with blockchains and the internet. By providing decentralized access to high-integrity data, Flare enables new use cases and monetisation models. ## What makes Flare unique? Flare's native interoperability protocols, the State Connector and the FTSO are secured by the network itself, allowing it to reliably deliver data from a wide variety of off-chain sources in a decentralized way. The Flare Time Series Oracle delivers highly-decentralized price and data feeds to dapps on Flare, without relying on centralized providers. The State Connector protocols enable information, both from other blockchains and the internet to be used securely, scalably and trustlessly with smart contracts on Flare. Risk is minimized by building this decentralized data infrastructure natively into the blockchain, powered by a large number of independent data providers. By incentivizing sets of independent providers to query, acquire, and process data without relying on single, centralized sources, Flare’s core protocols can facilitate the development of interoperable dapps with a broad range of potential innovative use cases. ## What is the Flare (FLR) token used for? FLR is the native token used for payments, transaction fees to prevent spam attacks and staking in validator nodes. FLR can also be wrapped into an ERC-20 variant, WFLR. WFLR tokens serve various functions; they can be delegated to FTSO data providers, for example, or staked to participate in governance. These two uses are not mutually exclusive and do not prevent the tokens from being used in other EVM-compatible dapps and smart contracts on Flare. Wrapped FLR (WFLR) can be minted by depositing native FLR tokens into a smart contract and withdrawing the newly minted","links":"https://flare.network/","market_cap":1659301902,"market_cap_rank":90,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flare-networks/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}