{"name":"NIX","id":"nix","symbol":"nix","description":"What is the project about? NIX is the utility token for Cripto no Pix’s platform, where you can buy and sell crypto using the main brazilian payment and soon others, also there are buyback, cashback, burn and referral system running already. What makes your project unique? We use the fastest and safest Brazilian payment method in history to facilitate the purchase and sale of cryptocurrencies, with security and agility. Our services are 100% online, without bureaucracy and without abusive History of your project. Mission The mission of CNOP Intermediações LTDA is to offer secure and innovative cryptocurrency solutions, through the PIX system, to its customers, promoting financial inclusion and democratizing access to financial services. Vision Our vision is to be recognized as a reference in the cryptocurrency market, offering innovative and quality services that meet the needs of our customers. What’s next for your project? Values Safety: We value the safety of our customers in all transactions made through our system. Innovation: We constantly seek innovation in our services, to offer increasingly efficient and advanced solutions. Transparency: We act transparently in all our operations, keeping our customers informed about the services provided. Ethics: We act ethically in all our relationships, fulfilling our obligations and respecting the rights of our customers. What can your token be used for? Social Responsibility: We contribute to the development of society through responsible and sustainable actions.","links":"https://criptonopix.app.br","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nix/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbe96fcf736ad906b1821ef74a0e4e346c74e6221","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xbe96fcf736ad906b1821ef74a0e4e346c74e6221"}}}