{"name":"CRYPTO TEX","id":"crypto-tex","symbol":"ctex","description":"CRYPTO TEX offers user-friendly, secure, and efficient blockchain-based crypto solutions.\"Crypto Tex has launched Blockchain Ctex Scan, which solves economic and technological concerns by gradually implementing an interconnection between decentralised and centralised solutions,\" said a CTEX spokesperson. \"The Ctex Scan solution is cost-effective and simple to understand. It can meet the targeted passive gains generation of a large and expanding pool of digital asset owners while avoiding risks.\" Regardless of economic or technological background, everyone can participate in the future generation of digital asset markets.\" Ctex Scan innovation derives from creating a unique Ecosystem using the most secure, scalable, and cost-effective blockchains and crypto projects. Ctex Scan is a blockchain that can solve the blockchain Conundrum by delivering transaction speed, security, and significant scalability. Welcome to Web3’s friendliest scaling solution out there. With Ctex Chain Network, owning digital assets, creating smart contracts or exploring applications has never been so easy. With the help of Cloud Compute, users can truly experience the power of Web3. Ctex Swap CTEX Swap is governed by its community members who can create & vote on important proposals Ctex NFT Marketplace Ctex Marketplace is the world's first and largest NFT marketplace. You can list your own NFTs for sale on the Ctex Marketplace, and you can browse existing listings. Today, we’re proud to remain the largest general marketplace for user-owned digital items, supporting multiple blockchains, with the broadest set of categories and the best prices for new emerging digital item classes. Ctex Wallet Ctex Wallet is Decentralized Wallet Like Trust Wallet for Storing Crypto Currencies. Ctex Exchange Ctex Exchange is a cryptocurrency trading platform designed for people by people. It is a reliable and secure way to buy, sell and trade crypto with low fees and unmatched liquidity. Be","links":"https://ctexcoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-tex/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}