{"name":"Cavatar","id":"cavatar","symbol":"cavat","description":"What is the project about? Cavatar is a Web3 AI avatar generator that creates unique and personalized avatars for users. It utilizes cutting-edge technology and sophisticated AI algorithms to produce high-quality and scalable avatars at affordable prices. Users can earn extra income by selling their prompt and receiving exclusive benefits for loyal holders. What makes your project unique? - Reasonable price – Generating AI avatars costs a fee. Cavatar offers a good price that is much lower than any similar services - High quality – Cavatar is using the latest AI technology and generating high quality and scalable avatars compare to others service provider - Create to Earn – With the revenue model, users can sell their prompts to earn extra income and receive exclusive benefit for loyal holders History of your project. The motivation behind Cavatar is to empower users to express themselves in new and exciting ways online, breaking down barriers and facilitating more meaningful connections between people from different cultures and backgrounds. With its emphasis on affordability, accessibility, and user-friendliness, Cavatar is poised to become a leading platform for AI-generated avatars, offering a new standard for virtual identities in the digital age. What’s next for your project? - Stake CAVAT tokens to earn - Cavatar monthly contest - New feature: vertical AI videos What can your token be used for? - Investors who stake Cavatar's tokens will receive a profit from Cavatar's monthly revenue: 20% of the revenue will be divided among investors holding CAVAT tokens. The amount of profit investors receive will be based on the number of tokens they are holding and the total number of current holders. - The remaining 80% will be used for developing Cavatar project in long-term","links":"https://cavatar.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cavatar/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x116204ba071bb5c8b203e2a5f903f557b54ef577"}}}