{"name":"OUSG","id":"ousg_solana","symbol":"ousg","description":"OUSG is a tokenized short-term US Treasury bills ETF, overseen and managed by Ondo Capital Management, a subsidiary of Ondo Finance. The significant majority of this portfolio is held in the iShares Short Treasury Bond ETF (NASDAQ: SHV). There is also a small portion of USDC and USD for liquidity purposes. OUSG brings exposure to the ‘risk-free’ US Treasury rate on-chain for the first time. OUSG is an investment option that delivers a stable and predictable return while offering deep liquidity. Ondo funds such as OUSG only ever invest into ETFs backed by secure, stable, and liquid securities; these are the same assets in which trillions of dollars are invested every day by the world's largest institutions. OUSG was developed alongside two other fund tokens, OSTB and OHYG, by Ondo Finance, a software development firm in DeFi. Ondo launched in August 2021. Its first product was Ondo Vaults, a structured finance protocol on Ethereum. Later that year, Ondo launched Liquidity-as-a-Service (LaaS), facilitating over $210M in total liquidity provided. As DeFi yields compressed in 2022, the Ondo team decided to sunset Vaults and LaaS (together, \"Ondo V1\") to focus on next-generation protocols. Ondo V2, including Ondo’s tokenized funds, were announced by Nathan Allman in January 2023. Ondo funds subsequently opened to subscriptions soon after. What can OUSG be Used For? For investors who pass KYC and AML screening and sign subscription documents, OUSG tokens represent ownership in the fund. Investors can transfer these tokens between each other to effect changes in fund ownership. Investors can also use smart contracts to facilitate their financial arrangements such as by engaging in lending and trading activities with each other. The tokens themselves have transfer restrictions that will ensure they do not end up in the hands of anyone not appropriately qualified as an investor in the fund.","links":"https://ondo.finance/","market_cap":827492108,"market_cap_rank":108,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ousg/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"i7u4r16TcsJTgq1kAG8opmVZyVnAKBwLKu6ZPMwzxNc","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/i7u4r16TcsJTgq1kAG8opmVZyVnAKBwLKu6ZPMwzxNc"}},"is_native":false}