{"name":"Subsocial","id":"subsocial","symbol":"sub","description":"Subsocial is a next generation content monetization and social networking platform, allowing anyone to build innovative social applications on top of a shared social layer, where users truly own their connections, data, and profiles. With monetization features like Creator Staking working to boost network growth and curation, Subsocial provides the foundation for the social apps of the future. Subsocial runs on top of the Polkadot network, providing it with robust security, and allowing it to easily communicate with other chains. By leveraging this approach, Subsocial is able to be custom-built for social functionality (providing benefits such as low fees), while still being part of an ecosystem and having access to other types of applications, like DeFi. Built with the Polkadot SDK, Subsocial features a truly decentralized on-chain treasury and governance system, and possesses the ability to upgrade without forking, according to the will of SUB token holders. Subsocial's native token SUB allows users to participate in on-chain governance, manage the treasury, register Subsocial Usernames, stake to their favorite creators, create content and applications, and create Energy to lower transaction fees. Subsocial is Polkadot's social layer. It’s an open platform constructed with the Polkadot SDK to build social primitives (such as posts, profiles, comments, likes, etc.) and the IPFS decentralized file system to handle storage. It is censorship-resistant and has built-in monetization mechanisms. One of the key points of Subsocial compared to other Web3 social projects is that it is built on Polkadot, providing sovereignty and allowing it to be custom-built for social use cases, while still being part of a thriving ecosystem. Polkadot allows Subsocial to communicate with other chains without traditional bridges that are slow and expensive. Compared to other social projects, Subsocial has the best of both worlds: customizability, and ecosystem access.","links":"https://subsocial.network/","market_cap":1682267,"market_cap_rank":2385,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/subsocial/logo.png","detail_platform":{"moonbeam":{"decimal_place":10,"contract_address":"0xffffffff43b4560bc0c451a3386e082bff50ac90"}}}