{"name":"Camille","id":"camille_binance-smart-chain","symbol":"camille","description":"Camille is an AI agent built to simplify DeFi decisions, automatically detecting and analyzing a user’s positions across multiple DEXs and chains. Powered by Datai Network and real-time on-chain data, it delivers personalized yield strategies, from low-risk growth to short-term market plays. This AI Agent has real utility, and offers to its users a uniquely advanced way to access onchain data insights to help keep them informed and leveraging market analytics and dynamics to optimize their portfolios. Function: In the First Version Current (V1) to be launched in March 2025, users will get access to: - Portfolio Analysis: Gathers user pool data and compares performance against market metrics. - LLM-Driven Recommendations: Evaluates pool trends (APY, IL, ROI) daily, assigning a recommendation score with insight tags (e.g., “Above Market Average,” “Most Volatile”). - Automated Updates: Uses historical data snapshots to refine suggestions. In the upcoming version (V2), users will be able to access (with earlier access for $CAMILLE holders): - Advanced Pool Discovery: Beyond exact token pairs, Camille will find “similar” pools based on risk profiles and token attributes. - DeFi Smart Wallet Tracking: for copy-trading services - Customized Strategies: More nuanced approaches aligned with individual risk tolerance and broader market context. - Trade Execution: Beyond optimizing portfolio and findings gem pools, users will be able to execute Camille’s recommendations in one click","links":"https://meetcamille.ai/meet-camille","market_cap":20734,"market_cap_rank":9719,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/camille_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1a5f096d6d4f0da25f2df00279cff615c7f856fc","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x1a5f096d6d4f0da25f2df00279cff615c7f856fc"}},"is_native":false}