{"name":"xRocket","id":"xrocket","symbol":"xrock","description":"The XROCK token is the cornerstone of the xRocket ecosystem, the first centralized exchange (CEX) born in Telegram on The Open Network (TON) blockchain. This revolutionary token serves multiple purposes within the xRocket platform, providing users with an array of benefits and utilities designed to enhance their trading experience. Utility and Benefits Trading Fee Discounts: Holders of XROCK tokens enjoy significant discounts on trading fees. This feature is designed to incentivize the holding and use of XROCK within the platform, making trading more cost-effective for frequent users. Staking Rewards: Users can stake their XROCK tokens to earn rewards. Staking not only provides a passive income stream but also helps secure the network and maintain liquidity within the exchange. The staking process is straightforward, allowing users of all experience levels to participate easily. Governance Participation: XROCK token holders have the ability to participate in the governance of the Xrocket exchange. This includes voting on key decisions such as listing new tokens, implementing new features, and making changes to trading policies. This decentralized approach ensures that the community has a voice in the platform’s development. Exclusive Access: Certain features and events on the xRocket platform are exclusively available to XROCK holders. This includes early access to new token listings, participation in special trading competitions, and invitations to exclusive community events. Technological Foundation Built on the TON blockchain, XROCK benefits from the high throughput and scalability of the network. TON's advanced technology ensures fast transaction speeds and low fees, which are critical for a seamless trading experience on the xRocket exchange. The security features of the TON blockchain also ensure that users' funds and transactions are protected against fraud and hacking attempts. Market Potential The XROCK token is positioned to tap into the growing market of decentralized finance (DeFi) and blockchain technology. As the first CEX on TON, xRocket aims to attract a wide user base by offering unique advantages that leverage the strengths of the TON blockchain. This includes integration with TON's ecosystem, providing users with access to a broader range of decentralized applications (dApps) and services. Tokenomics The total supply of XROCK is capped, creating a deflationary model that can increase the token's value over time as demand grows. A portion of the trading fees collected in XROCK is burned regularly, reducing the circulating supply and creating upward pressure on the token's price. This mechanism aligns the interests of token holders with the long-term success of the xRocket exchange.","links":"https://xrocket.tg","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xrocket/logo.png","detail_platform":{"the-open-network":{"decimal_place":9,"contract_address":"EQAVfEY2iKSpEkUhgFLFWAgHeSz2NH2XV-MvDuiKF5plSbsU","geckoterminal_url":"https://www.geckoterminal.com/ton/tokens/EQAVfEY2iKSpEkUhgFLFWAgHeSz2NH2XV-MvDuiKF5plSbsU"}}}