{"name":"VON","id":"von","symbol":"von","description":"VON Token (Vameon) – A New Era in GameFi & Play-to-Earn. VON is the ecosystem utility token at the heart of the dark fantasy universe of dEmpire of Vampire, a mobile game by the Vameon project. dEmpire of Vampire is an AI Play-to-Earn Metaverse on the BNB Chain that is redefining gaming by granting players true ownership of their in-game assets—including characters, achievements, and rewards—all secured as NFTs and tradable on-chain. Players are fully immersed in the game ecosystem, where they can mint free NFT characters and build their value through in-game progress, as well as earn crypto rewards and enjoy the captivating gameplay. Enter the AI World of Vampires. dEmpire of Vampire is the world’s first AI Play-to-Earn Metaverse game, where AI algorithms and technologies are deeply integrated into the Play-to-Earn mechanics. Players’ characters are brought to life through AI, allowing gamers to transform their real-life appearance into unique vampire avatars, making their characters look like them but in a more fantasy vampire style. Immersive Gameplay, Accessible to All. dEmpire of Vampire is a full-fledged 3D AAA game featuring an expansive map and engaging gameplay. Utilizing advanced polygonal optimization technology, it delivers high-quality graphics seamlessly compatible with smartphones across all generations. The first game by Vameon, dEmpire of Vampire, has already surpassed 2,000,000 downloads in its beta version. Even at this early stage, the game has a lot of features, engaging mechanics, diverse levels, and exciting PvP Arena opportunities. The dEmpire of Vampire game is already available on Google Play and the App Store: https://play.google.com/store/apps/details?id=com.vameon.android https://apps.apple.com/us/app/dempire-of-vampire/id6478310626","links":"https://vameon.com/","market_cap":5632003,"market_cap_rank":2250,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/von/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa4c3497b57c8b6d510f3707a1e9694fd791f45fb","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa4c3497b57c8b6d510f3707a1e9694fd791f45fb"}}}