{"name":"Ibiza Final Boss","id":"ibiza-final-boss_solana","symbol":"boss","description":"A young partygoer with a stylish bob has been spotted cutting shapes in Ibiza. Footage of the man - Jack Kay - went viral at the start of this week as he was filmed donning a gold chain and pair of sunglasses with a baby pink cup gripped in his hand. But it was the dancer's haircut that caught the attention of thousands of social media users - with many saying they thought the 'top bloke' had been wearing a hat. Electricians have concluded: Solar panels are only worthwhile if your house has this Ad Electricians have concluded: Solar panels are only worthwhile if your house has this Eco Experts call to action icon The lone reveller's bright white teeth contrast perfectly with his black vest as he purses his lips and throws out his best moves to the groove of the music. Several thousand people have commented under the footage on TikTok after it was uploaded with a plea to locate the 'absolute legend'. Somebody claimed the mystery dancer was in fact 'Lloyd Christmas' - a character from the film Dumb and Dumber who is also known to sport an iconic bob. One person said: 'When you've got Ibiza at 3 but the battle of hastings at 4.' Another added: 'That's a hat right? It is... it must be? Tell me it is...'. Footage of the man - Jack Kay (pictured) - went viral at the start of this week as he was filmed donning a gold chain and pair of sunglasses with a baby pink cup gripped in his hand Footage of the man - Jack Kay (pictured) - went viral at the start of this week as he was filmed donning a gold chain and pair of sunglasses with a baby pink cup gripped in his hand In the other video Mr Kay can be seen wearing the same iconic sunglasses and gold chain pulling out more dance moves from under his belt as a mate puts his arm around his neck In the other video Mr Kay can be seen wearing the same iconic sunglasses and gold chain pulling out more dance moves from under his belt as a mate puts his arm around his neck One person said: 'Thatched roof short back and sides please' - a comment that has since been liked almost 1500 times One person said: 'Thatched roof short back and sides please' - a comment that has since been liked almost 1500 times Since the footage spread online Mr Kay - now known as \"Ibiza final boss\" has uploaded a brand new video to TikTok - but this time with friends. He can be seen wearing the same iconic sunglasses and gold chain pulling out more dance moves from under his belt as a mate puts his arm around Mr Kay's neck. UK Residents Born 1945-1975 Could Be Eligible For This Ad UK Residents Born 1945-1975 Could Be Eligible For This British Seniors call to action icon A montage of photos also shows the partygoer enjoying himself with \"the lads\". Somebody commented under the video: 'Short back and Battle of Hastings, cheers mate.' Another person said: 'Short back and magna carter please mate.' And a third concluded: 'Are the mandem from Sherwood Forest as well?' Mr Kay has already developed a fanbase with some admirers even using him as their artistic muse. Someone who had painted a portrait of the reveller caption their social media post: 'Excellent use of free will if I do say so myself.'","links":"https://www.ibizafinalboss.info/","market_cap":150164,"market_cap_rank":6351,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ibiza-final-boss/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"GUy9Tu8YtvvHoL3DcXLJxXvEN8PqEus6mWQUEchcbonk","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/GUy9Tu8YtvvHoL3DcXLJxXvEN8PqEus6mWQUEchcbonk"}},"is_native":false}