{"name":"RoOLZ","id":"roolz","symbol":"godl","description":"## What is RoOLZ? RoOLZ Studios is combining the fast growing Anime Market, with short-form Mobile Videos and Mobile Apps on TON and Telegram. As a studio, RoOLZ has produced online Series with 3B+ views on socials. This year, its NFT collection (#10 all-time on GetGems) and Anime Series (20M+ Views) was released. RoOLZ’ TON-native app has 10M+ active users. RoOLZ is just the start. Fuelled by their mission to change entertainment, together, they are building a fan-owned entertainment studio where fans and creators collaborate and share in the success backed by the $GODL Token. $GODL is the Token that the community uses to decide on what RoOLZ produces as a studio. Imagine a future where Entertainment is more than just “watching”, where you own, play, produce and get rewarded in $GODL. The $GODL token is used for: Voting on and producing multi-content, participatory entertainment High quality, integrated, content with massive opportunity for monetisation Fast production of high-quality content due to our studio background In-App Staking and Rewards B2B Sponsorships and Ads ## How Many $GODL Tokens Are There in Circulation? The $GODL Token was listed on November 7, 2024 with a total supply of 800,000,000 tokens. A large portion of the token is in the hands of the community and unlocked at the Token Generation Event (36%). ### Who Are the Founders of RoOLZ? RoOLZ is led by a CEO with a Venture Capital background who recognized a unique gap in his portfolio, inspiring him to build the organization (RoOLZ Studio) himself. As an investor and advisor in the TON ecosystem, he’s well-versed in leveraging current market opportunities. The CTO brings expertise from SDAO and SingularityNET, while the Head of Content, founder of Atrium.Art, adds creative depth. With a team experienced in TON, Telegram, and startup growth, RoOLZ has a strong foundation to fulfill its mission of reshaping entertainment. ### Where Can I Buy $GODL? $GODL is available for trading on KuCoin, MEXC, BitGet and Gate.io.","links":"https://roolz.ai","market_cap":249983,"market_cap_rank":6112,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/roolz/logo.png","detail_platform":{"the-open-network":{"decimal_place":9,"contract_address":"EQAZwJdXCZoO9JIbwBTL2a_zzOAPheLICa4YG7lNIlDZzMmx","geckoterminal_url":"https://www.geckoterminal.com/ton/tokens/EQAZwJdXCZoO9JIbwBTL2a_zzOAPheLICa4YG7lNIlDZzMmx"}}}