{"name":"4TRUMP","id":"4trump","symbol":"4win","description":"What is the project about? 4TRUMP (4WIN) is a revolutionary meme coin that aims to unite the power of meme culture and the spirit of innovation under one banner. The project draws inspiration from the enigmatic figures of Donald Trump, blending their influence and the meme-centric ethos into a cryptocurrency that is as engaging as it is powerful. With the vision of creating a meme coin that transcends the boundaries of traditional digital currencies, 4TRUMP (4WIN) is poised to redefine the landscape of meme coins in the blockchain ecosystem. What makes your project unique? The unique concept of truly a decentralized platform, renounced contract and exceptional development team backing the project have seen 4TRUMP grow massively and achieve alot of success in a short time frame History of your project? We set out to create a community-driven token with strong tokenomics, transparency, and fun. Since then, 4TRUMP has established itself as a leading player in the world of meme tokens, with a growing community and exciting plans for the future. What's next for your project? We're focused on building a strong and sustainable token economy that rewards long-term holders and fosters a vibrant community. What can your token be used for? 4TRUMP (4WIN) is a meme-focused cryptocurrency on the Solana blockchain, creatively leveraging political and pop culture themes for community engagement and humor. This token embodies the playful spirit of meme culture in the crypto sphere, attracting participants interested in speculative investments tied to cultural phenomena As a community-driven project, it aims to capitalize on the virality of memes, encouraging a fun and engaging atmosphere among its holders.","links":"https://trump4win.com/","market_cap":4424403,"market_cap_rank":1970,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/4trump/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"4TRUMPJwguiFjfY6PLpwT6SZ5BZmCuzfqWWeJAdR6xP3"}}}