{"name":"SpaceAI Finance","id":"spaceai-finance","symbol":"spai","description":"Space AI Finance is an innovative, peer-to-peer, smart and diverse CEDEFI financial platform with advanced financial services. We rely on blockchain technology to provide everything you need for wise trading and investing. The platform allows the pairing of application modules to integrate new features into the same previous features based on technolog #LunchBreak so the applications of the DeFi and CeFi protocols are assembled into a single resource system. with all the financial services currently on the market and new financial services being created in the future. With SpaceAI Finance, you can join one of the largest cryptocurrency ecosystems by features. We are focused to serve millions of users in more than 100 countries. Application Modules introduced on the Space AI Finance platform will provide users with the following services: § AI Swap: DEX Trade, Bridge § SpEarn: Defi Farming,Staking § SpaceLaunch: Launchpad, Lock LP token § SpNFT: NFT Marketplace § AI info: market information, retrieve GPT price forecast § SpPay: Payment, OTC, P2P § SpCefi: Spot, margin, futures, options, perpetual swaps, lending and mining services. § Other utilities: o Crypto Forex Services o Tokenizing assets o gameFI o Metaverse o Smart Contracts Overall, it's a combination of both CeFi and DeFi and offers comprehensive solutions for crypto users. In the SpaceAI Finance ecosystem, you can use our zero-gas blockchain for DeFi protocols, NFT projects, dApps, and more. You can trade anonymously and safely with our decentralized exchange. Our ecosystem will open up new avenues for developers since our blockchain zero gas and uses the latest tech","links":"https://www.spaceai.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spaceai-finance/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x358e5d2378f5fc3fa5504aebb728c4c568f973a4"}}}