{"name":"Sync Network","id":"sync-network","symbol":"sync","description":"Projects in the decentralized finance space started utilizing stake and proof-of-liquidity mechanics to develop a trustless economy but fundamental flaws have held these projects behind. The SYNC Network addresses these problems and offers a workable solution through tradeable stakes bonding Uniswap liquidity pairs with a fully trustless ERC-20 token (SYNC). SYNC enables users to earn interest by staking a cyptographic bond to Uniswap liquidity pair tokens (Crypto Bonds). Crypto Bonds are an NFT (ERC-721) token with collectible attributes, accruing interest rates, and the ability to separately trade and speculate on them within a secondary market. SYNC Network works to bring stability and risk mitigation to decentralized finance by solidifying a guarantee on holding liquidity pairs for an extended period of time. The Sync Network can help build a needed, stable foundation for the DeFi space and a fully functioning, more robust trustless economy. -- The SYNC Network is composed of two main contracts: the SYNC ERC-20 contract and the Crypto Bond ERC-721 contract. SYNC tokens have an undefined total supply with inflationary and deflationary attributes through the interactions with Crypto Bond investors. Despite being a long-term investment, Crypto Bonds do not share anything in common with traditional finance bonds. The name comes from the bonding of liquidity pairs and our own token. Crypto Bonds introduce proof of long-term position in DeFi liquidity pools, and will naturally strengthen the core of DeFi finance as a whole. They are a tradeable, long-term (90 days - 3 years) stake - bonding Uniswap liquidity-pair tokens together with SYNC. Deflation of the currency happens when Crypto Bonds are created, burning SYNC from the total supply. Using a Crypto Bond, an investor is able to lock liquidity-pair tokens with the corresponding dollar-to-dollar value in SYNC at some guaranteed interest rate of SYNC upon maturation. Dividend paying versions are also available. Therefore, this occurs in inflation, minting the principle plus interest. Crypto Bond Interest Rates SYNC balances itself through daily, self-correcting interest rates. Interest rates of bonds depends on three factors. 1. Total supply of sync in the market. 2. Duration of bond 3. Total bonded amount of that liquidity pair token Please see the full whitepaper and website https://www.syncbond.com for more information.","links":"https://syncbond.com/","market_cap":106364,"market_cap_rank":7367,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sync-network/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb6ff96b8a8d214544ca0dbc9b33f7ad6503efd32","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xb6ff96b8a8d214544ca0dbc9b33f7ad6503efd32"}}}