{"name":"Bored Token","id":"bored","symbol":"$bored","description":"The $BORED project was initiated with the goal of providing the average person in our ecosystem with a secure and affordable source of passive income. $BORED is optimized for farming $ape. This is due to the built-in features, which make $BORED a more efficient option than other methods such as buying and staking BAYC or MAYC NFTs which aren’t accessible to the vast majority of people due to the hefty price tag. $BORED also has an exclusive bonus feature. The DAO will buy BAYC and MAYC NFTs, as well as $ape and the assets will be staked. The passive income will then be distributed to the holders via a unique platform for ownership of all $BORED dao staking assets. Using $BORED, a revolutionary new solution for cost-efficient staking, users are enabled much greater freedom of choice. It allows them to define their own parameters and protocols when building strategies around compound staking while utilizing the various dividends available within the system. With this technology, investors have access to much higher liquidity pools with lower entry costs that have been adjusted according to user preferences. This provides them more flexibility with returns as well as reduced risk compared to regular forms of investing due to pegged exchange rates. $BORED also increases efficiency in terms of operation costs associated with cost-efficient staking by decreasing transaction times, reducing travel time required for funds transfers between parties and increasing accuracy through algorithmic matching processes rather than depending solely on manual operations within their investments portfolios. In addition, this innovative tool enables investors with tools such as price trend tracking which increases accuracy when forming strategies as well automatic alerts for its user making it easier for them stay informed about what’s happening in the fields they want to track without having continuous efforts from their side.","links":"https://www.boredtoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bored/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x2047ab3072b52561596ce5e0131bdbb7c848538d"}}}