{"name":"Shiba Classic","id":"shiba-classic","symbol":"shibc","description":"# What is SHIBA CLASSIC (SHIBC)? Shiba Classic is an OG meme cryptocurrency, built on the ETC (Ethereum Classic) Network, the original Ethereum Network. It was anonymously created and deployed on August 2022. It is a fun, community driven token, that focuses on always growing its members and by always innovating in the meme ecosystem. SHIBC quickly managed to gain respect from the crypto space and have now became a Top Dog. ## Who is the founder of SHIBA CLASSIC? It’s founder, who’s goes by the pseudonym of ‘’Fenikkusu’’, said in the WhitePaper that he wanted this project to be completely decentralised. With no official team to lead investors, it is important that we all participate in promoting the token and to help it grow. However, very little is known of the mystery founder of the dog-themed cryptocurrency, much like the founder of Bitcoin, Satoshi Nakamoto. ### What makes SHIBA CLASSIC unique? The project is 100% community driven, from the people, to the people. The liquidities are burned to a dead wallet so no one can ever access them. The contract is also fully renounced and it is not possible to stop trading or alter in anyway it’s functionalities. We go by the chain motto Code Is Law. #### How Many SHIBA CLASSIC (SHIBC) Coins Are There in Circulation? There are 100 Trillions tokens total and 99.98 Trillions in the circulating supply as of Sept. 9th 2022. As the community will start burning tokens through various way the supply shall decline in time, becoming more and more rare. ### Where Can You Buy SHIBA CLASSIC (SHIBC)? SHIBC is freely available on both CEXs and DEXs as it is a 0% tax coin. Major exchanges have listed us such as Coinsbit and Azbit. SHIBA CLASSIC is also Whitelisted on ETC’s native DEX Hebeswap. The goal of the community is to gradually get listed on as many exchanges as possible and reach the masses.","links":"https://www.shibaclassic.sc/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shiba-classic/logo.png"}