{"name":"Taboo","id":"taboo-token","symbol":"taboo","description":"Taboo is an adult NFT & Streaming media project. Specializing in highly, exclusive content. With models, who aren’t strictly porn stars, their content is not like other adult tokens. Their marketplace is cutting-edge, with its creation by the Enjin Coin Marketplace Developers. From Super Models to Pornstars, TABOO is selectively curating the most exclusive content creator list in existence, providing the highest quality and most exclusive SFW, NSFW to XXX exclusive media from content creators. There is an application process, in which any adult performer who wishes to be on our platform will have to qualify and obtain approval by us first. This selectivity and exclusivity will create a media platform of the utmost quality and soon everyone will understand why Taboo is the best in the industry. Their NFT Marketplace and media platform will be cross chain, utilizing layer 2 solution protocols with the lowest fees and fastest transactions. An asset bridge to the ERC20 Network, along with Version 1 of the marketplace, to bring ERC721 and ERC1155 compatible NFTs to the Taboo Ecosystem, on the Binance Smart Chain. Their Marketplace will be built on the Plasma Network, targeting networks like Polygon and Harmony and Sol. There will also have a merchandise store where you can buy your favorite goodies. A unique forum will be made, too, with special incentives and rewards for generating traffic. However, what is the biggest hurdle in the adult industry? Anyone with a camera can create erotic media. Our NFT marketplace tier system aims to create scarcity, in an oversaturated market. The more Taboo Tokens a person holds, the more content they can access, Similar to buying Diamond tier on Patreon. Each tier will grant access to more and more content, with the highest quality and most exclusive content contained at the highest tier for the most discerning of consumers. Their highest Tier includes private VIP party invites to the Taboo Mansion, industry events, and model meet and greets. Want a minted NFT of a sexy playboy model in lingerie or a bikini? Access to XXX-rated NFTs? Private live shows+Rated-R videos? VR content? The ability to transfer NFTs seamlessly from various networks onto our marketplace? Or maybe you are a content creator that would like to test out the opportunity to generate passive income rewards? The answer to all these questions is TABOO. Buy, sell, interact, create, earn. The $TABOO way.","links":"https://taboo.io","market_cap":440516,"market_cap_rank":5297,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/taboo-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x9abdba20edfba06b782126b4d8d72a5853918fd0","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9abdba20edfba06b782126b4d8d72a5853918fd0"}}}