{"name":"Horizen","id":"zencash_base","symbol":"zen","description":"What is the project about? Horizen is a modular privacy-first platform designed to make privacy technology, such as zero-knowledge proofs and TEEs accessible and usable across the web. Originally launched in 2017 as a fair launch, non-ICO project, Horizen is now undergoing a major evolution with the launch of Horizen 2.0, a next-generation Layer 3 (L3) appchain deployed on Base, the Ethereum Layer 2 developed by Coinbase. Horizen 2.0 is built as an Ethereum-aligned Layer 3 appchain on Base, inheriting Ethereum's security while implementing its own application-level integrity guarantees. Key components of Horizen’s security model include: Ethereum-Aligned Security: As an appchain deployed on Base, Horizen 2.0 benefits from Base’s rollup security and settlement on Ethereum, ensuring robust finality and composability with other L2 and L3 applications. Simplified and Secure Architecture: Unlike Horizen’s previous iterations (which used a hybrid PoW/PoS model), Horizen 2.0 focuses on application-level security, decentralization of its privacy layers, and composability with existing infrastructure — reducing complexity and increasing user safety. Decentralized Privacy Stack: Horizen’s focus on decentralizing privacy infrastructure (e.g., decentralized proof generation) allows for modular, secure applications that uphold data confidentiality without compromising performance. What makes your project unique? Privacy-first Approach: Horizen integrates a diverse stack of privacy-enhancing technologies (PETs) — including zero-knowledge proofs (ZKPs), trusted execution environments (TEEs), attribute-based encryption (ABE), multi-party computation (MPC), and fully homomorphic encryption (FHE) — to deliver scalable, flexible, and future-ready privacy solutions across its platform. First Privacy Appchain on Base: As an L3 on Base, Horizen benefits from Ethereum’s security and Base’s scalability, while enabling a privacy layer for any app on the network. This unlocks new possibilities for private identity, DeFi, onchain gaming, and compliant confidential transactions. Zero-Knowledge, Without the Trade-Offs: Horizen 2.0 scales ZK privacy and verification by integrating with leading zk infrastructure providers such as Fermah, zkVerify, and Singularity, optimizing proof generation for performance, cost-efficiency, and developer usability. Token Utility Expansion: ZEN’s updated tokenomics allocates 5 million unminted tokens toward strategic ecosystem growth. ZEN powers DAO governance, serves as a payment token in privacy apps, and supports a sustainability fund to accelerate privacy innovation. Developer-Centric Design: With EVM compatibility, privacy-friendly tooling, and the ability to embed privacy directly into smart contracts, Horizen allows developers to build privacy-first apps without requiring deep cryptographic expertise. DAO-Led Governance: Governed by the Horizen DAO and shaped through community proposals (ZENIPs), Horizen is evolving as a fully decentralized protocol with transparent development and decision-making. What can your coin/token be used for? Horizen 2.0 delivers performance, privacy, and scalability for developers building privacy-enabled and compliance-friendly applications, with significantly reduced cost and latency. At the core of the ecosystem is ZEN, the native utility token used for governance, accessing privacy services, and fueling zkApp interactions. With its migration to Base, ZEN becomes an ERC-20 token, improving liquidity, interoperability, and composability across the broader Ethereum ecosystem.","links":"https://www.horizen.io","market_cap":138602605,"market_cap_rank":340,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zencash/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xf43eb8de897fbc7f2502483b2bef7bb9ea179229","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xf43eb8de897fbc7f2502483b2bef7bb9ea179229"}},"is_native":false}