{"name":"SeedLaunch","id":"seedlaunch","symbol":"slt","description":"What is the project about? Seedlaunch is a multichain crowdfunding platform with international brokers' support, NFT-marketplace, and a unique NFT collection. Our goal is to provide convenient and efficient solutions for IT startups to launch their projects on the international crypto market successfully. Seedlaunch will implement a centralized launchpad with professional compliance project verification and decentralization in accordance with DAO principles. The launchpad supports IDO, IGO, INO on popular platforms BSC, Ethereum, Solana, Polygon, TON, Cardano, Bitgert. What makes your project unique? 1.The Seedlaunch team is working on creating technical solutions that allow integrating the launchpad functionality and IDO, IGO, INO products into traditional brokerage companies. 2.NFT marketplace for holding IGO, INO, as well as reselling the NFT collection Seedlaunch, developed by a famous artist, which opens up unique platform opportunities for its holders. 3.Services for community development: SeedLaunch will offer several tools for startups to help with community development, including airdrop platforms, giveaways, and other solutions. 4.Team Search Services: A specialized platform where professionals can leave information about themselves, whereas startups and blockchain companies can find the right staff or performer for a specific task. You can learn more about the platform's features from the white paper & website . History of your project The project was founded at the end of 2022. Now the winners of the Binance hackathon and specialists with experience in brokerage companies are developing and launching the project. What can your token be used for? SLT Token - The utility token of the SeedLaunch project is SLT, which opens additional access to important features and services of the platform. The token will be released on BSC, TON, and other networks.","links":"https://seedlaunch.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/seedlaunch/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd70d1dd91ecd79c6f8de86924571a454ff587818"}}}