{"name":"Litedex","id":"litedex","symbol":"ldx","description":"\"Litedex goal is to create a multi & cross blockchain in our platform. Litedex now completed our first DeFi blockchain in Binance Smart Chain and we are currently on the progress on making our wrapped token smart contract on Ethereum Blockchain. Though we will have multiple DeFi blockchain products in Litedex, it is very important for our holders to understands that, our holder is not investing on a Dex or a mere DeFi token project. Our holder is indeed investing on a Meta Finance Blockchain System Integrator, as we BELIEVE the moment metaverse is becoming REAL, our product will help metaverse user to bridge their token in the metaverse seamlessly. Therefore combining multiple blockchain is very critical on our first 24 months products development. Litedex have 2 business model; - 1st is our B2C Model, as our goal is to build an ATM & banks in metaverse for user to be able to bridge their token from 1 blockchain to another blockchain in a seamless experience without existing metaverse dimension. - And B2B is our 2nd Business model where we would sell & affiliates our Meta Finance backbone infrastructure into their metaverse project. Therefore their meta community are able to transact in their metaverse without putting an effort on generating liquidity on every blockchain and re building their multi and cross bridge again Litedex achievements: - Litedex has successfully sold 3,000,000 LDX tokens just a hour at our ICO II event by March, 16th 2022 - Our Telegram community group has more than 300.000 member - Litedex is on the Top 20 DAO in Snapshot - Litedex SmartContract has audited in CertiK - Litedex awarded by the MURI record as the \"\"1st Metaverse Signing Agreement\"\" - Litedex is supporting CAKRA Associate for Blockchain Education in 14.000 Highschool in Indonesia\"","links":"https://www.litedex.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/litedex/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x8286387174b8667ae5222306a27e9ab5189b503b"}}}