{"name":"Suzuverse","id":"suzuverse","symbol":"sgt","description":"What is Suzuverse? 15years ago Suzuverse team started internet businesses with the hope and passion of bringing the world closer together and getting people richer. 15 year on, Suzuverse team tell people internet becomes Web3 decentralization. Internet, blockchain, digital assets and metaverse are just means to an end. Creativeness, curiosity, imagination, freedom and transparency are far more valuable traits. Suzuverse will provide an extraordinary MR techonology and experiences to help you unlock to the fullest the potential of virtual worlds and the metaverse. What are SGT token utilities? (It must be based on the agreement between DAO and Suzuwalk development company) -For buying important rights and asset of Suzuverse -For staking to get voting power (xSGT) -For getting discount on tax/fee: 25% of tax/fee will be discounted by paying with $SGT -For level up: Users need to pay a certain level-up fee with Both of $SZT & $SGT. -For staking to upgrade account -For NFT minting & customization What is DAO and Community Strategy of Suzuverse? The Suzuverse can be a dynamic medium for building an active, highly engaged community and attracting third-party developers from around the world. To build a strong network of independent developers and creators, Suzu wants to set open design & development standards that enables independent creators and developers to participate in the creation of our metaverse. In the mid-term, Suzuwalk development company will shift its focus from as a developer to as an orchestrator that is responsible for operating the platform, growing the Suzuverse and managing its partnerships, setting legal rights as legal company etc. Holding xSGT by staking will grant users voting rights that will help the Suzuverse transition into a community-governed DAO, or decentralized autonomous organization.","links":"https://suzuverse.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/suzuverse/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x5b649c07e7ba0a1c529deaabed0b47699919b4a2"}}}