{"name":"Supreme Finance","id":"supreme-finance","symbol":"hype","description":"Supreme Finance has begun a complete blockchain solution that is a fully-integrated user-friendly platform/service to connect as many crypto-muggles with the many products and services about Decentralized Finance (DeFi), Game Finance (GameFi) and now extended its services to Play-To-Earn (P2E), non-fungible tokens (NFTs), and the metaverse. Our initial goal was to make DeFi simple and easier to use to offer a better user experience for those who are intimidated by the learning curve, therefore lowering the barrier-to-entry. We are focusing on working towards mass adoption through the existing bleeding-edge and making that experience as seamless as possible for the user. NFT services with its various asset trading and management purposes have established a steady position in the market. So Supreme Finance now intends to develop a new asset management service by combining the versatile NFT asset services with DeFi. Supreme Finance connects its own NFT market with an external NFT market to register assets and use DeFi's financial services with the registered assets as collateral. Users will have a means of generating new revenues after owning and trading NFTs. All these actions are distributed and managed on the Blockchain. Our Mission To provide the greatest profit for users through these objectives: - Aim to provide a guaranteed minimum return. - Build a new user-friendly UI/UX for user convenience. - Allow for user rewards to be paid and used immediately. - Support NFT trading and staking to maximize returns. - Allow for easy swapping between tokens. - Ensure all governance will be implemented/decided through the Governance Token. Our Vision To provide - High Accessibility - Decentralized finance with stable APY - NFT asset and DeFi interworking platform Our Services HYPE NFT Marketplace HYPE NFT Marketplace is a proprietary NFT platform created based on an exclusive contract for global copyright. Unique NFT marketplace Supreme NFT’s exclusive images and videos are provided through contracts with partners, helping us distribute exclusive works in the current market. In addition to selling NFT products, we also provide cross-service between NFT products and DeFi products. Staking various NFTs The staking service provided by Supreme NFT did not start from the perspective of simple storage and interest. Since NFT is a unit of blockchain that is linked with virtual assets, Supreme NFT tries to frame the NFT Token (product) as a virtual asset, like the Defi service. Unlike other services that receive a simple fixed APY, an additional reward algorithm works in the social relationship of the actual NFT product. For example, if a picture of a sports star is stored as an NFT, additional rewards are provided when the sports star performs outstandingly. Trading, staking, and various reward systems Rewards in the NFT marketplace are determined by transactions and royalties. And DeFi service is determined by APY according to the profit from deposits and loans by liquidity supply. Therefore, it has a very simple reward system. Supreme Finance tries to take a new dynamic reward system by mixing a change into this simple market reward system. While staking for NFT products stores the value as DeFi and maintains basic APY, additional rewards will be provided as a bonus by reflecting the social interest and value of NFT products. This is a service of a different concept from simple farming, and it will give customers the fun of receiving rewards from various points as if they were playing a game. P2E Contents HYPE Contents Platform has a reward system to connect various content. With a new game system called Play-To-Earn, customers can enjoy the game and get HYPE Tokens as a primary reward, then obtain additional rewards by staking the acquired HYPE through the DeFi Service. In addition, the game’s essential characters or accessories might also be purchased through the HYPE NFT Market. HYPE DeFi Service Optimized Weighting System for Maximal Returns (Reward Booster) Minting Feature for Boosting Customer's Return Rate (Minting Booster) NFT Staking Service","links":"https://www.supremefinance.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/supreme-finance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x62891201468a517eeec00fe72f33595a3f9047ee"}}}