{"name":"GEI BEAR","id":"gei-bear","symbol":"gei","description":"GEI BEAR ($GEI) is a community-driven meme token built on the XRP Ledger (XRPL). It was born from the resilient spirit of XRP holders who have withstood years of market skepticism, ridicule, and doubt—particularly from critics dubbed \"GEI Bears.\" Rather than remain passive, the XRP community chose to answer with humor, memes, and a bold new token that turns mockery into motivation. GEI BEAR aims to become the unofficial meme ambassador of the XRPL, blending entertainment, community engagement, and blockchain functionality. In an era where meme coins capture mass attention and cultural power, GEI BEAR takes a unique position by representing a specific subculture within crypto: those who never gave up on XRP. By embracing satire and internet culture, the project energizes a new wave of XRP holders who want more than just passive investment—they want fun, community, and identity. The token features zero tax on buy and sell transactions, making it frictionless to trade and ideal for fast-paced meme coin markets. It is fully deployed on the XRP Ledger, taking advantage of the network’s high-speed, low-cost, and eco-friendly design. With a total supply of 69,420,589 $GEI, the project embraces meme culture to its core while ensuring supply is capped for scarcity. Beyond trading, $GEI is also the key to accessing the GEI BEAR NFT collection on xrp.cafe, where holders can collect, trade, and show off bear-themed NFTs with rarity traits. These NFTs strengthen community bonds and add another layer of engagement and utility to the ecosystem. The GEI BEAR community thrives on Twitter, Telegram, and expanding platforms like TikTok, where memes, updates, and events foster ongoing interaction. The team is also exploring future use cases such as governance voting, exclusive holder events, and staking or burn mechanics—all driven by community input. Importantly, GEI BEAR makes no claim of utility beyond its entertainment and community value. It is intentionally transparent as a meme coin—but one backed by purpose, culture, and relentless community energy. Whether you’re a long-time XRP supporter or new to the world of crypto memes, GEI BEAR invites you to laugh, hold, and join the movement that turns doubt into digital gold.","links":"https://geibear.com/","market_cap":193236,"market_cap_rank":6499,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gei-bear/logo.png","detail_platform":{"xrp":{"decimal_place":0,"contract_address":"gei.raadqNCqPHhqpb5HEMBjbfFa21YYu9GWfW","geckoterminal_url":"https://www.geckoterminal.com/xrpl/tokens/gei.raadqNCqPHhqpb5HEMBjbfFa21YYu9GWfW"}}}