{"name":"retardcoin","id":"retardcoin_solana","symbol":"retard","description":"In the fast-paced, over-hyped world of crypto, where bots front-run trades and billionaires tweet market-moving nonsense, retardcoin stands proudly as the people’s champion — slow, irrational, and gloriously misinformed. Built on pure degeneracy and fortified by a community of diamond-handed apes who read charts upside-down, $retardis the only coin that proudly declares: “We have no roadmap, but we’re still going to the moon.” retardcoin has quickly snowballed into a movement. $retard features zero utility, infinite volatility, and an unwavering commitment to bad decisions. There’s no whitepaper — just a napkin drawing of a rollercoaster with the caption “Wheeeee!” Unlike other tokens that pretend to solve real-world problems, retardcoin solves nothing. In fact, it creates problems — like explaining to your tax accountant why you YOLO’d your rent money into a coin called retard. But that’s the beauty of $retard: it doesn’t try to impress institutions, pass regulations, or make sense. It exists purely for the meme. The retardcoin community thrives on chaos. Fueled by late-night Twitter spaces, misspelled Telegram posts, and endless hype cycles, holders pride themselves on buying tops, selling bottoms, and repeating the cycle with delusional optimism. Forget technical analysis — here, we use vibes and TikTok astrologers. Disclaimer: retardcoinis a meme token with no inherent value, utility, or intellectual merit. It’s offensive by design and not recommended for anyone with common sense or financial goals. If you’re still reading this and considering a purchase, please consult a therapist — or at least your mother.","links":"https://retardcoin.world/","market_cap":42694,"market_cap_rank":8454,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/retardcoin_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"FtTSDNLD5mMLn3anqEQpy44cRdrtAJRrLX2MKXxfpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/FtTSDNLD5mMLn3anqEQpy44cRdrtAJRrLX2MKXxfpump"}},"is_native":false}