{"name":"EZZY Game","id":"ezzy-game","symbol":"ezy","description":"What is EZZY Game? EZZY Game is an M2E game that rewards you for walking and running outdoors. Its key features are simplicity and ease-of-use, as well as well-developed tokenomics designed to minimize the likelihood of excessive market fluctuations of the in-game EZY token. How EZZY Game works EZZY Game is powered by the special Proof-of-Walk algorithm which tracks user activity using an accelerometer, the Internet and geolocation and rewards them with EZY tokens based on the data received. To start mining tokens, you need to install EZZY Game on your smartphone. The test Sneakers will immediately become available to you as a gift. Allow access to GPS, start the training and go outside to walk and get tokens. Each training lasts 10 minutes. The test Sneakers allow you to understand how EZZY Game works and give you the opportunity to get some reward. To get more tokens for walking, you can mint NFT Sneakers using EZY tokens exchanged for USDT. You can also mint multiple pairs of NFT Sneakers at once to train and get even more rewards. Why EZZY Game is unique EZZY Game has no complicated and unnecessary GameFi mechanics — the game is simple and clear. No level and attribute max-out, additional elements to enhance training effectiveness, different speed modes and other complex components inherent in M2E applications. All NFT Sneakers only differ in the following: Mint amount is how many EZY tokens you need to use to get new NFT Sneakers. Mining power is how many EZY tokens per day 10-minute workouts can generate. Durability is how many days NFT Sneakers will generate EZY for training. All NFT Sneakers have the same speed limit (3–9 km/h), as well as a transparent and predictable reward. To make EZZY Game economy stable, NFT Sneakers are released in limited series. The goal is creating a long-term sustainable M2E app tokenomics that prevents spikes in the market and influence of the whales. Why EZY token is needed EZY is an in-game token of EZZY Game","links":"https://ezzy.game/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ezzy-game/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb452bc9cead0b08c4ef99da0feb8e10ef6bb86bb"}}}