{"name":"Ankr Staked BNB","id":"ankr-staked-bnb","symbol":"ankrbnb","description":"What and why is Binance Liquid Staking? Instant Liquidity Using Ankr Staking is the best way to stake BNB as you can access instant liquidity in the form of the ankrBNB token. Avoiding locking your tokens up with the BNB Chain network is a big advantage — it allows you to use the value of your staked tokens to earn multiple layers of rewards on DeFi platforms and multiply your ROI potential. As Liquid Staking solves the capital inefficiency problem of (Nominated) Proof-of-stake networks, it offers a way to earn additional rewards on your staked BNB, enabling new yield farming strategies, arbitrage trading, lending, and more will all be possible using the value of your staked assets. ankrBNB is a reward-bearing token, meaning that the fair value of 1 ankrBNB token vs. BNB increases over time as staking rewards accumulate. No technical knowledge is required Receive an easier staking experience with no technical knowledge necessary. Liquid Staking makes staking as easy as a swap: exchange your BNB for the reward-bearning ankrBNB token. Enhanced decentralization Our BNB Liquid Staking will not use only Ankr validator nodes to stake the BNB from users. Ankr Staking will select several suitable and reliable BNB Chain validators, making BNB Liquid Staking as decentralized as possible. This means that Ankr will not contribute to giving any party more influence over the BNB Chain network as the BNB will be spread over a wide variety of nodes. Ultimately, the goal is to have Ankr governance decide on the target allocation to different validator nodes. Contribute to the security of the BNB Chain network Staking with BNB Liquid Staking allows you to play an important role in boosting the network’s security as a whole. Ankr’s BNB staking system distributes staked tokens intelligently across the BNB Chain ecosystem to help the network achieve optimal decentralization. Diversity and decentralization of active validators both ensure the network remains as secure as possible.","links":"https://www.ankr.com/staking/stake/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ankr-staked-bnb/logo.png"}