{"name":"Exeno Coin","id":"exeno","symbol":"exn","description":"As a decentralized finance (“DeFi”) & crypto commerce (\"c-commerce\") tech innovator, exeno is developing blockchain solutions from the ground up, with its vision to \"bring crypto to life\". To get there, it started with exeno store, deployed over a year ago. After its success, the company decided that - with it and upcoming features on the roadmap - it will need its own cryptocurrency to \"power\" the entire ecosystem it plans to develop & deploy. Introducing exeno coin an EIP 1363 token which will do just that as well as other initial features including but not limited to: *Offer utility within both exeno.com & exeno.finance *Power numerous benefits like the the exeno ambassador & affiliate programs. *Be multi-blockchain from day one as it is built already on ethereum, binance smart chain, and polygon, and more on the horizon. The company doesn't stop there and is on track to deploy its other large milestones including its currently launched innovative DeFi, payments, and Web3.0 ID platform, exeno finance which brings these numerous products and services seamlessly under one roof solving challenges across industries especially DeFi and crypto commerce. With the introduction of exeno finance, the team are on their way towards launching the world's first peer to peer (\"p2p\") crypto only marketplace, known as exeno 2.0 by end of Q2 2023. And there is more planned on the horizon, with exeno coin being a critical piece of all these products & features. The team encourages visiting the website and reading the whitepaper to better understand the whole scope of how exeno & exeno coin plans to be a leader within the DeFi, payments, and overall crypto commerce space.","links":"https://coin.exeno.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/exeno/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0c9b3ab1bd0cf0745625381f5c3aa1cd9bbc7abb"},"polygon-pos":{"decimal_place":18,"contract_address":"0x0c9b3ab1bd0cf0745625381f5c3aa1cd9bbc7abb"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0c9b3ab1bd0cf0745625381f5c3aa1cd9bbc7abb"}}}