{"name":"Jerry Inu","id":"jerry-inu","symbol":"jerry","description":"What is the project about? Jerry Inu aims to bring fun and entertainment to the world of decentralized finance. By leveraging the power of meme culture, we hope to create a community-driven platform that allows users to earn, trade and hold Jerry Inu tokens. Our vision is to create a fun, engaging and innovative ecosystem that brings people together and empowers them to participate in the future of finance. What makes your project unique? our tokenomics is designed to reward long-term holders, with a 10% transaction fee that is distributed to holders, discouraging dumping and encouraging holding. We have a strong community focus, with regular community events and a commitment to transparency and open communication. Our team is dedicated to creating a fun and engaging platform that leverages the power of meme culture to bring a new level of entertainment to the world of decentralized finance. History of your project. We set out to create a community-driven token with strong tokenomics, transparency, and fun. Since then, Jerry Inu has established itself as a leading player in the world of meme tokens, with a growing community and exciting plans for the future. We remain committed to our vision of creating a fun, engaging, and innovative platform that empowers users to participate in the future of finance. What’s next for your project? We're focused on building a strong and sustainable token economy that rewards long-term holders and fosters a vibrant community. Our roadmap includes expanding our partnerships, listing on new exchanges, and launching new products and features to enhance the user experience. We also plan to increase our marketing efforts to reach new audiences and spread the word about Jerry Inu. What can your token be used for? Jerry Inu can be used for various purposes, including trading on decentralized exchanges, participating in community events, and as a means of payment within our ecosystem.","links":"https://jerryinu.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jerry-inu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xdd6978f36c98aff4287e5ac803c9cf1b865641f6"}}}