{"name":"Merit Circle","id":"merit-circle","symbol":"mc","description":"The Merit Circle DAO is an ever-evolving digital ecosystem built by a global community to ensure the future of gaming. With a strong foundation in the web3 space, we are committed to integrating the endless possibilities of blockchain technology with the latest in gaming to create the next generation of immersive gaming experiences. Activities by the Merit Circle DAO can be divided into four verticals, each with their own respective product. Collectively, they form an ecosystem that adds value to the DAO and, thereby, the $MC token. Merit Circle investments: Since its creation, the DAO has invested in countless projects across the web3 landscape and worked hard to create a resilient treasury that’s able to weather the shifting tides of the industry. In order to continue supporting the growth of the DAO, we are committed to optimally running the treasury to ensure we have the resources to support our growth. Merit Circle gaming: The Merit Circle DAO would not exist without the gaming industry. While we look towards expansion across our ecosystem, we will continue to scale-in games that are engaging and well-designed. Setting our sights on disrupting the dated practices set by the industry, we will be focusing on advancing our gaming infrastructure to ensure it is both entertaining and rewarding for gamers. Merit Circle studios: As an organization at the forefront of gaming, the Merit Circle DAO is determined to contribute to the industry on a much larger scale. Through our studios vertical, we can unleash our creativity and take a hands-on approach in building new games and incubating innovative projects. As the DAO has expanded, so too has our knowledge and experience of the industry, which we aim to leverage while growing this space. Sphere marketplace: The explosive growth of the NFT space in the web3 industry exposed some clear areas for improvement that prevent it from reaching a broader audience. With our vast amount of in-house knowledge and experience in gaming, we are committed to making our NFT marketplace Sphere the best fit for gamers.","links":"https://www.meritcircle.io/","market_cap":54491422,"market_cap_rank":655,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/merit-circle/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x949d48eca67b17269629c7194f4b727d4ef9e5d6"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x949d48eca67b17269629c7194f4b727d4ef9e5d6"}}}