{"name":"DUEL","id":"duel","symbol":"duel","description":"# What is DUEL? The native token of Prism, developed by Rainmaker Games Prism is a gamer-focused platform poised to unveil a suite of gaming tools and frictionless experiences that caters for both gamer and game creator. DUEL is the native utility token that is used for: * Community voting on proposals * In-game utilities, we have launched 4 games already * Use cases in our digital asset & NFT marketplace * Staking * Profit-sharing for token holders ## What are the pain points that Prism is trying to solve? * Prism is a suite of gaming tools where each tool addresses a key need. * Our first 5 tools are described below: Arcade: A vast gaming library comprising our own first-party games, third-party blockchain games, games created in our creator program, and retro arcade games licensed from premier gaming companies. Challenge: A skill-based wagering platform where users compete in 1v1 or group challenges and wager against others on top web2 and web3 game titles. Users can even create their own challenges and take a cut of the winnings! Develop: Open-sourced AI dev tools, which we use to build games. Create your own game to host in Arcade and revenue share on the platform. This initiative will be launched in tandem with our creator program, enabling revenue sharing. Swap: With a mission to reach gamers everywhere, a cross-chain swap tool will power the platform to allow a seamless and easy swap system for your digital assets. Wallet: Building a DEX into the platform makes platform onboarding and asset storage easy. We aim for users who are completely web2 to play our games without understanding blockchain. This leads us to develop the Prism wallet, which will hold all digital assets brought into and earned in our games. Its cross-chain and fiat on-ramp will be necessary for the next wave of gamers.","links":"https://prism.rmg.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/duel/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0e79de3a7ee59abf6086c2138231b1f8ec8c638e"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x60a8b010e2d7e536f576d15cfb8ffae99227df61"}}}