{"name":"Chooky","id":"chooky","symbol":"$choo","description":"Chooky is an ecosystem upon the blockchain unlike any other in the industry. Aspiring to be the premier entertainment hub of crypto, with an already established music label, music streaming platform and upcoming animation series, Chooky has become a pioneer in crypto providing such fundamental real life use case. The Chooky music labels premier release with Elesia Iimura and OT of the “Chooky” song has caused waves in the industry with over 200k streams on Spotify, over 200 organic videos on Instagram and Tik Tok with multiple dancers, Djs, night-club owners and events managers all joining the trend and culture. The song also featured on some of the hottest Hip Hop outlets world wide like World Star hip hop, this is 50, The Breakfast club and many others. This indicates and validates the fact the Chooky music label can put relatively unknown artists on the map and everything associated with the song incubation process was funded majorly by the label, while the royalties and revenue share is considerably more favourable to the artists than any other music label in the industry. The Chooky crypto animation is a educational, informative and light hearted series about everything crypto. Primarily centred and focused around memecoins has been in production many months now and is set to release in the coming month post launch. Having partnered already with Volt Inu and Squidgrow to feature in the series, many more NFT projects, memecoins and crypto partners will be added as the series is released. The Anime NFT owners will the have Dao governance over the full direction of the free streaming animation series about the daily happenings of crypto and those NFT owners who contribute to the series will earn rewards in tokens, Merch or ETH.","links":"https://chooky-inu.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chooky/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x244748587f145c0571e92e85429d711d1b4cc43a"}}}