{"name":"Pengycoin","id":"pengycoin","symbol":"pengy","description":"Pengycoin is a meme community on Solana, and our website represents the culture we take great pride in—it simulates an operating system. Initially, our founder, an amateur developer, built the website with the help of ChatGPT and open-source projects from GitHub, aiming to satirize meme coins that have no real utility. The project was fair-launched on Pump.fun 2024. This is a purely community-driven project. When our founder started it, he only had $65 left in his pocket, far from enough to normally launch a meme coin. That’s when he found Pump.fun and fair-launched the project without any team members. He never expected so many people to resonate with the project and its story. As more community volunteers joined, the project stood out and gradually grew into what we see today. Now, Pengycoin has evolved into a diverse meme community. Whether you're new to crypto, a seasoned trader and investor, or a gaming addict, we aim to be your all-in-one hub for a smooth and enjoyable experience. In PengyOS, users can access various dApps, fun apps, browse crypto news, check out memes, play games, and even listen to our rap album. It’s also available on Apple Music, Spotify, and YouTube Music. We also created a decentralized chat service called PengyChat and developed a mobile app for Solana Mobile’s SAGA and Seeker phones. Recently, our new product PengyAI has also been integrated into PengyOS and has received strong support and retweet from Solana Mobile! This project is full of narrative and challenges, but thanks to the growing support of community volunteers, Pengycoin has reached new heights. The journey continues, just like our song - Road to Billions.","links":"https://pengycoin.com/","market_cap":876222,"market_cap_rank":4069,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pengycoin/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"9YHZjCb14bB9XWZz6FZPTf5nek7kLeoGHmNNrgcxpump"}}}