{"name":"MNet Continuum","id":"mnet-continuum","symbol":"nuum","description":"MNet (Metaverse.Network) , developed by BitCountry team, stands as a scaled blockchain made easy and interesting for wider audience, intricately designed to foster a vibrant and enriched social framework and ecosystem. Our platform is a beacon for developers, offering robust support for both WASM and Ethereum-compatible smart contracts. This enables the seamless creation of diverse and innovative decentralized applications on our network. Core components of Metaverse.Network: Blockchain Our core blockchain technology underpins the network, facilitating the integration of EVM and WASM smart contracts, thus offering a versatile foundation for blockchain development. Bit.Country Immerse yourself in the super app of Bit.Country, a metaverse-like digital environment. Here, members can engage in a unique land economy, explore extensive 2.5D/3D spaces, participate in events, & connect via messaging. Our platform includes a comprehensive marketplace, NFT trading, interactive meetings, and a dynamic timeline feed, enriching the user experience. Bit Avatar Experience the novel concept of Bit Avatar – soulbound digital personas tailored for social interaction, communication, and earning opportunities within the Web3 space. SP Protocol Join forces with a community to earn native rewards. The SP Protocol is designed to facilitate collaborative earning and community engagement. ESE Framework SDK For developers seeking to create rich & multichain applications, our ESE Framework SDK is the gateway. It comes packed with prebuilt modules including spatial design, meeting functionalities, & more, streamlining the app development process Utilities of NUUM - Native coin for paying transaction fees on the blockchain network - Governance token - Universal currency in the Core components - NUUM Stakers will also receive priority early access to innovative new projects at MNet Innovation. A Special Grants Program has been designed to support brand-new ideas in the AI, DePIN and Re-staking.","links":"https://mnet.io","market_cap":253451,"market_cap_rank":6086,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mnet-continuum/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"nuumnQ637GtKPis16AeU3PhNru74S7tK9GdjYVATbxL","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/nuumnQ637GtKPis16AeU3PhNru74S7tK9GdjYVATbxL"},"base":{"decimal_place":18,"contract_address":"0x41485fa1ff3c677d1f09fc8b9576560e4a4c223c","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x41485fa1ff3c677d1f09fc8b9576560e4a4c223c"}}}