{"name":"Distributed Autonomous Organization","id":"distributed-autonomous-or","symbol":"dao","description":"What is the project about? DAO (Distributed Autonomous Organization) is a community independent think tank and collective intelligence unit. We will be committed to building a fully integrated Dao community covering multiple fields. What makes your project unique? Open governance: The beginning of DAO will serve as a think tank. However, as it matures to the extent that the private market sector is interested, governance will be semi standardized and members can vote or veto. Through open governance, community members will have a fair opportunity to propose, share, and veto public agendas that are crucial to the direction of # DAO. History of your project. The DAO project was initially founded in June 2017 by a group based on their vision for Web3.0. In July 2018, the DAO community held an online conference on global mining machine ecological development. In March 2019, the DAO community announced the establishment of a dedicated blockchain laboratory. In May 2021, The DAO Lab released the progress of the DAO project online, conducting in-depth research and technological development on Web3.0 and mining machine energy loss. In June 2021, The DAO Lab has launched a global recruitment campaign, hoping to attract more like-minded individuals to join the laboratory. As of now, DAO's open source code has passed the review, and the DaoSwap platform has passed the code review of PeckShield Inc. What’s next for your project? DAO aims to uphold the concept of Web3 and create a diverse ecosystem with six characteristics: sustainability, connectivity, immediacy, creativity, compatibility, and economic attributes. Multi chain integration, serving entities, efficient and low-cost, self&Autonomous","links":"http://daoswap.financial/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/distributed-autonomous-or/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x037b202ca88d2028d82936d5615ee5088cb9fd78"}}}