{"name":"Axle Games","id":"axle-games","symbol":"axle","description":"Axle Games is a skill-based web3 gaming platform that offers various single-player and multiplayer games with live contests that run daily on the platform. By establishing a secure, supervised, and responsible environment for competition that will have a good and enduring impact, Axle Games is on a mission to become the most player-focused gaming platform in the world. We are primarily focused on skill-based word games, as we believe a fair outcome can only be achieved in a game of skill compared to a game of chance. One of the key propositions of Axle Games as a platform is freemium play, a low platform fee, and transparency. The project is in development for last 1 year and we are continuously building games for our users. 4+ games are already live on practice mode and will be released on mainnet after the game contract audits. We are actively building various skill-based games for our users. Right now, we have four different games already live in practise mode. We will be auditing our game smart contracts before we release our games on the mainnet. Axle is a universe of various offerings. We are moving towards building a fully decentralised platform for our users. Axle DAO, Swap, and Stake will be released once our games go live on the mainnet. Axle Token comes with various utilities: it can be used as game currency, for governance and subscription services, and can be used to make purchases on our online marketplace. A more detailed article has been published discussing $AXLE token use cases and our tokenomics. $AXLE token: https://medium.com/@axlegames/Introducing-Axle-Token-by-AxleGames-1fe0c5b66b4d","links":"https://axlegames.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/axle-games/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x7c56c79a454cbfaf63badb39f82555109a2a80bf"}}}