{"name":"Genius X","id":"genius-x","symbol":"gensx","description":"BLOCKCHAIN AGNOSTIC ACCELERATOR & LAUNCHPAD (1) To projects, we are the only evergreen accelerator (always open and running and not dependent on shareholders/sponsors), with a 100% customized acceleration services - no fixed-term/3-month group activities with a demo day that does not consider each project's own problem and challenge. Our engagement is typically long-term: we don't believe you can offer a project a lot of support within 3 months. Venture building takes time - a year or more, we are always there to make sure we do everything for projects at the right point of time. (2) To communities, we are the only tokenized accelerator, where we involve community in the venture building business and share with community the value and revenue generated at Genius X, through our GENSX tokens. Other accelerators are centralized / owned by institutions and do not involve community. Our team started building another DeFi protocol before launching Genius X. During their entrepreneurship journey, they gained a lot of valuable experience and learned some lessons, and they already realized a huge lack of truly value-adding support for Web3 founders to build their project. Therefore, we decided to launch Genius X to contribute to the Web3 venture building ecosystem by providing a unique, and really value-adding accelerator product. We have a current pipeline of projects for onboarding to Genius X, and we expect to onboard several of them in the rest of 2023. GENSX token has a very unique utility and value driver. According to Genius X's business model, it will earn tokens of many projects that it will accelerate, as well as fees from helping those projects raise funds and host IDOs (on the launchpad). 20% of all these earnings will be distributed to GENSX stakers.","links":"https://www.genius-x.co/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/genius-x/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"fbae99b8679369079a7f6f0da14a2cf1c2d6bfd3afdf3a96a64ab67a"},"arbitrum-one":{"decimal_place":6,"contract_address":"0xf29fdf6b7bdffb025d7e6dfdf344992d2d16e249"}}}