{"name":"MCOIN","id":"mcoin1","symbol":"mcoin","description":"Mcoin Chain seeks to build a new, distributed infrastructure of digital assets to form an improved, modern framework. And also seeks to link the present to the future, through the implementation of Blockchain technology. Mcoin Chain connects and exchanges value between different blockchain ledgers in a distributed manner. mCoin was designed to provide a foundation for a decentralized internet of blockchains, also known as Web3. mCoin provides a foundation to support a decentralized web, controlled by its users, and to simplify the creation of new applications, institutions and services. The mCoin protocol can connect public and private chains, permissionless networks, oracles and future technologies, allowing these independent blockchains to trustlessly share information and transactions through the mCoin Relay Chain (explained further down). mCoin’s native mCoin token serves three clear purposes: staking for operations and security, facilitating network governance, and bonding tokens to connect parachains . mCoin has four core components: Realy Chain: mCoin’s “heart,” helping to create consensus, interoperability and shared security across the network of different chains; Parachains: independent chains that can have their own tokens and be optimized for specific use cases; Parathreads: similar to parachains but with flexible connectivity based on an economical pay-as-you-go model; Bridges: allow parachains and parathreads to connect and communicate with external blockchains like Ethereum. Who Are the Founders of mCoin? mCoin is the flagship protocol of Web3 Foundation, a Swiss Foundation with a mission to facilitate an open-source, fully functional and user-friendly decentralized web. mCoin’s founders are Mr. Denis Shehu (CEO), Mr. Andrzej Adam(CMO), Mr. daniel Weiss, Mr. Robert Ciurkot(Global Head), Mr. Paul Smith. Mr. Denis Shehu (CEO), is a Thiel Fellow and accomplished blockchain and cryptography researcher and developer. Mr. Robert Ciurkot, is a Blockchain Developer and Mr. daniel Weiss, is an influencer. What Makes mCoin Unique? mCoin is a sharded multichain network, meaning it can process many transactions on several chains in parallel (“parachains”). This parallel processing power improves scalability. Custom blockchains are quick and easy to develop using the Substrate framework and Substrate blockchains are designed to be easy to connect to mCoin's network. The network is also highly flexible and adaptive, allowing the sharing of information and functionality between participants. mCoin can be automatically upgraded without the need for a fork in order to implement new features or remove bugs. The network has a highly sophisticated user-driven governance system where all token holders have a vote in how the network is run. Teams can customize their own blockchain’s governance on mCoin based on their needs and evolving conditions. Nominators, validators, and collators all fulfil various duties to help secure and maintain the network and eradicate bad behavior.","links":"https://m20chain.com/","market_cap":58498883,"market_cap_rank":470,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mcoin1/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}