{"name":"GAMB","id":"gamb","symbol":"gmb","description":"What is GMB and the GAMB Company? GAMB Power to the Merchants, in partnership with Globra, offers an online marketplace called GLMall enabling merchants and their customers to perform daily e-commerce in crypto. To do so, GAMB uses a proprietary parallel chain system by creating a “clone” coin (GMBT) on the SkyFiber blockchain, to its publicly traded ECR-20 parent token (GMB). GMB and its parallel clone are the native tokens of GLMall. This revolutionary and patent-pending parallel token solution allows crypto payments without any blockchain-related transfer or gas fees and is the key to implementing crypto payments in daily e-commerce. Why should I buy GMB? By being a GMB holder you will be part of the first decentralized online marketplace operating in the real world and the metaverse. GMB is easily swappable into its parallel coin GMBT which can be used to purchase goods or services on the marketplace without any fees. How many GMB are in circulation? All of 5.000.000.000 GMB created have been created and issued, along with the same number of clone tokens GMBT. What makes GMB so unique? GAMB’s unique parallel chain solution allows transactions to be completely free, infinitely scalable. For any one active GMBT coin used for transactions on the marketplace (i.e., within the SkyFiber blockchain), one GMB token is locked on the ETH blockchain until a re-swap occurs. This directly limiting impact on GMB liquidity on the ETH blockchain, created through the increased utilization of the GMBT on the Marketplace, forms an organically value-driving token economy. What is the technical basis of GMB/GMBT? GMB is an ECR 20 Token and a licensed utility token. Its parallel clone GMBT's is built on the Skyfiber blockchain using its unique consensus algorithm called \"\"Obelisk\"\". Obelisk consensus mechanism uses a PoT (Proof-of-Trust) consensus algorithm which establishes a unique validation mechanism modeled on a 'web of trust' topography and distributing influence across the network in a manner reminiscent of human social dynamics. Every node has a list of trusted nodes to which it subscribes to and the more subscribers a node has, the more influence it has on the network. Due to the transparent and public nature of the decisions and trust lists located on each node's individual blockchain, a misbehaving node can easily be identified and isolated by the community as nodes will simply remove the malicious node from their trust list, causing the node's influence to decrease. This mechanism allows the community to shift the balance of power on the network rapidly which brings about a highly democratic and decentralized decisioning process. Where can I buy GMB? GMB tokens can be purchased on most KuCoin, Coinsbit & Azbit and provides four trading pairs BTC, ETH, BNB, USDT. Most recent articles about GAMB: https://www.glbrain.com/index.php?r=content/view&id=40813 https://www.youtube.com/watch?v=MSDIqmoFcuo&t=1279s https://finance.yahoo.com/news/first-cinematic-nft-film-series-135800667.html?soc_src=social-sh&soc_trk=tw&tsrc=twtr","links":"https://gamb.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gamb/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x9488936e4a36e3585afeb63377e2393aeac253ea"}}}