{"name":"Lagrange","id":"lagrange","symbol":"la","description":"Today, Lagrange has expanded its ZK Prover Network to power proof generation for ZK rollups, adding onto Lagrange’s existing ZK Coprocessor and State Committee offerings. With this new addition, Lagrange now unlocks proofs for anything – for rollups, apps, coprocessors and interoperability – as an infinite proving layer that enables anyone to prove everything at internet scale. Previously, Lagrange launched the first production-ready ZK prover network in the industry, operated by top operators including Coinbase, Kraken, OKX and more. Now, Lagrange’s ZK Prover Network is expanding to address key challenges faced by rollups and advance ZK adoption and utility. The ZK Coprocessor can generate a proof of correct computation over arbitrary storage slots for arbitrary block ranges. For example, consider an application that wishes to compute the average on Ethereum for ETH / USDC pricing. A developer must first specify the memory slots and block range (~50,400) that they are interested in including in the data set. Next the developer writes the computations that is to be executed across the storage slots over the different blocks in parallel. Once the proof is generated, it will prove both the storage inclusion and the aggregated computation as valid with respect to a block header derived from smart contract information.","links":"https://www.lagrangefoundation.org","market_cap":65196386,"market_cap_rank":692,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lagrange/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0fc2a55d5bd13033f1ee0cdd11f60f7efe66f467","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x0fc2a55d5bd13033f1ee0cdd11f60f7efe66f467"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x389ad4bb96d0d6ee5b6ef0efaf4b7db0ba2e02a0","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x389ad4bb96d0d6ee5b6ef0efaf4b7db0ba2e02a0"}}}