{"name":"Yesports","id":"yesports","symbol":"yesp","description":"What is the project about? Yesports is disrupting the traditional gaming world and democratizing the industry in its mission to deliver complete, user-friendly experiences and bridge the gap between gaming, fans, and web3. Bringing entertainment and access closer to the user, Yesports is leading the way in creating a more inclusive gaming world leveraging new technology. Backed by leading VCs and built with world-leading technology, Yesports is focused on delivering the most valuable digital products for gamers everywhere. What makes your project unique? Yesports is unique in that we have more esports partnerships than any other platform in the space. This allows us to drop completely unique products in collaboration with our web3 gaming network of more than 50 web3 games. Being able to faciliate web3 experiences such as branded game items, esports leagues, speciality events for esports in web3 is a huge point of difference for Yesports. The platform aslo stands out in its offering of a many different fan engagemetn features from gamer No Loss NFT Prize Games, the first esports leagues in web3, speciality round robin tournaments, branded game items, rare colelctibles and whitelabeled esports metaverses to come. Historyof your project? Yesports was founded in September 2021 when the team through its relationships with big names in the esports space realised that esports teams lacked creative, fun and engaging ways to deliver fan-first experiences. It was through that vision of providing new ways for teams to engage their fans that Yesports was created. The first months of Yesports saw the team establish multiple strong partnerships in esports that cascaded to a huge 11 esports teams with a 30m fan reach across 5 continents. In late 2022 Yesports did its first soft launch of 6 teams multi-tiered fully customiseable memberships that saw the first onboarding of esports fans into the web3 space via Yesports. Through the first quarter of 2023 Yesports has succesf","links":"https://yesports.gg","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/yesports/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x46cca329970b33e1a007dd4ef0594a1cedb3e72a","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x46cca329970b33e1a007dd4ef0594a1cedb3e72a"}}}