{"name":"BOCOIN","id":"bocoin","symbol":"boc","description":"We are developing electronic cards for the convenience of providing all payment services with digital currencies, which will be available to the public on the specified date of BOCARD according to the date mentioned in the announcement section.https://bocoin.info/work-2/ BOC can be purchased onhttps://bocurrency.com/ site with more than sixty different currencies, which will increase with the development of Ethereum, Polygon, Phantom, Avalanche, Hedera, Solana, and Tron platform. We have created a diverse ecosystem which is a peer-to-peer financial service without third person intervention, with extensive commercial activities in the world that will cause the high value of coins, we will invest in different areas, BOC is a peer to peer payment system which causes secure and fast payment with low fees and high transaction capacity. And In terms of scalability and transaction speed in terms of consensus and validators and block division and block size has smoothed the transaction problems. Which will be provided in BOC dedicated network program as well. And we emphasize on its decentralization and promotion BOC is designed on the blockchain Binance Smart Chain network As required by our regulators, we have included a role for regulatory compliance to freeze or seize the assets of a criminal person, only if, required to do so by law, including by court order or other legal process. The AssetProtectionRole can freeze and unfreeze the BOC balance of any address on chain. It can also wipe the balance of an address after it is frozen to allow the appropriate authorities to seize the backing assets. BOC will not execute these functions on its own accord, will utilize it extremely rarely (if at all) and only under extenuating circumstances. The list of frozen addresses is available in Frozen https://bocoin.info/frozens/ The use of digital currencies in the world is the goal of the BOCOIN team‌.","links":"https://bocoin.info/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bocoin/logo.png"}