{"name":"Interest Protocol Token","id":"interest-protocol-token","symbol":"ipt","description":"## What Is Interest Protocol? Launched on June 13th, 2022, Interest Protocol (IP) is the first fractional reserve banking protocol on the Ethereum blockchain that pays interest to all depositors. USDi is an over-collateralized stablecoin issued by Interest Protocol. IPT is the governance token of Interest Protocol. Users can mint 1 USDi by depositing 1 USDC into the protocol, and anyone can receive 1 USDC from the protocol by burning 1 USDi that they hold. In addition, users can deposit assets into a multi-collateral vault and borrow USDi against that collateral. Regardless of how they obtained USDi, all USDi holders automatically earn yield without having to spend gas to stake. Given the same amount of capital, Interest Protocol can generate more loans with less liquidity risk than existing lending protocols without fractional reserves. Interest Protocol automatically manages its reserve ratio—USDC in the protocol’s reserve over the total supply of USDi—by employing a variable interest rate system. As the reserve ratio decreases, the borrow and deposit rates of USDi increase, and vice versa. ## How Many IPT Tokens Are There in Circulation? At launch, there will be 100 million IPT tokens in existence. 20% of this will be unissued and held in the protocol treasury. Through governance proposals, IPT holders can collectively decide to mint additional IPT tokens. ## Who Built Interest Protocol? Interest Protocol was developed by GFX Labs. GFX Labs started in 2021 with the goal of building web 3 applications that facilitate ownership and improve usability. ### Where Can I Buy IPT? IPT can be purchased by participating in the [IPT sale](https://interestprotocol.io/#/sale).","links":"https://interestprotocol.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/interest-protocol-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd909c5862cdb164adb949d92622082f0092efc3d"}}}