{"name":"Pollen","id":"pollen-2","symbol":"pollen","description":"Beraborrow unlocks instant liquidity against Berachain assets through the first PoL powered stablecoin, Nectar ($NECT). Built with simplicity and flexibility at its core, Beraborrow is designed to maximise opportunities for users without forcing them to sacrifice yield. The protocol enables users to deposit collateral assets into Dens, which mint our over-collateralised stablecoin, $NECT. $NECT can then be used throughout the Berachain DeFi ecosystem, unlocking further opportunities whilst maintaining exposure to the original assets. Initially built around $iBGT, the protocol has since evolved into a multi-collateral platform. Offering support for Bera native tokens, liquid staking derivatives, or LP positions, as collateral to mint $NECT. Beraborrow enables users to retain price exposure to their assets while unlocking liquidity. The protocol makes use of Proof of Liquidity (PoL) to supercharge key features and to bootstrap liquidity, enabling users to gain leverage to the collateral asset while boosting the yield it generates. Nectar ($NECT) is the first stablecoin fully collateralised by Berachain native assets, offering users a composable way to participate in the ecosystem without selling, all while benefiting from the unique advantages that PoL offers. Essentially, $NECT can be thought of as a unit of account that can accrue value through PoL and liquidations. Consider Beraborrow as a foundational building block for the Berachain. Our ambition is to develop a comprehensive suite of essential products that fuel growth for Berachain, starting with the core need for a Native CDP platform.","links":"https://www.beraborrow.com/","market_cap":864321,"market_cap_rank":4379,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pollen-2/logo.png","detail_platform":{"berachain":{"decimal_place":18,"contract_address":"0xc99e948e9d183848a6c4f5e6c1d225f02f171d79","geckoterminal_url":"https://www.geckoterminal.com/berachain/tokens/0xc99e948e9d183848a6c4f5e6c1d225f02f171d79"}}}