{"name":"ProximaX","id":"proximax","symbol":"xpx","description":"ProximaX is an advanced extension of the Blockchain and Distributed Ledger Technology (DLT) with utility-rich services and protocols. Businesses, enterprises, and innovators can avoid costly and failure prone centralized architecture by utilizing an all-in-one sustainable platform which provides augmented secured services, content delivery, storage, and media streaming. The ProximaX protocol aims to offer DApp developers cost-efficient fault tolerant, multilayer, P2P cloud services including, but not limited to, blockchain-powered P2P storage and bandwidth. A fault-tolerant system is designed to ensure a system remains fully functional even when part of it is ‘down’ or unavailable. ProximaX will build a P2P cloud storage architecture with fault tolerance and a distributed database by removing the central entity and connecting all the servers (or nodes) in a mesh configuration. Failure of any single component of the mesh will have minimal effect upon the overall performance of the system. ProximaX protocol will ensure confidentiality and integrity of the data passing through a myriad of nodes. The use of distributed databases (DHT) ensures consistency and integrity throughout the network. ProximaX distributed file management system (DFMS) interfaces with NEM blockchain and works in four scenarios: 1. ProximaX Public DFMS with NEM Public chain 2. ProximaX Private DFMS with NEM Public Chain 3. ProximaX Public DFMS with NEM Private Chain 4. ProximaX Private DFMS with NEM Private Chain ProximaX will provide DApp developers with an easy-to-use SDK that abstracts the ProximaX protocol layer into a dynamic second layer on top of the NEM blockchain layer that can carry different unique DApp protocols. This will ensure that the DApp developers can build great P2P applications with the best possible security protocols without relying on points of central authority. It will empower developers to build apps and monetise in the ways they want without any unnecessary compliance pressure. This solution makes use of the NEM blockchain for value and hash transaction and the NEM cryptography framework to gain access to the ProximaX DFMS and work in a tightly integrated environment based on the above four scenarios.","links":"https://proximax.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/proximax/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x6f3aaf802f57d045efdd2ac9c06d8879305542af"}}}