{"name":"Not Notcoin","id":"not-notcoin","symbol":"notnot","description":"Welcome to Not Notcoin ($NOTNOT), the original Notcoin-inspired and supporting memecoin on the TON blockchain. Notcoin boasts over 30 million players, making its 2024 launch one of the most anticipated events! Crafted by dedicated enthusiasts for both the Notcoin and TON communities, Not Notcoin embodies transparency, exemplified by its doxxed Canadian developer. The project's roadmap is firmly anchored on the TON blockchain, aiming to foster mass adoption through achievable milestones and tangible utility features that benefit both Notcoin and TON. Backed by a talented team, $NOTNOT prioritizes safety and trust by burning the liquidity pool and renouncing the contract. Unlike projects prone to overpromising, $NOTNOT's approach is grounded in realism, committing only to feasible utilities aligned with its capabilities and resources, thus ensuring integrity and accountability for investors and participants. Upcoming utilities currently under development include NotBots - an NFT collection featuring robots in disguise tapping their phones furiously to earn more Notcoin, Not Hero - a Telegram-based tapping game inspired by Notcoin and Guitar Hero, and TON EVM - a gateway for EVM developers to build in their familiar programming language within the TON ecosystem. It's probably not nothing, and it's definitely Not Notcoin! With a vibrant community and exciting utilities in development, Not Notcoin is poised to make a significant impact in the world of cryptocurrency, offering both entertainment and camraderie. Join us on this journey towards innovation, transparency, and prosperity in the decentralized finance space.","links":"https://notnotcoin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/not-notcoin/logo.png","detail_platform":{"the-open-network":{"decimal_place":9,"contract_address":"EQBFTzLthvrKPgQXfgOhhlhVnStDt733UQzdxHjY65SdDUc3"}}}