{"name":"Goldn","id":"goldn_base","symbol":"goldn","description":"We are the gold maxis, the Web3 kings, the anti-fiat warriors, and the laidback stackers of chill wealth. We don’t chase money; we attract it. We don’t stress; we flow. We are $GOLDN—a tribe united by gold’s eternal truth, Web3’s unstoppable future, and a defiant vibe that says: Fiat’s a scam. Gold’s forever. Stay $GOLDN. Gold is King For 5,000 years, gold has been the only true money. It’s not a trend; it’s a law of nature. While fiat printers go brrr and paper promises crumble, gold shines eternal. We stack it, tokenize it, and make it sing on-chain. Silver, its noble kin, rides with us. Everything else? Noise. Fiat is a Lie We are the gold maxis, the Web3 kings, the anti-fiat whales, and the laidback stackers of chill wealth. We don’t chase money; we attract it. We don’t stress; we flow. We are $GOLDN—a tribe united by gold’s eternal truth, Web3’s unstoppable future, and a defiant vibe that says: Fiat’s a scam. Gold’s forever. Stay $GOLDN. Wealth is Effortless True wealth isn’t slaving for scraps or chasing pumps. It’s positioning yourself in gold’s flow and letting the wins pile up. We meme hard, then stack our profits in tokenized gold with zero stress and no inflationary risk. We don’t sweat the dips; we chill on the winning side. Web3 is the Future Everything that can be tokenized will be. Gold leads the charge, and $GOLDN is its flag. We’re building the on-chain economy where wealth flows to those who are early, right, and gold-pilled. The future is ours, and we’re already there.","links":"https://goldn.finance/","market_cap":5285682,"market_cap_rank":2027,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/goldn_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x52d0ac6a76da6e4a5168a60c423f7ff0285534b1","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x52d0ac6a76da6e4a5168a60c423f7ff0285534b1"}},"is_native":false}