{"name":"Metalands","id":"metalands","symbol":"pvp","description":"Metalands is a thrilling and immersive gaming experience that takes you on a journey into a world where legends are forged. It combines the elements of survival, crafting, and base building with the intensity of a battle royale-style gameplay. In Metalands, every battle is an opportunity to prove your worth and showcase your skills. As you enter Metalands, you will be greeted with a vast and dynamic world that is teeming with challenges and adventures. It is a place where heroes are born and where you have the chance to unleash your inner warrior. Strategy plays a crucial role in your success, but it is your bravery and determination that will set you apart from the rest. Explore the breathtaking landscapes of Metalands, from dark and mysterious forests to desolate wastelands, and uncover hidden treasures along the way. Every step you take and every decision you make will shape your destiny in this realm of endless possibilities. Engage in intense battles, wielding powerful weapons and utilizing your unique abilities to overcome your opponents. The chaos of Metalands will push you to your limits, but it is within these moments that you will discover your true strength and resilience. Metalands offers more than just combat. It is a world where you can customize your character, weapons, and even your own bunker using NFTs. This allows you to create a truly personalized experience and stand out from other players. As you embark on your adventure in Metalands, remember that it is not only about the battles you win but also the stories you write. Immerse yourself in the lore of Metalands, uncover its secrets, and become a legend in your own right. So, step into Metalands and let the journey begin. Embrace the challenges, hone your skills, and leave your mark on this extraordinary world. The stage is set, and it's time for you to make your presence known in Metalands, a world like no other.","links":"https://metalands.gg","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metalands/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xfd290dab8ec58fb7e9c7ce6e36b9a5a1a90ec164"}}}