{"name":"CryptHub","id":"crypthub","symbol":"crht","description":"CryptHub is the first social-marketing platform based on AI (artificial intelligence), created for blockchain and web 3.0 project owners, as well as potential investors. The platform's goal is to simplify the interaction between projects and investors by providing quality project analysis and helping to attract investments. CryptHub features an innovative design and exceptional ergonomics. The platform provides users with comprehensive information in the form of cards for each project. Every user can conveniently compare and analyze tokens using the swipe method. Currently, information about new projects in the blockchain field is scattered across various resources, creating difficulties in searching for and analyzing them. This leads to a lack of complete and reliable information about the projects. In turn, the investment process becomes more complicated and the risk of losses for investors increases. Convenient access to information about projects will help ensure their successful development and dissemination. For society as a whole, this is important because blockchain technologies are playing an increasingly significant role in the economy and public life. CryptHub is a convenient and unified source of information about blockchain projects for potential investors and users. The social component of the CryptHub platform allows token owners to interact with potential investors, promoting user retention and creating their own community on the platform. This became possible through targeted adaptation of content for the CryptHub crypto community audience. CryptHub uses artificial intelligence for project analysis, evaluating their ratings, activity, and other factors. Using the platform tools, investors can make informed and balanced decisions.","links":"https://crypthub.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypthub/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x98d4c60deea495c94d50d162d331278658a6b681"}}}