{"name":"Alpha Bot Calls","id":"alpha-bot-calls","symbol":"abc","description":"What is the goal of Alpha Bot Calls? AlphaBotCalls strives to reshape the defi landscape to create a safer environment for investors, a platform for real alpha callers to showcase their calls, and a way to expose fake callers who call scam projects or dump on their followers. We’ve created a bot that acts as an on chain monitoring, reputation protocol for crypto callers. How Does The Bot Currently Work? AlphaBot was created to monitor its users’ calls and provide their stats. This allows investors to see how credible a caller is and gives successful callers a way to build a following. AlphaBot classifies calls as either wins or losses and has subcategories for 10x, 50x, rugs, and honeypots. It gives each user a stats page where it reports how many wins and losses they've called as well as how many rugs, honeypots, 10x, and 50x's. Users are also able to check their call history. There is an Snipe button in all call messages that is integrated with Unibot to allow investors to quickly snipe the called token. The bot keeps track of all call history and reports the best callers on different leaderboards. It also keeps track of tokens called so that it can report which tokens are trending currently. The bot can be added to any telegram group for free. Why hold ABC? Holding tokens grants you access to a token locked holders chat where filters are applied to provide alpha signals. Cals are forwarded to chats in the channel based on filters that notify our holders as soon as a good call is made. The team is currently developing a dashboard that will take this idea and allow for token holders to apply their own filters and follow callers that they chose to follow. Future of ABC The team is currently working on adding new chains, revenue streams through paid features and advertising, building a dashboard, creating a way to financially compensate good callers, and building a way to audit tokens that are called.","links":"https://alphabotcalls.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alpha-bot-calls/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x52b552c4a698c9b1de4c7fe0dd4462af141f7c3e"}}}