{"name":"BitRunes","id":"bitrunes_ethereum","symbol":"brune","description":"BitRunes is a suite of services designed to propel the Rune token standard, a fungible token standard built on the Bitcoin blockchain's Unspent Transaction Output (UTXO) model, offering a decentralized and efficient solution for tokenization. BitRunes extends the capabilities of Runes by providing essential infrastructures for Rune etching, transfer and UTXO management. Runes are represented by UTXOs, and each UTXO can contain any amount of any number of runes. It stems from the need for an efficient standardized fungible token system on the Bitcoin blockchain, leveraging its robust UTXO model. In Bitcoin's transaction model, when someone sends bitcoins to another person, they're essentially spending a certain amount of bitcoins they received in a previous transaction. These received bitcoins are represented by UTXOs. When spending bitcoins, the spender needs to reference these UTXOs as inputs in their new transaction. Once a UTXO is used as an input in a transaction, it becomes \"spent\" and cannot be used again. As the demand for an efficient token solution on Bitcoin continues to grow, the BitRunes ecosystem emerges as an innovative doorway to a world of possibilities with Runes. BitRunes is designed to work flawlessly with Bitcoin's UTXO system, the backbone of its secure transactions. We understand that a smooth user experience is key. That's why BitRunes prioritizes efficient UTXO management, ensuring your Rune transactions are handled quickly and easily within the familiar Bitcoin ecosystem.","links":"https://bitrunes.net/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitrunes/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x724313985dcb55d432d3888ddc0b9e3d3859e86d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x724313985dcb55d432d3888ddc0b9e3d3859e86d"}},"is_native":false}