{"name":"Kizuna","id":"kizuna","symbol":"kizuna","description":"At the heart of the crypto revolution lies the essence of Kizuna. Embracing deep-rooted connections, mutual respect, and unwavering trust, the Kizuna spirit fosters a collaborative and supportive community where every member thrives. Together, we’re more than just a network of transactions; we’re a tapestry of relationships, building a brighter future on the foundations of the past. As a holder of the Kizuna token, you are part of something extraordinary - a decentralized and autonomous perpetual community built upon the principles of unity, self-actualization, and collective self-accountability. At its heart lies the idea of Kizuna, the powerful bond that connects us all, just like the thread that weaves together the feathers of the crane. Our vision is simple yet profound: to bring together individuals from diverse backgrounds and unite them under a common goal – the pursuit of shared prosperity and success. We reject hierarchies and centralized control, instead choosing to empower each member to become a vital part of our growing community. To achieve this, we must remain steadfast in our commitment to decentralization and autonomy. Each holder has a crucial role to play in shaping the future of Kizuna. Whether it's contributing your skills, sharing knowledge, or simply lending your voice to discussions, every action counts towards strengthening our bond and propelling us forward. As we embark on this journey, let us remember the wisdom of our predecessors, especially Ryoshi, who demonstrated how community building can thrive without a single leader or central authority. By upholding values such as mutual support, personal responsibility, and continuous improvement, we ensure that Kizuna remains sustainable and resilient. Kizuna forever!","links":"https://kizunatoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kizuna/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x470c8950c0c3aa4b09654bc73b004615119a44b5"}}}