{"name":"Plan B DAO","id":"plan-b-dao","symbol":"planb","description":"What is the project about? PlanB DAO is a community-driven, decentralized financial platform that aims to empower individuals through self-custody and transparent DeFi applications. Focused on fairness, incentive, sustainability, and scalability, it offers services like staking, yield farming, and liquidity provision. The native token, CASH, plays a key role in governance and utility. With a diverse, global community of cyberpunks, PlanB DAO operates without traditional organizational structures, relying on collective contributions to revolutionize the financial landscape. What makes your project unique? PlanB DAO's uniqueness stems from its strong adherence to the four core principles: fairness, incentive, sustainability, and scalability. It fosters a truly decentralized governance model, with no employees, investors, or advisors. Its global community of cyberpunks collaboratively drive the platform, ensuring self-custody and empowerment. The native token, CASH, plays a multifaceted role in decision-making and utility, while the platform continually develops innovative DeFi applications to meet users' evolving needs. This collective approach and relentless commitment to its principles set PlanB DAO apart from other projects. History of your project. Our community, with crypto investors, coders, and artists, created PlanB DAO to provide a secure platform for like-minded individuals to collaborate. We aim to foster trust, unity, and empower members to shape the crypto landscape together. What’s next for your project? PlanB DAO token is used for staking, earning rewards, and participating in governance. In the future, it will be integrated into various DeFi products and services, providing utility across the ecosystem and creating lasting value for community members. What can your token be used for? PlanB DAO token enables staking, rewards, governance participation, and future integration in DeFi products, offering ecosystem utility and value.","links":"https://www.planbdao.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/plan-b-dao/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe77f82f288a6a7eb4ac295a86fccb1f6d240499b"}}}