{"name":"would","id":"would_solana","symbol":"would","description":"What is $WOULD? $WOULD stems from memes but transcends them, serving as a trusted long-term wealth vehicle. Born on the Solana (SOL) chain with decentralized Web3 blockchain tech, it's unique. By a stroke of luck, $WOULD became Elon Musk's favorite meme, and with just one sentence, it was activated. After experiencing a 2600 - fold price increase and a complete turnover of hands, it has built a solid foundation at the bottom. Since then, it has been reborn, surpassing 99% of meme coins and getting past the initial 0 - 1 phase. Future of $WOULD? Rather than relying on technology or applications, it depends on the consensus of its holders. Abandoning the typical meme coin PVP (Player vs. Player) approach, $WOULD embraces PVE (Player vs. Environment), making it a refreshing change among meme coins. Among the 99% of coins that eventually become worthless, it's like the \"Crypto Berkshire Hathaway,\" where every holder is a shareholder. Abandon centralized stocks, real estate, and fiat currencies, and embrace cryptocurrencies that you can control, taking your destiny into your own hands. It is decentralized, non - inflationary, with no marketing and no fake data. It attracts a group of investors who share the same values for long-term value investing. $WOULD is everyone's piggy bank. Tokenomics $WOULD is only issued on the SOL chain and not on other chains. Any issuance on other chains is a scam. Supply: Decentralized, CTO now in charge. No Taxes, No Bullshit. It's that simple. LP tokens are burnt, and contract ownership is renounced. WOULD Mission: Empower long-term holders to generate profits while incentivizing them to reinvest in WOULD. WOULD Values: Integrity and honesty; embracing the philosophy that “slow is fast” by prioritizing health and longevity; striving for value creation beyond mere profit. WOULD Vision: To establish itself as the Berkshire Hathaway of cryptocurrency.","links":"https://www.wouldmeme.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/would_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"J1Wpmugrooj1yMyQKrdZ2vwRXG5rhfx3vTnYE39gpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/J1Wpmugrooj1yMyQKrdZ2vwRXG5rhfx3vTnYE39gpump"}},"is_native":false}