{"name":"Useless","id":"useless-2","symbol":"use","description":"\"What Is Useless (USE)? The only thing useless about Useless is the name. USE is the token behind the AllForOne mobile app and ECLIPSE decentralized ranking system, with the parent contract on the Harmony (ONE) network and tokens currently bridged into both Binance Smart Chain (BSC) and Ethereum (ETH). According to the project’s whitepaper, its mission is to “reclaim individual finance and digital ownership by providing accessibility to the crypto space” and aims to do that by providing access to tens of thousands of decentralized liquidity pairings via its flagship product, the AllForOne mobile app. USE is a utility token that is used for: Tracking the rank of projects in the ECLIPSE decentralized ranking system. Unlocking premium features in the AllForOne crypto charting and wallet app. The AllForOne mobile app is currently in open beta, and currently features: - Crypto line and candlestick charting. - Crypto info and recent transactions. - Crypto searching, favoriting, and organizing. - Crypto tagged news feed. - Whale-watching. - Non-custodial, EVM multi-chain wallet creation and import. - Hierarchical deterministic sub-wallets. - Multi-currency support. - ECLIPSE decentralized ranking system. - In-app Web3 transactions. Other roadmap features include: - Decentralized Exchange Network (DEN) integration. - Fiat on-ramping. - Portfolio management. - Multi-language support. - Staking and farming interactions. What are the tokenomics of Useless (USE)? USE is a deflationary token launched with approximately 707 million tokens in circulation. Instead of relying on a burn wallet, tokens are completely removed from circulation when USE is burned. USE has a static 3% token tax that is imposed on all buys, sells, and transfers on the Harmony (ONE) network. Of this tax, 1/3 is used for token marketing, 1/3 is used for on-chain rewards, and 1/3 is sent to the decentralized Furnace protocol. Based on the health of the liquidity, the Furnace will either pair liquidity, buyback, and/or burn — making USE the first token with a decentralized, auto-stabilizing protocol to manage its liquidity pool. USE tokens bridged to other networks have the symbol 1USE and do not incur taxation (0% tax). Who Are the Founders of Useless (USE)? USE originally started as a meme token, but was salvaged by the community and relaunched to provide utility for a decentralized ranking platform. David Wyly was elected community leader, and founded Useless Crypto, LLC to help govern the global community-led project and manage multi-signature cryptoassets. Over time, the project team grew to a global network of more than 60 volunteer staff and moderators. The six directors of Useless Crypto, LLC are multi-signature safe keyholders, where 4/6 signatures are required to facilitate a transaction. Notably: - David Wyly, 15 years in Software Engineering and Engineering Management. - Lance Badger, 15 years in DevOps Engineering and Systems Architecture. - Amir Arafat, 12 years in UI Engineering and Mobile App Architecture. - Jackie Dutton, 6 years in Content Creation and Television. - Joseph Andrews, 7 years in Software Engineering and Product Management. - Stefan Alexandrov, 5 years in Macroeconomic Research and Finance. Where Can I Buy Useless (USE)? You can purchase USE easily on the AllForOne App by Useless Crypto. USE is available for trading on a growing number of decentralized exchanges, with Binance Smart Chain (BSC) pairings on PancakeSwap and Harmony (ONE) pairings on Hermes and FoxSwap. The token is also available on BitMart.\"","links":"https://uselesscrypto.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/useless-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x60d66a5152612f7d550796910d022cb2c77b09de"},"harmony-shard-0":{"decimal_place":18,"contract_address":"0xc079d0385492ac2d0e89ca079c186dd71ef49b1e"}}}