{"name":"Coinzix Token","id":"coinzix-token","symbol":"zix","description":"COINZIX is a centralized exchange, launched in 2021, with headquarters in Romania, that says its mission is to “make crypto simple, safe and reliable for everyone, from beginners to experts”'. The ecosystem was built on four key pillars - payment services for fiat and crypto, crypto trading services, crypto-economic services, and community services. The COINZIX project was born during the pandemic years, in an EU country that has a big technological and resource potential, with the goal to “smoothen the transition from FIAT to CRYPTO” and increase the DeFi literacy. While launching the CEX platform, COINZIX also implemented a network of crypto ATMs in all the major cities in Romania, that continues to grow across Europe. Their ZIX native utility token was designed to fuel the technical development of their ecosystem, which would include staking, listing services, crypto ATM maturity, and point-of-sale locations. Some of the key security features COINZIX has integrated are secure software development cycles, Multi-Factor Authentication for all sensitive operations, withdrawal protection, live customer support in Romanian and English, and Four Eyes Principle for high-value transactions. All smart contracts and blockchain assets are line-by-line audited and validated by COINZIX’s industry leader partner. COINZIX is used not only by crypto traders but also by new crypto projects as their Launchpad. ZIX is COINZIX’s decentralized utility token, aimed to power COINZIX’s ecosystem, and specially designed to offer access to specific services available on the COINZIX platform. The ZIX token allows COINZIX stakeholders like customers, users, coaches, business owners, and partners to use it on each product, and to interact within the ecosystem. The functionalities of the ZIX Token will be adapted or extended, depending on the evolution of their platform.","links":"https://coinzix.com","market_cap":96932,"market_cap_rank":7500,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coinzix-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x48077400faf11183c043feb5184a13ea628bb0db","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x48077400faf11183c043feb5184a13ea628bb0db"}}}