{"name":"Sparkswap","id":"sparkswap","symbol":"spark","description":"What is the project about? SPARKSWAP, brought to you by the team behind EMP Money, is a new yield farming protocol on Pulsechain with multiple farms and single asset staking pools to choose from, in addition to an AMM and a BNB Chain to PulseChain Bridge. This is your gateway to earning abundant yields on Pulsechain, in a project you know will still be here tomorrow! What makes your project unique? There are two major differences with SparkSwap as opposed to other yield farms you may have participated in : All LP pools that are eligible to earn INC rewards from the native Pulse LP reward pools are being rehypothecated. That means we are able to earn rewards on those LP positions while never actually taking custody of your tokens. Those INC rewards are then sold to supplement the SPARK/PLS LP and rewarded back to users that are staking in Sparkler. This also puts MASSIVE buying pressure on SPARK & PLS. We distribute ALL protocol fees and rewards back to our users via Sparkler. This is a revolutionary mechanism that gives utility and value to the SPARK token. We use the exact same principles from HEX in calculating your pool shares (TShare equivalent), but instead of minting rewards, the rewards are distributed based on the real yield of the protocol. Just like a Certificate of Deposit, the longer you choose to stake your SPARK, the more rewards you will receive from the reward pool. You can calculate your share of the pool and bonuses through our calculator. Currently over 32% of the circulating supply is locked in Sparkler, significantly reducing inflation. History of your project. This is a sister project from the veteran team at EMP Money, who have had their DeFi project running on BNB chain for nearly 2 years. When Pulsechain was announced, they started planning a sister project, and Sparkswap has launched after months of planning and development. What’s next for your project? We're about to launch our BNB Chain to PulseChain bridge which will serve major utility as there are not currently many reliable bridges to and from Pulsechain, especially from BNB Chain. What can your token be used for? Our farms & Sparkler which is a revolutionary ROI contract on our platform that not only reduces the circulating supply of the token, but gives users the opportunity to earn abundant yields.","links":"https://sparkswap.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sparkswap/logo.png","detail_platform":{"pulsechain":{"decimal_place":18,"contract_address":"0x6386704cd6f7a584ea9d23ccca66af7eba5a727e"}}}