{"name":"Bahamas Network","id":"bahamas-network","symbol":"bn","description":"What is the project about? Bahamas Network $BN is a project building a Proof-of-Authority (POA) blockchain network that aims to address the shortcomings of low-fee chains that have become breeding grounds for scams and malicious activities. The Bahamas Network will offer several features, including a swap, bridge and wallet to make it an attractive option for developers and users alike. The chain will be secured by the POA consensus algorithm, which makes it fast, efficient, and highly secure. The fees generated on the Bahamas Chain will mostly be used to burn $BN tokens through a high burning mechanism What makes your project unique? One major issue that has plagued the blockchain ecosystem is the prevalence of low-fee chains. These chains have attracted many developers and projects, but they have also made it easy for bad actors to launch scams and other malicious activities. The Bahamas Network aims to address this problem by being a high-fee chain. The high fees will discourage bad actors from launching scams and other malicious activities on the network. Instead, the fees will attract committed developers who are serious about building quality projects. History of your project. The blockchain development has been in progress since April, 2023. This was followed by a successful presale in early September 2023 and the release of the testnet of the blockchain. Also, the token has been launched first on Ethereum network on 19th September, 2023. What’s next for your project? The release of the mainnet on 1st October together with the swap and bridge. What can your token be used for? The token will be used a gas fees for the Bahamas Network blockchain.","links":"https://bahamasnetwork.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bahamas-network/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xe508364efad1f04572f052d76779d7407dcff3d9"}}}