{"name":"ESPL Arena","id":"espl-arena","symbol":"arena","description":"ESPL launched its amateur e-sports tournament platform in 2020 and was within months, were commissioned by Tencent, Digi (Telenor) and Oppo to run ESPL’s inaugural PUBG Mobile tournament. In the same year, ESPL partnered with Gojek to provide Esports content for GoPlay and signed up PayTM (largest e-wallet provider in India) as ESPL India’s franchise partner. The momentum of scaling up the global community continued into 2021. Despite the global economic disruption caused by the Covid 19 pandemic, ESPL continued to achieve notable milestones, such as being commissioned by Riot Games to host the largest Valorant event in SEA, being commissioned by Supercell to run the Clash of Clans tournament for India and partnering with Warner Music’s “world’s first” music video release with esports, garnering over four million views in two weeks. In 2022 ESPL made its first inroads into web3 by organising the first hybrid Axie Infinity tournament in Malaysia. in partnership with Luno and Monstax, the tournament featured a live viewing at the Dadi Cinema, this event was ESPL's penetration into the Play-to-Earn (P2E) scene that ultimately established a strong partnership with Yield Guild Games SEA in March 2022. While ESPL began its journey as an avenue to bring esports communities together, its proprietary tournament platform has risen to the challenge of managing multi-genre web2 tournaments for highly competitive esports titles including but not limited to Valorant, PUBG and Clash of Clans. These tournaments transcended borders to host players in multiple geographies. ESPL continues to forge partnerships across both web2 and web3. With incredible support from investors such as 500 Startups, Warner Music, Genting Group, iCandy Interactive (backed by Animoca Brands), Sedania and Rightbridge Ventures, Infinity Ventures Crypto, Arcanum Capital and ESPL is well equipped to accelerate the transformation of esports into a thriving web3 industry.","links":"https://espl.co/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/espl-arena/logo.png"}