{"name":"Meblox Protocol","id":"meblox-protocol","symbol":"meb","description":"Meblox is committed to creating a traffic gateway linking the metaverse, providing value enabling based on the trust mechanism at the bottom of blockchain, and fully promoting the development and application of the metaverse ecology, thus ushering the metaverse ecology into a new era. Meblox is a digital aggregator version of Roblox, the world's largest online multiplayer creation game, which will be connected to VR and motion sensing devices to become a more immersive 3D virtual reality platform. Meblox connects the creators of the entire network to build a virtual entertainment and social product UGC platform through the bottom-layer consensus protocol based on decentralized blockchain technology. It carries the assets and identities of users with the bottom-layer mechanism of blockchain, forms a complete commercial closed loop with the token economy system, and creates the world's top player community. Meblox has a complete metaverse economic system and ecological structure, which consists of four elements. The first is digital creation, which is the beginning of the metaverse economy. Without creation, there would be no goods for trade. The second is digital assets, which imply property rights and are the premise of transactions. Meblox will pay full attention to the value and security of users' digital assets. The third is the digital marketplace, which provides a place for transactions in the digital world and establishes the rules that everyone must follow. It is the core of the digital economy and one of the core infrastructures that enable the metaverse to thrive. Meblox will build a perfect matching engine and transaction mechanism in the digital market to facilitate circulation and conversion.","links":"https://www.meblox.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meblox-protocol/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7268b479eb7ce8d1b37ef1ffc3b82d7383a1162d"}}}