{"name":"Brave Power Crystal","id":"brave-power-crystal","symbol":"bpc","description":"What is the project about? Brave Power Crystal (BPC) is a token issued by BOBG PTE. LTD. BPC has a contract address on both the Oasys Mainnet and the Home Verse platform, and can be obtained by purchasing on external exchanges or converting from Brave Power Crystal Points. The token has utility within the game ecosystem of BRAVE FRONTIER HEROES, as it can be used to exchange for \"Delta Summon Tickets,\" the payment currency in the in-game market, and to participate in \"Governance Voting.\" Additionally, BPC can be bought and sold on external exchanges. When users spend Brave Power Crystal Points in the BRAVE FRONTIER HEROES game for purposes other than claiming rewards, the corresponding amount of BPCs will be burned from the deposit contract for the Brave Power Crystal Points spent. What makes your project unique? \"BRAVE FRONTIER HEROES\" is a blockchain game based on the popular smartphone RPG \"Brave Frontier,\" which has been downloaded over 38 million times worldwide, allowing users to own characters as NFTs. History of your project. \"BRAVE FRONTIER HEROES\" was developed by a team of experienced game developers and blockchain experts, with the game officially launching in January 2020. The game has since gained popularity in the blockchain gaming community and has continued to evolve with new features and updates. What can your token be used for? Brave Power Crystal (BPC) is an in-game token that can be used in \"BRAVE FRONTIER HEROES\" to purchase items or participate in governance voting. Players can use BPC to buy Units, Spheres, and other items in the game, or to participate in governance voting to have a say in the development of the game. Additionally, BPC can be obtained through external exchanges or by claiming it with Brave Power Crystal Points, which can be earned by playing the game.","links":"https://bravefrontierheroes.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/brave-power-crystal/logo.png","detail_platform":{"oasys":{"decimal_place":18,"contract_address":"0x9a340a0de81b23ecd37ba9c4845dff5850a7e7a4"}}}