{"name":"Baby Broccoli","id":"baby-broccoli_binance-smart-chain","symbol":"babybroccoli","description":"BabyBroccoli (BabyBroccoli) is a fun and community-driven meme token inspired by CZ’s dog, Broccoli. Designed for entertainment and engagement, the token brings together meme enthusiasts and crypto lovers from around the world. While its primary goal is to foster a strong community, future developments may introduce innovative utilities, potentially incorporating AI-driven features or Telegram mini-app integrations. BabyBroccoli operates on the Binance Smart Chain (BSC). How Does BabyBroccoli Token Work? BabyBroccoli is a standard BEP-20 token on the Binance Smart Chain. While it currently functions as a pure meme token, its team has hinted at possible expansions, including AI-powered utilities or Telegram-based applications. BabyBroccoli Tokenomics The total supply of BabyBroccoli Coin is 1 billion tokens (1,000,000,000 BabyBroccoli). The distribution is structured as follows: 25% of the total supply was sent to the BabyDoge multi-signature wallet. 20% was added to the PancakeSwap Liquidity Pool (V3). 20% was automatically placed in the BabyDoge Swap Pool after bonding from puppy.fun platform. The rest of the supply remains in circulation, fuelling community-driven initiatives, marketing efforts, and potential future developments. Who Created BabyBroccoli? BabyBroccoli was created by meme lovers for meme lovers. The team consists of dedicated crypto enthusiasts who share a passion for blockchain, memes, and building an engaging community. While the core team remains pseudonymous, their focus is on entertainment, viral growth, and potential innovation in the meme coin space. Where Can I Buy BabyBroccoli (BabyBroccoli)? As of now, BabyBroccoli Token is available for trading on decentralized exchanges (DEXs): - PancakeSwap V3 - BabyDoge Swap What’s Next for BabyBroccoli? While BabyBroccoli Token currently thrives as a community-first meme token, its roadmap suggests potential expansion into AI-related utilities or Telegram-based mini-apps. Whether it remains a pure meme token or evolves into a utility-driven project, one thing is certain—the community plays a crucial role in its growth and success.","links":"https://www.baby-broccoli.com/","market_cap":386740,"market_cap_rank":4940,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/baby-broccoli_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x709a6bb090b8c4c72cb44533624f3df320a8ba80","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x709a6bb090b8c4c72cb44533624f3df320a8ba80"}},"is_native":false}