{"name":"Jeff","id":"jeff_ethereum","symbol":"jeff","description":"Jeff is a meme token, based on an average guy working at Mcdonalds. ‘I Was Very Stressed, I Couldn’t Sleep’ I'm Jeff, just an average guy working at McDonald's. For years, I've been struggling to make ends meet and living paycheck to paycheck. I'm tired of just getting by, and I want more out of life. I've been dabbling in cryptocurrency for a while now, hoping to find a way to change my fortunes. Unfortunately, I've lost more money than I've gained, investing in shitcoins that turned out to be worthless. But I'm not ready to give up just yet. I've been studying and researching everything I can about tokenomics and blockchain technology. I've been reaching out to people in the crypto community for advice, trying to learn as much as possible. And now, I think I've got an idea for my own token. It's risky, but I believe in it. I've spent all my spare time working on this, pouring my heart and soul into it. I know that there are a lot of scams out there and the market is volatile, but I'm confident that my token will be different. Launching my own token is a huge risk, but it's also my last shot at making something of myself. I'm willing to put everything I have into it, knowing that I could lose it all. But maybe, just maybe, this will be the breakthrough I've been looking for. I'm excited and nervous at the same time. I know it won't be easy, but I'm ready for the challenge. This is my shot at changing my life and making something of myself. And I'm not going to let it pass me by. Jeff Guy who always fail","links":"https://thejefftoken.com/","market_cap":212441,"market_cap_rank":5827,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jeff_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf831938caf837cd505de196bbb408d81a06376ab","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf831938caf837cd505de196bbb408d81a06376ab"}},"is_native":false}