{"name":"Sabai Protocol","id":"sabai-ecovers_ethereum","symbol":"sabai","description":"What is Sabai Ecoverse? Sabai Ecoverse is an ecosystem on Polygon that bridges blockchain and real world with finance solutions and collaboration tools, enabling easy, transparent, and scalable access to real estate with gamified educational content and simple investment options in stable assets. What makes Sabai Ecoverse unique? Sabai's uniqueness lies in providing financial tools for real estate, including the Crypto-Real Estate Index, a trading instrument based on real estate markets. All tools are accessible through a Sabai ID account with an integrated ERC-20 and ERC-721 compatible wallet. Features also include renting and lending of entities through secure contracts. Sabai will form a DAO from different audience segments and decisions will be made through voting. History of Sabai Ecoverse Sabai Ecoverse was founded in 2021 by Vadim Bukhkalov, drawing from his 20-year track record as a successful real estate entrepreneur, including his roles as founder and CEO of Layan Green Park, VillaCarte, and La Vista Villas. Inspired by P2E technology, real estate, and customer relations, he began developing a user-friendly platform featuring gamified educational content and simplified investment options in stable assets via blockchain. What’s next for the Sabai Ecoverse? Sabai Light (an idle clicker game) Sabai World (a learn-and-earn game in the Sim Tycoon genre) Sabai Academy (an adaptable learn-and-earn platform) Sabai Marketplace (a platform for trading NFTs, real estate shares, and fractional real estate) What can the SABAI token be used for? Rewards in P2E games Buying and selling in-game NFT assets Speculations and DEFI 2.0 tools Generating real estate income Purchasing real estate (including fractional) Paying commissions for sale of real estate Buying/selling goods and services of partner companies","links":"https://sabaiprotocol.com/","market_cap":2081363,"market_cap_rank":2931,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sabai-ecovers/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb5d730d442e1d5b119fb4e5c843c48a64202ef92","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xb5d730d442e1d5b119fb4e5c843c48a64202ef92"}},"is_native":false}