{"name":"Auki","id":"auki-labs_base","symbol":"auki","description":"Auki is making the physical world accessible to AI by building the real world web: a way for robots and digital devices like smart glasses and phones to browse, navigate, and search physical locations. At its foundation is the posemesh protocol, a collaborative and decentralized machine perception network that allows robots and XR devices to have a shared understanding of physical space, and a token economy for exchanging spatial data and compute resources. 70% of the world economy is still tied to physical locations and labor, so making the physical world accessible to AI represents a 3X increase in the TAM of AI in general. Auki's goal is to become the decentralized nervous system of AI in the physical world, providing collaborative spatial reasoning for the next 100bn devices on Earth and beyond. From autonomous drone delivery to copilots for physical labor to robotic companions for children and navigation aid for the blind, the Auki network is a fast-growing ecosystem of cutting-edge physical AI applications. Rapidly rolling out into thousands of commercial and private locations world-wide, the Auki network is now home to a growing number of applications that are already collecting millions of dollars in yearly revenue. With a growing roster of robot integrations like Unitree, EngineAI, Padbot, Slamtec and more, Auki has cemented itself as the web3 robotics project with the most real world traction. This year, Auki demonstrated the world's first large-scale autonomous humanoid navigation, app-free augmented reality, and spatially aware smart glasses. To a see a sample of Auki's recent accomplishments, watch the State of the Auki Network 2025 report: https://youtu.be/sUtqAXM8Srs To track adoption, visit the burn tracker on Dune: https://dune.com/auki/stats","links":"https://www.aukilabs.com/","market_cap":31073837,"market_cap_rank":867,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/auki-labs/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xf9569cfb8fd265e91aa478d86ae8c78b8af55df4","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xf9569cfb8fd265e91aa478d86ae8c78b8af55df4"}},"is_native":false}