{"name":"BABIL TOKEN","id":"babil-token","symbol":"babil","description":"Babil Token is the official cryptocurrency of Chain Turko, a Georgia-based cryptocurrency exchange. It is built from the ERC20 Ethereum Blockchain. It will be offered for sale at a fixed price. Total production is 1,894,000 BABIL and public offering is 894,000. The amount of supply was determined based on the year 1894, the founding date of Babylon. In addition, the maximum supply has been kept low so that money does not create inflation and investors do not suffer. Inspired by the country of Babylon, which is the symbol of power and innovation, the project is designed to open new doors to innovations and financial change in the field of crypto money, to always develop, to take part in more markets, to reflect the power and quality of the Chain Turko stock market to its investors, and to enable its investors to invest with confidence. provides facilities. Our primary goal is to expand the e-commerce online payment system in all countries as GLOBAL, with the pilot region GEORGIA and TURKEY, in accordance with the law, with contactless and automatic recognition systems and our business plan. Babil will also use the revenues from the project to increase the amount of investment and accelerate R&D studies. We want to be present in all sectors related to online payment, more specifically E-commerce. Therefore, we will soon have a very comprehensive e-commerce site where you can buy with BABIL tokens. As a cryptocurrency exchange platform, we serve with the Chain Turko platform. Babil Token will serve as the cryptocurrency of our exchange. Technologies developed in the field of blockchain will also contribute to the acquisition of valuable products in our country. Our BABIL Token project stepped into this project by adopting the principle of developing solutions that can be used both in our daily lives and to end the problems in our lives.","links":"https://www.babiltoken.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/babil-token/logo.png"}