{"name":"Cookie DAO","id":"cookie","symbol":"cookie","description":"Cookie DAO is the largest AI agents index and a data layer for AI and humans. It created crypto’s first AI Agents index, [cookie.fun](http://cookie.fun/), giving investors and traders a top-level overview of the AI agents market. It eliminates the need to blindly invest in hundreds of new AI agents by providing data that allows for informed and targeted investments. Real-time analytics make powerful decision-making easier and safer for traders to laser-pick the most promising agents to invest in or spot market and sentiment shifts in real time. Based on 7TB of live data feeds, Cookie DAO is building the primary infrastructure for AI agents-driven reality. Cookie DAO is the first project on the market to aggregate and index live data of all AI agents, presenting it in human—and AI-friendly formats—index dashboards and agent APIs. Cookie DAO is powered by the COOKIE token, which guarantees that Cookie DAO keeps gathering and indexing the growing amount of AI agent data. It is a utility token that that grants access to the token-gated sections of the [cookie.fun](http://cookie.fun) index and is required for AI agents that plug into the Cookie DAO APIs.","links":"https://www.cookie.fun/","market_cap":80072982,"market_cap_rank":608,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cookie/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc0041ef357b183448b235a8ea73ce4e4ec8c265f","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xc0041ef357b183448b235a8ea73ce4e4ec8c265f"},"base":{"decimal_place":18,"contract_address":"0xc0041ef357b183448b235a8ea73ce4e4ec8c265f","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xc0041ef357b183448b235a8ea73ce4e4ec8c265f"},"ethereum":{"decimal_place":18,"contract_address":"0xc0041ef357b183448b235a8ea73ce4e4ec8c265f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xc0041ef357b183448b235a8ea73ce4e4ec8c265f"}}}