{"name":"SoccerInu","id":"soccerinu","symbol":"soccer","description":"SoccerInu is set out to become the biggest and safest utility meme coin on the Binance Smart Chain. We will continue to grow until we reach the top with marketing, utility, and more! Our community is already growing massively, and we have no doubt this project will be one of the top memes! The Soccerinu platform is groundbreaking because it stands out from other meme coins. These characteristics contribute to Soccerinu strength as a token in the cryptocurrency space. According to the executive officer, the Soccerinu coin will guarantee you the best features available in the crypto industry. The cryptocurrency includes several features, including liquidity locked, anti-whale wallet limits, etc. Additionally, it comes with a 100% LP lock with buy and sell fees of 8% each. The team behind Soccerinu is skilled and has a big marketing budget. Although the total supply is not known yet, the team plans to own no more than 3% of the platform's total supply. Soccerinu was launched with 2 BNB liquidity, with a max transaction of 20,000,000,000,000. We have the vision to grow together with our community. We are presenting a new way to develop wealth, and to be a part of a strong community. We focused on attaining the goal, even though it appears ambitious. We have values such as community lead, transparancy and trust, grow together, and longevity. We are prepared to spread the word about this most recent project in the crypto ecosystem and have a substantial marketing budget to ensure this materializes. We successfully passed a top-grade security audit to further the community’s confidence, in full transparency. Here at SoccerInu, we are constantly working towards developing new ways to help the Blockchain run safely and securely and adapt to the end users' needs. With our tokenomics, users will be assured they are in a safe project! Furthermore, the marketing manager highlights the relevance of the coin. According to him, “the goal of Soccerinu is to establish itself as the","links":"https://soccerinubsc.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/soccerinu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xeb0ad54a88dc735e55f0d9b394c8cb6e46b62202"}}}