{"name":"ShibaKeanu","id":"shibakeanu","symbol":"$shibk","description":"\"What is the project about? $SHIBK ShibaKeanu is a BNB-based meme token inspired by Shiba Inu with a charitable nature. 888 trillion tokens exist, with 444 trillion to be sent to charity(ies) for charitable purposes. The community governs the token's future through a voting mechanism. The project emphasizes community control and evolution over time. The four founders are each successul entrepreneurs in their respective fields, with a collaborative vision to create a legacy through the token. What makes your project unique? $SHIBK distinguishes itself as a charitable token from its inception. Rooted in the visionary outlook and philanthropic ethos of its creators, $SHIBK emerges as a beacon of enduring significance. With its sights set on addressing global socio-economic challenges, $SHIBK not only aims to make a tangible impact but also to establish a precedent for future meme tokens, setting a new standard in the crypto community. History of the project: On March 25, 2024, the $SHIBK token initiated its presale phase, hosted on Pinksale, as part of a week-long pre-launch campaign. Remarkably, trading opened to an enthusiastic response, with half of the 200 BNB hard cap secured within a mere 44 minutes. By March 27, 2024, just two days later, the presale had fully subscribed, hitting the 200 BNB market hard cap, prompting an immediate launch on Pancakeswap. To safeguard the token's launch from potential threats such as bots and opportunistic actors, the development team devised a vesting mechanism for presale participants. This mechanism mandated a 40-day waiting period for purchasers to receive their full token allocation, underscoring the team's commitment to project security and integrity. The token has been steadily trending since launch and has reached just under 3x value with over 600 holders. What's next for your project? The founder’s recently funded the token's first Centralized Exchange (CEX), choosing P2B, and they are currently working with P2B to laun","links":"https://shibakeanu.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shibakeanu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x314bc6c98a28bd0580651233c351f2994cc12645"}}}