{"name":"SoundLinX","id":"sound-linx_ethereum","symbol":"sdlx","description":"Technology at SoundLinX Data-Over-Sound Technology Soundlinx harnesses the power of data-over-sound technology, a cutting-edge method of transmitting data using sound waves. This technique involves encoding data into sound and then decoding it at the receiving end, utilizing the built-in speakers and microphones of devices. It's a secure, efficient, and universally accessible way of data transfer, offering real-time communication. Integration with Ethereum Blockchain We take this a step further by integrating with the Ethereum blockchain. Each sound transaction is recorded on this decentralized ledger, providing an immutable and transparent record. Ethereum's smart contracts automate processes, enabling actions or rewards based on the data received. Sound Recognition Methods in Soundlinx Soundlinx's sound recognition operates in two innovative ways: 1. Cross-Referencing with Library: Soundlinx compares a snippet of sound against a secure library. It analyzes various audio characteristics to accurately identify the song or sound. 2. Unique Audio Markers: Soundlinx can detect unique, inaudible markers embedded within media files. These markers are unique to each file, offering precise identification, recognizing the special container inside the broadband waves with exact data of the transaction ( MP4file). How does the token system benefit users? Tokens serve as a currency within the platform, allowing users to upload snippets and earn rewards, fostering a vibrant, participatory music community. We also planing to develop second layer of ETH network , L2 (SDLX)will allow us to increase number of transactions and brings developers , who can create a side chaines by using SoundLinx SDK.","links":"https://soundlinx.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sound-linx_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x352a4b34b8e9f43b869f6f80728978cccdced406","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x352a4b34b8e9f43b869f6f80728978cccdced406"}},"is_native":false}