{"name":"Hashflow","id":"hashflow","symbol":"hft","description":"Hashflow is a decentralized exchange designed for interoperability, zero slippage, and MEV-protected trades. It allows you to trade any asset on any chain in seconds simply by connecting your wallet. All trades are commission-free, and all price quotes are executed at their displayed price, giving you the most value for your buck on every trade. Since its inception in August 2021, Hashflow has cleared $10B+ in total trade volume with over 170K unique wallets trading on the platform, making it a top 10 DEX by volume with an average daily volume of $25-30MM. What Makes Hashflow Unique: - Hashflow allows you to trade with zero slippage and full MEV protection. - Hashflow offers fully-native cross-chain swap functionality without the use of bridges or synthetic assets, enabling seamless trading across one or more chains with guaranteed price execution. - Hashflow’s RFQ model allows Market Makers to price any asset class and is no longer limited to stable coins or blue chip assets. This means Hashflow can offer seamless trading of products (i.e. options, ETFs) that were previously impossible in DeFi. HFT's utility: - HFT is the native token for the Hashflow protocol as well as the Hashverse, Hashflow’s gamified DAO and governance platform. - Governance: Hashflow governance will follow a vote-escrow (ve) token model where voting rights are determined based on the amount of HFT staked as well as the duration for which HFT is locked. Staking tokens will grant users the right to vote and manage the future of the protocol. This includes decisions relating to protocol fees, marketing, and code development. - In-DAO Health & Rewards: The Hashverse is the first-ever storyverse-driven, gamified DAO and governance platform. Staked tokens will be used to determine users’ health metrics within the Hashverse. The protocol will continue to reward the most active members of the community and their Hashverse presence will play a major role in redeeming these rewards.","links":"https://hashflow.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hashflow/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb3999f658c0391d94a37f7ff328f3fec942bcadc"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x44ec807ce2f4a6f2737a92e985f318d035883e47"}}}