{"name":"None Trading","id":"none-trading","symbol":"none","description":"An all in one trading solution directly in discord. Trade NFTs, Erc20 tokens, and create tasks to automate your trading journey. The bot is fully operational, with a revenue sharing mechanism for holders. $None supports ETH at the moment but plans on expanding onto more chains in the future. It also offer a task system for sniping both tokens and NFT mints. Tools Overview: - Below is an overview of the the currently available features of the NONE trading bot. Analytics: Dive into your personal performance, collections statistics, and token information all from within our bot. Our features include; PNL graphs/summaries, collection statistics and watchlists, token summaries, and security checks for ERC20 tokens. NFTs: Enbark on your NFT trading journey all from within discord. We offer buying, listing, sweeping, offering, and bidding for all NFT collections across Ethereum. We aggregate all listings and information always getting you the best deal. Shitcoins: Trade shitcoins with ease using our easy to use and smooth panels. With advanced protection features, sniping, and trading panels to track all of your active trades. Be ahead of your competition and buy tokens faster than anyone else. Tasks: Trying to mint or snipe a hyped collection and or token launch? Our task system is here to help you! Setup automatic actions to be triggered on chain all from within discord. Have to go out to dinner but still want to mint your favorite project? Setup a task and know that you'll be able to secure that sweet NFT without a single worry in the world. Monitors: Want to monitor the top traders/wallets in the space? Want to track new deployments and contracts? Want to receive volume summaries for NFTs and shitcoins to get alerted for new trends? We've got it all. Our in-depth monitoring and tracking system allows you to aggregate all the information needed to stay on-top of the game, all within discord.","links":"https://noneth.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/none-trading/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x903ff0ba636e32de1767a4b5eeb55c155763d8b7"}}}