{"name":"Ignite The Chain","id":"ignite-the-chain","symbol":"ignt","description":"At Ignite, we are dedicated to fostering a democratized blockchain future, where your financial prowess does not limit your ability to build on the blockchain. We are breaking down traditional barriers to token launches, creating an egalitarian playing field for everyone. With our proprietary Ignite token, IGNT, we are revolutionising the way tokens are launched, traded, and managed in the dynamic DeFi universe. Leading the charge are IgniteExchange, DynamicSale by Ignite, and IgniteDeployer. In a fast-paced and innovative industry, Decentralized Exchanges (DEXs) have struggled to keep up with the evolving environment. That's where we step in to make a difference. Our groundbreaking approach to token launches eliminates the requirement for initial liquidity provision. Through our unique DynamicSale protocol, projects can confidently set their initial launch price, establishing a robust base price for their tokens, as if ETH had been added to the liquidity pool. This significantly reduces the cost of token launches, making them viable even for projects with limited budgets. Our ambitious vision is to disrupt the blockchain industry by delivering user-friendly, cutting-edge tools that enhance the experiences of both developers and traders in numerous ways – all while keeping simplicity and accessibility at the forefront. Ignite is not just about igniting change; it's about fueling an unstoppable revolution. We invite you to be a part of this revolution and Ignite the space with us. Tokenomics Our tokenomics are carefully designed to support stability and long-term growth. A substantial 80% of tokens are allocated to the liquidity pool, ensuring widespread distribution of IGNT. All team tokens are locked, with vesting periods of 5 to 12 months. Tokens designated for marketing purposes will be strategically utilized over time. Taxes & Limits Buy Tax: 5% Sell Tax: 5% Max Transaction Amount: 2% Max Wallet Amount: 2%","links":"https://ignitethechain.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ignite-the-chain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd12443d642d021dc52d0af8f5f6191e02d1e9419"}}}