{"name":"Mead","id":"mead","symbol":"mead","description":"\"The Tavern is a passive income protocol that improves upon current node projects, by combining gamification, NFTs and a treasury-backed token to reward participants sustainably over the long term. The protocol allows users to purchase BREWERYs, which continually produce MEAD at a fixed rate - for life! The Tavern is a project launched on the Avalanche network on the 11th of March 2022. It can be described as a Passive Income Protocol (PIP) that combines combining gamification, NFTs and a treasury-backed token all in one. MEAD is the utility token for The Tavern and is integral to the gamification elements of the project. MEAD was launched with a starting price of $1 and an initial supply of 2,500,000 MEAD split as follows: • 54% Rewards reserve (10% reserved for LP rewards) • 10% Treasury reserve • 16% Whitelist Presale • 20% Liquidity – Locked for 1 year. To gain a “BREWERY” that produces MEAD passively, investors must first acquire MEAD from the liquidity pool. This can then be used to mint a BREWERY, a special yield bearing NFT that rewards a fixed amount of MEAD daily. If a user decides to sell their MEAD on the market, there is a sell tax of 10% that goes back into the Treasury reserve. BREWERYs have a “tier” associated with them that increase the production of MEAD per day. BREWERY tiers can be increased by earning experience over time by not claiming the MEAD that the BREWERYs have accrued (for a certain length of time). BREWERYs only begin earning experience after a “fermentation period” of 14 days. This is reset whenever a user claims the accrued MEAD built up by the BREWERY(s) in their wallet. There is also a “claim tax” in place that decreases with Brewer’s Reputation level. This tax goes towards the Treasury reserve for the project. Brewer’s Reputation (BR) is gained by a wallet that carries out beneficial participation in the protocol. Some examples of this include: purchasing a BREWERY, every day not claiming MEAD past the fermentation period and staking liquidity pool tokens. There are four classes of BR, each with decreasing levels of claim tax to reward active participants within the Tavern protocol. Users that hold a BREWERY NFT in their wallet can verify ownership of this to gain access to an exclusive group known as “The Brewers Guild”. This group forms a governing body for The Tavern protocol that allows members to create proposals, vote on them and help to govern the ecosystem. Their MEAD balance and Brewer’s Reputation is used to calculate their voting power within the Brewer’s Guild. Participants in The Tavern protocol can upgrade their BREWERYs (separate to gaining experience) with special renovation NFTs from the dApp store using MEAD. These renovations can be installed onto BREWERYs to increase their production rate and efficiency. Additionally, they can purchase vanity skins with varying levels of rarity that change the look of their BREWERYs. There is also an incentive program for increasing the liquidity for The Tavern, whereby users will earn rewards for staking their MEAD-USDC LP tokens gained from depositing MEAD & USDC into the liquidity pool. To further incentivise this, users can purchase BREWERYs at a discount using these LP tokens.\"","links":"https://tavern.money","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mead/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xd21cdca47fa45a0a51eec030e27af390ab3aa489"}}}