{"name":"Ribbit","id":"ribbit","symbol":"ribt","description":"Anura DAO is a governance first protocol. We are a team of developers with past experience in finance, development, and marketing, who have come together to develop various \"\"Dev-Tools\"\" for Web3. We are currently developing an: Encrypted Messaging App, A Cross-Chain Bridge, A Stablecoin, and more. We are constantly developing new tools that provide utility to users, revenue for the protocol, and value for $RIBT holders. In essence we are a group of developers who like to build tools for fun, and decided to bring these projects to the public to provide value to the web3 space whether it be for individual users, or for entire protocols. Our token $RIBT can be described as: is a fundamental component of our ecosystem that has been well-tested and refined by our world-class development team. The token is tied into our protocol-driven applications and acts a common currency for both primary development and Anura-incubated projects. $RIBT can be staked in the protocol, earning additional rewards over time. With an active development cycle and more protocol-driven apps to come, $RIBT is a token that investors will want to keep in their crypto portfolio for the long haul. To reiterate some tools that we have developed and are launching in the next month are: - Cross-Chain Bridging Protocol - Stablecoin - Encrypted Messaging Dapp - Community NFT that will be incorporated into an arcade play to earn game - NFT Generation Dapp - Since we are a DAO we always take community requests into consideration, and constantly seek to develop new Dev-Tools to solve problems As a group of passionate developers, we are seeking to provide value to token holders, by building tools that generate revenue and in turn generate value for the $RIBT token.","links":"https://anuradao.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ribbit/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x302abf007c2045f1bc0867a4b7abaae2152e0eb3"}}}