{"name":"Apollo Diversified Credit Securitize Fund","id":"apollo-diversified-credit-securitize-fund_solana","symbol":"acred","description":"This feeder fund invests in the Apollo Diversified Credit Fund (\"Underlying Fund\") which seeks to generate a return comprised of both current income and capital appreciation, emphasizing current income with low volatility and low correlation to the broader markets. ✓ Seasoned Asset Manager: Apollo draws on 30+ years of experience, aiming to achieve attractive returns across the risk spectrum through proprietary origination, credit strategies, and a flexible approach to borrower needs.(1) ✓ Historical Track Record of Outperformance: A diversified, global credit strategy with potential for enhanced income and attractive risk-adjusted returns across various market cycles. ✓ 0% Performance Fee ✓ $0 Redemptions ✓ Pricing Transparency: Daily pricing transparency and daily liquidity.(2) The Underlying Fund takes a multi-asset private and public credit approach centered around five key pillars: ✓ Corporate Direct Lending: Targets large scale corporate originations and sponsor-backed issuers of first lien, senior secured and unitranche loans, utilizing Apollo’s proprietary sourcing channel. ✓ Asset-Backed Lending: Focuses on agile deployment of capital into origination and proprietary sourcing channels across a broad mandate of asset-backed investments, with a focus on investments collateralized by tangible investments. ✓ Performing Credit: Primarily pursues liquid, performing senior secured corporate credits to generate total return. ✓ Dislocated Credit: Seeks to use contingent capital to tactically pursue “dislocated” credit opportunities such as stressed, performing assets that sell-off due to technical and/or non-fundamental reasons. ✓ Structured Credit: Focuses on structured credit opportunities across diverse asset types, vintages, maturities, jurisdictions, and capital structure priorities (for example, CLOs, residential, and commercial mortgage backed securities among others).9 (1) Diversification does not ensure profit or protect against loss. (2) Investment performance is not guaranteed and is subject to market risks.","links":"https://securitize.io/primary-market/apollo-diversified-credit-securitize-fund","market_cap":131502504,"market_cap_rank":352,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/apollo-diversified-credit-securitize-fund_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"FubtUcvhSCr3VPXEcxouoQjKQ7NWTCzXyECe76B7L3f8","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/FubtUcvhSCr3VPXEcxouoQjKQ7NWTCzXyECe76B7L3f8"}},"is_native":false}