{"name":"Lumera Health","id":"lumera-health_binance-smart-chain","symbol":"lur","description":"Lumera Health is a Web3-powered digital health super-ecosystem that reimagines global healthcare through blockchain, AI, and decentralized cloud infrastructure. Built over ten years of R&D, Lumera delivers a secure, unified platform that solves healthcare’s biggest inefficiencies — fragmented systems, data breaches, and outdated workflows — by merging communication, imaging, procurement, payments, and patient management into one interoperable environment. At its core is the LUR utility token, a BEP-20 token that fuels the Lumera network. It enables seamless payments, smart-contract settlements, SaaS access, validator rewards, and a tokenized data marketplace within Lumera’s eight-module ecosystem: • LUMERA Connect: Encrypted global communication for verified healthcare professionals. • LUMERA Buy: A blockchain marketplace for trusted medical equipment and supplies. • LUMERA Expert: A services hub connecting clinics with certified specialists worldwide. • LUMERA Manager: Full clinical workflow and radiology information system (RIS/CIS). • LUMERA Scan: Next-generation PACS for medical imaging and AI diagnostics. • LUMERA Vault: End-to-end encrypted data storage for HIPAA/GDPR compliance. • LUMERA Stream: Healthcare-only content and e-learning platform. • LUMERA Wallet: Instant, low-fee global settlement layer using USD-pegged credits. By combining these into a single app ecosystem, Lumera allows hospitals, physicians, and researchers to communicate, trade, store, and analyze medical data securely in real time .","links":"https://lumerahealth.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lumera-health_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc66b6f38ae5053a109cfd8639e0ee17ec69cf788","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xc66b6f38ae5053a109cfd8639e0ee17ec69cf788"}},"is_native":false}