{"name":"Xcavator","id":"xcavator","symbol":"xca","description":"Xcavator (XCA) token is a project backed by real-world assets i.e. mining farms which will be generating real-world revenue through mining the most profitable cryptocurrencies. Xcavator (XCA) is a first-of-a-kind token which has an in-built price appreciation mechanism. Xcavator (XCA) token is a BEP20 token which has a limited supply of 51 million tokens. All the funds from the token sale will be used to set up crypto mining farms and revenue will be generated through mining the most profitable cryptocurrencies. From the mining revenue, around 50% will be used to buy their own tokens from the market through various crypto exchanges at the prevailing market prices and they will be burned with proof of burn. Balance 50% of the mining revenue will be used for the expansion of crypto mining farms which will generate additional mining power, which in future will further increase their profits. Since around 50% of the mining profits will be used to buy tokens from the market through various crypto exchanges at the prevailing market prices and the tokens will be burned, the total supply of the tokens will keep decreasing and the demand along with the mining power per token will keep increasing. Hence, the price of the token will keep increasing and this process will continue forever while additional mining capacity will be added every month. Xcavator will be injecting real-world revenue from mining farms & will be continuously purchasing tokens from the market & burning so the token price will always be pushed up and the token will never die or fade away. The decisive power to dictate the price will be given to the general public as at some point in time as the shortage of XCA tokens arises, XCA token holders will be able to sell their tokens at the price decided by them. The token subscribers will be gaining from the long-term appreciation of the token value due to the compulsory burning process.","links":"https://xcavator.co","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xcavator/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xbd20f9b0dbeed33fc4436f0ae7a34eedefda2878"}}}