{"name":"DecentraBNB","id":"decentrabnb","symbol":"dbnb","description":"Utilising blockchain technology to disrupt the current centralised modality, DecentraBNB's universal protocol aims to connect users directly with travel companies and individuals hosting their rentable properties on the dedicated application, while giving consumers full autonomy of their digital identity – allowing them to receive royalties for their content and data points. DecentraBnB Application is a peer-to-peer app that directly connects Hosts and Guests without the need of middlemen. With the best payment method via different types of Cryptocurrencies. For Hosts, it’s the best way to have some Crypto income and for Guests, it’s beneficial because it reduces the costs during a trip. DecentraBnB will provide a smart-contract-based protocol that connects all consumers and businesses in the travel industry on a decentralized travel ecosystem that incentivizes content creation, transactions, and consent-based sharing of user data. The DecentraBnB App will bring the value of the DecentraBnB Network to life. It is a dApp on the DecentraBnB protocol, using its open API and transparent data access. It also serves to upstart the ecosystem, by forging a content platform with a powerful incentive scheme, a zero-commission marketplace for business venues, and an advertising model that rewards users. The project is being led by Abdoulaye Diop AKA Majestic Drama who is in his day job a platinum selling music producer but also a Crypto influencer with over 100k supporters, he is followed and supported by the likes of Shytoshi from Shib and is well educated in the cypto world. Alongside him is Eric, again he has worked on many projects as Operations which have successfully reached 56M Marketcap and is now taking the lead dev position in writing the solidity contract for the project including an innovative whale defence function through dynamic tax functions.","links":"https://decentrabnb.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/decentrabnb/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x99f618edcfedca1fcc8302e14daa84802114a8c5","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x99f618edcfedca1fcc8302e14daa84802114a8c5"}}}