{"name":"Fluidity","id":"fluidity","symbol":"fly","description":"Fluidity is the blockchain incentive layer that rewards people for using their cryptocurrencies. Fluidity Money tokens (Fluid Assets) are a 1-to-1 wrapped asset that expose holders to randomly paid rewards when they use their cryptocurrencies. Rewards are paid out according to a drawing mechanism held each on-chain transaction of Fluid Assets. These rewards are generated by the cumulative yield generated by the underlying asset, which is deposited and lent on money markets. With Fluid Assets, yield is gained through utility. The more you utilise your assets, the more yield can be potentially received over time. Existing decentralised finance incentivises leaving interest-bearing products ”idle” – sitting in an account accruing interest. Through wrapping a variety of assets with Fluid functionalities, we effectively grant utility to what would otherwise be stagnant tokens. This has the added benefit of composability and a change in how we interact with blockchain payments as a whole. Careful economic modeling ensures resilience against misuse and maintains utility, embodying the platform’s commitment to making finance accessible and rewarding for all. The $FLY Token is the Fluidity Governance Token. It has different use cases, such as Staking, Revenue sharing, Governance, Utility Mining, Utility Vaults, Utility Gauges and deciding on key protocol parameters. It also gives token holders exposure to the Superposition Layer-3. Through $FLY, token holders will be able to steer order flow, as the distribution of Utility Mining and $FLY incentives will be controlled through Utility Gauges. Fluidity becomes a marketplace for order flow, with voter incentives paid by protocols every epoch to $FLY holders to direct incentives and volume towards themselves. With $FLY, Protocols will have a tool to increase their volume and will be able to direct order flow to their liking.","links":"https://fluidity.money/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fluidity/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":6,"contract_address":"0x000f1720a263f96532d1ac2bb9cdc12b72c6f386","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x000f1720a263f96532d1ac2bb9cdc12b72c6f386"}}}