{"name":"NFTmall","id":"nftmall","symbol":"gem","description":"What is NFTmall (GEM)? NFTmall- Pioneers of Multichain GameFi Infrastructure & Phygital NFT Commerce. Introducing a robust multi-chain NFT platform that empowers creativity. It allows NFT creators to have fun while earning. NFTmall is not just a marketplace but a community governed by its utility & governance token GEM. We are a next-gen NFT marketplace & Launchpad for NFT creators, traders, and enthusiasts. Our platform is synergizing Defi and e-commerce to achieve a fully autonomous and royalty-driven marketplace. Bridging NFTs Between Chains NFTmall will also solve the liquidity problem of NFTs / NFT collections minted on chains that lack sufficient liquidity. We will allow the bridging of NFTs across all the chains that NFTmall supports. Screenshot 2022-08-27 at 13.30.50.png Our mission includes bridging the gap between digitized and real-world while allowing real-world use cases for NFTs by introducing revolutionary features like the NFT Materialisation service. Using NFTmall, anyone can mint, list & trade NFTs in a simple & cost-efficient manner. Thanks to its super-efficient smart contracts. NFTmall = Multichain NFT infrastructure provider + Powerful NFT API + NFT materialisation service + Launchpad. Benefits of the platform include but are not limited to, - A super sleek, easy-to-use user interface marketplace & launchpad with beautiful great design. - Reliable, Cost-efficient & Secured. - A universal NFT platform for all. Accommodates everyone according to their needs. Offers \"Zero\" platform fees to mint NFT and charges only 2% on NFT sell or 1% if GEM is used, which is the cheapest in the space. - Houses famous NFT artists as \"Featured Creators\" to appreciate creativity. - Offers different NFT auctioning systems (Timed auction & Open to bid). - Has its native token, GEM 💎 with various utility & use-cases throughout the ecosystem, including governance of the platform. - One-of-a-kind platform offers mass NFT materialisation service and delivery worldwide. - One-of-a-kind mobile app, AR & NFT verification app. - Has a robust API \"NFT explorer\" (Google of NFT). - It aims to offer NFT Fractionalise, lending & borrowing service in the coming days & months. What problem does the product solve? - nftmall.io makes NFT minting super simple and accessible in a few clicks in various blockchain networks! - Houses a wide range of individual NFTs & NFT collections minted on various blockchains. - Users can buy or sell popular NFT collections minted on different chains from one unified NFTmall platform. - NFT creation, NFT collections listing, NFT auctioning, NFT buy or sell, finding NFT collections info, finding famous NFT artists as \" Featured Creator\", and NFT project fundraising from one universal platform. \"Your one-stop-shop\" for anything & everything related to NFT. - Bridges the gap between the digital & real world. One-of-a-kind platform offers NFT materialisation services to NFT owners. - Users can project the NFT into any surface on its various materialise forms before ordering through our AR & NFT verification app in real-time, confirming peace of mind & accurate view. - \"NFT explorer\" (Google of NFT) is a handy tool or guide for NFT traders or newcomers in the NFT space. Users can find info on all individual NFT or NFT collections minted on different chains, including their Rarity information). What positive change should it bring out? - It should introduce the NFT community and allow NFT minting to a high transaction speed, low-cost chains in a secured manner for NFT minting encouraging creativity. - It opens up the door for relatively new chains and creates a broader NFT market by introducing them with NFT streamline, allowing NFT minting and trading. - Bridging the gap between the digital & real world with NFT materialise service creates further use-cases for NFTs and more interest in NFT. - NFTmall empowers creators by providing a cost-efficient, super sleek, reliable, easy to use user interface platform, which should attract and create interest for newcomers in NFT & crypto space in general. - It should make the NFT community and NFT creators more diverse and vibrant. Users can experience a super-fast, reliable, sleek, and easy-to-use user experience platform. nftmall.io makes NFT minting, listing & trading super easy and efficient for NFT creators & traders. What's GEM Tokenomics? Token Info: Symbol: GEM Max Supply: 20 million (Deflationary) Token Distribution: 5% Private Sale 15% Public Sale 5% Exchange Liquidity 2% Liquidity Mining 30% Marketplace Mining 15% Marketing & Educational Program 5% Technical Bounty & Hackathon 5% Strategic Partnerships 8% Team & Advisors 10% Foundational Reserve Investor Pitch Deck: https://nftmall.docsend.com/view/hv7mx4savkksnqb7 White Paper: https://nftmall.docsend.com/view/aqitrk9vsfhbahe8 Docs: https://docs.nftmall.io/","links":"https://nftmall.io/","market_cap":32240,"market_cap_rank":4195,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nftmall/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbac1df744df160877cdc45e13d0394c06bc388ff"},"avalanche":{"decimal_place":18,"contract_address":"0xdebb1d6a2196f2335ad51fbde7ca587205889360"},"ethereum":{"decimal_place":18,"contract_address":"0x9b17baadf0f21f03e35249e0e59723f34994f806"},"polygon-pos":{"decimal_place":18,"contract_address":"0x4a7b9a4589a88a06ca29f99556db08234078d727"},"thundercore":{"decimal_place":18,"contract_address":"0x218c3c3d49d0e7b37aff0d8bb079de36ae61a4c0"}}}