{"name":"Quill USDQ","id":"quill-usdq","symbol":"usdq","description":"Quill Finance is a decentralized borrowing protocol operating on Scroll, an Ethereum zk-rollup network. The protocol is a fork of Liquity V2 that enables users to mint USDQ, an over-collateralized stablecoin pegged to the US dollar, by depositing collateral assets including wrapped Ethereum (wETH), wrapped staked Ethereum (wstETH), Ether-Fi staked Ethereum (weETH), and Scroll's native token (SCR). The protocol operates through a collateralized debt position (CDP) model where users deposit assets into \"Troves\" to mint USDQ against their collateral. Unlike traditional lending protocols with fixed interest rates, Quill allows borrowers to set their own interest rates within protocol boundaries (6-100% at this time), creating a market-driven system where higher rates reduce redemption risk. USDQ maintains its USD peg through algorithmic mechanisms and direct redemption capabilities, allowing users to redeem USDQ for underlying collateral at face value. The protocol operates without intermediaries, using smart contracts to manage all borrowing, liquidation, and redemption processes automatically. Quill is governed by its native token QUILL, which enables holders to participate in protocol governance decisions including parameter adjustments and fee structures. The protocol leverages Scroll's zk-rollup technology to provide faster transaction speeds and lower costs compared to Ethereum mainnet while maintaining security through zero-knowledge proofs. The protocol serves multiple use cases including accessing liquidity without selling assets, leveraging positions on collateral, and providing USDQ to stability pools to earn rewards. By combining Liquity V2's proven mechanisms with Scroll's scalability and expanded collateral options, Quill aims to provide efficient, decentralized borrowing infrastructure for the DeFi ecosystem.","links":"https://www.quill.finance/","market_cap":274714,"market_cap_rank":5975,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/quill-usdq/logo.png","detail_platform":{"scroll":{"decimal_place":18,"contract_address":"0xdb9e8f82d6d45fff803161f2a5f75543972b229a","geckoterminal_url":"https://www.geckoterminal.com/scroll/tokens/0xdb9e8f82d6d45fff803161f2a5f75543972b229a"}}}