{"name":"Exzo","id":"exzo","symbol":"xzo","description":"Exzo Network Protocol is a decentralized application platform designed to make apps usable on the web. The network runs on a Proof-of-Stake (PoS) consensus mechanism called IBFT, which aims to offer scalability and stable fees on the network so developers and users can quickly and easily conduct low-cost transactions. The Exzo Token (XZO) is the native utility token that is used for: Fees for processing transactions and storing data. Running validator nodes on the network via staking XZO tokens. Used for governance votes to determine how network resources are allocated. Exzo Network's tools include: EXZO SDKs which includes standard data structures and testing tools for Solidity and compatibility with the EVM. Exzo Wallet that lets application developers create streamlined user experiences. Exzo Explorer to aid with both debugging of contracts and the understanding of network performance. Exzo Command Line Tools to allow developers to deploy applications from local environments. Exzo Network's decentralized exchange (DEX). Exzo Network's multi-chain NFT marketplace. How Many Exzo Tokens (XZO) Are There in Circulation? Exzo Network launched its testnet & mainnet beta on September 27, 2022 with 800 Million Exzo tokens created at genesis. Token Distribution Break Down: 20% goes to the founding team members. 20% goes to the treasury 2% goes to philanthropy. 3% goes to Airdrop rewards. 5% goes to bug bounty rewards. 50% goes to other endeavors such as public sale, partnerships, exchange listings, rewards, and burning events. Ecosystem Tokens: Exzo Token (XZO) - Native blockchain token, governance and utility token. ExzoCoin 2.0 (EXZO) - Membership token, governance and utility token. Wrapped Exzo Token (WXZO) - Wrapped version of our native blockchain token. Exzo Stable Coin (USDX) - An algorithmic stable coin for the Exzo Network ecosystem.","links":"https://exzo.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/exzo/logo.png"}