{"name":"QORPO WORLD","id":"qopro_ethereum","symbol":"qorpo","description":"**What is QORPO Token (QORPO)?** The QORPO Token is where gaming meets web3 innovation. The token serves as the foundation of an innovative gaming ecosystem, integrating a multitude of products and services to deliver an unparalleled gaming experience. QORPO was minted as LayerZero’s OFT token standard, currently on Ethereum and BNB Chain. During the Token Generation Event (TGE), a total supply of 750 million QORPO tokens was generated, and there are no plans to create or mint any additional tradable tokens in the future. The total token supply will only decrease over time via various burning and deflationary mechanisms tied to the token economy. Hodlers of token will have access to a range of exclusive benefits and incentives within the expansive framework. Team has meticulously crafted every aspect of the ecosystem to provide exceptional utilities to token hodlers, ecosystem users and players. **QORPO Token Ecosystem Products** $QORPO is positioned as a central element in the expansive gaming ecosystem of. The tokenomics is crafted to benefit and utilize both of QORPO's main pillars: the QORPO WORLD Ecosystem Platform and QORPO Games. QORPO World developed a variety of top-tier games, such as acclaimed hero shooter Citizen Conflict along with an up-and-coming creature extraction shooter AneeMate, all built by industy experts in Unreal Engine 5. QORPO World brings accessible Web3 innovations to Web2 gamers and simplifies blockchain for everyday players. Users can now explore, download, play and rate games as well as easily manage their digital assets, discover, earn, buy, sell and trade rare NFTs, compete in esports tournaments, raise their ranks and socialize with their friends. QORPO World’s gaming platform brings all of this within an intuitive yet powerful user interface. Bringing AI Into Web3 Gaming For their flagship titles, AneeMate and Citizen Conflict, QORPO is leveraging generative AI to personalize the gaming experience. Using Amazon Bedrock, developers have built an AI agent that analyzes near-real-time game data streams. It then randomly generates creatures with varying physical and behavioral attributes based on players’ previous activity. Every aspect of the ecosystem is tied to ONE TOKEN ONLY - $QORPO.","links":"https://qorpo.world/","market_cap":4152684,"market_cap_rank":2238,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/qopro_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x22514ffb0d7232a56f0c24090e7b68f179faa940","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x22514ffb0d7232a56f0c24090e7b68f179faa940"}},"is_native":false}