{"name":"BitmapPunks","id":"bitmappunks_binance-smart-chain","symbol":"bmp","description":"A fully-onchain, ultra-large, hybrid collection. BitmapPunks is a new breed of NFTs that combines the permanence of on-chain assets with the flexibility of hybrid tokens. Designed to address the limitations of traditional NFTs, BitmapPunks leverages a unique approach that merges the ERC-721 and ERC-20 standards, giving each NFT a fungible token mirror and creating new possibilities for ownership, trading, and accessibility. Hybrid NFT NFT marketplaces have provided a home for trading digital collectibles, but they aren’t ideal for active trading or price speculation. Platform fees and royalties add friction, reducing potential profits for traders. Attempts to improve NFT liquidity, like off-chain order books and fractionalization, have had limited success. Hybrid NFTs, however, offer a promising alternative by blending the best of both non-fungible and fungible tokens. In a hybrid setup, each NFT in the collection has a corresponding fungible token, making hybrid NFTs like BitmapPunks compatible with all on-chain infrastructure built for both asset types. This dual structure enables easy integration with centralized exchanges and unlocks the potential for broader trading options, putting hybrid NFTs on par with other crypto assets. Fully On-Chain While many projects claim to be “on-chain,” they often rely on off-chain storage solutions like IPFS to store images and metadata. This means that if the storage system fails, the NFT could lose its visual component. CryptoPunks is one of the few collections that has achieved true on-chain permanence, with both metadata and media data stored on Ethereum. BitmapPunks builds on this legacy by taking on-chain storage even further: every trait, image, and piece of metadata is fully embedded within the blockchain, making BitmapPunks independent of any external storage. BitmapPunks also goes beyond the typical pre-mint image generation seen in most NFTs. Instead of using off-chain scripts, BitmapPunks performs all trait combinations on-chain, creating each unique image directly through smart contract code. While this approach removes the flexibility to manually adjust unexpected trait combinations, it guarantees the collection’s longevity and integrity by eliminating the need for external scripts. Bitmap The bitmap format, one of the earliest digital image formats, may seem like an unconventional choice, especially given its size inefficiency compared to JPEG or PNG. However, the bitmap format has one powerful advantage: its simplicity makes it highly compatible with on-chain implementation. Bitmap images are straightforward to create and layer, allowing BitmapPunks to compose images directly on the blockchain. Each BitmapPunk’s traits—including their names, rarity, and image data—are stored on-chain, allowing for direct layering and composition within the smart contract itself. To support this on-chain composability, BitmapPunks includes an embedded, bare-bones image editor coded into the contract. This system handles image layering logic, keeping trait conflicts to a minimum and providing the pixel-perfect composability that traditional NFTs lack. Ultra-Large Scale Most NFT collections cap their supply at around 10,000 tokens, balancing demand and supply but limiting community growth and accessibility. BitmapPunks challenges this convention with a massive collection size of 2,100,000 tokens. This ultra-large supply is designed to accommodate a broader community, offering room for growth and participation at a scale unseen in typical NFT collections. By breaking out of the traditional scarcity model, BitmapPunks aims to surpass the reach of even successful memecoins, establishing a digital asset that’s both community-driven and widely accessible. With a large supply, fully on-chain integrity, and a hybrid structure, BitmapPunks sets a new standard for sustainable, inclusive NFT collections that are built to last.","links":"https://bitmappunks.com","market_cap":2136297,"market_cap_rank":2900,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitmappunks/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbbbbbb163f835a334f2cc2dfc6bf51286db69fbb","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xbbbbbb163f835a334f2cc2dfc6bf51286db69fbb"}},"is_native":false}