{"name":"Hanuman Universe","id":"hanuman-universe","symbol":"hut","description":"$HUT, or Hanuman Universe Token, is the foundational utility token of Hanuman Universe, a Metaverse project that will utilize blockchain technology for realizing immersive experience in the awe-inspiring world of Hanuman. With an initial total supply of 40,000,000,000,000 $HUT, it offers awareness, belongingness, connectivity, guidance, and comfort to Hanuman Universe with the blockchain experience. After the inception of the projects, bringing community, product development and going with the market feedback. HUT has burned 14,000,000,000,000 tokens from total supply. So the new total supply is 26,000,000,000,000 HUT. Product 1 : Hanumanverse V1 Introducing the Hanumanverse, driven by the essence of Hanuman's timeless stories, is forging a universe where community thrives that offers : - COMPLETE THE TASK TO UNLOCK NFTS - FULL MEDITATION PLAN - OFFERING PRAY TO HANUMAN - HANUMAN MANTRA - METAVERSE VIEW OF MAJOR SITES - EXPERIENCE FEELING ON BEING ANCIENT RAMAYAN Hanumanverse is estimated to launch in 2024, starting preorder from Feb 7. The first version will come with limited editions and funds will be locked in contract for the period of time mentioned in the preorder. Learn more : www.hanumanverse.com Product 2 : HUT Reward Vault The HUT Reward Vault is a game-changer for HUT holders seeking passive income. By depositing their tokens into the Vault, users can earn a mouthwatering 18% APY. - The reward can be claimed every 30 days. - Your deposited HUT in the vault will be locked for 6 months and start unlocking from 7th month by 8.33% each month. - You can unlocked all deposited token by 18th months Learn more : app.hanumanuniverse.com Product 3 : HanumanNFT NFTS FOR GAMES AND METAVERSE - These NFT can only be acquired through game and metaverse platforms. - Users are only able to mint such NFT after accomplishment level or task. There is no other ways to mint such NFTs - Users can also buy/sell those NFTs in the NFT marketplace using $HUT tokens.","links":"http://hanumanuniverse.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hanuman-universe/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6b2812f1a8350de38c4da2d29446ead15b91fa3c"}}}