{"name":"Rebel Cars","id":"rebel-cars","symbol":"rc","description":"WITH PASSION AND LOVE FOR AUTOMOTIVE RACING \"REBEL CARS\" BRINGING TO LIFE A PIONEERING VENTURE IN THE CAR RACING & WEB3 GAMING. COMBINING TOP CLASS CAR RACING PHYSICS AND ULTRA REALISTIC UE5 GRAPHICS. WATCHING IT IS ONE THING RACING IT IS ANOTHER Decentralized Ownership: 100% true ownership of digital assets, such as unique cars, tracks, with a full car ecosystem. Players have full control over their digital assets, enabling upgradability, renting g and selling within and across other games, providing a real sense of ownership and value. Transparency and Security: Transparent and secure transactions. In-game transactions, digital assets, and rewards are recorded on an immutable ledger. $RC Opportunities: Rebel Cars Blockchain-based sim racing introduces mechanics, where players will get $RC cryptocurrency rewards for their in-game achievements. Community Governance: Rebel Cars involve the community in decision-making processes through decentralized autonomous organizations (DAOs). Players have a say in the game's development, updates, and rule changes, enhancing involve the community in decision-making processes through decentralized autonomous organizations (DAOs). Immutable Racing Records: Blockchain records and verifies racing statistics and achievements, creating a permanent and trustworthy record of a player's performance. This adds a competitive edge, as gamers can prove their skills to potential sponsors or teams. Global Competitions and Tournaments: Rebel Cars Pro Sim Game enable global competitions with large-scale tournaments and events. The decentralized nature of blockchain ensures fair and secure competition on a global scale which attracts car manufactures and sponsored events.","links":"https://rebelcars.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rebel-cars/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}