{"name":"Pin Token","id":"pin-token","symbol":"pin","description":"What is the project about? PinSwap is committed to creating a convenient, efficient, relatively transparent, and low-slippage multi-chain decentralized trading system for GameFi users. PIN is the platform token issued by PinSwap. What makes your project unique? Proof of Liquidity (POL) Consensus Mechanism: There are currently two mainstream methods for obtaining computational power: purchasing mining machines to mine cryptocurrencies or buying coins directly to gain mining power. However, PinSwap has created another consensus mechanism called Proof of Liquidity (POL), which allows users to obtain mining power by participating in a game and testing their luck History of your project. PinSwap V1.0 is an exchange protocol based on TRON that allows the exchange of any two TRC20 Tokens. It utilizes an Automated Market Maker (AMM) mechanism and follows the Constant Product Market Maker model with the algorithm \"X*Y=Z\" for efficient and convenient market-making. What’s next for your project? After repeated exploration, the PinSwap team has successfully bridged the connection channels between multiple decentralized exchanges through aggregation protocols. Currently, it aggregates popular decentralized exchanges on the Tron network and Binance Smart Chain. Soon, it will enable asset interaction with other chains such as Ethereum, Matic, and Heco. Our goal is to establish a convenient, efficient, transparent, and low slippage GameFi multi-chain aggregated decentralized trading system for users. What can your token be used for? PIN is the platform token of PinSwap, with a total supply of 21 million coins, all of which are generated through mining. It pioneered the Proof of Liquidity (POL) consensus mechanism. On the first day, 1,000 coins are mined, and this increases by 10 coins daily. Every time 1 million coins are mined, the mining rewards are halved. It is estimated that it will take approximately 14.5 years to mine all the coins.","links":"https://swap.bid/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pin-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb86126b872e3f23bc62d6a4a3152ec65202a2073"}}}