{"name":"PulseChain Peacock","id":"pulsechain-peacock","symbol":"pcock","description":"Peacock on PulseChain is PulseChain's Official Mascot Meme, based on posts by Richard Heart twerking on a Peacock stage and Liberty Swaps mascot post on Twitter, PCOCK was created on Pump.tires! Created 2 weeks ago in honour of Liberty Swaps post, Peacock is now one of the hottest and most talked about coins on PulseChain. The project was released into the community by the creator and hopes to be the first 1 billion dollar market cap coin on PulseChain. It has the backing of Liberty Swap Finance and the total supply has been burnt by 15% already. Utility it being working and PCOCK has been paired to many tokens in the ecosystem giving it a solid foundation. Peacock could play a big part in kickstarting PulseChains Bullrun and so has a strong narrative in the community using Pump.tires as the platform to launch from bringing more eyes and adoption to PulseChain. PulseChain has the strongest community in the whole of cryptocurrency so with their backing PCOCK could do some serious gains bringing on PulseChains much needed Bullrun. Peacock is a simple meme at heart but has lot of potential! You can trade it at Liberty Swap and PulseX at lightning speeds and the contract is solid, no blacklisting, buy or sell tax etc and super cheap in gas fees to trade. PCOCK has an army of followers and even more memes to go with it. Trading Peacock also burns PulseChains native token $PLS therefore lowering supply of time and strengthening the whole chain overall. Richard Heart's as a flamboyant character and a pet Peacock fits the bill perfectly! Guarding the gardens of hexico, he's not just a mascot he's the protector of PulseChain!","links":"https://libertyswap.finance/","market_cap":4263372,"market_cap_rank":2504,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pulsechain-peacock/logo.png","detail_platform":{"pulsechain":{"decimal_place":18,"contract_address":"0xc10a4ed9b4042222d69ff0b374eddd47ed90fc1f","geckoterminal_url":"https://www.geckoterminal.com/pulsechain/tokens/0xc10a4ed9b4042222d69ff0b374eddd47ed90fc1f"}}}