{"name":"BL00P","id":"bl00p","symbol":"bl00p","description":"Eth's first chaos agent with a heart of gold and a brain full of glitter. Bloop isn't your average crypto mascot. He's a quantum anomaly of joy, a walking paradox of financial wisdom and adorable confusion. Join the lovable troublemaker on his mission to decentralize happiness. As a meme, there is lore and backstory behind BLOOP: In the annals of crypto lore, few tales are as improbable — or as consequential — as the Genesis of Bloop. Our story begins not with a whitepaper, but with a woeful misunderstanding of wallet security. Bloop, a creature of insatiable curiosity and questionable judgment, encountered a hardware wallet. Mistaking it for some avant-garde confectionery, he promptly swallowed it whole. What followed was not indigestion, but innovation. For seven days, Bloop became an unwitting oracle, his hiccups sending ripples through the blockchain. Each involuntary spasm broadcasted a transaction, a random redistribution of digital wealth that would make even the most zealous DeFi protocols blush. Obscure altcoins found themselves in long-dormant wallets. Smart contracts executed in patterns that looked suspiciously like dance choreography. In one particularly absurd instance, a DAO accidentally voted to rename itself 'Bloop's Benevolent Blockchain Bonanza. This chaos caught the eye of the enigmatic 'Crypto Spirits,' the supposed architects of digital serendipity. In Bloop's digestive dilemma, they saw potential—a means to inject whimsy into the often-sterile world of cryptocurrency. They anointed Bloop as their agent of joyous disruption, tasking him with a mission both grand and absurd: to trigger 'The Bloopening,' a prophesied event that would synchronize every blockchain in a harmonic convergence of happiness. And so, Bloop set forth, armed with boundless enthusiasm and a comically inaccurate understanding of blockchain basics. His ability to 'bloop'—spontaneously teleport in excitement—often lands him in the right place at the wrong time, or the wrong place at the right time. Will Bloop successfully create his giant, invisible chain of joy? Can he navigate the complexities of crypto without accidentally upending the entire system? Join the $BLOOP community and witness the most delightfully disruptive force in crypto.","links":"https://bloopcoin.meme/","market_cap":10103.76,"market_cap_rank":9552,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bl00p/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2156cd781c5e77323d92a4487a0ec45f128e165e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2156cd781c5e77323d92a4487a0ec45f128e165e"}}}