{"name":"Zeemcoin","id":"zeemcoin","symbol":"zeem","description":"What is the project about? Zeemcoin helps you to find the perfect Charging Station for you, through our App you can see the evaluations of European Charging Stations made by the rest of the community and find the one that best suits your needs. What makes your project unique? Rate European fast Charging Stations and earn rewards in Zeemcoin (Zero Emission Coin) tokens, our own digital currency with which you can pay for products, services and generate passive income. The most complete App for locating Charging Stations. Access the entire network of Charging Stations and information about their quality, the area and the services that are available to plan the best trip in your electric car. A new experience awaits you Thanks to our integrated gamification module and the benefits of blockchain you will live a new experience. It’s time for Zeemcoin The e-mobility sector is growing exponentially year by year and blockchain technology and its utilities are going to change the world. We are pioneers in bringing these mega trends together and Zeemcoin will become the main form of payment in the e-mobility industry. Your participation in the Community is Rewarded What’s next for your project? Currently only charging points can be found and assessed. We also want them to be able to pay for the energy they consume, regardless of the company that provides it. An all-in-one aggregator of electric vehicle chargers. What can your token be used for? Get the following products, services and discounts: Buy a VELCA 100% electric motorcycle, with a discount of 300 €. Rent a 100% electric Tesla with FutureDrive Install a charger for your electric car with IonClick Get a discount on a blockchain course with Tutellus Be part of our sustainability program where you can reduce your carbon footprint, plant trees and have your own NFTs. Generate passive income through staking/farming in our dApp.","links":"https://zeemcoin.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zeemcoin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x4ca7bf91e4384d7c7a48ed4c04b555f350eb6719"}}}