{"name":"Sphynx Labs","id":"sphynx-labs","symbol":"sphynx","description":"Sphynx Labs is localizing the decentralized space by being an All-In-One (AIO) Crypto Investing Ecosystem that is designed to simplify the trading experience. Founded by CEO Zaidoun \"\"Lonzo\"\" Al-Owbydi and Brandon Dey, the two had a goal of creating a safe, effortless, stress-free platform where users can streamline the process of trading in the DeFi space. Sphynx Labs has already met much of this goal by producing various utilities that include a DEX, charts, staking and farming pools, NFT staking, a written learning hub, and a launchpad. The Sphynx DEX leverages technology from their strategic collaboration with Chainlink to offer a stop loss feature not unlike that offered by a CEX. This allows traders to sleep soundly on more speculative plays knowing that they can set their own terms for trade without having to be glued to their screens. Sphynx is here to offer a unique platform for other projects as well. With the staking and farming pools mentioned above and launchpad, Sphynx gives projects a way to launch that is safe and accessible. Projects can choose to work with Sphynx if they would like to offer built-in utility to their investors through staking without the need to develop and set up pools themselves. Support is available throughout the entire process for any services they use from Sphynx. Soon, future developments will be released to the public, such as a Wallet Extension and Mobile Application which offers CEX like functionality in the DeFi space, Sphynx Pay for real-world purchases with the token, token bridge, NFT marketplace, and a visual learning hub with Sphynx TV. The future Sphynx Labs bridge will be cross-chain. By linking the BRC-BSC-ERC chains, the bridge will focus on Alt and Stable Coins, making it simpler for investors to move from one network to another. In addition, Sphynx Labs has plans to bridge more networks together, such as Polygon, Avalanche, Harmony, Moonriver, Fantom, and many others. Sphynx offers two NFTs on the BSC and ETH blockchain respectively. Holders of the “Genesis” NFT on ETH will receive a portion of all bridge fees when it goes live directly by just holding the NFTs. Holders of the “Scion” NFTs on the BSC can stake their NFTs on the Sphynx platform and earn the native Sphynx token. Holding two “Scion” NFTs grants holders special access to IDOs that Sphynx procures, such as the recent IDO for Fight of the Ages. Each NFT, regardless of chain, grants five whitelist spots a month to projects that are launching on the SphynxPad. Lastly, Sphynx Labs continues to innovate by being the premier DEX on BRISE. As a result, BRISE users can trade, invest, and swap on the fastest and easiest to use DEX in Crypto. With its well-educated and dedicated team offering top-notch customer support, unparalleled utilities, and professional environment, Sphynx is poised to be one of the top ecosystems in the crypto space.","links":"https://www.sphynxlabs.co/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sphynx-labs/logo.png"}