{"name":"Nelore Coin","id":"nelore-coin","symbol":"nlc","description":"The First Agricultural token that gives rewards based on real profit. NELORE COIN is an agricultural business token with multiple farms under management focusing on COW production in Brazil that gives rewards based on real profit. The transaction tax goes to a Treasury account where the money is invested on buying or renting farms in Brazil. This way it creates an intrinsic value that should uphold bear markets and grow with bull markets. The selection of farms is very important so it can be the most profitable for the money invested. Those farms produce a profit which is used to buy NLCs from the Liquidity Pool. Coin buying usually happens every month and in the worst case 2 months. Since the start of the project, NELORE COIN already bought 2 farms in Brazil capable of producing 20.000 COWs with a total of 20 hectares of land. The team at NELORE COIN is composed of Agricultural experts with more than 20 years of experience. It was founded by CEO Marcos Rodrigo, Vice President Carlos Junior and CFO Emerson Muller. Now the team consists of more than 10 people and are in the process of hiring several more. Brazil is the biggest exporter of Agricultural products and NELORE COIN is the first real agricultural token based on Brazil with a real company already created. In the future, it aims to be the biggest farm manager in the world combining WEB3 features into a very old-fashioned sector of the global economy. With blockchain technology it aims to tokenize its NELORE COWS through an internal NFT system and create a Marketplace for real-time transactions of multiple Agricultural products. And it aims to record immutable and trusted data onto the blockchain such as the production, distribution, and sales history of every product. Other than that it aims to create a speculative investment market on agricultural products in Brazil, partnering with the biggest farmers in the country. Where users will be able to speculate on prices of Cows, Seeds, Oxes, Chicken a","links":"https://nelorecoin.com/","market_cap":130757,"market_cap_rank":4727,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nelore-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x5f320c3b8f82acfe8f2bb1c85d63aa66a7ff524f"}}}