{"name":"ScapesMania","id":"scapesmania","symbol":"$mania","description":"What is ScapesMania? ScapesMania is a project created for two distinct audiences: Web3 enthusiasts and Web2 casual gamers. The goal is to provide Web3 enthusiasts with the opportunity to influence the development of and benefit from games played by a massive and profitable Web2 casual gaming audience. What makes ScapesMania unique? Key Advantages -Profitable Web2 Casual Gaming Audience -Benefits for Web3 Enthusiasts from the Massive High-Potential Market -Token BuyBack & Burn -Reward Program for Token Holders -DAO Governance Participation in the Development -Tier-1 BNB Grant Winning Developer -Blockchain, GameDev, and Art In-house teams -AI Content Generator & In-Game AI Assistant -Engaging Mechanics & Setting Based on Market Research -Well-Established Game Economy with a Wide Range of Revenue Streams -App Store & Google Play Presence -Rapid Implementation based on Ready-made Solutions -$MANIA Ecosystem: a unique opportunity to add new projects History of ScapesMania. We noticed the decline of the P2E market fueled by major conceptual issues of many Play-to-Earn projects. We found our inspiration in the evergrowing market of casual games. We created a project that can satisfy both the need of Web2 players for an engaging and colorful gameplay experience and the need of Web3 enthusiasts to find new ways of monetization. What’s next for ScapesMania? To create a sustainable ecosystem we plan to create additional games that utilize the same $MANIA token. Token holders can vote on the development of new games through DAO governance. We reserved the additional funds for these projects and built the numbers into our tokenomics. What can $MANIA be used for? -DAO Governance -Token Buyback & Burn -Token Staking -Engagement Rewards -In-game Assets -Ecosystem Currency","links":"https://scapesmania.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/scapesmania/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xab4e026a2f6f6265c29bbb4c565e66968e3d4962"}}}