{"name":"THE LAND ELF Crossing","id":"the-land-elf-crossing","symbol":"elf","description":"ELF Token is a Governance Token in THE LAND ELF Crossing. Launched globally for both iOS and Android platforms, THE LAND ELF Crossing is a farming blockchain game that combines social interaction, creativity, and economic strategy within a full 3D environment. Developed by a prominent Web3 company based in Japan, the game offers a unique blend of gaming and blockchain technology, catering to a diverse demographic by supporting multiple languages including Japanese, English, Simplified Chinese, and Traditional Chinese. The project utilizes Japan's largest proprietary consortium chain to provide NFT marketplace and wallet services. In addition, we conducted Japan's first game token IEO and raised 1.25 billion yen. THE LAND ELF Crossing introduces a simplified Web3 wallet setup, where wallets are automatically created upon game registration. Players manage their wallets using traditional ID/password systems along with a PIN code, reducing the barriers typically associated with cryptographic key management. This integration facilitates a seamless and secure user experience without the necessity of handling private keys directly. In collaboration with over 50 high-quality partners, including major corporations like Animoca and KDDI, as well as international projects like the Osaka Expo, the game enhances user engagement through diverse cooperative and competitive elements. Additionally, THE LAND ELF Crossing has been integrated with systems like the “EXPO2025 Digital Wallet” provided by HashPort during the Osaka-Kansai World Expo, allowing for mutual use of wallets between the game’s user base and the expected 28 million Expo attendees. In summary, THE LAND ELF Crossing stands as a pioneering project within the blockchain gaming sector, driven by its innovative integration of NFTs, a user-friendly and secure wallet system, and a strategic partnership network, all while providing a compelling gaming experience that transcends traditional mobile games.","links":"https://theland.game/en","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-land-elf-crossing/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8a13f32e2a556830f3a5e97a96ae941abfcb1d5c"}}}