{"name":"Primex Finance","id":"primex-finance","symbol":"pmx","description":"Primex Finance is the cross-chain prime brokerage protocol allowing traders to use decentralized lender liquidity to spot margin trade on DEXs, with a totally decentralized trade execution mechanism. Our goal is to bridge the gap between the biggest DeFi use cases - Lending and decentralized exchanges and defragment the digital asset markets. Financial services and assets will eventually transition to decentralized environments, where people trade and invest freely and without intermediaries, regardless of their social position, nationality, or present location. Primex’s mission is to make trading and investing limitless and globally accessible without trusting middlemen. Key features: Cross-dex trading Besides a specific DEX, Primex allows traders to have leveraged positions across multiple DEXs and the position can be opened on one DEX and closed on another, depending on multiple factors including available liquidity in the respective pair. Cross-chain trading & lending For lenders, it’s an ability to lend assets on one chain and withdraw on another. For traders, open a position on one chain, and close on another or transfer assets seamlessly and trade on DEXs of another chain. Risk management for assets, trading pairs, and traders Lenders can diversify their risk across multiple assets, specific traders using Primex liquidity pools - Credit Buckets. A Credit bucket is a smart contract with a set of trading rules introduced by a community-nominated risk notary to facilitate managing risks for lenders. Decentralized trade execution A layer of keepers, decentralized instances in the protocol, are responsible for executing actions needed for the platform when certain criteria are met, such as a position liquidation, a stop-loss/take-profit or a limit order.","links":"https://primex.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/primex-finance/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}