{"name":"Westland Smart City","id":"westland-smart-city","symbol":"wlsc","description":"WestLand Smart City (WLSC) is a visionary initiative to build a fully sustainable smart city, located in Val Verde County, in the western part of Texas. The city will be designed with the aim of achieving self-sufficiency in essential resources such as water and energy, utilizing 100% renewable sources. The governance of WestLand will be based on a direct democracy model, where all important decisions will be recorded on a blockchain, ensuring transparency, active participation, and decentralization in the decision-making process. The WLSC token will be the central unit of the WestLand ecosystem, functioning as a community governance platform and encouraging community engagement throughout all stages of the smart city's development. The WLSC token will be used for voting, crowdfunding, participation rewards, and as a tool for urban development, allowing citizens to have a voice in the creation and evolution of their city. Furthermore, WestLand Smart City will host a cryptocurrency mining industrial park, taking advantage of the existing energy infrastructure, including power transmission lines that cross the land, as well as the installation of 5G broadband, which has already been completed in the city's lands. This industrial park will provide an opportunity to integrate the digital economy with the physical infrastructure of the city, making it even more innovative and resilient. It is also important to highlight that WestLand's land is located over the Andrews Aquifer, a strategic source of groundwater, which ensures a solid foundation for the city's sustainable water resource management.","links":"https://westlandworld.com/transparency-progress","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/westland-smart-city/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6aa6eec5ba2e7ab3ae7d9807c7a13c1fecf55da7","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x6aa6eec5ba2e7ab3ae7d9807c7a13c1fecf55da7"}}}