{"name":"Symbol","id":"symbol","symbol":"xym","description":"Symbol is a blockchain platform launched in March of 2021. It's the spiritual successor to NEM, featuring a new consensus algorithm called proof-of-stake-plus (PoS+), rule-based tokens (called mosaics), namespaces, multisignature accounts, and aggregate transactions. Its client, Catapult, is written in C++. Symbol has a cult following in Japan and Korea. The community can be primarily found on Twitter, LINE, and KakaoTalk. Some of the most notable projects built on Symbol include: - QUEST [https://quest-bc.com/] | a bounty and tipping platform for creators. Follow the official Twitter account here [https://twitter.com/QUESTofficial5]. - SYMBOARD | a loyalty and rewards card for businesses. Follow the official Twitter account here [https://twitter.com/symboard_symbol]. - THE TOWER [https://symvolution.com/thetower/] | an endless dungeon crawler. - NFT DRIVE [https://www.nft-drive.com/] | an on-chain media and content storage service. Follow the official Twitter account here [https://twitter.com/nftdrive_jp]. - COMSA [https://comsa.io/en] | a novel NFT marketplace developed and designed for the Japanese cryptocurrency community. In November 2021, Symbol was forked by a pseudonymous team of cryptocurrency experts and enthusiasts alike. Titled Cyprus, this hard fork signaled the community’s intent to turn Symbol into the world’s leading omnichain platform with content-specific, scalable shards - powered by zk-STARKs [https://starkware.co/stark/]. Symbol aims to solve for problems inherent in EVM-based platforms and omnichain solutions, where security is often defined at a smart-contract level (versus a network-wide level); where L2 validators are centralized and not incentivized; and where new features and functionality are decided by central client teams versus a fair and free market.","links":"https://symbol-community.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/symbol/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}