{"name":"DAYSTARTER","id":"daystarter","symbol":"dst","description":"Purpose DAYSTARTER is a Web3 Lifestyle dApp that improves your lifestyle and helps you instill new habits and reach your goals by focusing on \"Wake-Up Routine,\" which is an essential part of your daily life. DAYSTARTER is the first of many dApps that will be developed and released on Life3's dApp ecosystem platform by METALABS. DAYSTARTER aims to help accelerate the mainstream adoption of cryptocurrencies by bridging and encompassing traditional non-crypto mobile app users who have not yet adopted cryptos to the crypto space seamlessly through familiar and easy-to-use mobile app design, achievable milestones and incentives. Function DAYSTARTER detects and determines users' performance of the required Wake-Up Routine action using various sensors on users' mobile phones. Users will carry out assigned Wake-Up Routines that help them wake up in a good mood and earn DAYSTARTER Point (DSP), its utility token. DSP is used to obtain a new NFT or level it up. Users can request to exchange it into DAYSTARTER Token (DST), the ecosystem governance token, through the daily Token Generation Event (TGE). Utility 1) DST holders can receive voting power for governance operations through \"staking lock\" DST Tokens and redistribution of the fees incurred on the ecosystem. 2) DST is used to purchase Achievement SBT. 3) DST is used on the Marketplace to trade Membership NFTs, Benefit NFTs, and Giftbox NFTs. 4) DST is consumed to initialize Benefit NFT attributes reset cost. 5) Outside of DAYSTARTER dApp, DST can be exchanged to OYL Token (Own Your Life), the governance token of the Life3 ecosystem. This Web3 lifestyle ecosystem platform hosts all other lifestyle dApps to be released in the future by METALABS. Various matters concerning the ecosystem's operation are decided through voting and executed through the DAO.","links":"https://daystarter.life/","market_cap":15015904,"market_cap_rank":1079,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/daystarter/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe3a46b2bc1d83c731d58cab765d3b45bce789095"}}}