{"name":"Linea Velocore","id":"linea-velocore","symbol":"lvc","description":"Velocore is the first and the most optimal veDEX on multiple chains, built on the strong foundation of Solidly. It offers users an environment where everyone can trade with low fees and slippage, while relieving protocols of the burden of inflating their respective token rewards, with the goal of growing the DeFi ecosystem together. The existing ve(3,3) system based on Solidly initially solved the problem of incentive misalignment of protocols like Curve and SushiSwap. However, it had numerous inefficiencies and loopholes. Velocore solved these issues with a revolutionary new model of AMM and a free-flowing voting system through V2. Decentralized exchanges are one of the most critical Lego blocks of DeFi and the primary source of real yield. At Velocore, we aim to become the top DEX for major new chains and the standard for efficient DEXs. Our belief is that a leading DEX should fulfill the following criteria: 1. Make it possible to trade major tokens with minimal slippage. This, in turn, would increase the size of the liquidity pool itself while at the same time increasing the exchange efficiency of the liquidity that exists. 2. Host and attract a wide variety of tokens so that all transactions can be done within a single platform as much as possible. Velocore aims to become the home of a broad array of tokens. 3. Essential optimization of gas costs for the users. Given that over 95% of transactions are of smaller sizes, the real exchange rate is significantly impacted by gas costs, particularly on chains based on Ethereum. 4. The incentive system should be easy to understand and predictable. Minimizing user confusion and eliminating inconvenience will help find the optimal sweet spot and accelerate the momentum of the flywheel. In order to achieve this, Velocore ensures a clear and predictable voting and reward system. However, it's carefully designed to not be so recurrent per epoch or per NFT as to consume unnecessary gas and time. The AMM itself has also dramatically reduced gas usage while creating an environment where swaps can be made with very low slippage using a variety of pools, including Stableswap, NFT sudo-swap, up to 8 tokens pool, and nested interest-bearing pools. Velocore prides itself on being the most efficient DEX currently available, and we have strived to establish the benchmark for exceptional decentralized exchanges in the coming future.","links":"https://linea.velocore.xyz/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/linea-velocore/logo.png","detail_platform":{"linea":{"decimal_place":18,"contract_address":"0xcc22f6aa610d1b2a0e89ef228079cb3e1831b1d1"}}}