{"name":"AutoMiningToken","id":"autominingtoken","symbol":"amt","description":"1. AutoMiningToken aims to democratize bitcoin mining. For this, a bitcoin mining ecosystem was tokenized so that everyone can invest in mining just by holding the token (AMT) in their wallet, receiving daily and proportional income in BTCB. It is a synthetic bitcoin token, from the BSC network, which can be bought and sold on PancakeSwap. 2. Yields are distributed through a portfolio programmed for this purpose, with a smart contract immutable and public, without keeping the investor's money in custody. This is not about renting terahash or cloud mining. In fact, receiving BTCB is independent of the will of a person or company, but of the smart contract programming. In addition, the project has more than 35 BTCB in the Warranty Vault (a number that constantly increases according to the distribution of mined bitcoins) and a blocked liquidity of US $1 million for 2 years. 3. The AMT project was officially launched in September 2022 with approximately 800 mining machines. With the entry of new investors, this number was already approaching 2400 active machines at the beginning of 2023. 4. The next step will be to connect even more machines to the ecosystem, making one more token issuance. This is because all AMT issuance depends on terahash backing (new tokens are only issued when there is terahash to support them). More machines, more earnings. 5. AMT is useful for those who want to invest in bitcoin, as it generates passive, daily and proportional income in BTCB. The AMT facilitates the investment in bitcoin mining, because it assumes all the operational and bureaucratic part of the activity. Investors in AMT do not have to worry about buying, importing and maintaining mining machines, nor do they have to worry about renting space, machine cooling equipment, employee salaries, taxes, high electricity costs. It is up to the investor to just buy and hold the AMT token, verifying their daily bitcoin yields increase, as programmed in the project's smart contracts.","links":"http://autominingtoken.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/autominingtoken/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6ae0a238a6f51df8eee084b1756a54dd8a8e85d3","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x6ae0a238a6f51df8eee084b1756a54dd8a8e85d3"}}}