{"name":"DEEPSPACE","id":"deepspace_binance-smart-chain","symbol":"dps","description":"DEEPSPACE is an immersive space exploration strategy game. Engage in the DEEPSPACE universe by using $DPS, the in-game currency, and trading unique, upgradeable smart NFTs as you navigate through the cosmos with your fleet of ships! Prepare to explore, harvest, race, and battle your way across the DEEPSPACE universe! DEEPSPACE - Outpost One A key feature of DEEPSPACE is the Outpost. The Outpost serves as a decentralized exchange hub where you can buy, sell, and trade your ships, cores, and other upgradeable Smart NFTs with fellow explorers. Use the marketplace to build limited edition ships and acquire other valuable collectible assets. Expand your fleet to enhance your exploration, harvesting, racing, and combat capabilities throughout the DEEPSPACE universe! Players can exchange land, weapons, spacecraft, and other items in the marketplace to aid their exploration of the game world. As players advance in the game and grow their ship fleet, they can enhance their gameplay experience. The custom decentralized app (dapp) marketplace is integrated with the rest of the DEEPSPACE (DPS) platform, allowing for seamless connections between players looking to trade items and further their progress in the game. Ship modifications, both temporary and permanent, can be transacted on the marketplace. DEEPSPACE - Game Game assets such as ships and equipment are blockchain NFTs, giving gamers full ownership of their in-game assets. Players can mint their own starships or purchase from the proprietary NFT marketplace, and choose up to 4 ships from their fleet to begin exploring, engaging, and discovering planets, places, and other players within the 3D space-based universe. Racing and Track Builder In addition to exploration and combat, DEEPSPACE features exhilarating racing mechanics! Players can participate in high-speed races across various cosmic tracks. The innovative track builder allows you to create your own custom racetracks, designing loops, jumps, and obstacles to challenge yourself and your friends. Share your tracks with the community and compete for the fastest times! Starship Archetypes Four starship archetypes allow you to explore the universe openly, engage in combat, or mine resources: 1. Fighters - Ships with state-of-the-art weapon technology. 2. Tank - Ships designed for managing enemy engagements, longevity, and withstanding damage. 3. Mining - Ships specially engineered for efficient resource collection. 4. Support - Ships focused on utility and boosting the capabilities of your other ships. Each ship has its own benefits in the form of 8 different stats: attack, special attack, shields, special defense, speed, luck, mining, and health. Players can apply permanent and temporary modifications as they play. Modifications allow for many added battle benefits, situational adaptability, and other stat improvements. Temporary modifications give players single-use bonuses during gameplay with specific uses and unique outcomes. Resource mining allows players to gather raw materials, like ore, for ship or property add-ons and modifications. Mined materials enable you to customize your ships, creating a unique experience for every player. Battles and Challenges Battles occur frequently within the game and can take one of two forms: 1. Player vs Player (PvP) - PvP allows players to battle against each other for prizes, leaderboard placement, and bragging rights. 2. Player-vs-Enemy (PvE) - PvE involves battling Non-Playable Characters (NPCs; i.e., game-based Artificial Intelligence (AI) players) throughout the game as a mechanism for winning rewards and enhancing your gameplay experience. Dive into the DEEPSPACE universe today and embark on your adventure filled with exploration, racing, and epic battles!","links":"https://deepspace.game/","market_cap":62985,"market_cap_rank":7803,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/deepspace_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xf275e1ac303a4c9d987a2c48b8e555a77fec3f1c","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xf275e1ac303a4c9d987a2c48b8e555a77fec3f1c"}},"is_native":false}