{"name":"Bot Compiler","id":"bot-compiler","symbol":"botc","description":"What is the project about? Bot Compiler is project that leverages its treasury to invest into other projects that provide revenue share tokenomics. The fees accrued are then aggregated and redistributed to $BOTC holders. Holding the $BOTC token also provides holders the advantage of being able to access revenue generated from multiple projects whilst only managing one token. Our custom dApp allows the claiming of rewards and the tracking of the treasuries progress ensuring investors are always upto date with the treasuries actions and growth. What makes your project unique? We were the first project to implement a revenue aggregation system that redistributes the fees accrued back to holder. Our custom dApp has only just launched but is the most developed on the market but still being improved as we progress. Bot Compiler has also formed several partnerships with already established bot and revenue sharing platforms and have more already in the works. History of your project. Bot Compiler originally launched and saw a great response, with a great community being formed alongside. After launch although our contract worked correctly, we quickly discovered that a change in CA would allow for the claiming process of the rewards to be cheaper, increasing profitability. BOTC provided a migration period where V1 holders could send their tokens to receive an airdrop of V1. 85% of holders migrated to V2 further showing the strength of our community and highlighting the positive steps BOTC has taken. What’s next for your project? BOTC aims to grow the treasury over the long term, providing more rewards to BOTC holders. We have many improvements planned for our dApp which will allow holders even more insight into how the treasury is functioning. Bot tokens and revenue share projects are a new frontier for crypto, and with BOTC taking early positions in this growing market the potential for exponential reward growth is possible. What can your token be used for? To allow exposure to many revenue share projects, and accrue some of their generated fees via one platform and token.","links":"https://botcompiler.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bot-compiler/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x9532ca064278ce3ba4fcc66cebec6d9f04f58f70"}}}