{"name":"TrumpArmy","id":"trumparmy","symbol":"trumparmy","description":"Introducing TrumpArmy, a revolutionary crypto meme token that aims to stir the digital asset universe. Taking inspiration from meme culture and the spirit of the TrumpArmy, this unique digital token offers an innovative blend of amusement and financial engagement. TrumpArmy is developed on the Binance Smart Chain, showcasing a perfect marriage of playful interaction and serious crypto investment. The aim is to provide a delightful yet financially rewarding experience for cryptocurrency investors and meme enthusiasts. The essence of the TrumpArmy token lies in its reflection of the supportive community around it. Envisioned as a mode of payment within the community, the token is designed to carry real-world value. It will be accessible for acquisition on a variety of crypto exchanges, with its value intrinsically tied to that of the Binance Smart Chain. However, TrumpArmy transcends the concept of being just a token; it represents a community. The TrumpArmy team is committed to nurturing a flourishing community, consisting of individuals who share a mutual passion for memes, cryptocurrency, and the TrumpArmy spirit. The project further enhances its appeal by preparing a 1000 piece NFT collection ready to mint, featuring 1:1 artworks paying tribute to Donald Trump. TrumpArmy serves as an exciting exemplar of a project that effortlessly combines memes and cryptocurrency. With a unique concept underpinning it, and a committed community supporting it, TrumpArmy is poised to climb the ranks of popularity in the meme token market. It invites all to partake in the fun, acquire some TrumpArmy tokens, and enlist in the digital army. Experience the blend of entertainment and investment that TrumpArmy offers, and become a part of this groundbreaking journey","links":"https:trumparmy.co","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trumparmy/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x7361de48dde2d05e379d9e6641b7e7b2e323a464"}}}