{"name":"Marquee","id":"marquee","symbol":"marq","description":"Marquee is a decentralised insurance platform, that aims to allow users to protect their digital assets and earn premiums while providing liquidity. Why Marquee? * High cover period flexibility: Choose between 1 and 365 days. * Wide Coverage: We offer Smart Contract and Crypto Price Covers. In addition, we have NFTs, TradFi and Parametric Covers coming soon! * No KYC/AML required. * No lockup period for staking. * All insurance premium (real yield) goes to fund providers. * DAO-driven: The DAO decides how assets are controlled, distributed and protected. MARQ is the native token issued by Marquee insurance protocol. Designed to be backed by a basket of assets with stablecoins included in the vault, each MARQ is backed (not pegged) by one USDT. MARQ has several uses cases: * MARQ can be staked in the staking pool to earn high APY received in sMARQ. * MARQ serves as the fourth layer of users' payout in extreme situations, after Insurance Premia, Fund Pool and Vault have all been drained. * By wrapping the sMARQ, holders also receive the voting right to participate in Marquee governance, regarding Marquee parameters, dividend distribution, secondary offering of MARQ, governance of co-operating projects, and future development, etc. Roadmap: 2023 Q1: * Launch new website * Launch Mainnet * Extend covers to more crypto assets & smart contracts * Launch MarqueeDAO * Offer more bond maturities * Multiple listings across both DEXs & CEXs 2023 Q2: * DEX Derivative Trading Platform * Launch Stablecoin De-Peg Cover * Launch NFT Cover * Add 3rd-party DeFi court on top of the DAO * Develop Referral Mechanism 2023 Q3: * Launch Event Cover, e.g. cover for flight delays * Launch Autonomous Oracle * Launch Marquee Smart Pool strategy for Fund Pool to generate higher yields 2023 Q4: * Develop more event covers against natural disasters * Launch Customisable insurance products depending on user needs","links":"https://marquee.fi/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/marquee/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}