{"name":"XION","id":"xion-2","symbol":"xion","description":"XION is the first L1 purpose-built for mainstream adoption. **What is XION?** XION is a blockchain built for everyone, everywhere through chain abstraction. Utilizing its Generalized Abstraction layer, XION distinguishes itself by integrating complex blockchain functionalities, such as accounts, signatures, and interoperability, directly at the protocol level. This approach allows for engagement with blockchain applications without needing to understand the underlying technologies. XION is the native utility token that is used for: - Network Usage Fees: Transactions on the XION network incur fees, which are used innovatively to offset the minting of new tokens. This mechanism means that as network usage increases, the offsetting of fees could lead to a deflationary token model. - Proof of Stake Security: As a proof-of-stake network, XION relies on validators to maintain its integrity. $XION token holders can delegate their tokens to validators or stake their tokens to run their own validator nodes. In addition, instead of calculating inflation against all tokens, the XION network calculates against only staked tokens. This vastly reduces the token’s overall inflation, leading to much more sustainable economics of the network. - Governance: $XION token holders can actively participate in network governance by proposing and voting on proposals. - Medium of Exchange & Collateral: $XION can be utilized as native liquidity and collateral within the ecosystem. It can also facilitate peer-to-peer transactions across applications and accounts within the XION ecosystem. **What makes XION unique?** Generalized Abstraction Layer: XION's foundational feature is its Generalized Abstraction layer, designed to simplify blockchain technology's complexities. This innovation aims to address the primary challenges that have prevented widespread blockchain adoption, providing a comprehensive solution for users and developers. Meta Accounts: A distinctive element of XION, Meta Accounts, abstracts the traditional key model, enabling varied authentication methods. This feature facilitates a user-friendly transition from traditional web experiences to blockchain-based applications. Signature and Device Abstraction: Through a signature-agnostic approach, XION accommodates transactions authenticated via common methods like email and biometrics. This inclusivity extends to device usage, ensuring seamless interactions across multiple platforms, thereby boosting security and user accessibility. Parameterized Fee Layer: XION introduces a parameterized fee system that abstracts fees, enhancing user convenience. Furthermore, this system supports transactions denominated in stablecoins, such as USDC, enabling familiar pricing and stability. Abstracted Interoperability: Focusing on interoperability, XION ensures that its Meta Accounts are compatible across diverse blockchain ecosystems. This feature enhances the user experience by facilitating effortless cross-chain interactions through chain abstraction. **Who are the founders of XION?** Burnt is the research and development company that first began contributing to XION blockchain. Burnt Banksy, the founder, purchased a painting by the internationally famous artist Banksy, incinerated it, and then created an authenticated 1 of 1 NFT representation, selling it for more than the original physical artwork. His actions demonstrated the concept of digital scarcity on the world stage, making NFT community history and receiving universal acclaim in the process. The story was covered by leading publications including Bloomberg, CoinDesk, GQ, CoinTelegraph, BBC, CBS, HYPEBEAST, Art.Net, TechCrunch, and many others. He is often cited as one of the catalysts for NFTs as well as being cited in the wikipedia for the word NFT. **How is XION secured?** XION operates on a Tendermint-based proof-of-stake (PoS) consensus mechanism. Prominent validators help to secure the network while making it more decentralized as well. XION is backed by industry leaders such as Animoca, Circle, Multicoin, Arrington, Spartan, Draper Dragon, Hashkey, GoldenTree, Mechanism, Morningstar Ventures, Figment, Play Ventures, Valor, Sfermion, Kucoin Ventures, MH Ventures, Laser Digital (Nomura) and more.","links":"https://xion.burnt.com","market_cap":120174347,"market_cap_rank":547,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xion-2/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}