{"name":"JulSwap","id":"julswap","symbol":"juld","description":"What is the project about? JULSWAP DAO: Empowering Community Governance and Decision-Making JULSWAP DAO is an innovative and community-driven project that places power and decision-making authority directly in the hands of its token holders. With each JULD Token representing a voting right within the DAO, participants have a genuine opportunity to shape the future of the ecosystem. The Utilization of DAO Token (JULD): Voting Power: Every JULD Token carries one voting right, ensuring that each participant's voice is heard and considered in the decision-making process. Proposal Acceptance: To be accepted, proposals require a minimum of 5% of the total token supply to vote with a \"YES.\" This ensures that proposals garner sufficient support before progressing. Majority Consensus: For a proposal to pass, a minimum of 50% of all votes cast must be positive. This ensures that decisions represent the majority sentiment within the community. Timely Voting: The voting timeline for proposals is set at 72 hours, providing ample opportunity for community members to participate and contribute their perspectives. What’s next for your project? Liquidity.Bond DAO Community What can your token be used for? Earn While You Vote: Here's where it gets truly remarkable! When you exercise your voting rights, you have the opportunity to earn fees in the process. Your engagement and active involvement in the governance of our project are not only appreciated but also rewarded. This unique incentive structure aligns your interests with the success of our ecosystem.","links":"https://julswap.com","market_cap":678376,"market_cap_rank":3478,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/julswap/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf5d8015d625be6f59b8073c8189bd51ba28792e1"},"harmony-shard-0":{"decimal_place":18,"contract_address":"0x504d7d5bd2075fa782fbd0be9bea4cdc7e25f5a1"}}}