{"name":"ViCat","id":"vicat","symbol":"vicat","description":"ViCat is a cat themed coin that emerged in the market against dog dominance. ViCat is a meme coin for cat lovers and everyone who enjoys crypto. Its goal is getting more people to get involved in crypto and especially in the VITE chain. While there are lots of dog coins out there, cat people seem to come short too often. ViCat wants to represent the cat lovers in the VITE community, deliver platforms for VITE enthusiasts of several regions and languages and help in growing the reach for the VITE chain. Since its a meme coin, the most important goal is creating a fun experience for all those who would like to get involved! ViCat went beyond the targets published in the first road map, so a road map was prepared with new targets. ViCat's history until mid-June 2022, ViCat was initially minted on VITE chain and listed first on ViteX (DEX) Team share is locked for 2 years with smart contract ViCat Council share is locked for 2 years with a smart contract ViCat SBP established and daily distribution to voters (total Vite reward amount distributed so far) 9.409 number of ViCat Holders reached (June 22nt) ViCat has been bridged to Binance Smart Chain integrated and listed on Pancakeswap Staking programs established at https://app.vivafi.org/ and https://stake.vitc.org/ for Vite network and BSC network In order to gain a solid place in the NFT market (which is gaining popularity day by day) themes were determined for the ViCat NFT project and artist collaboration was achieved. The first ViCat NFTs have been minted and distributed https://wax.atomichub.io/explorer/collection/vicatuniques","links":"https://vicat.tech","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vicat/logo.png","detail_platform":{"vite":{"decimal_place":7,"contract_address":"tti_b3fbb46b9318b3d168ba904e"},"binance-smart-chain":{"decimal_place":7,"contract_address":"0x3bfad48181c9e88e1dd9c1b48887e33e2653db4d"}}}