{"name":"QueenBee","id":"queenbee-2","symbol":"qube","description":"What is the project about? Queenbee is a decentralised exchange that aims to provide a seamless and transparent trading experience for users. With its unique liquidity pool design and community-driven governance model, the project has gained attention in the DeFi space and is likely to continue growing in popularity over time. What makes your project unique? Queenbee project is unique in several ways: 1. Low transaction fees: Queenbee has a low transaction fee structure, which means users can trade on the platform without worrying about high fees eating into their profits. 2. Decentralized governance: Queenbee is a decentralized exchange that is governed by its community. This means that decisions are made through consensus and all stakeholders have a say in how the platform evolves. 3. High liquidity: Queenbee uses liquidity pools to ensure that users can easily trade their tokens. This means that users can quickly buy or sell assets without fear of slippage. 4. User-friendly interface: Queenbee has a user-friendly interface that is easy to navigate. This makes it easy for both experienced and novice traders to use the platform without facing any difficulties. Overall, Queenbee is unique because it offers a comprehensive decentralized trading experience that is flexible, low-cost, highly liquid, and community-driven. History of your project. Overall the Queenbee project has been well received by the community and is seen as a promising platform for decentralized trading. What’s next for your project? Queenbee is planning to integrate several new token pairs to its platform, allowing users to trade an even broader range of cryptocurrencies. In addition, the project is looking to introduce liquidity pools, which would enable users to earn passive income by providing liquidity to the platform. What can your token be used for? Staking and Trade","links":"https://queenbeeswap.net","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/queenbee-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf4d834a2b5f9fd7b37c5388255a21691406b87fb"}}}