{"name":"Sangkara","id":"sangkara","symbol":"misa","description":"1. Increse the Underlying Asset’s Value The asset that protects the value of the $MISA token is a productive plantation of 11.5 hectares in Central Java. The value of this asset will be increased by utilizing this land into a more profitable agricultural land. PT MSA plans to cultivate cassava plants to meet the large demand for cassava from abroad. The existing land will be used to plant cassava with superior quality seeds. PT MSA plans to establish a factory to process the cassava so that it has a suitable yield for export. This processing factory will also receive cassava products from local farmers, so that PT MSA can have a positive impact on the surrounding environment. 2. Acquire Token Exchanger Public interest in crypto investment in Indonesia has begun to increase significantly in Indonesia, especially since the government has recognized crypto as a digital asset that has become a trading commodity (Liputan6.com). The data released by the Ministry of Trade shows that every day the value of crypto transactions reaches IDR 1.5 trillion, and this is also reinforced by the growing ability of the Indonesian in creating their own tokens/coins. With the ever improving enthusiasm of the community, PT MSA intends to establish an exchange that can accommodate and distribute the coins created by the Indonesia’s own and also make this crypto investment easily accessible to investors who want to invest in crypto currency. Unlike other exchangers in Indonesia, PT $MSA will accommodate the underlying assets of token creators who wish to list their tokens with underlying assets so that PT MSA will not only become an exchanger that facilitates coins in general, but PT MSA will facilitate tokens that have an underlying asset. 3. Token Publisher In May 2021, Indonesia was ranked 5th in the world in the number of startups. The number of MSME in Indonesia is also tantalizing, reaching 65 million in 2018. Of this number, many startup companies and MSME need funds to laun","links":"https://www.misatoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sangkara/logo.png"}