{"name":"Ducker","id":"ducker","symbol":"ducker","description":"Ducker is a revolutionary memecoin that brings together memecoin enthusiasts and meme artists in a vibrant community. In a world dominated by Pepes, Ducker emerges as a fearless and unique hero, ready to make a splash. With a friendly connection to the Pepe universe, Ducker captures the attention of Pepe lovers and meme enthusiasts in the crypto space. What sets Ducker apart is the collaboration with a renowned Pepe artist, ensuring high-quality and authentic artwork that resonates with Pepe's style. This collaboration adds a special touch to the project and sets it apart from others in the memecoin realm. The dedicated Ducker community shares a clear vision and fosters a passionate environment. They actively contribute to the project's growth, creating a strong sense of camaraderie and participation. This community bond is a key factor that propels Ducker's exceptional growth potential. The history of Ducker showcases its adaptability and market appeal. The project launched in June 2nd, 2023, aligning with the current market trend of 0/0 taxes. The release of Ducker's version 2 project received praise for its clean and reminiscent image of Pepe, making it an attractive option for those seeking the next Pepe-like phenomenon. Looking ahead, Ducker has exciting plans. The project recently launched limited edition NFTs in collaboration with a renowned Pepe meme artist. The focus now shifts to expanding the community, increasing the project's market cap, and preparing for the highly anticipated release of the DUCKERVERSE NFT Collection. Ducker also aims to be listed on additional exchanges and platforms, opening up more opportunities for growth and exposure. The DUCKER token holds significant value within the Ducker ecosystem. It serves as a means of value exchange, enabling participation in community events, contests, and giveaways. Additionally, DUCKER holders gain access to the exclusive DUCKERVERSE NFT Collection, acquiring unique digital artworks.","links":"https://www.ducker.vip","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ducker/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf70ce9ee486106882d3dc43ddbd84e0fa71ac2a5"}}}