{"name":"Play It Forward DAO","id":"play-it-forward-dao","symbol":"pif","description":"FIRST GUILD TO MARKET IN 2022, Play It Forward DAO redefines Play-to-Earn by enabling a Plug-and-Play Metaverse Poised to be the growth engine of the Metaverse, with a unique dual business model: - Guild management SaaS platform with 20,000+ users pre-launch (P2E Board) - 3rd largest guild globally with 3,000+ scholars (PIF Guild) P2E Board - one-stop platform to connect guilds with scholars, where guilds can find, track, manage, and pay their scholars across multiple games - in the process making Play-to-Earn more accessible. The central repository of gamers' and guilds' performance data in the Metaverse PIF Guild - 40,000+ community with 3,000+ scholars across multiple games (Axie Infinity, Thetan Arena, Pegaxy), earned 21 million+ SLP to date. Partnered with exchanges to pay scholars in fiat and make Play-to-Earn more accessible Backed by the biggest names in crypto and venture capital - Signum, Kyber, UOBVM, Jump Capital, GBV, LD Capital, Great South Gate, Octava, AU21, Double Peak and many more. Advisors include the who's who of gaming - Paul LinChen (Head of APAC Strategy, Activision Blizzard) and Dave Waslen (CEO, Wilder World) PIF holders will benefit from multiple token accrual mechanisms: - Growing Guild revenues across our markets and varied game scholarships - Increasing P2E Board platform revenue from guilds and players using our premium tools and services - Appreciation of Treasury NAV via early stage investments in GameFi governance tokens and NFTs - Active Treasury management from buybacks using DAO revenues and price support in times of weakness Our staking program is inspired by Protocol-Owned Liquidity mechanisms like Olympus DAO, which incentivizes long-term holding over simplistic staking. Stakers will vote on distribution of DAO rewards - over time, PIF DAO will become an algorithmic liquidity provider for GameFi PIF DAO broadens access to the Metaverse and allows all gamers to achieve financial freedom via Play-to-Earn. Over time, we will serve as the bridge between sources and users of capital for the Metaverse Play It Forward DAO - making play more rewarding, one game at a time","links":"https://playitfwd.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/play-it-forward-dao/logo.png"}