{"name":"Ledgis","id":"ledgis","symbol":"led","description":"What is LEDGIS? LEDGIS provide the next-generation blockchain platform in the era of data sovereignty, which solves both the structural limitations of existing platform-oriented businesses and the decentralization issues that blockchain solutions must overcome; which utilizes the SSI (Self Sovereign Identity) data management technology and allows individuals to control their own data. With its sophisticated token economy, Users can receive rewards according to their contribution to the ecosystem and experience various DApp services at a high speed of 3,000 TPS. Who created LEDGIS? LEDGIS was founded by Martin Lee, who now serves as CEO at IBCT (Institute of BlockChain Technology & Service). He worked as a chief researcher for more than 10 years in a national IT technology research institute. In 2018, He founded IBCT which makes it possible to experience a blockchain-enabled society everywhere. When was LEDGIS launched? The initial work on the LEDGIS project was started in February 2018 and it's mainnet was officialy launched in September 2019. What is the purpose of LEDGIS? The main purpose of LEDGIS is as below. - Self-Sovereign Identity (SSI) Service Platform As a key infrastructure in the data economy, even large amounts of data can be managed with its blockchain service. It performs the core function of the protocol economy that reorginizes and redistibutes the data power to user-centered system (SSI) from IT platforms. - Web 3.0 My Data Platform Web 3.0 era in which users take ownership of their own data, inevitably requires a completely new data infrastructure. The DIDH technology which is combined blockchain and IPFS-based encryption data sharing technology and private key distributed storage technology provides innovative total data solutions based on Web3.0 - Provides '1 Person 1 Wallet' private key management LEDGIS Realizes data control by oneself in the Web 3.0 perspective and prevents the possibility of theft or forgery (loss/stolen of keys, forgery of biometric information, etc.) based on DID technology recognized as international standard by W3C, IDH a decentralized data encryption storage/sharing solution, and Facial Authentication. - Coin economy that vitalizes the ecosystem By adopting the DPoSS consensus algorithm, DApp operators who provide high-quality services based on voting results and service utilization become block generators, and coin holders can also receive contribution rewards, and voting rewards depending on their ecosystem contribution.","links":"https://www.ledgis.io/","market_cap":208147,"market_cap_rank":4420,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ledgis/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}