{"name":"Uhive","id":"uhive","symbol":"hve2","description":"The Uhive Social Metaverse stands for a handful of social media revolutions that are breaking the decades-old norm and disrupting the status-quo that currently stands between Big Tech and individuals who use social media. While these include the Oasis and the Magna Carta Protocol, Uhive’s most ambitious and sweeping goal is to share all of its wealth and success with everyone via a universal income proposal, which unconditionally distributes dividends (via tokens) for all active users on a daily basis. Simply put – success and wealth should not be distributed between only those that own equity in Uhive, but all those that participate in making Uhive a success! The Five Core Pillars of Uhive Our continued growth owes a lot to the core fundamentals upon which Uhive was built; Freedom: It’s no secret that current social networks are broken. While they might still be experiencing user-growth, that can be chalked down to a lack of a truly viable alternative. Uhive’s decentralized moderation standard is the ‘fix’ millions of users are waiting for – and offers every single user the opportunity to have a voice on a platform that is decentrally moderated. Uhive aims to be 100% community moderated in 2022. Distribution of wealth (Dividends for All): Uhive’s ‘Dividends for All’ revenue share model is an entirely unique value proposition and promises to share the ‘wealth’ proportionately with users. Intrinsically linked to user acquisition, token trading volume and token price, Uhive aspires to create the first global universal income for every single user! Democratization: Uhive’s has agenda has always been to give back control to the users, and in doing so democratize the entire social metaverse experience. We achieved this by launching community moderation (pioneered by Wikipedia), accepting users to become councilors, and creating a public board. Circular Economy: Uhive’s economy is circular and complete, which means like the physical world, everything can be bought, sold and traded, while it operates both across the digital and physical environments. A user’s content, their space (profile/s) and space names, space locations will have a value. The Oasis (virtual world): Is our 4D immersive metaverse layer that encompasses all the above in a virtual world, acting as a bridge to our physical world. Read more about the Uhive Metaverse here... https://medium.com/uhive","links":"https://www.uhive.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/uhive/logo.png"}