{"name":"Winterdog","id":"winterdog","symbol":"wdog","description":"Winterdog is combining the latest blockchain technology in order to create the perfect development environment for a project bringing together the meme, the utility and the charity. Winterdog started the development of SAFEPAD, which will be a next gen launchpad that will provide developer a faster, easier and safer way to launch their projects. Safepad will provide premium and professional services for developers, and will be first international multi language launchpad, and also the cheapest one. Most of existing launchpads are demanding extra commissions for KYC and Audit services, a developer being charged almost 1 k $ for being able to have the badge on the launch platform. Winterdog will cut the expenses for launching a project so our parents will provide those services for a maximum charge of 250$. Each project launched will have it s own consultant, that will advice on proper launch services, including the marketing based on the project utility. Also, Winterdog team will help developers contacting the influencers, and each user of SAFEPAD will receive a 10% discount on marketing packages. SAFEPAD will not charge any tokens for launching a project. SAFEPAD will charge only 2% for the amount raised in BNB. 1,3 % will be used for project development and launchpad maintenance and upgrade 0.7% will be used for buyback and burn Winterdog weekly. Also, Winterdog will release an unique 267 NFT collection that will be minted by holders. There will be 2 Legendary and top tier NFT’S, each unique that can be randomly dropped by out minting platform when you buy the NFT’S. Owning one of Legendary NFT will get your wallet exempt for trading fees forever. The rare NFTS ( 3 x 5 unique NFTS) will gain an additional 1% rewards for the holder at staking. All NFT will get the holders Whitelisted for every project launched on SAFEPAD. From the NFTS price 30% will be donated to World against Hunger initiative and 70% will be used to further project development.","links":"https://winterdog.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/winterdog/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x6ffcebb2f9360bc233cc0aa35d15b4999cd6af29"}}}