{"name":"Public Meme Token","id":"public-meme-token","symbol":"pmt","description":"Public Meme Token (PMT) is a unique cryptocurrency that has a maximum supply of 2.000.000.000 tokens. It is designed to integrate the world of Artists, Visual art, and blockchain,providing a platform where users can not only engage with their favorite Artists and influencers but also stake their loyalty NFTs (Non-Fungible Tokens) to earn PMT tokens. Loyalty NFTs are special tokens created by renowned and talented artistsand influencer who have contributed their exceptional artistry to the PMT ecosystem. These NFTs are not only valuable pieces of digital art but also function as a symbol of loyalty and support for the PMT community. By staking their loyalty NFTs, users have the opportunity to earn PMT tokens as a reward. This incentivizes users to hold onto these unique artworks and participate actively in the PMT ecosystem. The more loyalty NFTs a community member stakes, the greater the potential rewards they can earn. This concept brings together the worlds of digital art and cryptocurrency, providing artists with exposure and recognition, while users gain the opportunity to earn from their loyalty and involvement in the PMT community. It creates a symbiotic relationship, where artists can showcase their talent and users can benefit from their support. The loyalty NFTs, created by great art artists, not only hold value in the PMT ecosystem but also appreciate in worth over time. This makes them highly sought after and coveted by both art collectors and cryptocurrency enthusiasts. Each loyalty NFT represents a unique and limited edition piece of artwork, making it a valuable possession in the digital art world. Public Meme Token (PMT) goes beyond just being a meme token! It’s a sustainable community token, empowering visual artists, musicians, and influencers. With (RWAs) Real World Asset backing and a buy back and burn mechanism, PMT is driving creativity while ensuring long-term value. Join this sustainable revolution and unleash the power of your BNB with PMT","links":"https://www.publicmemetoken.xyz/","market_cap":1129088,"market_cap_rank":2674,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/public-meme-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x68ae2f202799be2008c89e2100257e66f77da1f3"}}}