{"name":"Octo","id":"octo","symbol":"octo","description":"What is the project about? OctoLSD is the first LSD LAADP (LSD Liquidity aggregation and distribution protocol), which is governed by OctoDAO and aims to unlock the great potential of LSD. By aggregating LSD assets and distributing them to various application scenarios, the LSD LAADP provides a more efficient and accessible way to manage and deploy LSD assets. What makes your project unique? We aim to consolidate various LSD assets and use a decentralized mechanism to reasonably price them as high-quality and liquidity-concentrated $OcETH, facilitating the circulation of LSD assets in the future. After aggregating various LSD assets and integrating them into $OcETH, the protocol will open up to various LSD-related DeFi applications, enriching the application scenarios of $OcETH and providing high-quality LSD liquidity for these DeFi applications. In addition, various financial scenarios can be extended based on the Ethereum Benchmark Interest Rate and bond theory. History of your project. ETH staking is a public good for the Ethereum ecosystem. Any user with any amount of ETH can help secure the network and earn rewards in the process. What’s next for your project? 2023 Q2 ：Release $LSDD(LSD-Dollar). It is an interest-bearing stablecoin backed by LSD. 2023 Q2~Q3：Bring OctoLSD to L2. Launch on Arbitrum and ZKsync. 2023 Q3：Release OctoLSD LaunchPad. The LSD Liquidity distribution layer starts running. $Octo War is coming! 2023 Q3~Q4：Start the plan of promoting $ocETH to become the underlying asset of Decentralized stablecoin (eg. DAI). This includes a $MKR acquisition program. What can your token be used for? The $Octo is a transferable ERC20 token, designed to capture the value of the OctoLSD protocol.","links":"https://octolsd.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/octo/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x52dec19feef469d7a683963b7380ecd0b1aff9c7"}}}