{"name":"TaskBunny","id":"taskbunny","symbol":"bny","description":"Project Introduction TaskBunny is a decentralized freelance marketplace designed to empower independent workers by leveraging blockchain technology for secure, transparent, and efficient gig economy interactions. In the rapidly evolving world of remote work, TaskBunny seeks to disrupt traditional platforms by eliminating intermediaries, reducing fees, and allowing freelancers to take full control of their earnings. The platform focuses on creating a trustless environment where freelancers and clients can connect directly, ensuring both parties benefit from enhanced autonomy and reduced operational costs. Vision TaskBunny envisions a decentralized future where freelancers have complete control over their work relationships, payments, and personal data. By leveraging blockchain's transparency and security, TaskBunny aims to transform the gig economy, enabling freelancers worldwide to thrive without relying on centralized intermediaries that take significant commissions. The project's ultimate goal is to democratize freelancing, fostering a global network where work can be exchanged freely and fairly, with smart contracts ensuring trust and reliability. Main Advantages Decentralization: TaskBunny operates on a fully decentralized model, eliminating intermediaries, thereby reducing service fees for both freelancers and clients. Trust and Transparency: Leveraging blockchain technology, TaskBunny ensures secure transactions with transparent, immutable smart contracts that automatically handle payments upon project completion. Lower Fees: Traditional freelance platforms charge up to 20% in commissions. TaskBunny minimizes costs by charging only a small percentage for using its services, empowering freelancers to retain more of their earnings. Global Accessibility: The platform supports multiple cryptocurrencies, providing freelancers and clients from different regions with easy access to payments without the limitations of traditional banking. Token Utility The TaskBunny token ($BUNNY) plays a central role in the ecosystem. It can be used for various purposes, including paying for platform services, staking to gain access to premium features, or earning rewards through referral programs. Additionally, holding $BUNNY tokens offers users access to exclusive opportunities, such as discounts on service fees and participation in governance voting to shape the platform’s future. This creates a robust utility model that incentivizes user engagement and fosters community-driven growth.","links":"https://taskbunny.io/","market_cap":544593,"market_cap_rank":4517,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/taskbunny/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x6009e7cd237087e6d7570990e8bdac09c3e182b0"}}}