{"name":"$AIBOT IYI","id":"aibot-iyi_ethereum","symbol":"aib","description":"AIBOT IYI Protocol's tokenomics represent a carefully engineered economic model designed to create sustainable value, incentivize participation, and drive long-term ecosystem growth. Our AIB token serves as the cornerstone of a comprehensive financial ecosystem that bridges artificial intelligence, decentralized finance, and interactive entertainment. AIBOT IYI Protocol is a comprehensive AI-DeFi ecosystem that combines intelligent trading algorithms with play-to-earn gaming. Our platform uses 2,048 NVIDIA H100 GPUs to power AI trading bots with an 87.3% win rate, while offering gaming experiences that generate real rewards. The AIB token serves as the unified currency across all platform services, from trading fees to gaming rewards. Democratizing intelligent AI investment technology, creating a comprehensive ecosystem where everyone can access advanced financial tools and participate in the digital economy through entertaining experiences and practical applications. To become the world's leading AI-DeFi platform, connecting intelligent investment with interactive entertainment, creating a financial metaverse where users can learn, entertain, and generate sustainable profits. AIBOT IYI's GPU Mining Hardware division offers institutional-grade mining solutions combining cryptocurrency mining with AI processing services. Our mining rigs generate consistent monthly returns through diversified revenue streams while providing customers with tangible hardware assets and guaranteed performance.","links":"http://aibotiyi.com","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aibot-iyi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x78f5823bbea7bbce98091e60beeef8df31cc9f54","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x78f5823bbea7bbce98091e60beeef8df31cc9f54"}},"is_native":false}