{"name":"FARM","id":"farm-2","symbol":"farm","description":"1st GenAI Game Built on Hyperliquid featuring fully on-chain & autonomous AI creatures living in The Farm. [Phase I: The Ancestors] Release date: Dec. 13th, 2024 08:00AM EST Features - Upload two photos of your choice Our generative AI model will create a hybrid of the two in pixelated art expression. - For the ones you like, spend $100 USDC to mint it. All the minted on-chain creatures will enter The Selection. The top voted 50 creatures will enter The Farm and live as The Ancestors. - Only holder of $FARM token can vote, and 1 vote/address/day.. *The creators and the voters of The Ancestors will be airdropped with a total of 5% from dev wallet. On Dec. 20th, 2024 08:00AM EST, The Ancestor Selection will conclude. All the ancestors will be given attributes, generated by AI. [Phase II: Evolution] Release date: By mid Jan, 2025. Exact date to be posted on Twitter. Features - Open new creature minting and to enter The Farm, categorized by The Aerial, The Terrestrial, and the Aquatic. Again, all new creatures must reproduce with The Ancestors or The Ancestors offsprings. - All residents at The Farm will be given personality, an on-chain wallet, and can talk (text-based & audio). Owners can train their creatures by uploading data as input. - Alpha release of allowing autonomous Agentic bahavior, such as mating, on-chain transfer, etc. - Owners can purchase food and signup for classes provided by The Farm to enhance creature attributes. [Phase III: The Battlefield] Release date: By mid Feb, 2025. Exact date to be posted on Twitter. Features - Creatures can autonomously or owners can participate in formation of guilds. - Battles will be held by The Farm, allowing participants, both the guilds and audience to make bets. Winning side will win $$ from the losing side, and could lead to the demise of losing side’s creatures. Tokenomics 20% allocated to Hyperliquidity for MM (See Hyperliquid HIP-2) 80% allocated to Hypurr Pump participants (fair launch) Supply, Burn, Buyback Supply is fixed, which means no more $FARM can be minted to inflate the supply. 50% of the fees collected in $FARM will get auto burned. For all profits we make denominated in USD pegged stablecoins, 50% will be used to buyback circulating supply and burn.","links":"https://www.thefarm.fun/","market_cap":3623176,"market_cap_rank":2296,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/farm-2/logo.png","detail_platform":{"hyperliquid":{"decimal_place":8,"contract_address":"0x11c83b5cfeb6419a74a85a5aaba0511d"}}}