{"name":"EquityPay","id":"equitypay","symbol":"eqpay","description":"EquityPay is creating a self-growing community of Entrepreneurs, composed of people with the highest ethics, to be governed under the principles of divine or natural laws wherein members would transact with each other under the self-regulated or community-made by-laws woven carefully with the concepts of honesty and integrity reflected with fair treatment to all. EquityPay will be developing a platform for E-commerce similar to Amazon, wherein the members would be indulging in the sale and purchase of goods amongst themselves. Similarly, a platform like Fiverr for buying and selling services would be created followed by a platform for providing educational courses similar in line to Udemy. The websites so created could be accessed only by the community members. The payment method would prominently be EquityPay (EQPAY) coin that will be listed in the crypto exchanges and would be utilized for the private use of the members. Aside from this, the community will run the referral reward program, i.e. Dragonfly Reward Program to be developed by Dragonfly App, Development LLC for which EquityPay has allotted them 7,000,000 pre-minted EQPAY coins. In addition, several apps will be developed by Dragonfly App for the community members which will be available to the public for free to spread awareness of the brand. One of them would be ‘DragonFly wallet’, which would be a wallet for secured storage of EQPAY coins. As an added advantage, EQPAY coins could be earned in the form of a referral reward by inviting others to use this Free Wallet. The referral reward program will run for 3 years for the growth of the community that can be easily tracked through analytics, leaderboards, and related reporting sections within the app. All rewards will be credited to the “Dragonfly Wallet” itself. EQPAY coins were first mined in September 2021 and have been tested by miners from across the globe resulting in the fixation of several bugs. The coins could be mined and staked.","links":"https://equitypay.org/","market_cap":219106,"market_cap_rank":3602,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/equitypay/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}