{"name":"Nirvana ANA","id":"nirvana-ana","symbol":"ana","description":"Nirvana is a twin system of algorithmic wealth & ultra low-risk stablecoin on the Solana network. It produces the ANA token: an algorithmic metastable token that serves as a store of wealth. And it produces the NIRV token: a decentralized superstable store of value. It enables zero liquidation-risk loans of NIRV that have a negative interest rate. You earn yield on your debt. The way it accomplishes this is by transferring the volatile, speculative energy of the ANA token into the backing for the superstable NIRV token. -- Concentrated liquidity. The NIRV token bundles the diverse reserve of stablecoins, concentrating their fragmented liquidity into one token. This bundling includes Solana-native tokens, as well as bridged assets, increasing the overall stablecoin liquidity on Solana. -- Intrinsic value. Nirvana maintains a diverse basket of reserve assets that backs the value of ANA. At any point in time, ANA has an intrinsic value guaranteed by the reserves. The protocol will always buy ANA back at its intrinsic value, and so this value becomes a hard floor price under which the token cannot trade. -- Rising floor. As the surplus reserves grow in value, the protocol algorithmically increases the intrinsic value of the token. This increase is tantamount to raising the floor price. In other words, ANA holders enjoy permanent gains. Once the floor price ratchets up, those gains are locked forever. -- Sustainable APY. Users are incentivized to stake their ANA in order to gain periodic rewards. The protocol mints pre-ANA (prANA) tokens at a regular interval, based on the total supply of ANA. These prANA tokens are shared to stakers in proportion to how much they have staked. The result of repeated rewards creates compounding APY for stakers.","links":"https://nirvana.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nirvana-ana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"ANAxByE6G2WjFp7A4NqtWYXb3mgruyzZYg3spfxe6Lbo"}}}