{"name":"Lyzi","id":"lyzi","symbol":"lyzi","description":"Lyzi App is a solution that allows Binance users to access their spot wallet assets to make payments in the Lyzi merchant network. Lyzi also serves the purpose of loyalty tokenization. Our project is unique because it is the only solution that acts as a bridge between crypto exchange users' funds and the merchant network. We do not rely on VISA or Mastercard like the Binance card; instead, we enable crypto users to pay directly with their assets, and merchants can receive fiat without any commission. In the near future, they will also have the ability to hold crypto! Lyzi was born from the fusion of Easy Wallet (a non-custodial crypto payment wallet) and Fidly (loyalty on blockchain). We operate fully within regulatory frameworks and work exclusively with regulated partners. In the future, Lyzi will aggregate other exchanges apart from Binance (we are already in contact with major regulated exchanges) to democratize crypto payments worldwide. As for loyalty, we plan to launch our first use case of tokenized loyalty in Q4 2023! Additionally, we are actively seeking non-custodial wallets for crypto payments and lightning payments. The $LYZI token is the backbone of our ecosystem, serving as an incentive token distributed as cashback on crypto payment transactions and sponsoring reward. -> For users: Soon, it will be stackable, and many use cases will emerge, such as payments, vesting against specific offers in our merchant network, rewards for sponsoring our app, $LYZI as a conversion token for loyalty market platforms, participation in loyalty launchpads, and rewards for app sponsorship. -> For merchants: Vesting to gain free access to specific features (Lyzi display, etc.), staking, etc. -> For brands: Use as collateral for brands interested in launching their tokenized loyalty, staking, vesting for free brand token airdrops, etc.","links":"https://lyzi.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lyzi/logo.png","detail_platform":{"tezos":{"decimal_place":6,"contract_address":"KT1UMx7aZQWNKY9nC4LRYNsueEiGMfpcQhhD"}}}