{"name":"SeedSwap","id":"seedswap","symbol":"snft","description":"Founded in early 2021 and headquartered in the US, SeedSwap boasts an international development team with diverse backgrounds and novel ideas regarding the evolution of non-fungible tokens (NFT's). At its core, SeedSwap is a platform for people to congregate, discuss, learn, and exchange NFT's and other crypto related things. SeedSwap is designed around three main components: SNFT tokens and farming, the SeedSwap NFT exchange, and SeedSwap Social. SNFT tokens are the cryptocurrency offered by SeedSwap. No more than 100-million SNFT shall ever exist at once, and not all of the total supply of SNFT will ever be in circulation at one time. The circulating supply level is dictated by two factors: the farming system and the minting of SeedSwap non-fungible tokens. For the farming system, 40-million SNFT have been allocated as rewards for liquidity providers or \"\"farmers\"\". By applying a multiplier to farmers' annual percentage yields, the farming system will see increases to farmers' staking yields over time. Paid in SNFT, farmers will be chiefly responsible for bringing new SeedSwap tokens into circulation. The exact mechanics of the farming system, its rules, and the multipliers are described in the whitepaper, which all farmers are encouraged to read before participating in SeedSwap. The second factor that affects circulating SNFT supply occurs in the SeedSwap NFT exchange. The NFT exchange is a platform that enables its users to create and trade non-fungible tokens. SeedSwap will also offer its own non-fungible tokens which are redeemable with SNFT. Some of the SNFT used to redeem a SeedSwap non-fungible token will be burned or removed from circulation each time this occurs, thus whenever a SeedSwap NFT is created with SNFT it is a deflationary event. The number of SNFT required to redeem a non-fungible token will depend on the rarity of the non-fungible token, being either common, uncommon, rare, or ultra rare. In addition to SeedSwap NFT's, other NFT's can be created and exchanged on the exchange without the need to redeem them with SNFT. The SeedSwap platform also includes a social media component called SeedSwap Social, which will allow users to connect and discuss NFT's and other crypto-related topics. SeedSwap Social is a living accompaniment to the NFT exchange, and aims to host a variety of forms of media and content. By this, it is meant that the platform as a whole will neither be an NFT exchange nor a social media site simply, but both at the same time, facilitating discourse, entertainment, and NFT creation and exchange all from within a single, integrated setting. Through SeedSwap Social, users will be able to discuss and share their favorite non-fungible tokens, creators, and trends, and through the NFT exchange, they will be able to act by exchanging non-fungible tokens or creating their own.","links":"https://seedswap.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/seedswap/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa3c4dc4a9ce2a6b40b57f25f8b50decc2c64dec2"}}}