{"name":"SolCondoms","id":"solcondoms","symbol":"condoms","description":"SolCondoms is the founder of the $CONDOMS utility token on the Solana blockchain and the future platform creator to provide detailed research and analysis on NFT projects. Our goal is to provide a one-stop research solution — aka platform — to find, analyze, and gather information on newly minting NFT projects on Solana blockchain. Currently, a lot of information is scattered across multiple platforms, and separating information from noise is extremely difficult. A unified platform will enable investors to make better decisions and provide the first net of protection towards preventing rugs. The platform will be accessible to everyone to gather basic information for upcoming mints, while some special features and detailed research will be accessible only through a $CONDOMS-based subscription. The earnings through the subscription will be entirely used for compensating researchers for their work and towards the functioning of the DAO. In its inception phase, the project will conduct a risk assessment of upcoming NFT projects and rank them according to metrics based on five major criteria, hence providing detailed research for the community to invest in credit-worthy NFTs on the project’s website. A Decentralized Autonomous Organization (DAO) will be set up to create a crowd-sourced research platform to ensure fairness and rigor. The researchers (called Protectors) will be incentivized to provide research by generously compensating them with $CONDOMS, community ratings, and prestige. Next, the assessment will also be conducted with the help of an automated architecture that will be internally developed by the team, utilizing on-chain analysis, statistical analysis, machine learning models, decentralized prediction markets, and NLP. The team has plans to build an architecture for providing insurance for specific NFT projects that the DAO members marked as safe to mint, initially through a raffle-bases system. This will make SolCondoms the first platform to provide insurance against rugs.","links":"https://solcondoms.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solcondoms/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"EzL6LLmv4vgfF7irkjG7ZxM92bTJ9f6nFopDXJTow7zj"}}}