{"name":"Davos.xyz USD","id":"davos-protocol_polygon-pos","symbol":"dusd","description":"Davos is a brand new protocol that provides an easy-to-use lending and staking experience to users with a dual token model system. Through a yield-earning over-collateralized debt position backed by accepted collateral and DeFi liquid staking rewards, users will be able to borrow a stable asset that can generate consistent yield. There are several passive earning opportunities within DeFi, but those income streams are subject to strong fluctuations, and many have high entry fees. Liquid staking is quickly becoming the most stable way to generate income (in percentage terms). Using the well-established MakerDAO model, Davos adds another layer of composability to generate additional passive income by using collateralized lending on top of staking rewards from its Stable Asset Davos. Davos Protocol allows users to effortlessly borrow DAVOS Stable Assets against their over-collateralized crypto assets while maintaining their liquidity. When users deposit crypto in smart contracts, they receive an equivalent liquid derivative token. This is a token that remains fungible and transferrable in addition to earning rewards regularly. Davos has been built by experienced DeFi experts and smart contract developers with the goal to position the world-class revolutionary DAVOS Stable Asset as the most widely used decentralized stable asset protocol, by leveraging Proof-of-Stake (PoS) rewards, Liquid Staking, and yield-bearing assets. By taking advantage of Liquid Staking and providing an APR of around 6-12%, Davos will provide users with a stable yearly APR of up to 9-24% for yield farming in the liquidity pool. The Davos team aims to help promote blockchain technologies into mainstream adoption by incentivizing borrowers and stakers to become a part of a new decentralized economy of scale.","links":"https://davos.xyz/","market_cap":111484,"market_cap_rank":6815,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/davos-protocol/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xec38621e72d86775a89c7422746de1f52bba5320","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xec38621e72d86775a89c7422746de1f52bba5320"}},"is_native":false}