{"name":"Boss Blockchain","id":"boss-blockchain","symbol":"bbc","description":"Let's talk about Boss Blockchain (BBC), the project that's all about building a strong community. As we get into the details of what makes this initiative unique, we'll break down some of the important highlights and explain them in simpler language. Community First Launch: In the first phase of the launch, we're keeping it close-knit. No big ads from outside, it's just for the KryptoBoss community to kick things off. Opening Up with External Ads:Moving on to phase 2, we're going public! External ads and KOLs will bring more folks into the project, giving them a chance to be part of it early on. Extra Rewards at Launch: We want to make sure everyone joining the launch gets a little extra. In phase 1, it's a guaranteed triple (x3), and in phase 2, it's a guaranteed double (x2) bonus at the launch. Just a little thank-you for getting in early. Safe and Slow Token Release: All the tokens are locked up at the beginning to avoid any market chaos. We're unlocking only a small portion 2 % each day to prevent sudden drops in the token's value You Earn can While stake Holding: your tokens right from the start, and we're offering Q nice staking reward that adjusts based on how many tokens people are staking. lt's like earning interest on your crypt0. Bigger Plans for the Future: Boss Blockchain isn't stopping here. We're thinking big We want to grow from being part of the Ethereum community to becoming a Layer 2 blockchain. This move is all about adding more value to the crypto world. So, BBC isn't just your regular meme coin; it's a project with a vision for the long haul. In the next bits, we'll dive deeper into each of these things and see how they fit into Boss Blockchain's mission of building a strong, community-focused project in the always-changing world of crypto","links":"https://www.bossblockchain.world/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/boss-blockchain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x102fa93ef3d2dc5b0b9ed3e7b3bf832796cb7b95"}}}