{"name":"NAEST","id":"naest_solana","symbol":"naest","description":"The NAEST Group positions itself as an innovative player in the field of smart mobility, offering a comprehensive technological platform that revolutionizes urban and interurban travel. Our company offers a diverse range of services, from package and goods transportation (NAEST Express), passenger transport (NAEST Car), to grocery and meal delivery services (NAEST Food), all accessible through an intuitive mobile application. At the heart of our mission is the desire to create a flexible and dynamic mobility ecosystem, offering economic opportunities to drivers, delivery personnel, vehicle owners, and logistics partners. We are committed to promoting employment and entrepreneurship in the transport sector while meeting the evolving needs of consumers in terms of mobility and delivery. Decentralization is also at the core of our vision, as evidenced by several aspects of our ecosystem such as the NAEST Token (NAEST), a central utility token, which plays a key role in this decentralized approach. It offers its holders (customers and partners) not only advantages in terms of transactions and investments but also rewards and active participation in the platform's governance. This direct involvement of users in decision-making illustrates NAEST's commitment to a more democratic and distributed structure. Thus, the future NAEST Foundation represents another facet of this decentralization. We plan to share governance with the community, allowing token holders to participate in decisions through a decentralized voting system. This approach aims to align the interests of the company with those of its community. The project of a dedicated platform for ICOs for innovative startups also reinforces this decentralized vision. By facilitating the financing of projects with positive impact via blockchain, NAEST seeks to democratize access to investments and support innovation in a distributed manner. This multifaceted approach to decentralization demonstrates NAEST's commitment to creating a more open, transparent, and participatory financial ecosystem. The ultimate goal of the NAEST Group is to shape the future of urban mobility. We aspire to create smoother, safer, and more enjoyable travel and delivery experiences while positively contributing to society. Our vision is of an inclusive and sustainable transport ecosystem that improves the quality of life in cities and contributes to building a greener and more connected future for all.","links":"https://www.naest.express/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/naest_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"NAE5Rik3FrGoXoqoqW8boyCLrgEDnEKHNfPAVNNdQJr","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/NAE5Rik3FrGoXoqoqW8boyCLrgEDnEKHNfPAVNNdQJr"}},"is_native":false}