{"name":"Jefe","id":"jefe","symbol":"jefe","description":"JEFE TOKEN is a premier gaming platform in the world of cryptocurrency, leveraging the power of NFTs with unparalleled utility in Play 2 Earn and Burn games within the ever-evolving Metaverse. Our platform offers cutting-edge virtual reality and mobile gaming experiences that truly push the limits of what is possible. At the heart of our platform is our vibrant community of $JEFES. These holders not only have a significant stake in the token, but are also uniquely represented in the games through JEFE NFT Avatars. Join our community today to experience the thrill of immersive gaming and cutting-edge blockchain technology, all in one incredible JEFE SOCIETY. Welcome to the JEFE TOKEN NFT Collection, where you can find a wide variety of unique skins, wearables, avatars, land, accessories, and more. Our NFTs are assigned to different missions and challenges within the $JEFE ecosystem of games, and serve as your representation in the Metaverse and gaming-blockchain NFT games. FOUR MAJOR ELEMENTS THAT WE OFFER: Video Game Development Virtual Reality NFT Art Blockchain Technology SETTING THE MOOD WITH JEFE SOCIETY Our fusion of art and blockchain technology has resulted in the creation of JEFE NFTs, which are tokens bounded to images, video & music, that can be played in our games where you can learn & have fun competing with other JEFES from all over the world. As a JEFE TOKEN holder, you're eligible for a unique FREE NFT mint of your unique avatar. All you have to do is contribute to the JEFE SOCIETY. TAX STRUCTURE Tax Structure: We are tax free.","links":"https://www.jefetoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jefe/logo.png","detail_platform":{"fantom":{"decimal_place":9,"contract_address":"0x5b2af7fd27e2ea14945c82dd254c79d3ed34685e"},"ethereum":{"decimal_place":9,"contract_address":"0x9fd22a17b4a96da3f83797d122172c450381fb88"},"optimistic-ethereum":{"decimal_place":9,"contract_address":"0x9fd22a17b4a96da3f83797d122172c450381fb88"}}}