{"name":"SAFEREUM","id":"safereum","symbol":"safereum","description":"SAFEREUM- THE SEQUEL AWAITS Description Erupting as a sequel to a monumental tale that forever transformed the cryptosphere, Safereum echo’s the spirit of an unspoken predecessor, while carving it’s own unique path. Introducing Safereum Safereum is a decentralized meme token launching on the Ethereum Blockchain. It doesn’t have its own blockchain technology yet; its supply is managed by smart contracts on Ethereum’s internal blockchain. Safereum uses the ERC-20 token standard based on Ethereum (ETH). Safereum is launching on the Ethereum Blockchain in October 2023. Why Safereum? In a market saturated with centralized, fleeting, meme-based cryptocurrencies, transparency and longevity are slowly fading away. It’s time for the crypto sphere to return to its roots with Safereum and make decentralized memecoins great again. Safereum is reigniting cryptocurrency’s original mission: pure decentralization. As contemporary endeavors overcomplicate and stifle blockchain’s potential, Safereum emerges, cutting through the noise, realigning with crypto’s core, and steering the industry back to its intended course. Guaranteed Security Safereum sets an unmatched benchmark in modern DEFI cryptocurrency security, delivering unwavering protection for investors, be it during trading or holding. Trust in Safereum is beyond confidence -it’s a certainty. Safereum has been audited by 5 different companies to provide a high degree of security. Cyberscope Audit SourceHat Audit InterFi Audit BlockSAFU Audit SecureWise Audit Safereum has an official KYC certificate. Contract ownership has been renounced. Liquidity pool has been locked for 1 year. Buy, sell and transfer taxes are 0%.","links":"https://safereum.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/safereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb504035a11e672e12a099f32b1672b9c4a78b22f"}}}