{"name":"Bitcoin20","id":"bitcoin20","symbol":"btc20","description":"What is the project about? BTC20 is a Proof-of-Stake (PoS) ERC-20 version of Bitcoin built on the Ethereum blockchain, recreating the state of the Bitcoin blockchain and token supply from 2011, when there were only 6.05 million BTC in circulation and the price was $1. With every original Bitcoin block confirmation, a number of $BTC20 tokens will be released and distributed to stakers via a verified staking contract in line with the Bitcoin release schedule. After the presale, $BTC20 holders can stake their tokens to receive a share of the staking rewards. The more $BTC20 tokens a person stakes, the higher the rewards they are going to receive. What makes your project unique? Building upon the foundations of the Bitcoin release mechanism, which is Proof-of-Work (PoW), BTC20 introduces the less energy intensive Proof-of-Stake (PoS) model that rewards participants in proportion to their staked tokens. Through this mechanism, BTC20 presents a unique opportunity for individuals to earn a substantial share of the rewards released through the Ethereum-based staking contract. The more individuals stake their BTC20, the greater their share of the released rewards. This design fosters a community-driven ecosystem, where collective action drives the prosperity of all participants. History of your project. BTC20 presale started on the 17th of July and ended on the 29th of July, raising $6,050,000 and reaching its presale goal in only 12 days. Staking of BTC20 tokens started on the 9th of August and over 40% of the supply, $2.5 million have been staked in the first 18 hours since the launch. What’s next for your project? After the presale, 14,950,000 BTC20 remain tokens were locked in the staking contract to reward staking pool participants. With every Bitcoin block confirmation, 50 BTC20 tokens are released and distributed to all participants in the staking pool. Rewards accrue in real time every 10 minutes. Similar to Bitcoin, the project will have 4-year halvings. BTC20 is programmed to reduce its simulated block rewards by 50% every four years, starting at 50 BTC20 every 10 minutes. The first BTC20 halving will be in 2025 when the rewards will be reduced to 25 BTC20 per block. The second BTC20 Halving will be in 2029 and the rewards will reduced to 12.5 BTC20 per block. The third BTC20 Halving will be 2033 when the rewards will be reduced to 6.25 BTC20 per block. What can your token be used for? The project is a great opportunity for buyers to receive staking rewards and earn some passive income. The percentage of rewards users earn is directly proportional to the overall number of tokens staked. Since BTC20 is a proof-of-stake token, buyers who decide to stake their tokens have the opportunity to contribute to the network's security as well.","links":"https://www.btc20.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitcoin20/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe86df1970055e9caee93dae9b7d5fd71595d0e18","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe86df1970055e9caee93dae9b7d5fd71595d0e18"}}}