{"name":"Cerebrum DAO","id":"cerebrum-dao_solana","symbol":"neuron","description":"Cerebrum DAO implements novel funding mechanisms designed to traverse the so-called \"Valley of Death\" in brain research. We utilize community-based funding throughout all stages of development, from the inception of research to the point where medications or diagnostic products are ready for clinical implementation. With 86 billion neurons in the human brain, each NEURON token represents a neuron in our brain and serves as the cognitive essence and neural blueprint within the Cerebrum DAO ecosystem. The NEURON tokens are earned by contributing work, data, IP, or funds to fuel the growth of Cerebrum DAO. The main goal for the creation of the NEURON token is to provide a truly decentralized governance model and sustainable growth of Cerebrum DAO’s network. That means creating an equally attractive network to contributors, entities, enterprises, service providers and the wider community. The NEURON token will be issued as a governance token. The NEURON token has four primary governance uses: - Voting on which IP projects receive funding from Cerebrum DAO - Voting on the terms under which each project can receive funds - Voting on key Cerebrum DAO governance matters (e.g. compensation policy, funding events, key strategic partnerships, governance board memberships, etc.) - Voting on Cerebrum DAO treasury management policies The NEURON token is initially deployed on the Ethereum Mainnet as an ERC-20 token. The choice of Ethereum Mainnet as our deployed chain is intentional. Leveraging Ethereum’s robust developer community, established ecosystem, and widespread adoption provide a solid foundation for the NEURON token’s initial phase","links":"https://cerebrumdao.com/","market_cap":1715253,"market_cap_rank":3129,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cerebrum-dao_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"neuRodi6Saw2cwDpud7FyAcjzqPBJDtr3fDTXE2Fu4j","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/neuRodi6Saw2cwDpud7FyAcjzqPBJDtr3fDTXE2Fu4j"}},"is_native":false}