{"name":"Solace Coin","id":"solace-coin","symbol":"solace","description":"SolaceCoin is a Crypto Currency wanting to make the world a better place one block at a time. With the help of our vastly growing community we want to put Crypto Currency back in the limelight with positivity. Currently we are a team of 3 developers that are set on a mission to make the world a better place. This might sound unrealistic right now but we all know the potential of Blockchain technology and over past decade with have saw it grow exponentially. Our vision is to take CryptoNote to the next level by having a separated wallet that is viewable by the community and then slowly sell these coins and donate them to Charities that are chosen by ‘YOU’ the miners/community. We strongly believe that transparency is a requirement for this to be a success, Solace Coin want to earn the trust of our Community as this is how we will grow. The key to a successful project is dedication and our small team are 100% dedicated to the cause as we all have Charity in our hearts, We have been through life situations that have opened our eyes in the world of Charity. No matter how large/small our donations are we believe that it all helps others through desperate times. We are realistically giving to Charity at no cost, We are generating wealth for our miners and at the same time we are also sending these funds to causes that really matter. Solace Coin’s mission is to capitalize in on the computational power that exists in most homes today, A lot of devices just sit idle in drawers collecting dust! We want to build a platform with tools that allow those devices be put to work and earn wealth for the users and in the process contribute to a good cause. Solace Coin runs Cryptonote algorithm which facilitates the Proof-Of-Work methodology for mining coins. This allows us to open up the network and potential of miners, the requirements are just a CPU and for the highest mining rates a GPU.","links":"https://solace-coin.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solace-coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}