{"name":"THINK Protocol","id":"think-protocol_ethereum","symbol":"think","description":"THINK is a protocol designed to power decentralized AI agents and tokenized intelligence across Web3. Launched in July 2025, THINK introduces a modular infrastructure layer for building, owning, and interacting with autonomous software agents, known as THINK Agents. THINK Agents are on-chain, composable AIs that operate across digital environments and adapt to user data, preferences, and tasks. These agents are issued as Non-Fungible Intelligences (NFIs), a format that combines identity, logic, and memory into a user-owned asset. NFIs are upgradeable, context-aware, and interoperable across platforms that adopt the THINK Agent Standard. The THINK token ($THINK) is the native utility asset of the ecosystem. It is used to mint and upgrade agents, access compute and storage services, and participate in staking and protocol governance. $THINK also facilitates peer-to-peer payments between agents and supports licensing for third-party tools and models. The protocol's staking system, called THINK TANK, enables users to earn rewards by supporting ecosystem growth or staking behind specific agents and modules. Rewards are drawn from an emission pool and distributed based on participation, agent performance, and contribution to protocol activities. The THINK ecosystem is governed by the Think Foundation, a non-profit entity that stewards the open-source standards and allocates funding to builders via the Thinkubator — a grant and incubation program designed to grow the network of agent-powered applications. To date, THINK has received support and integrations from over 80 ecosystem projects through the Independent AI Institute. Developed as a response to the centralization of AI systems, THINK enables individuals and teams to deploy autonomous software on their own terms, with local control over memory, data, and logic. The protocol is designed to be extensible, supporting use cases in media, gaming, finance, and productivity.","links":"https://www.thinkagents.ai/","market_cap":1706442,"market_cap_rank":3134,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/think-protocol/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf9ff95468cb9a0cd57b8542bbc4c148e290ff465","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf9ff95468cb9a0cd57b8542bbc4c148e290ff465"}},"is_native":false}