{"name":"Doge 2.0","id":"doge-2-0_ethereum","symbol":"doge2.0","description":"Introducing Doge 2.0 ($DOGE2.0): Your Second Chance at the Meme Token Phenomenon! Are you still kicking yourself for missing out on the Dogecoin hype? Fret not, because here comes Doge 2.0, the ultimate community-driven meme token that's ready to take the crypto world by storm! $DOGE2.0 is a revolutionary new token that embraces the spirit of the original Dogecoin while adding a fresh twist of its own. This time, we're giving everyone a fair shot at participating in the excitement right from the beginning. First and foremost, we understand the importance of transparency and security. That's why we've burned the liquidity and renounced the contract, meaning no one has control over the token's fate except the community itself. You can rest assured knowing that $DOGE2.0 is a safe and decentralized project. But what sets $DOGE2.0 apart from other meme tokens? Well, it's all about the community. We believe that the true strength of any token lies within its passionate and dedicated holders. With $DOGE2.0, you become an integral part of an enthusiastic community that's eager to grow together and support each other every step of the way. Another unique feature of $DOGE2.0 is the 1/1 tax mechanism. This means that for every transaction made, a small tax fee is applied, ensuring stability and sustainable growth for the token. These fees are then distributed back to the holders, incentivizing long-term investment and fostering a rewarding experience for everyone involved. So, whether you're a seasoned investor looking for the next big thing or a crypto enthusiast who missed the initial Dogecoin wave, Doge 2.0 ($DOGE2.0) offers you an exciting second chance. Join our community today and witness the power of a united and passionate group of meme token enthusiasts. Together, we'll take the crypto world by storm and make Doge 2.0 the next viral sensation! Remember, this is just the beginning of something truly special. Strap in and get ready for the adventure of a lifetime","links":"https://www.doge2.net/","market_cap":69097,"market_cap_rank":7657,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doge-2-0/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xf2ec4a773ef90c58d98ea734c0ebdb538519b988","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf2ec4a773ef90c58d98ea734c0ebdb538519b988"}},"is_native":false}