{"name":"Zenbase ZenToken","id":"zenbase-zentoken","symbol":"zent","description":"Zenbase is the world's first meditation platform that rewards users with cryptocurrency incentives, This revolutionary Web3 meditation app, available on the IOS and Google Play store, gamifies the journey to inner peace through its unique \"Meditate-To-Earn\" system. Users can earn ZENT by spending just 5 minutes in Zen, which can be used to purchase wellness products, create NFTs, or even cash out. The Zentoken distribution emulates Bitcoin's fundamentals, with a total supply of 21 million tokens. This scarcity model encourages users to see ZENT as a store of value, much like Bitcoin. As the platform grows, the distribution of ZENT will decrease, making it more challenging to earn tokens through meditation. This mirrors Bitcoin's halving events, ensuring a finite supply of tokens. In each meditation session, users receive 70% of the ZENT generated, while content creators receive 29%. The remaining 1% is donated to charity, aligning with Zenbase's commitment to social responsibility. This revenue-sharing model fosters a supportive ecosystem for both users and creators, promoting the growth and sustainability of the platform. Zenbase is an open free platform for all to explore. Content creators are able to upload and have a share in the revenue from their content Zenbase is a comprehensive wellness platform that combines the benefits of meditation with the exciting world of cryptocurrency. By offering a \"Meditate-To-Earn\" system and a wide variety of content, Zenbase caters to both meditation enthusiasts and crypto-curious individuals. With its focus on privacy and social responsibility, Zenbase is the perfect platform to embark on your journey to a healthier mind and a fatter crypto wallet.","links":"https://www.zenbase.us/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zenbase-zentoken/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}