{"name":"Atlas Navi","id":"atlas-navi","symbol":"navi","description":"Atlas Navi is the first Drive to Earn navigation app that uses A.I. and the smartphone camera to avoid traffic by detecting road conditions (closures, road work, potholes), accidents, traffic in each lane, available parking spaces, police vehicles and rerouting drivers. It features licensed 3D NFT vehicles and a Drive to Earn mechanism rewarding users for each mile driven. Atlas Navi is a free iPhone and Android mobile app. Atlas Navi (NAVI) token utilities: 1) Premium features of the Atlas Navi Drive 2 Earn app: Users can use the navigation free of charge, with some premium, optional features. 2) Drive 2 Earn Rewards: Users have to purchase vehicle NFTs with $NAVI if they want to earn rewards for each mile that they drive. 3) Rewards are counted in miles driven, as points in the app. They can be exchanged for $NAVI inside the app whenever the user wants, based on the best $NAVI price available that day. 4) $NAVI can be used to acquire vehicle NFTs, to repair, upgrade, refuel, maintain the vehicles in the user's garage. 5) DAO / Voting rights: Token holders can vote on what vehicles to be released next, what features to be developed next; can organize themselves in virtual and real-world Auto Clubs with paid / free events (paid in $NAVI) for participation. 6) Vehicle Manufacturers can offer awards, invites, experience days, test drives for new vehicle releases to the users who have the most NFTs of their brand for example. 7) Smart City Administrations: some smart city initiatives are interested in purchasing some of the data generated by the A.I. They will be able to do so by topping up their account with $NAVI tokens from the open market and using them for the data they need. 8) Fleet / Dispatching Accounts: Atlas Navi features a built-in dispatching / fleet management solution for fleets with multiple vehicles. This will be paid in $NAVI by the fleets. 9) Purchasing of real world services payable in $NAVI: insurance, vehicle maintenance, car washes, refueling.","links":"https://www.atlasnavi.com/","market_cap":18328640,"market_cap_rank":996,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/atlas-navi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfc1c93a2507975e98b9d0e9260ded61a00152bf1"}}}