{"name":"Axelar Wrapped Ether","id":"axlweth_fantom","symbol":"axleth","description":"What is the project about? axlETH is a wrapped, multi-chain representation of Ethereum. For each unit of axlETH, there is a unit of ETH locked in an Axelar Gateway on Ethereum. axlETH is secured by a dynamic validator set running delegated Proof-of-Stake, which holds key shares in the Axelar Gateways via multi-party cryptography. Acquire axlETH in three ways: Swap via liquid pairs on any of the DEXs listed here. Swap via Squid, a cross-chain liquidity router built on Axelar. Mint via Satellite, a cross-chain bridge built by Axelar How is axlETH secured? Like all Axelar-wrapped assets, axlETH's security depends on a dynamic validator set (numbering 75 at this writing), running delegated proof-of-stake. In other words, Axelar secures cross-chain communication using the same approach as many of the chains it connects. Units of axlETH are minted when a user deposits USDC into a Gateway contract on the Ethereum chain. Axelar's decentralized validator set secures these Gateways via key shares in a multiparty cryptography scheme. Here's a brief explanation of Gateways and how they are secured, from the \"Learn More\" section of the Axelar documentation: Once a cross-chain message is initiated by a dApp user, its first stop is to interact with an Axelar Gateway. On each chain connected to Axelar network, a Gateway is deployed. On EVM chains, it is a smart contract address. On Cosmos and other non-EVM chains, it is an application with logic and the ability to communicate with Axelar network. This Gateway is used to receive messages from a connected dApp and send them into the Axelar network for routing to any connected chain. The Gateway is controlled by a key, which is held jointly by all Axelar validators. This is accomplished through a multiparty cryptography scheme, where the key is divided into many pieces, called key shares. Each validator holds many key shares, and the amount of shares is dictated by the amount AXL tokens staked with the validator.","links":"https://axelarscan.io/assets","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/axlweth_fantom/logo.png","detail_platform":{"fantom":{"decimal_place":18,"contract_address":"0xfe7eda5f2c56160d406869a8aa4b2f365d544c7b","geckoterminal_url":"https://www.geckoterminal.com/ftm/tokens/0xfe7eda5f2c56160d406869a8aa4b2f365d544c7b"}},"is_native":false}