{"name":"Bitxor","id":"bitxor","symbol":"bxr","description":"What is the project about? BITXOR is a multi-layer decentralized POS (Proof-of-Stake) mining blockchain that enables reliable and easy-to-use application integration for scalability. What makes your project unique? Bitxor allows high customization at both the network and single-node levels. However, the entire network configuration, specified in the config-network.properties, must be the same for all nodes. Somewhat the node-specific design may vary among all nodes in the same network, which can be changed in config-node.properties. Bitxor has been designed to use an add-on/extension approach rather than supporting Turing-complete smart contracts. While complete smart contracts may allow greater flexibility for the user, they are also more error-prone from the user's perspective. An add-on model limits the operations performed on a blockchain and consequently has a smaller strike surface. In addition, it is much easier to optimize the performance of a single set of processes rather than an unlimited set. These features allow Bitxor to achieve the high performance it was designed for History of your project. had its beginnings as a test project between a community of buying and selling Cryptocurrencies (OTC), we initially held the decision to develop a collection token with the Tron network, which aims to maintain the core essence of decentralization throughout our CosmoSystem (August 2022). Shortly thereafter, a multidisciplinary team of highly talented professionals from Latin America and companies such as Kriptxor Corp, Microsula S.A. and Focus On Results S.A., where new ideas began to emerge, including the development of our own Blockchain. What’s next for your project? Bitxor is currently on the phase 8 of our Roadmap which is the \"Exchanges Listing Phase\" and this entails the kickoff of negotiations to list on cryptocurrency exchanges worldwide What can your token be used for? 1. DApps 2. Start-Stake 3. Control-Stake 4. Synthetics 5. Swap 6. PoS Mining","links":"https://www.bitxor.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitxor/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}