{"name":"Namecoin","id":"namecoin","symbol":"nmc","description":"Namecoin is a domain name registry service and was the first coin to fork <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a>. Similar to registering a .com or .io domain name, you register a .bit domain on the network. This domain is censorship-resistant and impervious to activity tracking. Governments and large corporations control traditional domain name services (DNS) servers. This control is how the Chinese government, for instance, can block websites that go against their beliefs. To prevent this level of censorship, Namecoin uses blockchain technology to distribute its DNS amongst the users on the network. A pseudo-anonymous founder by the name of “Vince” created Namecoin in 2011. Since then, Vince has disappeared, but a core development team has kept the project alive. The project has several developers listed on the official website and benefits from the contributions of numerous anonymous developers as well. Namecoin has been fully functional for a few years, now, and the development team posts updates several times a month. Namecoin was the first cryptocurrency to use Auxiliary Proof of Work (AuxPoW) for its consensus. By using AuxPow, Namecoin and Bitcoin can be mined simultaneously. In this consensus, the child blockchain depends on the proof-of-work of parent blockchain, which means If a new block is created on Bitcoin blockchain, it will also be added to the Namecoin blockchain. NameID is another technology brought by Namecoin. It serves as an open service for securely registering human-readable names in a decentralized way. NameID is a combination between Namecoin and OpenId, where users can easily convert their Namecoin Identities into OpenIDs. This makes NameID a solution to Zooko's triangle, which states that there are three desirable properties (Human-meaningful, Decentralized, and Secure) for name participants in a network protocol and any participant can only inherit two properties at a given time. Namecoin is among some earliest cryptocurrencies. During its existence in the market, it has seen a high volatility on some occasions, which can be attributed to many reasons. Namecoin has been around in the cryptocurrency market much longer than most cryptocurrencies today; however, despite this, it has not gotten much attention until recently. In 2014, it was among the top ten cryptocurrencies by market capitalisation, which is now changed due to the introduction of hundreds of new cryptocurrencies. Namecoin was abandoned by its creator which can be seen as a red flag by many. The project is currently being developed with the support from its community. The current team has been actively taking the project forward and also provides regular updates on social media channels.","links":"http://namecoin.info","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/namecoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}