{"name":"BIM","id":"bim","symbol":"bim","description":"BIM is a governance token that supports the real economy by financing the production and projects of industries What is BIM? BIM is a governance and financing platform designed to support the real economy by financing industry production and projects. The BIM token is the native utility token used for : Financing companies Participate in governance votes to determine investments and road map priorities BIM tools include: BIM Finance, for acquiring BIM tokens. BIM Pay, an online payment solution using BIM tokens. BIM Industries, to facilitate the production of Made in France products. BIM Consulting, offering consulting and expertise services related to the BIM ecosystem and blockchain technology. BIM Financement, to support the financing of startups. How many BIM tokens are in circulation? BIM has generated an initial supply of 314,000, 000 tokens, split as follows: 6% for the project team 1% for partners 1% for ambassadors 1% for communication 1% for private sales 2% for the listing 19% Private/ICO The rest of the tokens are blocked in the DAO (Decentralized Autonomous Organization) of BIM. The only way to unlock them and put them into circulation is by a vote within the DAO, approving the release of tokens only for investments in companies. Token Burn, deflation BIM Group has committed to destroying at least 5% of its earnings in the form of $BIM tokens. This action results in a significant reduction in the total BIM supply available at launch, initially 314 million tokens. Who are the founders of BIM? Launched on August 23, 2022 by a team based in France. Damian PY, former CEO of Daantech, a French industrial SME, and Léo Pestre. The BIM project is an initiative to create a decentralized governance ecosystem around a crypto-currency, the BIM token. The main objective of this project is to support the industry by funding and providing technical assistance.","links":"https://www.bim-finance.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bim/logo.png","detail_platform":{"polygon-pos":{"decimal_place":17,"contract_address":"0xe78649874bcdb7a9d1666e665f340723a0187482"}}}