{"name":"mPendle","id":"mpendle_binance-smart-chain","symbol":"mpendle","description":"What is the project about? Penpie is a next-generation DeFi platform designed to provide Pendle Finance users with yield and veTokenomics boosting services. Integrated with Pendle Finance, Penpie focuses on locking PENDLE tokens to obtain governance rights and enhanced yield benefits within Pendle Finance. Penpie revolutionizes the way users can maximize returns on their investments and monetize their governance power. What makes your project unique? Penpie gives PENDLE holders the chance to earn high APR by converting their tokens into mPENDLE. By leveraging the power of Pendle Finance's veTokenomics model, Penpie offers users the opportunity to earn more PENDLE rewards with their PENDLE tokens. Penpie has created mPENDLE, a Penpie version of the PENDLE token, which allows users to earn a large share of PENDLE rewards while enjoying increased flexibility through Penpie. This mechanism gives PENDLE holders the chance to earn high APR% by converting their tokens into mPENDLE at a 1:1 ratio. History of your project. What’s next for your project? What can your token be used for? mPENDLE refers to \"Magpie PENDLE\", is a liquid version of vePENDLE that allows users to earn passive income on Penpie. PENDLE holders can convert tokens into mPENDLE on Penpie to earn boosted APR. Penpie takes all converted PENDLE tokens and locks them on Pendle Finance in order to acquire more vePENDLE. This, in turn, allows Penpie to provide boosted APR for its depositors. The process of permanently removing tokens from circulation is known as 'blackholing' and cannot be reversed. mPENDLE holders have the option to exchange their tokens for PENDLE on Wombat Exchange.","links":"https://www.pendle.magpiexyz.io/stake","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mpendle_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0465aad9da170798433f4ab7fa7ec8b9b9bf0bb1","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x0465aad9da170798433f4ab7fa7ec8b9b9bf0bb1"}},"is_native":false}