{"name":"Grantsville","id":"grantsville","symbol":"gville","description":"GVILLE is the token that powers the entire ecosystem behind Grantsville. Grantsville is a multi-layered interactive gaming platform built on the Avalanche Network with an emphasis on socially connecting players from all over the world, other blockchain networks, and finally, other projects. In the web3 gaming space, developers use the same WEB2 approach used for the last few decades when building games. And while some of these developers are creating successful projects, they still need to take advantage of the opportunities WEB3 and smart contracts provide in this new age gaming revolution. And that is what the founders of the MCVerse have set out to deliver, the opportunity to leverage these new technologies that empower everyone, from casual players to hardcore gamers. By giving them 100% ownership of their gaming experience without limitations; and developers through integration into an established and active ecosystem, Grantsville. For players, this means having a home base within Grantsville, where their journey starts, utilizing resources within the metaverse to build out their version of their world. Using GVILLE, which is passively earned by owning one of our gaming NFTs, players can build, play, create and participate within Grantsville economy. The Grantsville economy revolves around players and their involvement within the metaverse, but it is not dependent on full participation. The gaming mechanics are far-reaching and well-rounded so that the project can scale based on current trends without committing to one gaming mechanism. Players can simply upgrade their NFT gaming piece to earn more GVILLE and then use those earnings to farm tokens for other projects. They can also choose a more complex gaming path, one that requires time, energy, and resources to complete missions that will reward them with items needed to build their new life in Grantsville.","links":"https://mcverse.app/grantsville","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/grantsville/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x7c22e823b5ee641ed534ce3e368b59b5f0a3b7e0"}}}