{"name":"ICE Raids","id":"iceraids","symbol":"$iceraids","description":"$ICERAIDS is an ERC-20 memecoin launched in 2025 on the Ethereum Virtual Machine (EVM), following its migration from Solana on July 26, 2025, with its Liquidity Pool set to launch on Uniswap on August 13, 2025. The token serves as a utility asset within a community-driven ecosystem, providing token-gated access to Vertex AI, a multi-chain trading platform that supports Base, Ethereum, Solana, BNB Smart Chain, Sui, Arbitrum One, and Avalanche blockchains. Through this integration, $ICERAIDS holders gain entry to Vertex AI’s trading features, including artificial intelligence-driven technical analysis and social media insights that assist in identifying trading opportunities, as well as access to advanced and tested trading bots and algorithms deployable via APIs into centralized exchanges (CEXs) and Hyperliquid. The Hyperliquid integration enables users outside the US to engage in leveraged trading, futures, and derivatives, offering tools for shorting and longing to navigate bearish and bullish market trends. Additionally, $ICERAIDS holders can participate in Vertex AI’s copy-trading system, where leaders with strong performance share anonymous trades—replicable only within the platform—with leaders earning a share of copy-trade wins to encourage participation, alongside features like stop-loss orders, dollar-cost averaging (DCA), and customizable automated strategies. This synergy enhances $ICERAIDS’ utility, fostering a collaborative trading community and supporting platform growth, with a roadmap that includes beta testing in 2026 and an MVP launch in early 2027. The project maintains an active presence on X (@ICERAIDS), Telegram, and Discord for community updates.","links":"https://iceraids.io/","market_cap":4098.26,"market_cap_rank":11476,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/iceraids/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xaae45d365b76a6af2785b298b19be2d9b961fd8c","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xaae45d365b76a6af2785b298b19be2d9b961fd8c"}}}