{"name":"OriginTrail Parachain","id":"origintrail-parachain","symbol":"otp","description":"OriginTrail ecosystem’s vision is to build a trusted knowledge foundation that greatly impacts the way humanity’s knowledge is produced, maintained and shared in a trusted and inclusive manner. The purpose of the OriginTrail Parachain is to provide a tailored blockchain for Artificial Intelligence that extends the capabilities of the Decentralized Knowledge Graph with growth incentivization features for real world adoption. The OriginTrail ecosystem is based on real-world adoption of Web3 technologies with utility and is further spurred by the tokenomics design of both the OriginTrail DKG and OriginTrail Parachain, aligned in a way to leverage network effects by seamlessly integrating both network layers. OriginTrail Parachain L1 supports a spectrum of real world use cases, such as securing around 40% of imports the United States of America, vastly improving transparency and trust in electric vehicle (EV) industry, supporting trusted knowledge exchange in pharmaceutical supply chains, helping drive sustainability in European construction sector to name a few. More examples of real-world adoption may be found at www.origintrail.io . The plethora of applications designed to drive mainstream adoption of Web3 solutions are supported by a growing number of integrations with leading software and cloud providers such as Google, Oracle, DIgital Ocean and their Web2 product suites. The OriginTrail provides a quick and scalable way of bringing Web2 users into the Web3 world at an enterprise - grade level. The OTP’s basic utility is to facilitate the transactions in the OriginTrail consensus layer (similar to ETH used on Ethereum). In addition to the basic utility, OTP is used to ​​incentivise growth of trusted knowledge in the OriginTrail DKG, as well as to incentivise parachain collators and their delegators, and enable inclusive development by on-chain voting. The token (OTP) is created with the launch of the OriginTrail Parachain on the Polkadot network and is used for: - Incentives for knowledge creators - the OriginTrail Parachain is an innovation hub for the Trusted Knowledge Foundation, with OTP token used to incentivise the creation of useful, trusted knowledge, guided by OTP governance - Fees for transactions and smart contracts - all network participants utilizing the OriginTrail Parachain will be spending OTP to pay for transactions fees and smart contracts. Participants in the network can also lock up OTP and enable lower fees on the network by utilizing the \"subscription model\". - Incentives for collators - the OTP network is issuing rewards for collators to perform the network function of collating the transactions in blocks and providing them to the Polkadot Relay chain validators. - Collateral for collators - Collator candidates will need to lock their OTP as a way of signaling the amount of stake they are willing to keep locked for a particular period of time in order to receive collator rewards. The higher the locked amount, the greater the chance a collator candidate gets placed in the group of rewarded collators. - Delegating to collators - token holders can delegate their OTP tokens to those collators that allow their collateral (stake) to be increased by third parties. In return they are able to earn part of the rewards that the collator is receiving. - Voting with OTP - token holders will be able to use their OTP to vote on update proposals for OriginTrail Parachain network and Community treasury proposals. In order to take part in the voting process, their OTP will have to be locked up for a particular amount of time. - OTP as a fungible token - since OTP is a fungible token created in the Polkadot ecosystem, it can be used like other assets in the Polkadot network - it can be transacted across different Parachains and used in smart contracts. In addition to the token utility tied to the functioning of the OriginTrail Parachain as a blockchain layer network, the OriginTrail Parachain includes DKG incentives as part of the tokenomics model. The purpose of providing DKG incentives is to ensure that the OriginTrail Parachain is the most attractive blockchain layer for OriginTrail users and boosts OriginTrail’s network effects by providing further incentives for its adoption.","links":"https://parachain.origintrail.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/origintrail-parachain/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}