{"name":"Crypto Kart Racing","id":"crypto-kart-racing","symbol":"ckracing","description":"\"Crypto Kart Racing ($CKRACING) is the first Play-2-Earn (P2E) project on the CRO network and aims to be one of the largest P2E projects in the crypto space. With the simple gameplay mechanics, ability to pick up and play races quickly and earn whilst playing and earning unlockable items, as well as a very strong team behind the project, CK Racing has all of the right components to being one of the biggest on CRO. Crypto Kart Racing utilises Cronos Play to bring web3 integration to our game. Features include: Real Play-2-Earn Unique 3D created characters Fully 3D karts Multiple tracks Integrated NFTs - including cosmetic upgrades, playable characters, vehicles & unique effects! Multiplayer tournaments - PVP or PVE Championships and tournaments with huge cash prizes ($5,000+) Twitch and YouTube gaming ambassadors Mobile versions of the game For months now, the team behind $CKRACING has been hard at work, developing the mechanics and details of the game to ensure the playing experience feels just as rewarding as the token. Too many times we've seen other projects put the token ahead of the game development. We want you to feel satisfied on both fronts. The inaugural release of CK Racing is single-player, with the addition of the multiplayer option added soon after. Additional Features coming shortly thereafter include: - Tournaments - Championships - Contests - Leaderboards - MMR Systems and more! In-game loot and upgrades will be available via the CK Racing Store, all items purchasable with the $CKRACING token. Additionally, our integrated API will constantly update item prices so when the $CKRACING value fluctuates, the prices of the items remain the same, keeping you in the driver's seat on just how much you can afford to buy. The core of CK Racing's economy is the $CKRACING token. This token will be used for all transactions within the game (game entry, betting, purchases, boosts, NTFs, car wraps, etc.). If you are looking for a more traditional way to invest in $CKRacing, we are already in the process of developing a staking platform, so you can earn rewards along the way! The CK Racing team are also already in discussions with other CRO projects to form partnerships, which will help our community to constantly grow and expand as we grow as a project. The game is receiving constant updates (minimum 1 per week), so you can feel safe knowing that the team is pushing this project as hard as they can.\"","links":"https://cryptokartracing.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-kart-racing/logo.png","detail_platform":{"cronos":{"decimal_place":18,"contract_address":"0x5b3c7b96ea7be0367d054a8ef62557d4f4dd0fe7"}}}