{"name":"Bogey","id":"bogey","symbol":"bogey","description":"What is the project about? The Bogeyman is widely regarded as an imaginary mythical creature that is often used by the grown up to scare kids into compliance. Make no mistake, Bogey is truly here to storm the meme crypto space to break records and set high standards. What makes your project unique? The Bogeyman is widely regarded as an imaginary mythical creature that is often used by the grown up to scare kids into compliance. Make no mistake, Bogey is truly here to storm the meme crypto space to break records and set high standards. The mission is simple; creating a viable community wherein, members get to have unending fun while earning profits as a reward for being loyal to the Bogey. There have been numerous meme tokens in the crypto space with tremendous success achieved, the Bogey has set out to break the achievement records set by those other meme tokens, through a well-planned roadmap consisting of innovative utility products, effective marketing and developmental plans that is guided by highly experienced dev team. Bogey project has being carefully designed to be community driven. Therefore, built on the BSC chain to give affordability of transaction fees to the community members and giving equal opportunity to different class of people to be able to buy the $BOGEY token. The Bogey tokenomics has been set up to ultimately see to the success of the Bogey project, as tax fee has been partitioned into aiding constant effective marketing, constant development, and rewarding the token holders. To ensure maximum security and build trust, the contract ownership has been renounced. History of your project. What’s next for your project? What can your token be used for?","links":"https://www.bogeyofficial.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bogey/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb194d48350bc336520080d0732069ebf26cdf648"}}}