{"name":"MegaToken","id":"megatoken","symbol":"mega","description":"Revolutionary first of its kind fully Interactive NFT (INFT), MegaBaby INFTs have changed the future of NFTs. Interacting and playing with MegaBaby INFT e-pets will bring back nostalgia of playing with Tamagotchis. Over time interactivity points will build up and permit the owner to evolve their INFT into rarer and rarer INFTs. First conceptualized nearly 12 months prior, Jonathan Harrocks has dedicated his time and expertise to deliver to the world a truly unique technology, Interactive NFTs in the form of a lovable character named MegaBaby. When you first see MegaBaby you will certainly find yourself wanting to play and interact with your own MegaBaby. MegaBaby gets, tired, hungry, sick and will want to play requiring you to use small amounts of MegaToken to do so. MegaBaby will need to be revived if left uncared for. MegaBaby INFTs can be bought and sold on the platforms marketplace, with 5% commission returning to the original minter on each resale of their own creation. MegaBaby INFTs are purchased using the native MegaToken and all interactivity and in Dapp purchases are conducted utilizing the MegaToken. These microtransactions are reflected back to all holders, this is not just play to earn it is also hold to earn. Once all limited edition MegaBaby INFTs are sold, a generic MegaBaby INFT will be created for minting. The expectation is to get MegaBaby INFTs in the hands of the masses, driving the microtransactions amd in Dapp purchases for accessories and attributes. The possibilities are endless and future roadmap plans will include social mmo and metaverse capabilities. MegaToken is a reflections rewards contract as well with a special ‘claim’ function. All rewards claims on the MegaBaby INFT platform will conduct a purchase of the token reflecting as a buy. The MegaBaby INFT platform is a fully functional marketplace for the INFTs, purchasing BNB and MegaToken, with a roadmap for staking INFTs and staking MegaToken. MegaBaby INFT — the next “Mega” revolution in the Crypto space! This token is not only going to make waves — it will take the crypto world by storm, forming big quakes under the so-called current foundation. In 2012 when the first NFTs came out as simple colored coins who would’ve thought that in 2021 we would have Interactive NFTs? And yes, you read that correctly INTERACTIVE NFTs. The Lead Developer created the next revolution in DEFI with the first FULLY Interactive NFT E-Humans - completely mind-blowing! Owners will have the ability to modify and upgrade them by using MegaToken. Each evolution stage will have a percentage chance to make YOUR MegaBaby rarer and rarer creating a one-of-a-kind collectible — sellable or trade-able on its own Interactive Marketplace. The ability to frequently care for, accessorize and upgrade your E-Pet is what makes this token the purchase of the year. Just imagine this — while having fun caring for it — you can watch your MegaBaby grow alongside your investment — PRICELESS! I’m pretty sure many remember Tamagotchi and how revolutionary that was; there is every reason to believe that MegaBaby will be the next huge hyper trend.","links":"https://megababyinft.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/megatoken/logo.png"}