{"name":"BITmarkets Token","id":"bitmarkets-token_polygon-pos","symbol":"btmt","description":"The BITmarkets token, or BTMT, is an ERC20 token that resides on the Polygon blockchain. It enables the users of bitmarkets.com to perform cryptocurrency exchanges with low fees, participate in new token projects and initial exchange offerings in the platform, and indicate their preference regarding ecological and social impact investments of the company. In order to make its functionality align with the BITmarkets’ business model and social agenda, its smart contract induces a small transfer fee which is distributed between two dedicated BITmarkets-controlled wallets, the profits wallet and an ESG fund wallet. The accumulated funds on the ESG fund wallet will be distributed to an organization from a list of selected social impact companies and NGOs. The BTMT community will periodically vote to determine the organization. There will be three lists, a list of considered tokens where BTMT holders will be able to vote for their favorite projects, a list of upcoming token projects, and a list of active token projects. The Token Project dashboard feature will allow small developer teams with small or no backing to raise capital from platform users who support the team’s vision and see their product’s potential. The teams wanting to be listed on the dashboard will need to file an application which will be reviewed by a dedicated BITmarkets team. The internal team will rate the project based on its social impact, industry significance, the team’s trustworthiness, legal status, and various other factors. Once approved, the team will allocate a percentage of BTMT Tokens to the Token Project. Participants will have to exchange BTMT for the project’s tokens at the specified exchange rate. Once each project sale is completed, the funds will be unlocked with a linear vesting schedule. Participants will then receive their purchased tokens while the team will receive BTMT. It is important to state that BITmarkets will not be acting as an investment manager or advisor when deploying funds into ESG projects. The purpose of the ESG projects is to promote good causes (based on the voting of the BITmarkets community) and not to make a profit on investment.","links":"https://bitmarkets.com","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitmarkets-token/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x0fced30234c3ea94a7b47cc88006ecb7a39dc30e"}},"is_native":false}