{"name":"ChainEx","id":"chainex","symbol":"cex","description":"ChainEx is a cutting-edge blockchain infrastructure platform that focuses on improving user experience through account abstraction. Utilizing ERC-4337 and account abstraction, ChainEx provides a smart contract wallet solution that simplifies transactions and wallet management for users. This enables a more seamless interaction with decentralized applications (dApps), reducing the complexity and learning curve typically associated with blockchain technology. The ERC-4337 standard introduces a new object called “UserOperation” to the Ethereum network, enabling the functionality of smart wallets. When a user initiates a UserOperation, the “higher-layer pseudo-transaction object” is sent to a separate mempool specifically designated for processing ERC-4337 transactions, distinct from the main Ethereum network’s mempool.EIP-4337 presents a novel concept called a UserOperation, which is essentially a detailed description of a user's intended transaction. These UserOperations are collected in an alternative holding area, much like a pre-confirmation queue, known as an \"alt mempool.\"In the Ethereum network ecosystem, there are specialized nodes referred to as \"bundlers.\" These bundlers gather UserOperations from the alt mempool and compile them into a single, comprehensive transaction, aptly named a \"bundle transaction.\"The bundle transaction is then directed to a unique and centralized smart contract on the blockchain, the \"EntryPoint.\" As the only EntryPoint contract in existence, it plays a pivotal role in this process. Bundlers invoke a function on the EntryPoint called handleOps. ChainEx team createsan SDK which is an advanced tool designed for seamless integration with smart contracts, aligning with the ERC-4337 standard for account abstraction. This comprehensive guide focuses on utilizing the ChainEx SDK to enable gasless transactions and streamline interactions.","links":"https://www.chainex.live","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chainex/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd01d133166820557db7138963bcd9009c54e4c33"}}}