{"name":"Axiome","id":"axiome","symbol":"axm","description":"Axiome is a DeFi ecosystem centered around its Layer1 blockchain, Axiome Chain, and its native coin, AXM. The platform is designed to host various interconnected projects that not only share their revenues with AXM stakers in the form of stablecoins or their native coins but also enhance community engagement and platform growth. To manage economic incentives and ensure sustainability, Axiome uses a unique floating reward mechanism and intensive burning mechanisms, which together help prevent hyperinflation and maintain the coin’s value. The ecosystem is bolstered by a strong community and an attractive partnership program, which are essential for rapid development and adoption. Plans are in place to continuously integrate new projects into the Axiome network, further expanding its reach and capabilities. Core Value • Delegation rewards: Holders can mine new AXM, earning up to 20% per month, and receive a share of network fees, incentivizing long-term holding and stability within the ecosystem. • Tokenomics Stability: Employs a floating reward rate for delegation and various coin burning mechanisms to manage the supply and mitigate inflation risks. These features are critical for maintaining the long-term economic stability and appeal of AXM. • Project Integration & Ecosystem Growth: Axiome Chain champions seamless integration of projects with smart contract capabilities, enhancing the ecosystem through strong community ties and shared revenue models. This strategy bolsters the ecosystem's evolution, elevating AXM's utility as it steers continuous innovation and adoption of new projects. • Scalability and Interoperability: Axiome Chain is built on the Cosmos SDK, facilitating scalability and interoperability with other blockchains through the IBC (Inter-Blockchain Communication) protocol. This allows for seamless coin migration and interaction between different DeFi ecosystems, enhancing the usability and reach of AXM","links":"https://axiome.pro/en","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/axiome/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}