{"name":"Disney","id":"disney","symbol":"dis","description":"What is the project about? DIS is a meme coin initiated by Miningtw Technology Co., Ltd. with the support of the community, but hereby declares that it has nothing to do with Walt Disney What makes your project unique? In addition to the community's enthusiastic support for memecoin, actively participate in staking mining. 50% of the circulation of the token economic model is locked for up to 5 years as a reward. Staked accounts for about 20% of the circulating supply and 70% of the total circulation. In the pledge contract, users are rewarded per second according to the percentage of the total pledged amount. This is the concept of POS combined with POW mining. History of your project. DIS is founded by DaddyPig, originally from Hong Kong, who immigrated to Taiwan seeking democracy and freedom. Co-founding MiningTW with joint Hong Kong-Taiwan investment, DaddyPig's journey extends from mining to setting up large mining farms and developing blockchain projects, including a decentralized exchange (DEX) and various ecosystem projects like EthereumFair(ETHF) and DogeW. What’s next for your project? Looking forward, we envision DIS transcending its current status as a BSC network-based cryptocurrency to become its own mainnet with a self-sustained ecosystem. We anticipate DIS interacting with various blockchain projects and applications, providing more choices and possibilities for users. We also aspire to make a greater societal impact through technological innovation and community development, in addition to charity. What can your token be used for? It can be used to pay for the products of cooperative merchants, promote community interaction, event rewards, gift giving, public welfare, etc., to achieve the purpose of spreading happiness and love. In addition, coins can be pledged in smart contracts to obtain mining rewards, making tokens more worthy of long-term holding and collection.","links":"https://distoken.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/disney/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe2ecc66e14efa96e9c55945f79564f468882d24c"}}}