{"name":"GEURO","id":"geuro","symbol":"geuro","description":"What is the project about? GEURO is a stabletoken pegged to the Euro and is backed by Binance Coin (BNB) stored in a smart contract. Users can mint GEURO tokens by providing BNB collateral through the mint function and can also redeem their GEURO tokens without facing high withdrawal minimums. What makes your project unique? The GEURO project leverages blockchain technology and smart contracts to create a decentralized and transparent financial instrument that offers stability, security, and accessibility to users. Its key features are: • Decentralized Backed Assets: GEURO's collateral is stored in a smart contract, ensuring transparency and security. • Flexible Minting and Redeeming: Users can easily mint and redeem GEURO tokens without facing high withdrawal minimums, providing greater control over their assets. • Smart Contract Security: GEURO's smart contract is designed with robust security features to protect users' funds and ensure the integrity of the platform. History of your project. GEURO launched on the Binance Smart Chain on April 03, 2023 with a supply of 1 million GEURO tokens created at genesis. GEURO is part of GameGuru, a cryptogaming ecosystem that has been launched by parent company Marketing Guru, whose founder and CEO is Yassir Amechghale. What’s next for your project? The next steps for the GEURO team plans is to develop and launch the GEURO dApp, allowing users to interact with the smart contract's various functions. Once the project reaches a 10 million market cap, the team plans to list the token on major centralized exchanges (CEXs). In the first quarter of 2024, the GEURO team will focus on expanding the ecosystem through strategic partnerships and integrations with other DeFi platforms and services. What can your token be used for? GEURO addresses many of the limitations associated with traditional stablecoins and can be used as a safe, decentralized store of value with backed assets within the smart contract.","links":"https://gameguru.gg","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/geuro/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6f13b1fb6b2897bb40adbc09f7f6cfad181c0904"}}}