{"name":"Hotel of Secrets","id":"hotel-of-secrets","symbol":"hos","description":"What is the project about? What is the project about? This innovative product targets the satisfaction of one of mankind's primal physiological needs - sexual desire. Historically, explicit materials have served as an outlet for this, as seen in prehistoric cave paintings depicting erotic scenes. What makes your project unique? With HOS, you enter a safe, anonymous environment, where your personal data remains undisclosed. Additionally, you are shielded from any adverse experiences associated with sexual interaction in real life or online. This is largely due to our system pairing you with partners whose sexual fantasies align with yours. You can enjoy flirtations, find suitable partners, or even create your own characters based on real people and engage in virtual intimacy without boundaries. History of your project. Incepted in 2015, our team has a rich history of developing mods for high-profile games such as Skyrim, GTA 4, Stalker, The Witcher, GTA 5, and Minecraft. Leveraging our vast experience in enhancing game mechanics and engine optimization, we've honed our expertise in building bridges and transferring individual locations and characters. Our core team is an assembly of 13 diversely skilled and seasoned developers hailing from global tech hotspots like Russia, Belarus, Ukraine, India, and China, working in a primarily remote setup. What’s next for your project? All our steps are detailed in the Roadmap What can your token be used for? What sets our platform apart is the integration of our proprietary cryptocurrency, HOS Token, which fosters seamless interactions and payment for services within the game. Players can offer and receive services in exchange for rewards, all transacted through this native digital currency.","links":"https://hotelofsecrets.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hotel-of-secrets/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbf27b3163c25113be5439d56f8acf2209ef3e5bd"},"ethereum":{"decimal_place":18,"contract_address":"0xbf27b3163c25113be5439d56f8acf2209ef3e5bd"}}}