{"name":"Playa3ull Games","id":"playa3ull-games","symbol":"3ull","description":"PLAYA3ULL GAMES is building a Node-based blockchain currently situated on the AVALANCHE blockchain. There will be 50,000 Master Nodes in total and once they are sold, PLAYA3ULL GAMES will release their own Blockchain. They believe that games should reward their loyal players and include them in the decision-making process. The PLAYA3ULL GAMES token is 3ULL. To learn more about this project, check out our deep dive into PLAYA3ULL GAMES. The company also aims to “make crypto-based games that are games FIRST and reward-based games second” — Although all their games will be \"\"free to play\"\", they intend to be the first crypto company that makes proper PC-based games that you would be happy to pay for to play. PLAYA3ULL GAMES was founded in February 2022 by Jonathan Bouzanquet. The name is a play on words about games that need to be PLAYABLE and not a chore. The \"\"3\"\" placed in the name is designed to remind all involved that PLAYA3ULL GAMES is built for the Gamer, the Community, and the Company. They believe that all three need to win to build a happy and functional community. An interesting feature is their idea of providing a Management Company for Gaming Developers. Most game developers are not skilled in Business Management or in Marketing. PLAYA3ULL GAMES provides all those skills and services to the acquired Gaming Companies. By building a Business Team first, PLAYA3ULL GAMES can ensure that the games will be managed correctly and operated profitably. In late February 2022, they hired Daniel Visser (the founder of Wicked Witch Software) to the position of Head Of Games. Daniel brings with him over 20 years of experience in making games. Wicked Witch made over 200 games and sold hundreds of millions of copies. Wicked Witch still runs the support for Microsofts Age Of Empires. With a full management team of qualified professionals and the ability to purchase PC-based games nearing their release dates, PLAYA3ULL GAMES looks set to add value to the gaming sector of the market.","links":"https://playa3ull.games","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/playa3ull-games/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x9e15f045e44ea5a80e7fbc193a35287712cc5569"}}}