{"name":"8004 Dog","id":"8004-dog_base","symbol":"dog8004","description":"8004 Dog ($DOG8004) is the first meme coin built entirely on the ERC-8004 token standard, running on the Base Chain. This project represents a new chapter in the evolution of meme tokens — one that combines humor, community spirit, and technological transparency. Unlike traditional meme coins that rely solely on hype and speculation, 8004 Dog was created to showcase the potential of the ERC-8004 standard, which introduces a modern, transparent, and fair approach to on-chain tokenization. By adopting this new framework, $DOG8004 stands as a pioneer — demonstrating how even meme projects can embrace technical innovation and set higher benchmarks for how tokens are created, distributed, and tracked on-chain. The foundation of 8004 Dog lies in its community. It is a fully community-driven meme token, designed to highlight how decentralized communities can unite under a shared sense of humor and creativity. Holders are not just participants; they are the heartbeat of the ecosystem, shaping its direction through engagement, memes, and collective enthusiasm. Being the first meme coin built on ERC-8004 also symbolizes a shift from conventional ERC-20 memes toward a smarter and more structured design. The ERC-8004 framework allows for greater transparency in minting, improved verification for on-chain fairness, and seamless compatibility with next-generation blockchain protocols. By building on Base Chain, 8004 Dog benefits from high scalability, low fees, and strong alignment with the broader Ethereum ecosystem, while maintaining a distinct identity as a meme pioneer. The project’s vision is to prove that a meme coin can be more than just entertainment — it can be a symbol of innovation and community creativity. Through fair minting, transparent supply allocation, and open community participation, 8004 Dog seeks to inspire a new wave of ERC-8004-based tokens that value both fun and integrity. In short, 8004 Dog is not only the first meme coin built on ERC-8004, but also the beginning of a movement — one that blends blockchain technology, Base Chain performance, and the unstoppable energy of the internet’s most powerful force: memes.","links":"https://8004.dog/","market_cap":8129.66,"market_cap_rank":11575,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/8004-dog_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x9f5d8ee0d47296e4e78f2ea2a544917a31c501e2","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x9f5d8ee0d47296e4e78f2ea2a544917a31c501e2"}},"is_native":false}