{"name":"Verge","id":"verge","symbol":"xvg","description":"Verge coin started its cryptocurrency journey in 2014, going by the name of DogecoinDark. The reason it was created was to create a truly private cryptocurrency. The founder of Verge felt that Bitcoin wasn’t anonymous, so he decided to build a new blockchain where transactions could not be traced. Verge uses multiple anonymity-centric networks such as TOR and I2P. The IP addresses of the users are fully obfuscated. The Core QT wallet has built-in TOR integration as well as SSL encryption which adds an extra level of security. Verge is an open source project with an active team of developers from all over the world. The development team is always in close contact with the community. Verge is not a private company funded through an ICO or premining. Wraith Protocol is a technology upgrade package that enables our users to be able to send and receive payments privately across our blockchain by enabling stealth addressing services. Additionally this update removes our QT wallet users off of clearnet and migrates everyone to SSL enabled Tor. Verge focuses on security and maintaining user anonymity just like Monero; so that is its latent upside. Many investors are also applauding its unique technology. Having been improved and integrated with the Wraith Protocol technology, verge users are now able to effortlessly switch between private and public ledgers on the Verge blockchain. Before this, private and public ledgers were mutually selected, meaning that they could not co-exist on a very similar blockchain. But investors are today free to use whatever ledger they want. A good example was when Wraith Protocol switched ON – one will not be able to view the transaction data, not even via the blockchain explorer. Additionally, Verge makes obscure the IP addresses in both instances. When coupled with Wraith Protocol Verge certainly becomes the only undetectable cryptocurrency. Furthermore, transaction speed on Verge is light speed at 5 seconds only, using Simple Payment Verification technology. Verge also maintains a community feel since it’s not a private company. Community members are responsible for the direction of its technology and where the coin heads next. It currently offers a number of secure mobile wallets, including the Tor Android Wallet, which offers mobile anonymity, another big plus over Bitcoin. Verges offers five different Proof-of-Work algorithms for mining. They include; Lyra2rev2, Scrypt, X17, blake2s and myr-groestl. Offering a choice of five different algorithms promotes inclusion, since a wider variety of users will now have an opportunity to not only mine but influence the network. Should one algorithm demand greater mining resources, users get an option of just switching to a different one.","links":"http://vergecurrency.com/","market_cap":82189602,"market_cap_rank":504,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/verge/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}