{"name":"Jellyverse","id":"jellyverse","symbol":"jly","description":"What is the project about? Jellyverse is a comprehensive ecosystem in the decentralized finance (DeFi) sector, overseen by its community through a decentralized autonomous organization (DAO). It focuses on the next iteration of DeFi—commonly termed as DeFi 3.0—which aims to create a sustainable, yield-oriented landscape that integrates protocols with real-world price feeds. The platform provides several utilities designed to meet a variety of financial needs, all governed by its native token, JLY. What makes your project unique? Innovation in DeFi: Jellyverse is at the forefront of \"DeFi 3.0,\" merging traditional finance and decentralized protocols. This entails integrating real-world price feeds into a yield-driven DeFi environment. Diverse Utility Offerings: The Jellyverse ecosystem encompasses a variety of utilities tailored for different financial needs. JellySwap is remarkable for its features like WeightedPools, multi-token pools, and self-balancing portfolios, providing a multifaceted platform for traders, liquidity providers, and developers. Jelly USD (jUSD), the native stablecoin of Jellyverse, is based on proven mechanisms and offers industry-leading capital efficiency. It serves as both a yield-bearing asset and a store of value, with users benefiting from yields generated through liquidations and the ability to leverage their collateral. JellyBond complements this diverse utility spectrum by issuing decentralized bonds, enhancing liquidity and providing amplified returns for users. Real-Yield Staking: JellyStake offers a unique approach to incentivizing staking within the ecosystem. In addition to inflation-based rewards, stakers also benefit from a share of the transaction fees generated across Jellyverse. This dual-reward mechanism adds a real-yield component to staking, making it more appealing and sustainable for participants. Empowering Governance: The Jelly Token (JLY) isn’t just a token; it's a tool of empowerment for its holders. They engage in key decision-making processes, from strategy shifts to protocol integrations. Unique DEX Features: Jellyswap, the native DEX of Jellyverse, offers portfolio pools supporting up to 8 tokens, allowing users to diversify their investments. These pools automatically rebalance, and the option for uneven weightings (e.g., 30% / 70%) provides flexibility in portfolio management. In essence, Jellyverse's uniqueness lies in its community-driven ethos, integration of advanced financial tools, and a vision for a sustainable, yield-oriented DeFi ecosystem. History of your project. What's next? The project was announced on May 5th and has been focusing on community engagement and protocol development ever since. At its scheduled launch in mid of November 2023, JellySwap and JellyStake will be the first utilities available for community use. Following this, a stablecoin is set for release in early December, and a bonding protocol is expected to be rolled out in the first quarter of 2024. What can your token be used for? At the center of this ecosystem is the Jelly Token (JLY), serving as both a governance and utility token. Holders of JLY have the ability to participate in governance decisions concerning strategic developments and key parameters within the Jellyverse ecosystem. This includes voting on various protocols and decentralized applications (dApps) that are part of the platform. Additionally, a portion of transaction fees generated across Jellyverse’s protocols are redistributed as rewards to JLY holders who stake their tokens and engage in governance activities.","links":"https://jellyverse.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jellyverse/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}