{"name":"PubGame Coin","id":"pubgame-coin","symbol":"pgc","description":"What is the project about? Use of Tokens PubGame Coins (PGC) to exchange products and services in the physical and virtual worl What makes your project unique? PUBGameCoin is PubGame's real utility token. It serves as the native currency of the ecosystem, providing Web3 users with the ability to directly and conveniently utilize their digital assets in the physical world. With PUBGameCoin, users can exchange at the PUB Store, purchasing exclusive products and services without the need to convert into traditional currencies or use brokerage credit cards. History of your project. the Ecosystem behind the PUB Game COIN PGC is a utility token built on the Polygon network, has been developed and tested since December 2021, PGC has the purpose of offering web3 users the ability to directly and conveniently utilize their digital assets in the world physicist. By eliminating the need for traditional currency conversions or the use of exchange credit cards, PUB Game Coin gives users the freedom to exchange products and services from traditional market leading companies, while maintaining privacy and reducing conversion rates and risks during cross-portfolio transactions. Through PUB Game Coin, the real adoption of crypto assets is driven, allowing partner brands to interact with users, promoting and marketing their products and services through secure and efficient channels. As a token, the PUB Game COIN offers security, speed and transparency in all transactions within the PUB ecosystem, ensuring the protection of transactions and user privacy through blockchain technology. Within the PUB ecosystem, PUB Game Coin plays an essential role as a digital currency with real utility. Users can purchase products, participate in games and competitions, interact with partner brands, and experience an immersive PubVerse experience. In summary, PUB Game COIN is a practical solution for using crypto assets in the physical world, allowing the direct exchange of products and services from the main companies in the traditional market, eliminating the need for conversions and providing a safe and efficient interaction between brands. and users. What’s next for your project? Q2 2023 Air Drop Biconomy Pre Sale 2 Listing on Biconomy Listing/Traking CMC, CGC and others PubStore launch Q3 2023 Marketplace List of other centralized brokers Listing in Dex Launch of ´´Vip Access´´ Launch of the PUBbers League Launch of ´´House Owners´´ Q1 2024 What can your token be used for? Within the PUB ecosystem, PUB Game Coin plays an essential role as a digital currency with real utility. Users can purchase products, participate in games and competitions, interact with partner brands and experience an immersive PubVerse experience. In summary, PUB Game COIN is a practical solution for using crypto assets in the physical world, allowing the direct exchange of products and services from the main companies in the traditional market, eliminating the need for conversions and providing a safe and efficient interaction between brands and users.","links":"https://pubgame.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pubgame-coin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x35c2b6826b5c94fd2dfede51e7cfd4b94410840a"}}}