{"name":"Blue Pepe","id":"blue-pepe_base","symbol":"blupepe","description":"Once upon a meme, Base was for everyone — a place to build onchain, a canvas for creators, and a launchpad for wild ideas. It was our onchain summer, fast, based, and buzzing with life. Now Blue Pepe peeks out, not to preach, but to remind us of the magic we first felt. A wide grin, a blue glow, and a simple dream: to bring the fun back and build a truly based community. No hype. No noise. Just pure blue energy. 0x8a910eA80fC09D5b5a2120521A39B67980df0BC4 ABOUT From the deep corners of meme-land, a blue frog reappears. He’s not a savior — he’s a reminder. That the golden era of Base wasn’t about charts or words, but laughter, chaos, and the connections we built onchain. Blue Pepe just shows up, smiles, and paints the chain blue again. Because sometimes, the world doesn’t need more talk — it just needs another good laugh. Blue Pepe isn’t about numbers — but if you must know, here’s the funny part Total Supply – 1,000,000,000 $BLUPEPE Enough $BLUPEPE for every believer who still laughs. Zero Tax Because taxes kill the joke. LP Locked Forever Safe, strong, and meme-proof. Community Rules Pepe’s just the face. You’re the movement. No Dev Wallet No hidden stash. No puppeteer. Just people. Built on Base Fast, bright, and ready to be painted blue again. Why blue? Because green got boring. Blue is the future, clarity, and a bit of rebellion. Who’s it for? Who made it? Is there a roadmap? How far will this go? What’s the goal? We’re not a cult — we just like the same color. We’re not marketers — we just make each other laugh. If you smiled when you saw this frog, you’re already one of us.","links":"https://blupepe.xyz/","market_cap":94761,"market_cap_rank":7082,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blue-pepe/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x8a910ea80fc09d5b5a2120521a39b67980df0bc4","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x8a910ea80fc09d5b5a2120521a39b67980df0bc4"}},"is_native":false}