{"name":"Mori Finance","id":"mori-finance","symbol":"mori","description":"What is the project about? Mori Finance is an innovative stable asset protocol that leverages LSDs as collateral to yield both low-volatility stable assets and high-volatility derivative assets. Taking ETH as an example, users can choose to hold high-volatility ETHC (ETH Coin) assets and low-volatility ETHS (ETH Stable) assets based on their risk preferences. This offers users the flexibility to choose based on their risk tolerances. Moreover, the protocol offers a powerful hedge against ETH price shifts, allowing users to open low-cost long positions on ETH with low liquidation risk. What makes your project unique? Mori stands out with its unique approach, including the introduction of LSD support. It not only meets the demand for a trusted stable asset but also develop various applications for its' high volatility ETHC token, expanding its utility and potential use cases. This creates new opportunities for the community to leverage ETH's growth. Furthermore, Mori's risk management module ensures system stability and sustainability. History of your project. Mori is a next-generation native stable asset DeFi protocol built on Ethereum. The testnet was initiated on June 20th, and within the initial 24 hours, the transaction volume doubled, reaching nearly 500 transactions. The first token offering event occurred on July 20th, achieving a remarkable sellout in under 5 minutes, amassing a total of 150 ETH. The second round of token offering on August 10th, raising 174 ETH within a remarkably brief 35-second span. The project's alpha mainnet was introduced on August 13th. Moreover, the community has observed substantial and organic growth, primarily composed of dedicated enthusiasts. What’s next for your project? The upcoming stages of our project entail diverse endeavors. We plan to have our token listed on decentralized exchanges, facilitating direct trading, and also partake in the competitive landscape of yield optimization, possibly on platforms like Curve Finance. Furthermore, we aim to go live on Layer 2 scaling solutions(integrate with layerzero), optimizing efficiency. We're exploring cross-chain capabilities, aiming to function across multiple blockchain ecosystems, and considering the creation of derivatives tied to core assets like ETHS and ETHS. What can your token be used for? Initial token circulation: Core team: 25% *2.78%=0.695% Public sale: 6% Treasure: 10% *4.17%=0.417% Maketing: 7%*10%=0.7% Initial LP: 1.2% Airdrop: 0.8% Total Releases: 9.812%","links":"https://app.mori.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mori-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x00c8555542158fff0feb892c8e000a8d1831762c"}}}