{"name":"BNBDeFi","id":"bnbdefi","symbol":"$defi","description":"What Is BNB DEFI (DeFi) ? BNB Defi is a protocol at the Binance Smart Chain that uses Yield Farming and staking & Auto-compounding strategies to maximize and rebalance budget throughout pools to maximize APY returns. Individuals with long-time period investments in BSC and tokens (\"HODLERs\") can use a BNB DeFi swap as a supply of extra returns on their investment. For example, user that owns $DEeFi can deliver their tokens to the BNB DeFi protocol, and earn interest (denominated in BNB) while not having to control their asset, satisfy mortgage requests or take speculative dangers dApps, machines, and exchanges with token balances can use the BNB DeFi protocol as a supply of monetization and incremental returns by \"sweeping\" balances; this has the capability to release completely new commercial enterprise fashions for the BSC ecosystem. Moreover, Holders gets a dividend of 4% paid in BNB each 1 hour. Reflections will appear automatically in the holder's wallets. The native token $DeFi is used for mainly the governance of the protocol. However, some utility will also be established by allowing top holders to participate and trial the Beta version of the platform before public release and gain reflections generated from trading fees once the native staking goes live. What Makes BNB DEFI Unique? BNB DEFI protocol provides higher staking APY on BSC chain with its 12 cross-chains on its DEFI swap, where you can exchange from one chain to another without the hassle of using any third party with an extra GAS fee. BNB DEFI takes pride in creating swaps with Farms that are made up of liquidity pools of protocols that run on AMM's and allow for yield to be generated by liquidity providers. https://app.bnbdefi.io/farms The BNB DeFi pools generate a yield from staking a range of coins in the market and reward returns on the good competitive returns available at the time. https://app.bnbdefi.io/pools Auto compounding vaults are vaults that re-stake your rewards into pools or farms as they grow to increase the yield generated due to re-staking more of the underlying asset. Which in turn are more assets in pool/farm to gain yield from Our smart algorithms check for historical data and lock-up periods to make the most informed decisions for auto compounding strategies while maximizing yield.","links":"https://bnbdefi.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bnbdefi/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x455dedacbe41c178953119847f2b95e2d9ad0a1d"}}}