{"name":"Take Flight Alpha DAO","id":"take-flight-alpha-dao","symbol":"tfa","description":"Take Flight Alpha (TFA) is a decentralized autonomous organization that operates on the principles of fair launch, community involvement, and governance. TFA has a token, $TFA, that was launched without an initial coin offering and the entire supply was directly injected into the liquidity pool on Beamswap, a decentralized exchange. The absence of team allocation ensures that the development team does not hold any slice from the tokenomics and will participate along with the users through common channels. The total supply of $TFA is capped at 100K, and it is available for trade on Stellaswap & Beamswap. The $TFA tokens are pivoted around governance for the whole TFA economy, and the token holders have the power to vet proposals and make decisions about the direction of growth. Regular buybacks of $TFA tokens at market price using revenues generated from tangible business ensure the sustainability of the price curve. The $TFA tokens have general and specific use cases, including surprise airdrops, discounted merchandise and apparel of TFA's crypto-shop, access to token-gated events, and many more. TFA is a product of a grassroots movement incepted by the community, and the community collectively holds a virtual consciousness. TFA collectively runs 4 nodes on Moonbeam and Moonriver Network, has created an NFT collection that sold out in under 10 minutes, created a merchandise shop with global print-on-demand capacity, and is developing its very own P2E game sustained by the revenue and commission it generates. All developments are purely community funded. TFA aggressively allocates its resources and team to enable cross-project camaraderie and community relationships. TFA enjoys symbiotic support from many of its strategic partners that operate on Polkadot and beyond.","links":"https://tfalpha.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/take-flight-alpha-dao/logo.png","detail_platform":{"moonbeam":{"decimal_place":18,"contract_address":"0xe065ffaf3f7ded69bb5cf5fdd1fd1dda2eee8493"}}}