{"name":"Take Flight Alpha DAO","id":"take-flight-alpha-dao","symbol":"tfa","description":"No Initial Coin Offering (ICO): The token did not have an initial coin offering (ICO). In a fair launch the entire supply was provided directly to the liquidity pool on Beamswap, a decentralized exchange. The tken was available for immediate deployment with the said pair ( viz $GLMR ) allowing the trading to commence instantaneously. No Team Allocation: The token does not have a team allocation, meaning that the development team does not hold any slice from the tokenomics and will participate along with the users through common channels. This is done to bolster confidence and eliminate a central entity that can influence the development from the team spectrum. The intention is to attract and retain token holders that believe in the project long-term and partake actively in its development. Total Supply in Liquidity Pool: The total supply of $TFA injected directly into the liquidity pool on Beamswap, where it is available for purchase/trade. The total supply is capped at 100k $TFA. Governance: $TFA tokens are pivoted around governance for the whole TFA (Take Flight Alpha Dao) economy. All current and future developments in our roadmaps will be subjected to the grip of $TFA votes, allowing token holders to vet proposals and make decisions about the direction of growth. Regular Buybacks: Decoupling from market narratives, the project will ensure regular buybacks of $TFA tokens at market price using revenues generated from tangible business to sustain the health of the price curve. The buybacks are multi-sig controlled and have a robust mechanism in place to ensure tranquility in operations. Use Cases: $TFA tokens have general and specific use cases. The holders are eligible for surprise airdrops, discounted merchandise and apparel of our crypto-shop, access to the token-gated events with socialites and gig events, partake in developing our sustainable fashion line, vote on NFT development, MoonPets game mechanics, game auxiliary and co","links":"https://tfalpha.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/take-flight-alpha-dao/logo.png","detail_platform":{"moonbeam":{"decimal_place":18,"contract_address":"0xe065ffaf3f7ded69bb5cf5fdd1fd1dda2eee8493"}}}