{"name":"Fullhouse.gg","id":"fullhouse-gg_binance-smart-chain","symbol":"fh","description":"Fullhouse.gg, a leading crypto casino and sports betting platform started in 2021 and launched in 2024. It has garnered over 30k active users and 10.5 million bets, offering a true top-notch user experience, and offer users a novel way to become part of the house (and its upsides). Wherein platforms like Stake.com create revenues in the billions of dollars each year, they accrue such value only to the few shareholders they have. While Stake does not offer a native token, it is one of the three largest web3 corporations and creates tremendous value in the market, some even note that almost half of the transactions in web3 are in some way related to gambling (source). While this market is growing exponentially, there have not been many casino eco-systems able to accrue value to a token-based community. With aligned incentives and redistribution of wealth instead of accrual to the few at the top. Fullhouse aims to solve this problem and provide every user opportunities to participate in the growth and monetary gains of the platform. Players who join Fullhouse refer to their former casinos as having poor user experience, mediocre bonusing or native tokens that don't directly enhance their gaming experience. The Fullhouse eco-system runs by the GMX/DyDx playbook, wherein you can not only earn a portion of platform revenues (fees), you can also decide on business decisions together with the core team. The token is designed to grow alongside the platform, with value accrual that scales with platform use-age. As such, there will be several exciting token utilities such as: 1. $FH will be used as a wager asset 2. $FH will have a buyback-and-burn 3. $FH holders can gain early access to new features, exclusive bonuses and much more 4. $FH will be lockable for native rewards in ETH, BTC and any other currency Fullhouse supports, based on monthly platform revenues. 5. $FH will provide any holder rights to vote on decisions and proposals through FH DAO.","links":"http://Fullhouse.gg","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fullhouse-gg_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x441f06c76fd62b8a243fcec2fc3b6b4de34e875c","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x441f06c76fd62b8a243fcec2fc3b6b4de34e875c"}},"is_native":false}