{"name":"DragonSwap","id":"dragonswap","symbol":"drg","description":"Launched in June 2024, DragonSwap is the native liquidity hub on Sei Network. It serves as the native automated market maker (AMM) on Sei and supports multiple liquidity types, including constant product (XYK) pools, concentrated liquidity pools, and permissionless yield farms to incentivize liquidity provision across a range of trading pairs. By leveraging Sei’s parallelized and high-throughput infrastructure, DragonSwap can process transactions with low latency and minimal time to finality. This enables a seamless user experience, particularly for traders seeking fast execution and reduced slippage. The Sei Network’s Giga upgrade further enhances the protocol’s ability to scale with growing user and volume demand. Liquidity providers (LPs) on DragonSwap can choose between simple XYK pools or concentrated liquidity positions, offering greater flexibility in how capital is deployed. LPs earn a share of trading fees generated within each pool. In addition to organic fee revenue, DragonSwap offers emissions-based incentives to reward liquidity on strategic trading pairs. These incentives are managed through internal mechanisms and updated periodically based on market conditions. DragonSwap is powered by the DRG token, which plays a central role in protocol incentives. DRG is used to reward LPs, bootstrap liquidity, and support ecosystem development. A portion of token emissions are allocated to farms and other incentives that drive network activity and user engagement. DragonSwap was built with a modular architecture that supports ongoing upgrades and ecosystem integrations. Its smart contracts are open-source and have undergone audits to ensure a secure and transparent foundation. The protocol emphasizes efficiency, accessibility, and sustainability in its design. The team behind DragonSwap includes founders of successful DeFi infrastructure and protocols. Their focus is on building a resilient trading layer that aligns with Sei’s broader vision for scalable, app-specific performance.","links":"https://dragonswap.app/","market_cap":5636358,"market_cap_rank":2249,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dragonswap/logo.png","detail_platform":{"sei-v2":{"decimal_place":18,"contract_address":"0x0a526e425809aea71eb279d24ae22dee6c92a4fe","geckoterminal_url":"https://www.geckoterminal.com/sei-evm/tokens/0x0a526e425809aea71eb279d24ae22dee6c92a4fe"}}}