{"name":"Half Pizza","id":"halfpizza","symbol":"piza","description":"Half Pizza is a decentralized reward autonomous community of BSC. Any good ecology, model, and product that conforms to the underlying logic of the blockchain may be used by us as a community building section. We have our own complete ecological framework. 10 billion is issued, the initial 8.5 billion PIZA and 120 BNB add liquidity and have been locked up, 5% community construction, 5% project function dividends, 5% airdrop and team building. 4% of the profit of each sector is used for holding currency rewards, 3% for liquidity mining rewards, 2% for burning, and 1% for referral rewards. The design is based on liquidity mining rewards other than the pancakeswap exchange, issuing 1,000 sub-tokens, and users who add liquidity get the sub-token SWET, which is the number of BNB tokens at the beginning of adding multiplied by the total number of seconds to end the withdrawal of tokens. When the 3% liquidity bonus pool of the project's profit meets 10 million PIZA, it will be issued in accordance with the proportion of SWET currency holdings. Use sector profit to support independent ecological mining rewards with own liquidity. At present, the BTC quiz section project has been launched. The NFT section was launched in early September. Based on 1 million oil paintings a year in Shenzhen Oil Painting Village, China, the NFT art auction combines the physical art and the value of the NFT. After the auction, buyers can choose to let the sellers Burn the painting or send the original painting, and the two parties will confirm the transaction once again. At the same time, setting up is the function of investing in paintings. Investors can invest in the auctioned paintings and share the auction profits at the same time.","links":"https://halfpizza.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/halfpizza/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xfc646d0b564bf191b3d3adf2b620a792e485e6da"}}}