{"name":"Meta Masters Guild","id":"meta-masters-guild","symbol":"memag","description":"1. Meta Masters Guild (MEMAG) is a blockchain Web3 gaming ecosystem dedicated to developing mobile games with playable NFTs, where players can earn rewards, stake & trade. Operating as a guild enables MEMAG to work with leading blockchain developers on multiple games all utilising the MEMAG token. Players can earn Gems (in-game rewards) for their achievements. The earning system revolves around skill-based competitions coupled with resource collection & player-driven upgrade cycles. Gems can be exchanged for MEMAG tokens, which can be used to buy NFTs, Stake, or Convert MEMAG into ETH or USDT. 2 . Players own their assets & are rewarded for their time spent playing. MEMAG’s game mechanics enables players to play with their NFTs & upgrade them by earning experience points. Upgraded NFTs can be sold, or alternatively staked on MEMAG's innovative NFT staking platform where yield can be earnt by ‘Renting’ out NFTs to other players. 3. The Meta Maters Guild project was conceived by Gabriel Hristov back in 2019. The team behind MEMAG have been involved in the crypto and blockchain industry for 5+ years & are supporters of decentralisation & are passionate mobile gamers. MEMAG’s core vision is fundamentally based on the belief everyone should have full control of their assets, from having control of your money, art & other collectables. 4. Token staking to go live from Mar-23. MEMAG added as a payment option in the NFT store after CoinGecko listing. Further exchanges are being finalised and will be launching soon. NFT store updates with better UX and better functionality from Apr-23. Further game developments including Raid NFT game trailer from May-23. Fully playable demo version of the Meta Kart Racer game will be released Q3/Q4 2023. 5. Buying NFTs: The tokens can be used for buying ERC-721 NFTs from the MEMAG store. Token Staking: token staking pools launching shortly enabling holders to generate a yield for staking their MEMAG tokens in one of the staking pools.","links":"https://memag.io/en","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meta-masters-guild/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6e39a587691b8c9d4341ce0a960998ed6f537af6"}}}