{"name":"Meta Finance","id":"meta-finance_ethereum","symbol":"meta","description":"What is the project about? META is the native token of the Meta Protocol. The Meta Protocol is a DeFi system that allows you to deposit GLP and mint the stable coin mUSD without any fees or borrowing interest. mUSD held in your account will receive an average yield of ~20%+. In the Meta Protocol, users can take on the roles of Minters, Holders, Liquidators, Redemption Providers, Rebase Providers, Liquidation Keepers and/or others. What makes your project unique? It's the first yield-bearing stablecoin on Arbitrum providing an average APY of 20%+ History of your project. It's a new project with an ongoing whitelisting for IDO. What’s next for your project? Q3 2023: Audit Open source contracts for public review METADAO IDO Arbitrum Launch to the bring the Hype Looking for Whale adoption Avalanche Launch Q4 2023: Collaboration with DeFi Protocols for mUSD DeFi Degen Strategies Develop more functions according to Meta DAO community What can your token be used for? Minting mUSD Users can deposit GLP tokens to mint mUSD tokens. Minters of mUSD earns esMETA rewards in proportion to their minted mUSD value. At genesis, 70% of esMETA rewards are reserved for mUSD minters. esMETA rewards further accrue Protocol Revenue to boost yield. Stake META/ETH LP Tokens Users can provide liquidity to META/ETH pool on Uniswap and Balancer and stake their LP tokens to earn LP fees along with esMETA rewards. At genesis, 15% of esMETA rewards are reserved for META/ETH LP stakers. esMETA rewards further accrue Protocol Revenue. Stake mUSD/2Pool LP Tokens Users can provide liquidity to mUSD/2Pool pool on Curve Finance and stake their LP tokens to earn LP fees along with esMETA rewards. At genesis, 15% of esMETA rewards are reserved for mUSD/2Pool LP stakers. esMETA rewards further accrue Protocol Revenue. Yield Boost esMETA holders receive a varied percentage of yield boost depending on their lock-up length. The longer the lock-up length, higher the boost percentage.","links":"https://getmeta.finance/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meta-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":null,"contract_address":""}},"is_native":false}