{"name":"Sekuya Multiverse","id":"sekuya-2","symbol":"skya","description":"Sekuya is a video game company headquartered in Singapore. Born from a community, Sekuya aims to revolutionize the gaming landscape with a community-driven approach in all new anime epic fantasy universe. Sekuya’s flagship project, Sekuya Multiverse, an award-winning start-up project, combines 2 of the world’s most popular gaming genres: MOBA + RPG, promising a new gaming experience for global players of both genres. Problem: The current fast-growing MOBA gaming genres have not received a significant gameplay update since around 2003. Additionally, despite the total gaming revenue reaching $180 billion in 2023, game item ownership remains centralized. Approach: An entirely new genre of Epic Fantasy MOBA MMORPG powered by a unique Web3 ownership (heroes, items, skills, pets) and AI co-creation tools (user generated skin & personalized superpower). Positioning: We are among the pioneers in introducing a completely unique gameplay experience, along with Web3 ownership and AI co-creation tools that have the potential to appeal to millions of gamers and creators. Sekuya Multiverse, an award-winning start up project with GAMEFI AI RWA narrative, combines 2 of the world’s most favorite gaming genres: MOBA MMORPG, promising a new experience for 250 million global players Supported by over 100 communities in Southeast Asia, Sekuya Multiverse offers an immersive MMORPG experience set in the Novae Terrae, a 10-world universe. Players, known as \"Jumpers,\" can utilize an AI character creator to customize their own character, interact with AI NPCs, embark on engaging storylines, and participate in battles to collect 400+ sekumon souls and win the grand rewards. Anticipate an exhilarating 5v5 MOBA featuring unique superpowers bestowed by Sekuya heroes and special abilities tailored to each player's personality.","links":"https://sekuya.io/","market_cap":739007,"market_cap_rank":2798,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sekuya-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x623cd3a3edf080057892aaf8d773bbb7a5c9b6e9"},"base":{"decimal_place":18,"contract_address":"0x623cd3a3edf080057892aaf8d773bbb7a5c9b6e9"}}}