{"name":"Upril","id":"upril","symbol":"upril","description":"It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative. It's a meme driven by April's narrative.","links":"https://pump.fun/coin/PeGV8nmE7BP23Ev5e3LZJ3muvRvVYAaYozQfHDSpump","market_cap":8866.26,"market_cap_rank":11012,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/upril/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"PeGV8nmE7BP23Ev5e3LZJ3muvRvVYAaYozQfHDSpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/PeGV8nmE7BP23Ev5e3LZJ3muvRvVYAaYozQfHDSpump"}}}