{"name":"iNFTspace","id":"inftspace","symbol":"ins","description":"iNFTspace Digital artwork (NFT) trading platform based on DAO incentives. iNFTspace is a digital artwork (NFT) trading platform based on DAO incentives, Comparing Opensea to build a global leading NFT trading platform.And based on the DAO community development and transaction mining model,achieved better NFT liquidity and community feedback , helping more artists and enthusiasts to join the NFT trading more easily. iNFTspace focuses on the digital confirmation of modern trendy artists. Through iNFTspace, it realizes better copyright on-chain and safe、transparent value circulation, and support multiple mainstream public chains, covering more user groups and a wider range of NFT application scenarios. DAO Community Governance The iNFTspace DAO community consists of the founding team, NFT artists, NFT collectors, digital art brokers, and community members. We will encourage different members to join and coordinate governance in the form of rewards, and everyone will jointly participate in the ecological construction of iNFTspace. Early stage of development (Transaction mining pool balance ≥ 50%) Open transaction mining rewards, effectively incentivize the community and more users to participate in transactions, and promote the internal cycle of ecological development. Mid development (50% ≥ Transaction mining pool balance ≥ 30%) Mining rewards have slowed down, and NFT royalties have been added to fully incentivize NFT artists and platform brokers to enhance the creation value of the platform. Stable development period (30% ≥Transaction mining pool balance) After the release of the mining pool is completed, INS stable deflation is enabled, and 1/3 of the platform transaction fee is used to reward users who hold INS, 1/3 is used for platform operation and maintenance and market promotion, and 1/3 is destroyed.","links":"https://www.inftspace.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inftspace/logo.png"}