{"name":"Oort Digital","id":"oort-digital","symbol":"oort","description":"What is the project about? Oort Digital lets brands plug into our platform and easily provide a branded utility-rich gamification experience to their NFT members. What makes your project unique? Loyalty memberships grow best when there are monetary and non-monetary rewards. We help users integrate both without the high expense of building their own infrastructure. History of your project. Although customer and fan acquisition costs are getting higher, it costs nothing to retain a customer.NFT loyalty memberships provide a digitally native way to grow a loyal community through engagement & rewards. Brand communities come together when members can spend time engaging with them in a fun environment without buying pressure. Oort Digital provides the tools for any brand to enter the engagement economy. Through gamification of your NFT memberships, we help you keep your community interacting with your brand in a fun, rewarding, and memorable way. What’s next for your project? With Oort Digital, brands can create custom branded NFTs with our templates, create and manage their loyalty programs, launch campaigns to reward the custom NFTs created, and allow their users to bring the NFTs into the Oort Digital ecosystem to best engage with their users and boost loyalties. What can your token be used for? 1) $OORT as a Work Token – Brands would stake $OORT tokens to launch reward campaigns for their loyalty members. Staking would mimic the functions of store of value. 2) $OORT as a Governance Token – Token holders would have an opportunity to nominate for their desired candidates with domain expertise from the Hero Association to vote on behalf of them, Brands, or Influencers. 3) $OORT as a Currency Token – Tokens are used as currency to pay within the rental and trading marketplaces. Payment function would mimic the functions of medium of exchange.","links":"https://oort.digital","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/oort-digital/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xcce87c5b269c94b31ec437b1d7d85bf1413b7804"}}}