{"name":"Blockchain.io","id":"blockchain-io","symbol":"bcio","description":"Blockchain.io (BCIO) is a project of Paymium.com, one of the oldest bitcoin exchanges in the world, founded in 2011 and hack-free since the beginning of operations in 2013. Ultra-secure and profitable, Paymium is registered with the French regulation authority ACPR and accounting is certified by external auditors. Based on its record and experienced team, Paymium is launching a new crypto-exchange: Blockchain.io. This platform will be fully dedicated to crypto-trading while Paymium will remain the privileged hub for fiat currencies. Paymium customers (currently at 170,000 + accounts) will automatically have a blockchain.io account and will obtain incentives for their loyalty. Our new platform will offer: - For users: centralized orderbooks (maximum liquidity) and decentralized settlement (even more security), advanced trading orders with Maker & Taker fees at 0.1% with additional discounts, market-making and peer-to-peer lending - For entrepreneurs & institutions: ICO planning & execution services (thanks to an extensive network of bankers, lawyers, marketers, technologists, etc) up to the Blockchain.io exchange listing and guaranteed liquidity for BCIO tokens. What sets us apart is a concentrated effort in Europe, where the crypto market is largely still in its infancy and which as of today lacks a transparent and regulated crypto-exchange with a proprietary token enabling institutions to launch their ICOs. Our proprietary token will allow us to offer incentives to bootstrap the liquidity of the trading platform. Xavier Niel's fund Kima Ventures is advising the project and is a long-time investor with Paymium. Jean-Pascal Beaufret, Goldman Sachs advisor and former GM of the French tax administration, is also on board. Open to US Accredited Investors (the project is registered with the SEC). Submitted to AMF (French SEC equivalent) to ensure regulatory compliance. Blockchain.io’s exchange will be launched in November, right after the Public Sale closure. BCIO tokens will be distributed a few weeks later in December, to ensure there is enough liquidity on the exchange platform before the tokens distribution. Meanwhile, a public beta version will be released before the Public Sale begins, for users who would like to test the exchange. For more information about our token sale, click here: https://blockchain.io/!","links":"https://blockchain.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockchain-io/logo.png"}