{"name":"Arable Protocol","id":"arable-protocol","symbol":"acre","description":"Arable Protocol is a synthetic yield farming protocol that is dedicated to helping yield farmers access multiple blockchains (such as Ethereum, Avalanche, Solana, Cosmos or Polygon) assets and yields on a single chain. The biggest challenge in earning high yields in the DeFi space is the need to bridge assets across chains, requiring constant bridge fees that limit returns. Arable is changing that by providing the first single chain platform that enables multi-chain farming. The platform is supported by incentivized collateral providers (aka. stakers or minters) for synthetic assets. Users receive the same rewards as they would on native chains. Many different blockchains are now supporting liquidity mining pools and providing incentive mechanisms, but the transfer of the assets between different chains takes time and fees and requires chain and bridge specific knowledge. This is leading users to feel confusing which chain to stick on for yield farming. Synthetic assets are essentially tokenized derivatives to support people to buy or sell specific assets on native assets’ price. ARABLE’s goal is to provide an environment where yield farmers can access all the crypto farming assets on a single chain, where the users receive the same rewards as they would on native-chains. The environment is supported by incentivized collateral providers (aka. stakers or minters) for synthetic assets.","links":"https://arable.finance/","market_cap":55423,"market_cap_rank":4070,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arable-protocol/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x00ee200df31b869a321b10400da10b561f3ee60d"},"evmos":{"decimal_place":18,"contract_address":"0xfea7a6a0b346362bf88a9e4a88416b77a57d6c2a"},"osmosis":{"decimal_place":18,"contract_address":"ibc/bb936517f7e5d77a63e0adb05217a6608b0c4cf8fba7ea2f4bae4107a7238f06"},"ethereum":{"decimal_place":18,"contract_address":"0xb2cabf797bc907b049e4ccb5b84d13be3a8cfc21"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x5f006745a9a192a7cd1236089f704f9b35d3b9cd"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xebd949aacfc681787d3d091fa2929e4413e0e4e1"},"polygon-pos":{"decimal_place":18,"contract_address":"0x011734f6ed20e8d011d85cf7894814b897420acf"}}}