{"name":"Round X","id":"round-x","symbol":"rndx","description":"Round X is building a metaverse by issuing NFT using user-centered services in each country and entering the world's No. 1 sandbox using the Doongle app. Doongle is a platform that enables making friendship on a global scale for anyone. Doongle by Round X is a global friendship starter pack. People with similar interests and exploring new stuff can share and introduce anything to each other. Doongle is a social media focusing on global friendship and matching. RNDX is the native utility token that is designed for participation, payment, and reward tool for Doongle services. Round X launched on the 3rd of March, 2020. Its current circulation of RNDX is 1,200,000,000 RNDX and it's 6% of the total. Round X is available for trading on MEXC on one of the largest stable coins. (https://www.mexc.com/exchange/RNDX_USDT) pair currently available. Currently, Doongle is a social media platform with the feature of friendship, posting, messaging, and sending the gift. Once an account is created, the user will set the interests and what they would like to explore. Posting and making friends will lead the user to the global friendship experience with automatic translation. When the user likes someone he or she can send the gifts to each other that engages a stronger friendship. Doongle is preparing new features that will lead the user experiences to a whole new level. Doongle is adopting a new token economy that can expand the scope of service with better user experiences. There are and will be services requiring payment such as sending e-gifts, exclusive services (will be available in the future). Also, users can earn RNDX tokens by creating hot content or watching ads. All the transactions and payments made in Doongle will be done with the RNDX token once the token is available and listed on the first cryptocurrency exchange. Before the stabilization of the token economy, users are allowed to use the current payment method, but once the token economy settles, RNDX will be t","links":"https://round-x.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/round-x/logo.png"}