{"name":"TruFin Staked MATIC","id":"trufin-staked-matic","symbol":"trumatic","description":"The TruFin Protocol builds institutional-grade Web3 primitives, that can be used as the foundational building blocks for complex digital asset strategies to reduce risk, generate rewards, securely on-chain. TruFin’s first product, TruStake, is a MATIC staking vault which provides access to MATIC staking on the Ethereum network. TruMATIC is the liquid staking token users receive when they deposit MATIC into the TruStake vault. It is an ERC-20 token like MATIC and has all the same basic functionality. As soon as a user deposits MATIC on the TruStake smart contract, they receive newly minted TruMATIC, based on the exchange rate at the time of staking. As MATIC staking rewards accrue, the value of TruMATIC increases (with reference to MATIC). - Users have have the ability to stake their MATIC through TruFin’s [dApp](https://app.trufin.io/). - When a user stakes with TruFin, they will mint a new liquid token — TruMATIC. - Rewards are restaked automatically, giving an uplift in APY from the compounding effect. The TruMATIC liquid token is self-custodied, meaning holders have complete control over their TruMATIC at all times, with a broad set of possibilities: - **Target ~5%+ APY:** TruMATIC will deliver optimised staking rewards on the staked MATIC. Auto-restaking means your APY rides on the power of compounding. - **DeFi Interoperability:** TruMATIC’s token design ensures seamless integration with a myriad of DeFi protocols — from DEXs to lending/borrowing protocols to yield optimizers. - **Liquidity Pools:** Get ready for MATIC<>TruMATIC liquidity pools on leading DEXs, enabling a smooth liquidity provision for users seeking to exit their TruMATIC positions.","links":"https://www.trufin.io/","market_cap":84790196,"market_cap_rank":637,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trufin-staked-matic/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa43a7c62d56df036c187e1966c03e2799d8987ed"},"polygon-pos":{"decimal_place":18,"contract_address":"0xf33687811f3ad0cd6b48dd4b39f9f977bd7165a2"}}}