{"name":"Homeety","id":"hom","symbol":"hom","description":"We are reinventing customer engagement and loyalty using Web3 to onboard the next billion users. How ? By offering quality animated 3D creations, implemented in the form of NFTs. By simplifying access to NFTs by retrieving them just with an SMS or email. Via an APP which directly connects the brand with its owners of digital assets. Thus allowing them to provide them with exclusive content, and by sending notifications to their smartphones. Web3 represents the future of the Internet but still faces entry barriers, preventing its mass adoption by the general public. Homeety breaks down these barriers by democratizing access with simple tools for Web2 users. The $HOM token The $HOM token is the official currency of Homeety. The HOM Token serves to consolidate the Homeety ecosystem by becoming its official currency; it allows holders to benefit from exclusive rewards (competitions, marketing campaigns, receipt of partner NFTs). It is also a governance token that honors its community by offering voting rights and active user participation. ‍ Means of payment : ‍The $HOM token is accepted as a method of payment for the services offered by Homeety. It can also be used to settle transactions with sellers and suppliers affiliated with the company. ‍Benefits for Holders: ‍$HOM token holders have access to exclusive benefits, including discounts and promotions on Homeety services. These benefits are intended to encourage token retention and strengthen user loyalty. Reward mechanism: Homeety plans to use the $HOM token as a loyalty tool. Users could receive $HOM tokens in exchange for recommendations, constructive criticism, or participation in various company initiatives, such as surveys and feedback sessions.","links":"https://www.homeety.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hom/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x12a4cebf81f8671faf1ab0acea4e3429e42869e7","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x12a4cebf81f8671faf1ab0acea4e3429e42869e7"}}}