{"name":"The Unfettered Souls","id":"the-unfettered-souls","symbol":"souls","description":"The Unfettered is a decentralized role-playing video game developed by Trender Software on Unreal Engine 5. It offers an immersive soulslike experience with AI-powered infrastructure for unique NPC interactions, bringing depth and innovation to gameplay. The mission is to provide true gaming freedom in the Web3 space, combining stunning graphics with blockchain technology. What makes The Unfettered unique is its utilization of the Unreal Engine, known for delivering visually stunning and engaging gameplay. The integration of AI technology sets it apart by allowing players to have meaningful conversations with NPCs in their own way, creating a dynamic and immersive experience. The project has raised $2.5 million in funding from prominent investors like Animoca Brands, and has gained attention through a public off-chain demo on Steam. It has also partnered with PlayStain to bring the game to PS4 and PS5 consoles. Additionally, the project launched the $SOULS token, which is listed on Gate.io, MEXC, and Quickswap exchanges, providing liquidity and accessibility. The future of The Unfettered holds exciting plans, including continuous content enhancement and expansion, integrating advanced AI for more immersive NPC interactions and storytelling. The team is actively working on blockchain integration, with a launcher version catering to Web3 players, bridging the gap between Web2 and Web3 sectors. The roadmap includes a full version release on Steam in Q3 2023, followed by a blockchain-based version testnet, and a full version release in late Q4 2023. The $SOULS token within The Unfettered game serves as a versatile utility, enabling players to purchase in-game items and NFTs, participate in equipment repairing and staking, and engage in governance through The Unfettered DAO. It acts as a medium of exchange in the marketplace, fostering an economy and providing economic value.","links":"https://theunfettered.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-unfettered-souls/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xefcfece12a99d1dbbf6f3264ee97f8c045e97f1f"}}}