{"name":"Defi For You","id":"defi-for-you","symbol":"dfy","description":"\"DeFi For You is a crypto pawnbroking platform that facilitates lending by securing crypto and NFT collateral packages in smart contracts which are released when the loan is repaid or a liquidation threshold is met. The project is positioning itself as the leading pawnbroking platform in the crypto and NFT world. We have also developed a system for 'Evaluators' - most of whom are licensed pawnbrokers - to connect with borrowers in DeFi and offer them crypto loans against digital or physical assets. These pawnbrokers are uniquely positioned in that they have a licensed and secure premises to store hard assets. They store the asset, issue an NFT representing it to the borrower, and then burn the NFT when the asset is reclaimed. Our dev team took inspiration from the UI of Booking.com to design the layout of featured crypto pawnshops on the platform. They also designed an on-chain reputation system for lenders and borrowers, which denotes how many transactions they have had and their record of integrity when using the platform. We have developed an NFT marketplace with a special NFT Pawn Market integrated into it. This allows people to list NFTs for sale, auction, or pawn. It also means buyers can get great deals on NFTs that have been repossessed by lenders, who are now looking to cash in on the digital asset they have gained. DeFi For You will be launching lending pools in Q1 2022 to increase the value of its DeFi platform. This will allow users to quickly lend and borrow from pools with interest rates determined algorithmically. DeFi For You was founded by Adam Christopher Chaplin, who was a co-founder of Travala.com (AVA). The project is in the process of inking partnerships with major pawnbroking companies and banks to expand its reach and bring the world of pawnbroking into the crypto space. DeFi For You is built on Binance Smart Chain and the native DFY token is a BE20 - BEP2 bridge. It is used for fees on the platform, as well as loan currency, repayment currency, and collateral for loans.\"","links":"https://defiforyou.uk/","market_cap":154832,"market_cap_rank":4049,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/defi-for-you/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd98560689c6e748dc37bc410b4d3096b1aa3d8c2"}}}