{"name":"Qoda Finance","id":"qoda-finance","symbol":"qodex","description":"The Qoda Protocol is a DeFi lending/borrowing protocol built on Moonbeam Network with several key features: On-Chain Orderbook For Lending/Borrowing Isolated Collateral-Tier vs Market-Tier Assets Hybrid Overcollateralized/Undercollateralized Borrowing Fixed Interest Rate, Fixed Maturity Loans With Early Exit Repayment Redemption Ratio (RRR) Let’s take a survey of today’s incumbent money market protocols (e.g., Compound, Aave, etc). Current money market protocols (Henceforth, Money Market v1.0 Protocols) have been one of the most promising sectors of DeFi with real product-market fit. However, Money Market V1.0 Protocols typically have several key deficiencies. The Global Collateral Problem Money Market v1.0 Protocols have a global collateral system. This severely limits the number of markets the protocol can support. Any single asset that is supported poses a systemic risk to the entire system if it collapses. Hence, these protocols work excellently for blue-chip assets, but will never be able to support long-tail assets. The Price Discovery Problem Money Market v1.0 Protocols use a so-called static Interest Rate Curve that deterministically adjusts the floating interest rate based on the utilization ratio of borrowers to lenders in a particular market. However, the Interest Rate Curve itself is set a priori, and there are no guarantees that the curve has been configured appropriately to reflect real supply/demand and price discovery. The Overcollateralization Problem Money Market v1.0 Protocols only support overcollateralized borrowing. This is a necessity in a trustless DeFi ecosystem. However, this type of system has very limited real-world use cases where demand for overcollateralized borrowing is generally correlated with bull markets. Specifically, users only borrow overcollateralized for the purpose of facilitating leveraged trading. However, in sideways or bear markets, demand for overcollateralized borrowing dries up. In contrast, uncollateralized borro","links":"https://qoda.fi/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/qoda-finance/logo.png","detail_platform":{"moonriver":{"decimal_place":18,"contract_address":"0x7c733acdc87874c9b0d02e46f54cd89173b4a460"}}}