{"name":"Karat","id":"karat","symbol":"kat","description":"What is the project about? Karat leverages on-chain MPC and ZK technologies to create a sharable Web 2 & 3 ID data layer. Karat encrypts user data such as email and Twitter, links it to the user’s wallet, and stores it on IPFS. Users and nodes are then given the MPC private key, allowing them to have completely decentralized control over all data access permissions. This infrastructure is intended to be the infrastructure of all future Dapps that require Web3 social, data indexing, advertising delivery, and login permission calls. What makes your project unique? 1. Currently the largest and most active protocol on Zksync with over 250,000 kyc wal-lets, Each user has verified their web3 wallet and their web2 id/behavior data. Over 100 protocols have requested to stake and pay to request these data in the alpha. 2. Karat's genesis validators include KCC, OKX, Bitmart, NEO, and many other big Defi, Gamefi projects. It also has a KOL matrix of 300 top tier KOL validators manages the 250, 000 users. 3. Karat's MPC data infrastructure allows users to grant varying level of access to different Dapps. So they can use ZKP to proof their web2 behaviors credentials without showing their identity. Also, users are able to use one ID to log on different platforms and still zkProof all their credentials on Web2 & Web3. History of your project. lives in a country listed by FATF) Karat hosted an IDO on its official website from 7/19 to 8/19. It has two rounds. First round: Time: 7/19-7/21 Sale Price: 0.03 Paid Currency: ETH, USDT Sale Amount: $200,000 Second round: Time: 7/22-8/19 Sale Price: 0.035 Paid Currency: ETH, USDT Sale Amount: $317,092 What’s next for your project? * Q3 2023 (Completed): Utilize Multi-Party Computation (MPC) to build a bridge between Web2 and Web3 data. Establish an unified data ecosystem that allow user to have true ownership of their data for the first time in the history. * Q4 2023: Create a Karat-specific EIP standard that drives the future of our digital identity and verifiable credential. This standard will enhance interoperability within the entire EVM network. * Q1 2024: Revolutionize online authorization by making W3Auth the mainstream for web3, mirroring the role of oAuth in Web2. By embracing MPC technology, we aim to increase user control over personal data and promote interoperability. * Q2 2024: Partner with noteable identity providers such as Lens and Worldcoin and integrate them as one of the VCs in Karat ecosystem. We aim to build an open-source and flexible socring system for different applications, inlcuding foolproof, scalable solutions for Proof of Personhood Verification . * Q2 2024: Integrate Account Abstraction (EIP4337) into Karat Network, enhancing user experience by eliminating friction caused by gas and blockchain. * Q3 2024: Incorporate zero-knowledge (ZK) technology to further protect user’s privacy and bolster data ownership. What can your token be used for? Allocations: 70% of the KATs are designated for the 10 year Karat mining, currently stored in our multisig wallet managed by zkSync Official, NEO, Bitmart, and Karat Founders. The mulsig wallet releases KATs to the mining smart contract every 6 months. 10.5% of the KATs are for the team 10% of the KATs are for operation 7.5% of the KATs are for investors 2% of the KATs are for advisors Team, operation, investors, and advisors tokens all have a 48 months linear release after the 1st 3 months. Users need to stake 500 KAT for 7 days to join a content creator/validator’s private chat room and mint a Karat ID. For every new user joining, the content creator gets 50 KAT staked in his validator for 30 days, then he could withdraw. Everyone who stakes under the content creator will be able to gain KAT rewards based on the increasing number of users in the private chat. The more users join after you, the more staking reward you will receive. There is a 10% fee when one withdraws. Karat ID: Karat ID is a omnichain name service that connects users’ web3 addresses and web2 identities. It’s the foundation of Karat Network. User has to stake a small amount of KAT token to mint the Karat ID. Currently over 350,000 users have created their Karat ID and connect their web2 socials in Karat Network. Verifiable Credentials: Users can mint their web2 data, including social accounts, KYC information, etc on chain through verifiable credentials. Dapps can query these information on chain and build protocol around it. https://docs.karatdao.com/web3-authorization Validator Staking: Anyone who stake over 350,000 KAT can start a validator Growth Staking: Users can stake under the validators that they are expecting to have the highest growth and share the staking rewards every time a new user’s data is verified under that validator. A portion of the transaction fee will be burned. https://docs.karatdao.com/staking Data Request: Dapps need to pay KAT tokens to access users’ data for indexing, marketing, and other purposes. A portion of the transaction fee will be burned. https://docs.karatdao.com/data-marketplace","links":"https://karatdao.com/","market_cap":1614133,"market_cap_rank":3399,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/karat/logo.png","detail_platform":{"zksync":{"decimal_place":18,"contract_address":"0xcdb7d260c107499c80b4b748e8331c64595972a1"}}}