{"name":"BlockStar","id":"blockstar","symbol":"bst","description":"BlockStar is an immense decentralized ecosystem of user-centric platforms redefining how people engage in social media, create and share content, and transact in cryptocurrency worldwide. With a philosophy rooted in data privacy, BlockStar introduced an ecosystem that ends the traditional business model of unfettered access to user data, and brings about a realm where the pendulum of content monetization is shifted to favor the content originator. BST Token is BlockStar’s native token, which is ERC-20 compliant, powers the BlockStar ecosystem and fuels the BlockStar blockchain. BlockStar’s BST Token is used for transaction fees, ecosystem advertising pools, platform user rewards, and to secure the BlockStar network. A flagship component of the BlockStar ecosystem is their third generation blockchain, which bedrocks all the BlockStar platforms. This powerful dyad of Byzantine Fault Tolerant consensus protocols is a hybrid model blockchain secured by two settlement layers that were developed simultaneously. The BlockStar Layer 2 solution is a sidechain of the Layer 1 base layer and utilizes a Proof of Stake methodology where individual transactions are organized into blocks and confirmed by validators. BlockStar's Layer 1 protocol is a trustless Proof of Work mechanism that verifies sets of blocks previously generated and confirmed by randomized Layer 2 validators. This interaction produces an exceptional combination of workflows which delivers top-tier security, speed, and scalability. In addition, Layer 2 of the BlockStar blockchain is Ethereum Virtual Machine (EVM) compatible allowing for seamless interoperability to and from other blockchains and provides a phenomenal arena for developing Layer 3 dApps or state channels.","links":"https://blockstar.site/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockstar/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x4e4bffaa8df6f0dc3e5600bbacf7da55f37134fc"}}}