{"name":"TANUKI•WISDOM (Runes)","id":"tanuki-wisdom-runes","symbol":"🦝","description":"Degen-ery defines the state of crypto today, as we moved from the decentralization maxi cypherpunks of the past to the capitalist, fiat maximalists of today. It is no longer about values of decentralization and personal economic freedom, as crypto has evolved from a philosophically driven movement to being a extractive global casino for speculation. ‍ The 2013 run of Bitcoin was the birth of the collective belief that we could replace the global monetary system. ICOs of 2017 brought in more believers, with promises of grand ambitions, except they failed to materialize - leaving the speculators and newcomers disillusioned. The DeFi summer of 2020 brought in crypto’s first on-chain utility, shifting us into degen behavior, participating in clear ponzis to extract value in a zero-sum game - which all eventually collapsed. ‍ Memecoins are now the meta. They offer no promises or grand visions - they are transparent as they are just tickers with a image and liquidity. The transparency is an improvement - but the lack of any worldly value besides price movement leads to pure greed, FOMO and fear as the underlying utility is PnL. ‍ We want to inspire for something greater and uplift the crypto world into higher consciousness. Our vision with Tanuki is to align with the ultimate decentralized, uncensorable chain (Bitcoin) whilst bridging the worlds of psychedelics and mental wellness therapy. We believe that memecoins can provide a deep value for society if it comes from a purpose to elevate others rather than pure extraction. Bringing real world impact to crypto by redirecting the deep pool of liquidity in the memecoin space to charitable giving to impactful organizations that can lift the human spirit, thus changing the world. ‍ Tanuki is an entity from the higher dimensions - birthed as a Japanese raccoon dog, it is known as a mischievous creature embodying the trickster archetype. Its playfulness teaches us that life is not so serious, that the universe is about Leela - Play. It is a great teacher - as a shapeshifter that carries with it Abundance, Love and Prosperity.","links":"https://tanuki.xyz/","market_cap":708441,"market_cap_rank":4068,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tanuki-wisdom-runes/logo.png","detail_platform":{"ordinals":{"decimal_place":2,"contract_address":"868414:2716"},"solana":{"decimal_place":2,"contract_address":"GUUFsneDFrEgYwV2ngpvpMdAmwFjhFknA5eL7ehkeFf8","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/GUUFsneDFrEgYwV2ngpvpMdAmwFjhFknA5eL7ehkeFf8"}}}