{"name":"Rebase","id":"rebase-base","symbol":"rebase","description":"What is the project about? REBASE is the first rebase project on Base. It shares an ideological root with its predecessor, Ampleforth, and believes in the future of elastic supply cryptocurrencies. REBASE aims to bring this type of digital asset to Base, as a key DeFi primitive, so other interesting DeFi components can be built on top, whether flatcoins, vaults or more. What makes your project unique? Rebase is the first rebasing token on Base. Rebasing is a concept introduced by Ampleforth in 2017, but gained popularity during the DeFi Summer bull run of 2020. Rebase refers to the fact that the token supply is elastic, and changing to market price. This concept means price volatility is shifted to supply volatility, allowing for a new generation of DeFi products to be built on top. History of your project. Rebase launched in August 2023 as a completely fair launch project. There was no premine and 85% of the supply preloaded into Volcanos, the community liquidity reward program. What’s next for your project? Rebase plans to be the largest rebase project on Base, making rebase great again and helping make Onchain Summer the next wave. Rebase hopes to expand into the rapidly growing Base ecosystem and see various projects utilize Rebase as a primitive and liquidity layer. What can your token be used for? Base is a digital commodity money, like Bitcoin, so it can be used in many ways Bitcoin is: as an uncorrelated asset to the wider market, as a liquidity backstop for a protocol, as a medium of exchange for DeFi. Rebase is also supply elastic like Ampleforth, because of this innovation it can be used for innovative things such as a liquidity layer on protocols similar to Balancer, allowing for no-impermanent-loss liquidity pools, or as a backstop for flatcoins (such as AMPL and SPOT).","links":"https://www.rebasebase.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rebase-base/logo.png","detail_platform":{"base":{"decimal_place":9,"contract_address":"0x3421cc14f0e3822cf3b73c3a4bec2a1023b8d9cf","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x3421cc14f0e3822cf3b73c3a4bec2a1023b8d9cf"}}}