{"name":"ZeroLiquid","id":"zeroliquid","symbol":"zero","description":"What is the project about? Self-Repaying loans for your LSD Tokens Use your LSD tokens to get self-repaying, 0% interest loans without the risk of liquidation. What makes your project unique? With ZeroLiquid, you can leverage your future yield to pay for current personal expenses. Rather than relying on credit, either decentralized or centralized, or paying out of pocket, you can redirect your yield/loan to cover your expenses. History of your project. After months of tireless effort and collaboration with an amazing team, we are excited to announce ZeroLiquid, a novel protocol that offers interest-free, self-repaying loans for LSD tokens. Before we dive into ZeroLiquid, let’s take a step back and first understand why it’s even needed in the first place and what problem it is solving. Liquid Staking Tokens In the majority of POS chains such as Ethereum, you can stake it to earn rewards for help in verifying the transactions. However, while the tokens are staked they cannot be transacted, traded, or used as collateral — they are illiquid. LSD solves that part but you still have to pay high interest rate and had to deal with liquidation risk. ZeroLiquid solves that: lock your LSD tokens in our protocol, and the protocol will issue you synthetic tokens that can be freely traded on the market giving you instant liquidity. Don’t worry about paying back the loan as it will be paid off using the rewards earned on it. You can also early unstake it by paying back the remaining loan, simple as that. What’s next for your project? Ongoing: Successful stealth launch at March 19th Live AMAs Litepaper/Gitbook Protocol development Marketing and partnerships Apr 2023 Dapp Design launch Protocol development Testnet competition What can your token be used for? The $ZERO token is a governance/utility token that will have a fair launch with no public/private sale. It will attain further utility with the ZeroLiquid protocol as new features are implemented.","links":"https://zeroliquid.xyz/","market_cap":933312,"market_cap_rank":2780,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zeroliquid/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb0ed33f79d89541dfdcb04a8f04bc2c6be025ecc"}}}