{"name":"TrendBet","id":"trendbet","symbol":"tbt","description":"TrendBet - Decentralized Cryptocurrency Price Guessing Platform Description: TrendBet is an innovative, decentralized platform built on the Binance Smart Chain (BSC) that allows users to guess cryptocurrency price movements and earn TBT token rewards. With a sleek, user-friendly interface and a gamified experience, TrendBet combines the thrill of crypto trading with the excitement of prediction-based rewards. The platform supports a variety of cryptocurrencies, including Bitcoin (BTC), Ethereum (ETH), Binance Coin (BNB), and more, offering guessing periods from 30 seconds to 1 hour. Key features include: Price Guessing Mechanics: Users can predict whether the price of a selected cryptocurrency will rise or fall within a chosen timeframe. Correct guesses yield 2x the guess amount (minus a 2% fee), while ties refund the stake. TBT Token Rewards: Powered by the TBT token, the platform incentivizes participation through daily prize pools, where 50% is burned to enhance token value, and 50% is distributed among randomly selected players. Referral Program: Invite friends to earn 1% of their guess amounts, with rewards claimable upon reaching 100,000 TBT. Real-Time Data: Leveraging Binance’s official API, TrendBet provides accurate, real-time price data, ensuring transparency and fairness. Comprehensive Dashboards: Track total guesses, win rates, profits, and TBT balance, alongside detailed guess history, leaderboards, and token burn/reward records. Roadmap for Growth: Planned enhancements include multi-language support, gamification features, advanced guessing mechanisms, and native mobile apps by Q1 2026. TrendBet is designed for crypto enthusiasts seeking a fun, rewarding way to engage with market trends. Connect your BSC wallet, guess wisely, and join the TrendBet community to compete for TBT rewards!","links":"https://trendbet.fun/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trendbet/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6b747b8ccd1d46226edace142838687e41484444","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x6b747b8ccd1d46226edace142838687e41484444"}}}