{"name":"Stroke-Prevention GenomicDAO","id":"stroke-prevention-genomicdao","symbol":"pcsp","description":"GenomicDAO G-Stroke is a sub-DAO under the GenomicDAO’s AI-Powered ecosystem to initiate R&D & build awareness for Stroke. GenomicDAO is an AI-powered decentralized science platform to leverage Precision Medicine for Asians. $PCSP is the utility and governance token of GenomicDAO G-Stroke. $PCSP is used to reward users, for voting & govern rights, to exchange for vouchers applied on end-products, and for staking. GenomicDAO is an AI-powered decentralized science platform to leverage Precision Medicine for Asians. GenomicDAO is built by Genetica - the leading biotech company in the SEA region with a mission to empower billions of people to join forces for the advancement of Precision Medicine. Genetica and GenomicDAO’s core technology, upon which it conducts its testing, is built across three key pillars – gene decoding chip, artificial intelligence, and blockchain. Not only does GenomicDAO break free from the centralization of modern medicine R&D by establishing a community that initiates, drives, and governs precision medicine initiatives, but with a robust support system from our Web2 foundation of Genetica, we set an ultimate goal to develop working products addressing practical health causes. GenomicDAO is also a one-stop genetic product marketplace, which provides genetic insights, personalized recommendations, and precision medicine drugs. Eventually, the GenomicDAO platform will serve as the launchpad to bootstrap various precision medicine initiatives, followed by a dedicated subsidiary DAO. To accomplish such progressive goals, GenomicDAO is built on a strong foundation consisting of proprietary technology in partnership with top gene decoding companies, led by biotech veterans, and a world-class advisory board in both the traditional and blockchain space.","links":"https://genomicdao.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stroke-prevention-genomicdao/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe356337a72d4990a3cfd4d13367659f14f304545"}}}