{"name":"dogwifsaudihat","id":"dogwifsaudihat_ethereum","symbol":"wifsa","description":"Marhaba Chads! Welcome to the world of DogWifSaudiHat (DWSH) - where financial freedom meets meme culture. This token is not just about a dog with a hat; it's about paving the way for financial liberation for everyone. Why, you ask? Because this is no ordinary hat - it's a Saudi hat, symbolizing opulence and prosperity. Prepare for liftoff, because with DWSH, we're heading straight to the moon, habibis! Key Features: Decentralized Meme Token: DWSH is a decentralized meme token built on the Ethereum blockchain. It combines the power of memes with the reliability and security of blockchain technology, creating a unique and entertaining financial ecosystem. Financial Freedom: Our mission with DWSH is to democratize wealth and empower individuals from all walks of life to achieve financial freedom. Whether you're a seasoned investor or new to the crypto scene, everyone has the opportunity to participate in the DWSH community and potentially reap the rewards. Variety of Utilities: DWSH offers a range of utilities to its holders, making it more than just a meme token. From staking and yield farming to NFTs and community governance, there are numerous ways for holders to engage with and benefit from the DWSH ecosystem. To the Moon Mentality: At DWSH, we believe in aiming high and reaching for the stars (or should we say, the moon!). With a dedicated team and passionate community behind us, we're committed to pushing the boundaries and taking DWSH to new heights.","links":"https://dogwifsaudihat.com/","market_cap":9486.3,"market_cap_rank":11293,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dogwifsaudihat_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6630e3a2ec1e7e0a2f9f1d2289a9a89b0551683a","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x6630e3a2ec1e7e0a2f9f1d2289a9a89b0551683a"}},"is_native":false}