{"name":"Sports Bet","id":"sports-bet","symbol":"sbet","description":"SBET aims to extend the experience of live streaming and betting for sports and e-sports through the metaverse. The project aims to bring real-time streaming, real-time 3D content, and experience to almost every person connected to the internet in VR and AR. In other words, the idea is to convert real-life sports events like a soccer match, into 3D and stream it on the metaverse with a lot more features! In addition, SBET offers a metaverse platform for a different audience and a decentralized betting protocol. Everything will be scalable. The Sbetverse will allow gaming and streaming platforms to build their arenas, where gamers, athletes, sport associations or influencers can: 1 - Book a time slot to offer their streaming content, competitions, or metacasts. 2 - Create NFTs, which can also be used as betting assets, traded, or sold later. 3 - Engage community with custom ads, sell digital and physical goods. 4 - Create language specific virtual chat lounges and events. 5 - Create prizes that can be rewarded in form of tokens. The SBET Project will also offer an fair, and straightforward solution for the sports betting community. The platform allows users to have more control over their own bets and transactions. No customer identification process is required due to the way a blockchain works, and users can bet any amount. To avoid sensitive data collection, SBET will work with cryptocurrency only. All you will need to bet is a crypto wallet, like Metamask or Trust-Wallet. Think of the SBET protocol as a Decentralized Autonomous Organization, leveraging Ethereum 2.0 scalability and speed and most important, the staking for token stability, offering interoperability between different technologies so, that users can interact with each other regardless of their platform. The project counts on the community and investors for long-term growth, the community will decide what features and which sports are included first in the project. You are the target audience, therefore you have the voice!","links":"https://sbettoken.org","market_cap":30322,"market_cap_rank":9305,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sports-bet/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2ed2cc2c858a8a8219fd2f2d9e170285dbd02756","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2ed2cc2c858a8a8219fd2f2d9e170285dbd02756"}}}