{"name":"Wrapped OMAX","id":"wrapped-omax","symbol":"womax","description":"WOMAX is the wrapped version of Omax . Wrapped tokens, like WOMAX or Wrapped Bitcoin, are tokenized versions of cryptocurrencies that are pegged to the value of the original coin and can be unwrapped at any point. Almost every major blockchain has a wrapped version of its native cryptocurrency like Wrapped BNB, Wrapped AVAX, or Wrapped Fantom. The mechanism of such coins is similar to that of stablecoins. Stablecoins are essentially “wrapped USD” in the sense that dollar-pegged stablecoins can be redeemed for FIAT dollars at any point. In a similar fashion, WBTC, WETH, and all other wrapped coins can be redeemed for the original asset at any time. Wrapped coins solve a particular problem: because of the low interoperability of blockchains, native coins of one chain cannot be used on another chain. For instance, you cannot use Bitcoin on the Ethereum blockchain and you cannot use Ether on Bitcoin or Avalanche. Wrapping coins solves this problem by tokenizing them and applying the blockchain’s token standard to the tokenized version of the original cryptocurrency. On OMAX, almost all fungible tokens follow the ERC-20 standard developed in 2021. This token standard was developed to have a standardized set of rules for tokens on OMAX , which simplified new token launches and made all tokens on the blockchain comparable to each other. Mandatory rules all ERC-20 tokens have to follow are totalSupply, balanceOf, transfer, transferFrom, approve, and allowance. Unfortunately, OMAX itself does not comply with the ERC-20 standard. Wrapped OMAX was developed to increase interoperability between blockchains and make Ether usable in decentralized applications","links":"https://omaxcoin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-omax/logo.png","detail_platform":{"omax":{"decimal_place":18,"contract_address":"0x373e4b4e4d328927bc398a9b50e0082c6f91b7bb"}}}