{"name":"AgriDex","id":"agridex-governance-token","symbol":"agri","description":"AgriDex is a blockchain-based digital marketplace that improves agricultural trading by providing a low-cost, instant settlement system with full transparency across the agricultural value chain. The platform addresses key challenges in agriculture, including high remittance fees (typically 3-6% per transaction, up to 10% with FX spread), limited profitability for producers, complex sustainability verification, food fraud, and poor cross-jurisdictional traceability. Founded by CEO Henry Duckworth, who brings experience from a multigenerational farming background in Africa and a commodities trading role at Trafigure, AgriDex leverages blockchain technology to enhance transparency and efficiency in agricultural transactions. The platform, supported by the Solana Foundation and partnerships with Circle, Stripe’s Bridge, and Bastion, uses smart contracts and USDC to enable near-instant settlement with remittance fees reduced to less than 0.5%. Sustainability credentials are recorded on chain to enhance traceability and ESG transparency. Additionally, on and off ramp integration allows access to stablecoins which provides fair access to financial tools for emerging markets. AgriDex operates as a DAO, governed by the AGRI token, which allows token holders to vote on platform decisions. The AGRI token includes various utilities designed to engage users interested in sustainable agriculture and food traceability. AgriDex has secured strategic launch partners across Western and Southern Africa, with the token launch scheduled for December 4th, 2024. For a more detailed dive into the project’s core mission and value proposition, please visit the whitepaper: https://drive.google.com/file/d/1yuo1lPssoiisbtmNprYxKl6arq3hqvdM/view","links":"https://agridex.com/","market_cap":8262001,"market_cap_rank":2030,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/agridex-governance-token/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"AGRidUXLeDij9CJprkZx7WBXtTQC67jtfiwz293mVrJ"}}}