{"name":"Mavaverse","id":"mavaverse-token_binance-smart-chain","symbol":"mvx","description":"Mavatrix is launching its “gacha” game metaverse on the blockchain. With Mavatrix you will collect unique NFTs, play minigames, explore the Mavatrix Metaverse and play fashion battles earning tokens and more! In the metaverse, we call it MaVaVerse, you will collect unique NFTs, play minigames, explore the mavaverse, meet new friends and play fashion battles earning tokens, and more! In this space, everything like minting, buying, selling, staking will be revolving around a base currency the MVV Token. The project launched in the market with its first NFT collection of reward-based NFT pegged with rewards coming from a royalty pool made up with MVV Tokens. To do this Mavatrix built an on-chain/off-chain protocol that connects the DeFi and inGame transactions of the MVV tokens with a reward pool that accumulates fees from each token transaction. These rewards are then periodically transferred to the First Collection NFT holders. Mavatrix has been the first project to develop a reward-based NFT system on BSC. Mavatrix is gonna be launching a new collection of NFTs, this year, and this time of playable characters in its metaverse. To access the MaVaVerse, players will have to mint their own avatar, who will be assigned randomically to give everyone a fair shot. The avatars, called MaVaTars, will have different attributes and rarities assigned, and by playing and interacting with the environment every player will have the chance to increase his/her MaVaTar ranking to access more content and elite contests and games.","links":"https://mavatrix.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mavaverse-token_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":8,"contract_address":"0x10c9524dbf934b3b625dce3bdc0efdc367f4e84b","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x10c9524dbf934b3b625dce3bdc0efdc367f4e84b"}},"is_native":false}