{"name":"Nukplan","id":"nukplan","symbol":"nkpl","description":"NukPLAN is a compound word composed of nuclear and plan or plant. These clean nuclear power plants are constructed and invested in with blockchain technology to increase efficiency and profitability for private companies rather than governments. NukPLAN is a nuclear economy platform established to enable individuals, not large institutional investors, to participate in these high and safe investments, and is also an enterprise resource planning (ERP) for power plant construction. Whenever a project is completed, revenue is distributed via the economic model that will be loaded on the NukPLAN platform, and transparent management of each process, required manpower, and resources is possible. The system can be used to carry out a variety of economic activities and projects, such as raising funds for the project and distributing profits to individual investors. Among the blockchain technologies, ERC20 has been rated as the most stable and sustainable, and NukPLAN has adopted it for the build and maintenance of such an integrated system. With the blockchain technology, it will be possible to build a power plant, maximize the transparency of the construction project, and accurately manage the cost and materials used for construction. In particular, in order to minimize the possibility of a radioactive leakage accident that may occur after completion, all processes from construction of the nuclear reactor to actual management functions are transparently disclosed through blockchain technology. This will ensure real-time monitoring which can miximize the most important factor, such as project efficiency and safety. Furthermore, NukPLAN is designed for nuclear reactor development and construction projects, and it distributes construction profits to coin holders in the form of NFT shares, so that coin holders can receive equity income along with profits.","links":"http://nukplan.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nukplan/logo.png"}