{"name":"UltrAlpha","id":"ultralpha","symbol":"uat","description":"The native digital cryptographically-secured utility token of the UAT platform (UAT) is a transferable representation of attributed functions specified in the protocol/code of the UAT platform, designed to play a major role in the functioning of the ecosystem on the UAT platform, and intended to be used solely as the primary utility token on the platform. The UAT issued and sold in connection with the token sale are being created as ERC20 compliant tokens on the Ethereum protocol. UAT is a non-refundable functional utility token which will be used as the payment medium of service exchange between participants on the UAT platform. The goal of introducing UAT is to provide a convenient and secure mode of payment and settlement between participants who interact within the ecosystem on the UAT platform. UAT does not in any way represent any shareholding, participation, right, title, or interest in the Foundation, the Distributor, its affiliates, or any other company, enterprise or undertaking, nor will UAT entitle token holders to any promise of fees, dividends, revenue, profits or investment returns, and are not intended to constitute securities in Singapore or any relevant jurisdiction. UAT may only be utilised on the UAT platform, and ownership of UAT carries no rights, express or implied, other than the right to use UAT as a means to enable usage of and interaction within the UAT platform. UAT provides the economic incentives which will be distributed to encourage users to participate in the ecosystem on the UAT platform. UAT is an integral and indispensable part of the UAT platform, because without UAT, there would be no incentive for users to participate in activities on the UAT platform. Users of the UAT platform and/or holders of UAT which did not actively participate will not receive any UAT incentives. The limit of 500 million UAT is strictly imposed without any further increase. UAT are designed to be consumed/utilised, and that is the goal of the UAT token sale.","links":"https://ultralpha.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ultralpha/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x01c0987e88f778df6640787226bc96354e1a9766"}}}