{"name":"Horizon","id":"horizon-2","symbol":"hzn","description":"What is the project about? HorizonDEX is the #1 DEX on Linea with over 2.29 million TVL and an outstanding cumulative trading volume of 20 million USD since its inception. One of the key advantages of HorizonDEX is its unique offering of Concentrated Liquidity pools which optimizes the APR and capital efficiency for Liquidity Providers, ultimately resulting in the most favorable rates for traders. What makes your project unique? HorizonDEX is the leading liquidity hub of Linea. HorizonDEX has several improvements over the Concentrated Liquidity, addressing the major pain points of the users, HorizonDEX offers several feature that aims to provide a seamless trading and LP experience to its users, namely; -Capital efficiency via Concentrated Liquidity -Lazy LP -Auto-compounding Liquidity Provider Fees -Custom Pools -Liquidity Mining Rewards (TBA) History of your project ? HorizonDEX, formerly known as beatX, made a strategic decision to rebrand and transition from PulseChain to Linea. The move was driven by limitations encountered on PulseChain, including the lack of developer tooling, a gated ecosystem, and declining trading volume. Linea's zkEVM compatibility, ConsenSys backing, and advanced developer tools offered compelling reasons for the migration. The rebranding represents a new identity as HorizonDEX aims to become the main liquidity hub within the Linea ecosystem, providing efficient trading services. The journey began in early 2023 with rigorous research and development during the Conceptual Phase. The team closely studied existing DEX models, particularly Uniswap-V2, identifying challenges like low price impact, impermanent loss, and low capital efficiency. Recognizing the potential of the Linea platform, they chose it as the ideal foundation for their project. In Phase 2, focusing on product development and community engagement. The introduction of an incentivized testnet campaign proved immensely successful, attracting a large and enthusiastic user base. During this phase, HorizonDEX also formed valuable partnerships with Linea and other high-potential ecosystem projects, synergizing resources and expertise for mutual growth. As Phase 3 approached, HorizonDEX focused on safety, undergoing three independent security audits to ensure a secure mainnet environment. The mainnet launch paralleled Linea's mainnet launch. And just after the mainnet launched being the 1st DEX live on the entire Llinea ecosystem we got immense love from the community that we hit 15 million trading volume in 1st week only. What’s next for your project? The HorizonDEX Team is determined to prioritize Expansion and accomplish several key milestones in upcoming time such as: -Launch DEX on Base chain -Analytical Dashboard -Bridge Integration -Post Launch Development and Support -Additional Swapping Features -Build More Ecosystem Partners -Shipping New Products What can your token be used for? The $HZN token has 3 Use Cases : -Utility -Governance -Incentives How is the token used for governance? $HZN can be used to vote and decide on the protocol's upgrade via HorizonDEX Governance Model. How is the token used as an incentive? $HZN can be staked within the protocol, and the users can earn the protocol’s staking rewards and fees. Who has audited ? HorizonDEX is successfully Audited by SOLIDProof, DEFIMOON and by Hacken. In addition, our code is built entirely on Kyberswap Elastic, which has undergone numerous audits with impressive results. HorizonDEX Adoption ? HorizonDEX has become the leading DEX in the competitive Linea ecosystem by exceeding expectations. With a trading volume of over $24 million and the TVL of $2.9 million, it has garnered substantial community support, boasting over 108k Twitter followers and +60k Discord users. HorizonDEX's strategic partnerships with Linea and other industry players have contributed to its success. The platform's unique concentrated liquidity model sets it apart from traditional AMMs, providing enhanced liquidity and trading experiences. As an early mover and innovator, HorizonDEX continues to drive growth and adoption within the Linea blockchain ecosystem. Who are partners of HorizonDEX ? HorizonDEX is supported by prominent players in the industry, including Linea, Celer cBridge, Particle Network, OKX, Arc Finance, Mendi Finance, and others.","links":"https://horizondex.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/horizon-2/logo.png","detail_platform":{"linea":{"decimal_place":18,"contract_address":"0x0b1a02a7309dfbfad1cd4adc096582c87e8a3ac1"}}}