{"name":"Virtuals Protocol","id":"virtual-protocol_base","symbol":"virtual","description":"Virtuals Protocol is a launchpad platform launched in 2024 that enables users to create, tokenize, and monetize AI agents for gaming, entertainment, and virtual environments without requiring technical expertise. Initially built on Ethereum's Base Layer 2 network, the protocol has expanded to Ethereum mainnet, Solana, and Ronin as of 2025. VIRTUAL serves as the base liquidity pair and transactional currency for all AI agent interactions across the ecosystem. The protocol operates through a bonding curve system where new AI agents are created with a 100 VIRTUAL fee. Users can buy and sell agent tokens until the agent reaches 42,000 VIRTUAL, at which point it graduates to a permanent liquidity pool paired with VIRTUAL. AI agents are multimodal, capable of text, speech, and 3D animation, and can manage on-chain wallets autonomously. Notable examples include Luna, an AI girl band vocalist with over 500,000 TikTok followers. The GAME framework powers agent functionality, enabling them to process inputs, generate responses, and remember past interactions. Virtuals Protocol was founded by Jansen Teng and Weekee Tiew, evolving from PathDAO, a gaming guild established in 2021 that pivoted to AI agents in January 2024. The team raised $16 million in seed funding led by DeFiance Capital and Beam. In 2025, major partnerships were announced with Animoca Brands and a collaboration with Zyfai and BasisOS to launch an Agentic Fund of Funds. Users can stake VIRTUAL tokens for veVIRTUAL to participate in DAO governance and may receive airdrops of agent tokens. When users interact with agents, they pay fees in VIRTUAL that generate protocol revenue. This revenue funds periodic buybacks and burns of the VIRTUAL token, reducing its total supply as a value-accrual mechanism for holders.","links":"https://www.virtuals.io/","market_cap":466201730,"market_cap_rank":154,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/virtual-protocol_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x0b3e328455c4059eeb9e3f84b5543f74e24e7e1b","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x0b3e328455c4059eeb9e3f84b5543f74e24e7e1b"}},"is_native":false}