{"name":"Titanium22","id":"titanium22","symbol":"ti","description":"What is the project about? Titanium Games is a cutting-edge venture in the blockchain gaming realm, leveraging the potential of Ethereum blockchain to architect unique single and multiplayer games. We offer not just an immersive gaming experience, but also a reward system involving $Ti tokens, Ethereum, and rare NFTs. Our project is a harmonious fusion of traditional gaming elements and blockchain technology, ensuring seamless gameplay alongside on-chain transaction security. What makes your project unique? Our uniqueness lies in the bridging of Web 2.0 gaming structures with blockchain technology, capturing the advantages of both. We provide a gaming experience that’s engaging and rewarding, with off-chain gameplay for smooth user experience and on-chain transactions for transparency and security. Plus, our games are designed to cater to a diverse gaming community, from solo players to PVP enthusiasts, and we're committed to continually developing new games that enrich the Titanium ecosystem. History of your project. Conceived by a mysterious collective known as the SevenDevs, Titanium Games was created with the vision to revolutionize the blockchain gaming landscape. We anticipate a successful launch of our first game, Ti-Miner, and will continued to grow our game portfolio and innovate, fueled by our passion for creating unmatched gaming experiences and a sustainable tokenomics model. What’s next for your project? We're in the process of crafting our next games, each designed to complement the unique tokenomics of $Ti. Moreover, we're planning to introduce the Tithereum NFT with a limited supply of 1k, where holders stand to benefit from a 33% profit share from our Ethereum side of the Ti-Miner game. Our goal is to become the premiere gaming coin not just on earth, but extending to Mars. What can your token be used for? Our native $Ti tokens are at the core of the Titanium ecosystem. They can be used for participating in our games, earning rewards, and gaining access to exclusive features. $Ti tokens not only offer utility within the gaming ecosystem but also present an opportunity for holders to participate in the governance and future direction of Titanium Games, helping us shape the future of blockchain gaming.","links":"https://www.ti22.io/","market_cap":25548,"market_cap_rank":8444,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/titanium22/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xc5170dd7386247cdb8c48545c803f5d0e3347022","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xc5170dd7386247cdb8c48545c803f5d0e3347022"}}}