{"name":"Qubic","id":"qubic-network","symbol":"qubic","description":"Forget What You Know. This is Qubic. Qubic is a decentralised Layer 1 network, where unmatched scalable tech meets artificial general intelligence (AGI), purpose built from the ground up to transcend the traditional limitations of blockchain. Qubic is redefining blockchain with feeless transactions and instant finality, and a unique PoW model (Useful Proof of Work) that channels computational power toward AI training, rather than wasting it. This is a network where mining serves a higher purpose. Qubic's network can empower industries such as finance, gaming, and supply chain management with real-time, cost-free transactions. Its architecture enables high-performance dApps encouraging developers to build reliable and scalable solutions. Useful Proof of Work (uPoW): Unlike traditional PoW, which wastes vast amounts of energy, uPoW focuses computational power on AI training, making mining meaningful. Aigarth Initiative: Aigarth lies at the core of Qubic's mission to achieve AGI. Through this initiative, computational power is generated by a global network of miners and channelled via UPoW towards artificial intelligence training with the aim of developing AGI by 2027. Aigarth represents Qubic's vision of a decentralised, community-powered AI network where advancements in AI are accessible to all, not controlled by any single interest. Bare Metal Architecture: Running directly on bare metal hardware, removing the need for an operating system, enables Qubic to maximise performance, enabling unmatched scalability and high-volume processing. Instant Finality: Qubic's sub-second finality ensures nearly instantaneous transactions, essential for applications needing real-time performance. Feeless Transactions: Qubic’s zero-fee model eliminates cost barriers, encouraging wider adoption and participation. Smart Contracts and IPOs: Qubic boasts the world’s fastest smart contracts, achieving up to 55 million transfers per second. It also redefines smart contracts. Investors can bid for shares when a new Qubic smart contract is released via an IPO. Quorum Consensus: Inspired by Leslie Lamport’s Byzantine Fault Tolerance, Qubic’s Quorum design ensures security and resilience even if some nodes fail. With foundations in Nick Szabo’s decentralised trust principles, Qubic’s governance prevents any single entity from gaining control, maintaining a secure and truly decentralised network. Become part of the Qubic ecosystem, where decentralised blockchain and AI unite. Visit our website, become a miner or a developer, or engage with the Qubic community as we work together to redefine blockchain technology and AI for a new era.","links":"https://qubic.org/","market_cap":296175421,"market_cap_rank":263,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/qubic-network/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}