{"name":"HXAcoin","id":"hxacoin","symbol":"hxa","description":"The Herencia token is the native utility token of the Herencia platform. The main features: - Staking program - Collaboration with real-world items Brands - User-Tier levels system Herencia token serves multiple purposes, including but not limited to: 1.Staking and Rewards: The HXA token can offer a staking mechanism where token holders can lock or stake their tokens on the platform. By staking HXA tokens, participants can earn rewards in the form of additional tokens, discounts on purchases, or access to exclusive features and events. 2.Governance and Voting: HXA token holders may have governance rights within the platform, allowing them to participate in decision-making processes. They can vote on proposals, such as new clothing brand partnerships, platform upgrades, or changes to token economics. This gives token holders a voice in shaping the direction of the project. 3.Loyalty and Rewards Program: The HXA token can be used as part of a loyalty and rewards program. Token holders can earn rewards based on their engagement, purchases, or referrals, which can be redeemed for discounts, special privileges, or unique experiences within the real-items ecosystem. 4.Exclusive Access and Benefits: Holding HXA tokens can grant users exclusive access to events, experiences, or collaborations with real items brands. Token holders may receive priority access to new releases, early access to sales, or invitations to exclusive item presentation shows or brand events. 5.Tradable Asset: The HXA token can be traded on cryptocurrency exchanges, allowing token holders to buy, sell, or trade their tokens with other users. This provides liquidity and the potential for token value appreciation based on market demand. 6.Incentives for Engagement: HXA tokens can incentivize user engagement within the platform and the broader community. Active participation, such as referring new users, creating content, or contributing to discussions, can be rewarded with HXA tokens, fostering a vibrant and engaged community.","links":"https://www.hxacoin.io/","market_cap":4284.5,"market_cap_rank":4741,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hxacoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x15c1cab705b9ddb9ffeeea608ed8bafcdd4c0396"}}}