{"name":"Sophon","id":"sophon_arbitrum-one","symbol":"soph","description":"What is Sophon? Sophon is an innovative consumer entertainment platform dedicated to onboarding the next generation of crypto users through everyday useful products that monetize and reward the data we all naturally produce. Built as a modular rollup powered by the ZK Stack, Sophon creates an intuitive ecosystem where users can engage with gaming, social, AI, prediction markets, and more without the typical complexities of blockchain technology. Through zkTLS technology, Sophon transforms everyday online activities into valuable assets that users can control and benefit from while maintaining privacy. This consumer-focused platform bridges traditional applications and blockchain benefits, providing both a developer framework and a user hub for crypto-powered consumer experiences. What is the project about? Sophon differentiates itself through several key innovations: User-Centric Design: Sophon prioritizes beautiful, simple, and accessible experiences, making blockchain technology invisible to end users while delivering its benefits. Social Oracle: Leveraging zkTLS technology, Sophon's Social Oracle verifies and brings online achievements, reputation, and social influence onchain without revealing personal data. This transforms scattered social signals into collective intelligence that powers applications. Native Account Abstraction: Users can sign up with familiar methods like Google or Apple accounts, creating self-custodial wallets in the background without the complexities of traditional crypto onboarding. Gasless Experience: Through paymasters from the ZKsync codebase, Sophon offers a seamless platform that eliminates transaction fees for end users, significantly enhancing the overall experience. Entertainment Focus: Rather than competing solely for existing crypto users, Sophon targets entertainment verticals that already have proven traction, including gaming, gambling, sports betting, ticketing, and consumer AI. About the SOPH Token The SOPH token serves as the foundation of the Sophon Network, playing essential roles in both current and future operations: Gas Fee Payments: All transactions on the Sophon Network require gas paid in SOPH. However, thanks to native paymaster technology, end users don't necessarily need to hold SOPH themselves, as transactions can be subsidized by applications or the network. Network Security: SOPH enables the decentralization of Sophon's sequencer through staking. This mechanism supports the cryptoeconomic security of the network while distributing rewards to participants. Staking Rewards: Token holders can stake SOPH directly or delegate to Full Nodes (Guardian NFT holders with sufficient delegations). Stakers receive a portion of gas fees and potentially additional ecosystem rewards, with rewards compounding automatically. Deflationary Model: SOPH staking utilises an inverse square root reward model, inspired by Ethereum, which means that a portion of rewards are unutilised when less than 100% of the total circulating supply is staked. These unutilised rewards are sent to a separate contract where they are either burnt or redistributed as rewards to users. With a portion of unutilized rewards being burned and no ability to mint new tokens, the supply gradually decreases over time. SOPH Tokenomics SOPH has a fixed total supply of 10,000,000,000 SOPH tokens. At TGE 2,000,000,000 tokens will be in circulation, with the remainder subject to vesting schedules.","links":"https://sophon.xyz/","market_cap":30044510,"market_cap_rank":885,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sophon_arbitrum-one/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x31dba3c96481fde3cd81c2aaf51f2d8bf618c742","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x31dba3c96481fde3cd81c2aaf51f2d8bf618c742"}},"is_native":false}