{"name":"Javsphere","id":"javsphere","symbol":"jav","description":"Javsphere offers the next generation of Decentralized Finance (DeFi) products. Our ecosystem is being built upon the foundation of DeFiChain, a blockchain based on Bitcoin code that brings native DeFi capabilities to Bitcoin. On top of native DeFi, DeFi Meta Chain (DMC), was added as a functionality upgrade. DMC enables projects to build on the EVM-compatible layer quickly and deploy dApps and Smart Contracts (SC). Through the DMC, DeFiChain connects Bitcoin with Ethereum. Javsphere Products include: Javsphere comprises 6 innovative crypto product categories, all interconnected through reward mechanisms. StakeX: A unique staking mechanism that offers JAV or DUSD rewards block by block for holding JAV or DUSD tokens. CryoVault: Like a DeFi freezer or token lock-up concept, CryoVault offers enhanced rewards for locking up JAV or DUSD tokens over an extended period. Javsphere pays all earned rewards in JAV or DUSD. TradeX: TradeX revolutionizes the trading of dTokens within the DeFiChain ecosystem by enabling direct buying and selling through the Javsphere user interface on the DMC, without the need to use DeFiChain’s Light Wallet. AutoPilot: AutoPilot is our automated portfolio manager, constantly rebalancing your tokenized assets through SCs with plans for yield generation. LeverageBooster: LeverageBooster empowers users with a high multiple leverage on tokenized assets (=dTokens) within the DMC ecosystem for amplified trading opportunities. YieldFusion: Combining various liquidity mining and DeFi mechanisms, YieldFusion generates enticing rewards for users. YieldFusion connects our own and other services from external DMC projects, increasing yield within the Javsphere. All rewards are paid out in JAV, allowing users to access top DMC projects seamlessly without leaving the Javsphere with attractive APYs.","links":"https://www.javsphere.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/javsphere/logo.png","detail_platform":{"defichain":{"decimal_place":18,"contract_address":"0x66f3cf265d2d146a0348f6fc67e3da0835e0968e"}}}