{"name":"Lumino","id":"astarter","symbol":"$lmn","description":"What is the project about? Lumino is a key DeFi infrastructure hub on Cardano that features four core applications: Launchpad(Launchpool), DEX, Money Market & Tech Service Platform, with the backing of EMURGO, a founding entity of the Cardano protocol. Lumino aims to elevate its contribution and bring broader possibilities to the Cardano ecosystem by providing fair, safe, and accessible open finance services to meet existing and future demand in accelerating DeFi apps to empower the next generation of projects built on Cardano. What makes your project unique? Lumino addresses and improves upon issues in mainstream DEXs with a design implementation that minimizes the core smart contract component logic; this component is allowed to maintain the flow of liquidity provider's funds, thus making the system more scalable and secure. The core contract component of the system gets initialized by driver contracts that manage the required sequence of transaction validations, routing and calculations. History of your project. The Lumino project was founded in early 2021 when the founding team published their litepaper outlining the vision for the platform. The first version of the Lumino DEX closed beta launched in April 2023. The ADEX V2.0 open beta test launched on 30th August and will later officially deploy on the Cardano Mainnet. What’s next for your project? Now Lumino DEX(ADEX) V2.0 open beta test is live on Cardano Mainnet . We will soon start develop ADEX V3.0 What can your token be used for? (Utility, NOT tokenomics) AA token is the heart of Lumino, which acts as a governance token and native utility token for the community and project infrastructure. At the same time, the AA token is also the reward payment token of Lumino, AA1 pool. The rewards to users participating in Lumino ISPO stage 1 are in the form of AA tokens. AA tokens staked within the Lumino staking ecosystem can contribute towards merge-staking rewards in the second stage of the ISPO (Merge Staking Protocol). Lumino staking ecosystem is multifaceted with elements and functions that include Launchpad tier level access, Lumino Decentralised Exchange (ADEX) AMM liquidity provisions, Money Market yield generating lending, and collateralized borrowing. Where can you buy Lumino? $LMN tokens are currently unavailable to trade on exchanges listed on CoinGecko. Information will be updated when the token is available on centralized/decentralized exchanges. When can we expect Lumino ($LMN) tokens to launch? While CoinGecko cannot provide details on the launch of $LMN tokens, you can stay updated on $LMN's price movements by adding $LMN to your watchlist.","links":"https://www.luminodefi.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astarter/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}