{"name":"PlatinCoin","id":"platincoin","symbol":"plc","description":"The PlatinCoin is based on Litecoin Technology. It is not only a new generation of cryptocurrency but, together with the PlatinCoin Cryptosystem, also an extremely flexible and multifunctional platform that allows everybody to create a wide variety of daily business operations without the delay of payment for goods and services, for example such simple things as the purchase of your daily coffee, online purchases or payments for your international travel insurance. The PlatinCoin is designed to become the most used cryptocoin worldwide, especially by international users not being able to own a bank account. Its underlying blockchain technology facilitates the daily high volume of payments. PlatinCoin provides fast, inexpensive, international and secure transfers by form of immediate payment. The advantages of PlatinCoin will appropriately address the respective payment needs of individual as well commercial users like merchants and service providers. In addition, the introduction of the PlatinCoin Debit Card will further contribute to the commercial viability of the PlatinCoin. PlatinCoin intends to become a central transmission point for FIAT money. Fast transaction periods and low variability risks will be applicable. Additionally, comprehensive payment facilities such as debit cards, ATM’s, etc. are being implemented to become a suitable payment method on high scale for clients and merchandisers. The PlatinCoin moreover aims to contribute to the improvement of people’s standard of living worldwide. This shall especially apply to people in developing countries who do not even have a bank account. As an instrument to increase prosperity, we have developed the PlatinCoin Minting Program. This Program allows nearly everyone to easily produce PlatinCoins themselves.","links":"https://platincoin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/platincoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}