{"name":"STAN Token","id":"stan-token","symbol":"stan","description":"What is the project about? Stan is a cryptocurrency token that was developed with the aim of creating a new decentralized financial ecosystem and to create a community-driven ecosystem that is built on trust, transparency, and fairness. Our developers believe that by creating a decentralized financial system that is free from the influence of centralized authorities, they can empower individuals and create a more equitable world. What makes your project unique? STAN distinguishes itself from other meme-based cryptocurrencies through its focus on charitable giving and community involvement. A portion of the project's transaction fees is set aside for charitable donations, with the community having a say in which causes to support. History of your project. The name Stan is likely a reference to the popular Eminem song Stan, which has become a popular internet meme over the years. Team is made up of experienced developers and marketers, STAN has gained a significant following on social media platforms, with the project's Telegram group and Twitter account rapidly growing in size. What’s next for your project? STAN next steps include the launch of centralized exchange, which will enable users to trade STAN tokens. Team is working on creating a mobile app and a merchandise store to increase engagement and brand awareness. STAN also plans to establish partnerships with other projects in the cryptocurrency space to further expand its reach and impact. What can your token be used for? Holding STAN tokens enables users to participate in the project's governance system, where they can vote on proposals and help shape the future direction of the project. Users can stake their STAN tokens to earn rewards through the project's staking program.","links":"https://www.stantoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stan-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x52f9ca8cac2827d379068b069580f9fd730cc9f3"}}}