{"name":"Trivians","id":"trivian","symbol":"trivia","description":"New Gen Trivia Games in One Single Platform; Play - Compete - Learn - Earn Trivians is the ultimate trivia&puzzle gaming platform for play2earn ecosystem. The token and the idea has been culminated from a 3-years-old global Play2Earn trivia game, namely OynaKazan/Trivia Superstars (Play&Earn in Turkish), with more than 5 Million downloads and 1.5 Million monthly active users at its peak. This assures Trivians game and team has already delivered a huge proof of concept on democratization of trivia game show business. Trivians is a multiplayer game, which awards players with Trivian Token, according to their correct answers at different game modes and competitions. It is a decentralized version of classical game shows like “Who Wants to be a Millionaire”, “Jeopardy”, “Weakest Link” etc, all in one place. Trivians have established a huge proof of concept on democratizing and decentralizing the quiz game show business. Trivia play2earn game concept is very easy to adopt globally, and the market is huge. (Estimated target player market size is 2 Billion players) Trivians wants to become the first blockchain game which successfully onboarded non crypto users and goes truly mainstream. Trivians provides a variety of game modes such as multiplayer mode, single player mode, 1v1 games, instant play, scheduled tournaments and live shows. There are over 100K questions archived and they are being renewed on a daily basis by a dedicated editor team. With live stream games, our users have the chance to interact with host and the other trivia lovers all over the world. Our Vision is; To become a leading trivia genre in the blockchain game ecosystem by gathering all quiz & puzzle types of games on a single platform To enable millions of people, young and old alike, both to have fun and to turn their intellectual knowledge into money. To ensure that the game is played for years with the sustainable economic model we have created, with continuously renewed game types and quest","links":"https://trivians.io/","market_cap":97874,"market_cap_rank":4903,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trivian/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":3,"contract_address":"0xb465f3cb6aba6ee375e12918387de1eac2301b05"}}}