{"name":"AVA (Travala)","id":"concierge-io_ethereum","symbol":"ava","description":"What is the project about? AVA plans to tokenise the concept of loyalty reward programs using blockchain technology. The AVA token functions as the key to accessing web3 loyalty programs and provides perks to end users, such as AVA payment discounts, AVA loyalty rewards, gated access benefits, and more. Launched in 2017, the AVA Foundation says their overarching mission is to create a decentralised and self-sufficient blockchain-based loyalty ecosystem with AVA at its core. What’s next for your project? AVA is a web3 loyalty program token designed for projects across all industries. From discounts to loyalty rewards, AVA powers blockchain-based loyalty programs via a plug-and-play approach. What can your token be used for? Travel Bookings: AVA can be used to book more than 3 million travel products on Travala, including hotels, homes, flights, and activities in over 230 countries. Discounts & Rewards: Travel bookings paid with AVA receive a discount of up to 3% on the total booking price, as well as a cashback of up to 2% in AVA. Loyalty Program: AVA unlocks further benefits via the Smart Loyalty Program, which provides users with discounts of up to 10% on travel bookings. Travel NFTs: AVA paired with Travel Tiger NFTs unlocks the Diamond membership, with exclusive benefits such as Travel Credits, Airport Lounges, VIP Concierge, and Travel Drops (unique travel experience giveaways). Open Passport: With AVA, users can access the Open Passport to collect digital NFT stamps for every travel booking. Each NFT serves as “proof of travel” and, in the future, will unlock rewards and discounts. Voting: AVA grants voting rights to users based on their Smart loyalty membership level to have a say on how funds in the AVA Community Pool are spent. Payments: AVA use cases extend to other platforms, allowing users to shop and spend with AVA at millions of merchants via Binance Pay and Simplex or pay bills. Governance: As the AVA ecosystem becomes more decentralised, AVA will be the governance token needed to vote for future changes and improvements to the ecosystem. AVA Deals: Travala will launch a new travel offer initiative named “AVA Deals”, with thousands of travel products at heavily discounted prices (up to 70% off) bookable exclusively with AVA.","links":"https://www.travala.com","market_cap":19664067,"market_cap_rank":1126,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/concierge-io_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa6c0c097741d55ecd9a3a7def3a8253fd022ceb9","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xa6c0c097741d55ecd9a3a7def3a8253fd022ceb9"}},"is_native":false}