{"name":"Bonsai Coin","id":"bonsai-coin","symbol":"bonsaicoin","description":"$BONSAICOIN is a community token that adds real bonsai to the ecosystem under the theme “We make Bonsai.” Overview ・Token Name: BONSAI COIN ・Symbol: $BONSAICOIN ・Supported Chain: Astar zkEVM ・Issuance: 803,100,000,000,000 ・Issuer: Hyper Dimension Limited (BVI) ・Contract Address: 0x90E3F8e749dBD40286AB29AecD1E8487Db4a8785 Allocation ・Fundraising: 1% ・Community: 75% *1% is at TGE, 74% in subsequent rounds ・Liquidity: 6% ・Team: 17% *Cliff 12 months, Besting 36 months ・Advisor: 1% *0.1% at TGE, 1 month cliff, 23 months besting Tokenomics ・Buyback from Bonsai Profits ・BONSAI 100 Ketsu ・Get $BONSAICOIN Buyback from Bonsai Profits $BONSAICOIN is a community token that adds a “real bonsai market” to the ecosystem. $BONSAICOIN aim to increase the value of itself by buying and burning $BONSAICOIN from the market with a portion of the profits from the sales of the partner bonsai gardens and bonsai stores. Frequency: Once a year *next in 2025 Partner: BONSAI NFT CLUB *to be added BONSAI 100 Ketsu A ranking system that is activated when $BONSAICOIN has a “market capitalization of $100M or more”. Definition of BONSAI 100 outstanding Condition 1: Market capitalization of $100M or more for $BONSAICOIN Condition 2: Total*1,000USD (500USD on each side) or more liquidity provided to the designated DEX Condition 3: Top 100 liquidity providers (in USD) within the designated DEX BONSAICOIN/USDC pair *Designated DEX: Very Long Swap (*to be added) The 100 Best Holders will receive a seasonal bonsai tree each season as proof of their 100th rank, and will also be eligible for a variety of other benefits. Ranks 1st~10th: Hashira — Pillar 11~30th: Sanjushi — The 30 best 31st~100th: Hyacketsu — Hundred Excellence *Prizes are subject to change according to rank. Get $BONSAICOIN At least once each year*, new $BONSAICOIN will be issued from within the Community Allocation. The amount of new issuance will increase or decrease depending on each wallet’s activity over the past year and other factors. *One issue will always take place on New Year’s Day each year. Stay tuned for more details! Roadmap Roadmap for $BONSAICOIN based on the aforementioned tokenomics. 2024 Q3: TGE, BONSAI 100 Ketsustarted Q4: Send 100 Ketsu Bonsai, Get $BONSAICOIN snapshot 2025 Q1: Get $BONSAICOIN Q2: Art x Bonsai sales Q3: Buyback & Burn Q4: Get $BONSAICOIN snapshot Repeat from * onwards","links":"https://coin.bonsainft.club/","market_cap":2478604,"market_cap_rank":3031,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bonsai-coin/logo.png","detail_platform":{"astar-zkevm":{"decimal_place":18,"contract_address":"0x90e3f8e749dbd40286ab29aecd1e8487db4a8785"}}}