{"name":"gAsp","id":"gasp","symbol":"gasp","description":"What is gAsp (GASP)? gAsp is a decentralized blockchain that serves as the gas coin for the Aspire platform. gAsp’s blockchain is utilized for recording all assets and tokens created on Aspire as well as their transactions. gAsp is a Proof-of-Work blockchain with integrated real time checkpoints. This advanced security feature protects the gAsp blockchain from 51% mining attacks and double spending. The gAsp blockchain also has 4MB blocks to allow for more transactions while supporting a block time average of 2 minutes. gAsp is a decentralized minable blockchain, currently there is no financial gain or reward for mining the blockchain. This reward may change later in order to support future smart contract implementation on Aspire. gAsp is an open-source experimental blockchain project built using code from Bitcoin, Litecoin, Peercoin as well as small bits of code from other projects in the space. gAsp was built specifically for Aspire https://aspirecrypto.com/ but also is a standalone blockchain and does not require Aspire in order to operate. How Many GASP Coins Are There in Circulation? gAsp launched its mainnet on July 4th, 2020 with 1 billion GASP tokens created at genesis. No additional GASP will ever be created. gAsp is fully premined and Aspire Technology Inc sells tokens to exchanges as they are needed by community demands. 45% qual to 450 million GASP was allocated to Aspire Technology Inc, these GASP are locked. 25% equal to 250 million GASP was offered by a Bermuda crowdsale (Non-USA Residents) 26% of the private sale sold authorizing 61,483,651 GASP into circulation. 21% of the unsold GASP from the crowdsale were airdropped to bCommerce labs authorizing 52,000,000 GASP into circulation. The remaining 53% equal to 136,516,349 of unsold GASP private sale are locked up. 20% or 200 million GASP was allocated to founding members, these GASP are locked. 10% or 100 million GASP was allocated to external development, these GASP are locked. All coins not sold or allocated from the crowdsale are unlocked at 12.5 percent quarterly beginning December 30, 2020. Who Are the Founders of gAsp? The Aspire/gAsp project officially began April 10th, 2017 and was founded by Jim Blasko of Las Vegas Nevada and Michael Terpin of San Juan Puerto Rico. The gAsp blockchain mainnet was launched on July 4th, 2020. Jim Blasko is a blockchain developer and crypto pioneer known for mining Bitcoin in late 2010, and developing early altcoins such as UnbreakableCoin, Voxels, eBoost, and X-Coin. Jim is the founder of Bitcoin Talk Radio, and Cryptos.io. He has taken roles on other teams including Lunch Money, Talent Joe, FLASH, NetCoin, PIVX, Jewelz, Guardium, Neutron, and Minex. In 2013 Jim teamed up with Michael Terpin to launch bCommerce Labs, a blockchain incubator. Jim is actively found at Bitcoin conventions as a speaker and is now leading Aspire/gAsp. Michael Terpin is founder and CEO of Transform Group , whose divisions include Transform PR, a global public relations firm that has served more than 200 clients in the blockchain field and helped launch more than 100 ICO’s, including Aeternity, Augur, Dent, Ethereum, Factom, Golem, MaidSafe, and Neo; Michael is also the founder of CoinAgenda, a global event series for cryptocurrency investors and blockchain innovators since 2014 and Transform Strategies, the company’s advisory division. How is the Aspire Network Secured? Aspire and the assets/tokens created on Aspire are secured via [proof-of-work]( https://coinmarketcap.com/alexandria/article/proof-of-work-vs-proof-of-stake/) mining on the gAsp blockchain. The gAsp blockchain is protected by checkpointing every block preventing 51% attacks and double spending on the Aspire platform. What Makes Aspire Unique? Aspire improves on speed, cost, and security for creating both fungible and non-fungible digital assets and tokens. Easy to use - Aspire allows anyone to create assets/tokens in under two minutes. Speed – Instant transactions and two-minute confirmations make Aspire 5 times faster than Bitcoin. Cost Efficient - 1 GASP allows more than 300,000 transactions of any asset created on the Aspire platform making it the most cost-effective platform in the world. Security – The first asset creation platform running on a [proof-of-work](https://coinmarketcap.com/alexandria/article/proof-of-work-vs-proof-of-stake/) blockchain secured with advanced checkpointing.","links":"https://aspirecrypto.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gasp/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}