{"name":"Nodewaves","id":"nodewaves","symbol":"nws","description":"Describe Nodewaves: With the goal of investing in wellness, blockchain and healthcare professionals founded Nodewaves, a gamified Web3 health and wellness platform. An environment that encourages you to make healthy decisions, teaches you how to take care of others and yourself, and gives you the power to own and manage your health data is helping to achieve this goal. Through the use of blockchain technology and a special Proof of Action distribution algorithm, Nodewaves is reinstating personal accountability and making self-care an activity that generates rewards. Describe NWS: What are Nodewaves Nodes? At the foundation of the Nodewaves ecosystem are Nodewaves Nodes, which confirm transactions, earn daily NWS distribution, and provide governance for the blockchain. Community members can become Node NFT Owners by purchasing node licenses. which you can learn more about here: https://nodewaves.com/node Combining Nodewaves and NWS results in Nodewaverse, which shocks or excites people into action. The Nodewaves Blockchain's native utility currency NWS, rewarded everyone who behaves morally in the ecosystem, and operate Node NFT. How Many NWS token Are There in Circulation? NWS has a maximum supply of 10,000,000,000, half of which were distributed to Node NFT Owners and Others section as per our tokenomics through the Nodewaves Blockchain in the first year. Each year thereafter, the amount of NWS issued is half of the previous year’s allocation. The official start date of year-one points accrual was April 16th, 2023 at 00:00 UTC, serving as the date for annual halvings. Once someone becomes a Node NFT Owner, they also become a member of the Node Network DGF (Distributed Governance Framework), a blockchain coordination protocol made up of Nodewaves Node Owners. The Node Network DGF established the initial rules of the Nodewaves Blockchain prior to launch through a \"Charter\" vote, which was accepted by a majority of Node Owners .","links":"https://nodewaves.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nodewaves/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x13646e0e2d768d31b75d1a1e375e3e17f18567f2"}}}