{"name":"EMMA","id":"emma","symbol":"emma","description":"Meet Emma, the quirkiest kid on the block! Emma is all about keeping a positive and upbeat attitude towards life. Her hilarious meme expressions have taken the Solana network by storm, making everyone laugh out loud! Emma isn’t your average character—she’s a bundle of fun and humor, and she’s gone viral on social media faster than you can say \"meme magic.\" With her unique charm and creative meme content, Emma has built a fan community that’s as strong as her love for pizza (and trust us, that’s saying something!). Why Is Emma So Awesome? Meme Queen Extraordinaire: Emma’s expressions are meme gold. From goofy grins to epic facepalms, she’s got it all. You’ll find yourself sharing her memes everywhere! Viral Sensation: Emma’s fans are growing by the second. Her quirky antics have everyone hooked, and she’s the talk of the internet. Move over, cats of the internet—Emma’s here to stay! Community Vibes: The Emma fan community is like one big happy family. We laugh together, share memes, and enjoy the positivity that Emma brings to our lives. What Can You Do with $EMMA Tokens? Join the Fun: Use $EMMA tokens to access exclusive content, in-game items, and special events. Imagine having the coolest Emma gear in your favorite game! Collect Cool Stuff: Buy Emma-themed merchandise and NFTs that are as unique as Emma’s personality. Show off your collection to friends and fellow fans. Support Creativity: Tip our talented creators who bring Emma’s adventures to life. Your tokens help fuel even more awesome content. The Future Looks Bright (and Hilarious) We’re just getting started! Emma’s journey is filled with endless possibilities and tons of laughter. From new meme drops to exciting partnerships, there’s always something fun on the horizon. So buckle up, $EMMA community, and get ready for a rollercoaster ride of humor, creativity, and good vibes. Let’s make the world a funnier place, one meme at a time!","links":"https://emmasolana.org","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/emma/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"EsHPT8Sf7YP9eRhtfZzYvqjMnXxPeM6KZcpb1YNh2fBz"}}}