{"name":"Vision Metaverse","id":"vision-metaverse","symbol":"vs","description":"Vision has a complete incentive and promotion mechanism to ensure that the number of people in the community continues to grow and ecological applications continue to increase. Vision also has a complete inflation and deflation mechanism to maximize the protection of the interests of partners while ensuring the stability of VS price. The innovation of Vision’s token ecology lies in: Auto-adjusted inflation rate and market value model Through a complete calculation model, Vision will decentrally adjust the balance of Vision’s market value, price, and issuance according to the current market conditions, so as to achieve the role of protecting benefits and stabilizing value. Permanent community promotion fund support with permanent developer fund support is available on Vision Network. Through the growth of Vision, the fund pool will continue to increase by the accumulation of on-chain fees, and the expansion of the fund pool will also ignite the enthusiasm of community promotion and developers, which will make Vision further expand. The further growth of Vision will also accumulate a larger pool of funds ensuring the rapid development of the Vision community and decentralized application ecology. Believers can have a higher rate of return through a larger number of votes Vision Network also optimizes the reward mechanism of traditional PoS. Ordinary addresses with greater participation and higher contributions, which are called “believers”, can also get higher rewards. Provides a unique “current savings” high liquidity pledge method as an option The unique “Spread mint” method of minting provides great support for those who vote and have liquidity requirements, similar to depositing a demand deposit.","links":"https://www.v.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vision-metaverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0xcd76bc49a69bcdc5222d81c18d4a04dc8a387297"}}}