{"name":"Halloween Floki","id":"halloween-floki","symbol":"floh","description":"Halloween Floki (FLOH) is a meme cryptocurrency token operating on the BEP-20 Blockchain technology (Binance Smart Chain). The token was launched on September 1st, 2022. The project is created by the exact team behind Valentine Floki (FLOV), constituted of experienced programmers, cryptocurrency investors, and marketers who have a deep understanding and knowledge of the BSC DeFi space. The team designed a project based on definitive market rules and fundamental economic principles. Halloween Floki reconciles a high-performance protocol with integral price stability features. The smart contract has three taxes integrated in it: the rewards tax, the marketing tax and the liquidity pool tax. There is also an anti-whale mechanism programmed in the contract, preventing a single transaction above 1% of the total supply to be executed. The team has performed a KYC process prior to launching the project and its presale, which occurred on August 30th, 2022. The contract has undergone an audit with great results, increasing confidence and trust in the project for the current and future investors. Halloween Floki’s total supply initially accounted for 1 trillion FLOH, but the team made the decision to burn one third of the supply before the presale in order to dispose of unnecessary tokens. FLOH aims to peak at the highest market cap a Floki sub-project has ever reached, all while distributing large amounts of BUSD rewards every day to its holders. Investors can track their accumulated rewards via a partnered reward tracker app and claim their pending BUSD whenever they want. The Halloween Floki community brings together investors from every corner of the world and generates daily interacting contents such as games and contests. Staking, lotteries, NFTs and daily raffles are on the menu.","links":"https://halloweenfloki.co/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/halloween-floki/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x2c0e76dade015bc390a13c1b80cc1bafd9edd326"}}}