{"name":"MapMetrics","id":"mapmetrics","symbol":"mmaps","description":"\"What Is MapMetrics (MMaps)? MapMetrics is a crypto navigation app designed to improve users' navigation experience by showing them the most convenient way from A to B. The online community updates live road conditions faster than any other company could while getting rewarded for optimizing the platform. You make the platform, you get the rewards. It’s built by the community for the community. What Makes MapMetrics Unique? MapMetrics is the world's first community-driven navigation app that allows users to get rewarded for their data. By sharing their location with the network, and updating live road conditions, users are able to earn crypto and NTFs while navigating on the app. The unique advertising feature within the app allows users to collect coupons and NTFs while driving around. Earnings will be sent directly to the users' wallets. Advertisers can only buy this advertising space by purchasing MMaps that will increase the value of the tokens earned by the community. Users will be able to use their NFTs as avatars on the road for other community members to see. This allows them to be unique on the road, and even trade NFTs with other users, creating a gamified navigation experience. MMaps is the native utility token that is used for: Rewarding users for sharing their data. Allowing third parties to buy data sets or advertising space. MapMetrics tools include: Free navigation app to collect coins, tokens, and NFTs. Special Position Tracker (SPT), hardware to increase earnings and data accuracy. How Many MMaps Tokens Are There in Circulation? MapMetrics tokens launched on October 2021, there is a maximum supply of 64 billion MMaps. 84% goes to validators, 1% will be used for the ICO, 5% for marketing, and 10% goes to the MapMetrics treasury.\"","links":"https://mapmetrics.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mapmetrics/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}