{"name":"AVATARA NOX","id":"avatara-nox","symbol":"nox","description":"What is AVATARA and NOX? - AVATARA is a top-end action MMORPG where one can enjoy the God’s powers in your character. (Avatar: NFT) Users sign-up for a guild in the AVATARA universe, grow their characters, participate in battles and wars to earn rare items and utility tokens. In addition, items and avatars (NFT), and even characters can be freely traded among users in the game. Previously unguaranteed in WEB2 MMORPGs, this is returning the ownership of items and characters back to the users. Although we have just begun, the AVATARA team plans to expand beyond our platform and into the vast WEB3 world. We focus on the fun of ‘possible embodiments’. We believe that a game that ‘provides entertainment through real embodiments’, rather than merely ‘overlaying’ blockchain/NFT technologies, is the catalyst of bringing WEB2 users to WEB3. To do so, in PHASE 1, the focus will be placed on an MMROPG game’s most important ‘fun of battles’ and ‘improving business models and approachability’ of the blockchain. In PHASE 2, expansion will be focused on the ‘interoperability’ of the WEB3. This is so because we believe that WEB 3 can only operate when users show continuous joy playing a game with a strong base. AVATARA has a multi-token economy system using NOX/TARA as a means to enjoy the game more vividly. The governance token of AVATARA, and its use in DAO will be added later. It is also used for minting NFTs, which is the most important element in the world of AVATARA. NOX Tokens can be obtained by purchasing from Dex such as Klay Swap or by participating in certain in-game content (such as Siege). In AVATARA, you can collect utility tokens as reward from Web-app / in-game play. The utility token reward amount is partially related to the increase of the NOX price.","links":"http://avatara.online/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/avatara-nox/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0x5166fa1acba89e5e0de27841a1110b7f9ac112da"}}}