{"name":"Lux SideQuests","id":"lux-sidequests_solana","symbol":"lsq","description":"# Lux SideQuests (LSQ) ## What Is Lux SideQuests? Lux SideQuests is a Twitch chatbot that enables community-funded challenges for streamers through its SideQuest Sub mechanism. Built on Solana blockchain, Lux operates directly within streamer channels, allowing viewers to collectively create and fund challenges using a standardized contribution model. The chatbot facilitates a structure where each SideQuest Sub costs $6.99, consisting of a Twitch gifted subscription plus $1.00 additional contribution. This allows communities to pool resources for challenge prize pools while streamers receive compensation through Twitch's subscription system. The chatbot handles all transaction processing, challenge tracking, and reward distribution without requiring streamers or viewers to leave the Twitch platform. LSQ is the native utility token used for: * Providing liquidity within the protocol's economy * Facilitating transactions between participants * Enabling governance participation for protocol development * Rewarding active community members through the chatter reward system Lux accepts both traditional payment methods (credit and debit cards) and cryptocurrency (USDC on Solana), making participation accessible regardless of blockchain experience. When streamers complete challenges tracked by the bot, they receive accumulated gifted subscriptions directly through Twitch, while 5% of additional fees are distributed to active chat participants. ## How Does Lux SideQuests Work? The chatbot monitors channel activity and facilitates the SideQuest Sub mechanism, which standardizes community contributions at $6.99 per unit. This amount includes one Twitch gifted subscription valued at $5.99 plus $1.00 that contributes to the challenge prize pool. Viewers interact with Lux through chat commands to purchase SideQuest Subs, propose challenges, and track progress toward completion. Communities can purchase multiple SideQuest Subs to increase challenge stakes, with the bot aggregating contributions in real-time. Upon challenge completion, Lux automatically distributes gifted subscriptions to the streamer through Twitch's API integration. The accumulated prize pool from additional dollar contributions is then awarded to a randomly selected viewer participant who engaged during the challenge. The chatbot leverages Solana blockchain technology for transparent transaction processing and efficient settlement. Users can pay with traditional payment methods or USDC cryptocurrency, with all transactions recorded on-chain for verification. This infrastructure operates behind the scenes while maintaining a seamless chat experience. ## Who Are the Founders of Lux SideQuests? Information about the founding team of Lux SideQuests is not publicly disclosed in available documentation. The project focuses on building chatbot infrastructure at the intersection of live streaming, gaming, and blockchain technology. ## What Makes Lux SideQuests Unique? Lux SideQuests distinguishes itself by operating entirely within the Twitch chat environment rather than requiring external platforms or applications. The chatbot integrates with existing streaming infrastructure, allowing streamers to receive compensation through familiar channels while adding a collaborative funding layer accessible through simple chat commands. The standardized SideQuest Sub pricing at $6.99 removes complexity from community pooling. Viewers understand exactly what their contribution represents through bot-displayed information, making it simple to coordinate larger challenges without complicated calculations or variable pricing structures. The chatbot's payment flexibility accommodates both cryptocurrency users and those who prefer traditional payment methods. This approach lowers barriers to entry while maintaining blockchain benefits such as transparency and efficient settlement, all processed through bot interactions. The chatter reward system, which distributes 5% of additional fees to active community members, creates an incentive structure that encourages sustained engagement. The bot tracks participation and automatically handles reward distribution, fostering more interactive streaming communities without manual intervention. ## How Many LSQ Tokens Are There in Circulation? Specific tokenomics details including total supply, circulation numbers, and distribution mechanisms for LSQ tokens have not been disclosed in available documentation. ## How Is the Lux SideQuests Network Secured? Lux SideQuests operates on the Solana blockchain, which uses a Proof-of-Stake consensus mechanism combined with Proof-of-History for transaction ordering. This infrastructure provides the security foundation for all on-chain transactions processed by the chatbot. The bot's integration with Twitch relies on secure API connections to ensure proper distribution of gifted subscriptions. Payment processing for fiat transactions is handled through established payment processors that maintain industry-standard security protocols. The chatbot architecture is designed to handle multiple concurrent channel operations while maintaining transaction integrity. ## Where Can I Buy Lux SideQuests (LSQ)? Trading availability and exchange listings for LSQ tokens have not been specified in available documentation. Users interested in acquiring LSQ should check the project's official channels for updated information on token availability and supported trading platforms.","links":"https://lux.gg","market_cap":336067,"market_cap_rank":5142,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lux-sidequests_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"Gd4qRUCe3J871r5uVuxv8aUUnDbeT27TGaFjWVnhpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/Gd4qRUCe3J871r5uVuxv8aUUnDbeT27TGaFjWVnhpump"}},"is_native":false}