{"name":"OpenEden TBILL","id":"openeden-tbill_arbitrum-one","symbol":"tbill","description":"The OpenEden TBILL Vault is a smart-contract vault for U.S. Treasury Bills. Investing into the TBILL Vault provides exposure to the U.S. risk-free rate on-chain. The TBILL token is a prospectus-based token backed by short-term U.S. Treasury Bills. It is an EIP-20-compliant representation of stablecoin balances supplied to the OpenEden TBILL Vault. By depositing USDC and minting TBILL tokens, an investor will have legal rights to the redemption value of all the assets (Treasury Bills, USDC, and fiat USD) held within the Vault, proportional to the amount of TBILL tokens the investor holds relative to the total outstanding supply of TBILL tokens. The TBILL token is issued by Hill Lights International (“HLI”), a professional fund established under the British Virgin Island Securities and Investment Business Act 2010. The underlying portfolio of Treasury Bills are held by HLI via a bankruptcy-remote and wholly-owned special purpose vehicle, OpenEden Cayman Limited (“OCL”), with segregated accounts in regulated and qualified custodians. OpenEden Pte Ltd (“OEPL”), the investment manager of OCL, is a registered fund management company regulated by the Monetary Authority of Singapore under the Jurisdiction of the Republic of Singapore, and is responsible for managing the Treasury Bills portfolio. A small portion of underlying assets are held in USDC and fiat USD for liquidity purposes. TBILL tokens are currently only available to Accredited Investors from U.S. and non-U.S. jurisdictions who are required to undergo mandatory KYC and AML screening during the subscription process. Transfers of TBILL tokens are only restricted to the whitelisted wallets of Accredited Investors.","links":"https://openeden.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/openeden-tbill_arbitrum-one/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":6,"contract_address":"0xf84d28a8d28292842dd73d1c5f99476a80b6666a","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0xf84d28a8d28292842dd73d1c5f99476a80b6666a"}},"is_native":false}