{"name":"Mother Earth","id":"mother-earth_binance-smart-chain","symbol":"mot","description":"Mother Earth is a decentralized digital currency based on binance smart chain technology that trades with \"MOT\" symbol. This new and ingenious technological concept increases the security of the currency and allows verification of transactions. MotherEarth is an eco-friendly crypto-currency developed in collaboration with some of the best minds of Blockchain Technology. Our objective is to provide a reliable cryptocurrency for both who are looking for investment and for doing transactions via Crypto. Our team is already in talks with various Corporations and Governments globally to get it approved as a tender for transactions. Gateways for crypto as a tender have already been opened up. Further to counter our carbon footprint and give back to society, we have pledged to plant 2 million trees by end of 2022 in collaboration with various NGOs, which already began while the coin was still in it's testing stage. MotherEarth is working towards repairing the ecosystem is an integral part of its identity. Although it is multi-faceted, we have decided to address this as one of its principals - by planting trees, for \"he who plants a tree plants a hope\". It is our responsibility towards our ecosystem to make efforts and harness our energy and resources to put back what we are taking away and help this world become a better place and be answerable to our future generations. To make progress as planned, we would join hands with our partners and supporters throughout the reforestation process, from planting saplings and taking care of young trees, through to their establishment. In our quest, we intend to have various forces rally alongside us - influencers across various channels, private investors as well as charitable organisations that will be chosen by the community as we mature in time.","links":"https://www.motherearth.gq/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mother-earth_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xf3f3d7f713df0447e9595d9b830a5f00297070e4","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xf3f3d7f713df0447e9595d9b830a5f00297070e4"}},"is_native":false}