{"name":"ElasticSwap","id":"elasticswap","symbol":"tic","description":"ElasticSwap is a new multi-chain AMM focused on supporting elastic supply tokens like $AMPL. We use a variation on the Uniswap invariant formula x*y=k, placing \"\"extra\"\" tokens obtained during rebases to the side until new liquidity is added to a specific pool. Lack of an AMM has been one of the missing pieces to the puzzle in the ability to successfully launch and provide liquidity for an elastic supply token. Ampleforth, the first elastic supply token, has been trying different solutions with mixed success since they launched and we think ElasticSwap is the first AMM of its kind, that will allow for a more vibrant development ecosystem around elastic tokens. $TIC is the native governance token for ElasticSwap. It has no hard cap to its supply, ownership rights to the underlying DAO vault, or guaranteed value of any kind. The ElasticSwap team is a big fan of the fair launch approach taken by Alchemix with their $ALCX token. In designing the launch and release schedule, we've taken heavy influence from their team. We believe that the majority of the tokens should go to people who contribute to the protocol, specifically, the team who builds it, former ElasticDAO members who have chosen to support ElasticSwap, and liquidity providers who seed the markets. The ElasticSwap protocol and AMM interface will be launching on Avalanche on May 11th, 2022. We believe that the low gas fees and Avalanche's generally supportive environment towards innovative projects will result in a faster early growth cycle. We will be looking to bridge $TIC and launch the platform on Ethereum Mainnet and other EVM chains shortly after our initial launch. The protocol has passed an audit contest with Code4rena and all of the relevant links and addtional information about the community can be found at https://docs.elasticswap.org/resources. Please note that despite the 5,000,000 max supply, the token is inflationary and can have a larger supply over time. We expect total emissions to be less than 5,000,000 within the first 6 years of the project.","links":"https://elasticswap.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/elasticswap/logo.png"}