{"name":"Crumbcat","id":"crumbcat_solana","symbol":"crumb","description":"CRUMB is a meme token on the Solana blockchain, centered around a lovable GIF cat that has quickly become an symbol of Solana’s/Jupiters meme culture. Dubbed “Crumbcat,” this feline is not just another internet kitty - it’s the first major meme cat on Jupiter, the largest DEX aggregator on Solana, and also features in the Official Jupiter Theme Song, giving it both cultural and cosmic significance. At its core, CRUMB embraces the whimsical, community-driven nature of meme tokens. There are no promises of groundbreaking utility or complicated tokenomics—just pure internet joy, community vibes, and the spirit of decentralized fun. It’s a celebration of meme culture, Web3 creativity, and the Solana ecosystem. Crumbcat lives at the intersection of internet culture and Solana speed. The token has already gained traction, with over 1,000 holders and a market cap approaching $1 million. It’s actively traded on popular Solana platforms like Jupiter (verified), Phantom, Meteora DAMM V2, and Maestro Bot. The CRUMB community is growing fast. Visually, CRUMB leans hard into its aesthetic: a looping, purring, and chaotic-yet-charming animated cat that perfectly captures the energy of the project. Behind the meme is a team focused on creating a fun, engaging experience without overpromising or overcomplicating. Instead of a whitepaper full of jargon, CRUMB gives you a GIF, a song, and a chance to vibe. So what is CRUMB really about? It’s about community. It’s about Solana. It’s about cat GIFs. It’s about not taking crypto too seriously while still showing up, holding strong, and building something weirdly wonderful—together. Whether you’re in it for the memes, the music, or the meows, CRUMB offers a lighthearted space to join a galactic journey powered by cuteness, culture, and crypto.","links":"https://crumbcat.io/","market_cap":83205,"market_cap_rank":7322,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crumbcat_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"Hz7MeU72BNF9rCWyUFAwKTyCcjr6qsJm1jwYehnqjups","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/Hz7MeU72BNF9rCWyUFAwKTyCcjr6qsJm1jwYehnqjups"}},"is_native":false}