{"name":"Bitcoin Diamond","id":"bitcoin-diamond","symbol":"bcd","description":"Bitcoin Diamond (BCD) is a fork of <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> that occurs at the predetermined height of block 495,866 and therewith a new chain will be generated as the BCD. Bitcoin Diamond miners will begin creating blocks with a new proof-of-work algorithm, and will consecutively develop and enhance the protection for account transfer and privacy based on original features of BTC. This will cause a bifurcation of the Bitcoin blockchain. The original Bitcoin blockchain will continue unaltered, but a new branch of the blockchain will split off from the original chain. It shares the same transaction history with Bitcoin until it starts branching and coming into a unique block from which it diverges. As a result of this process, a new cryptocurrency was created which we call “Bitcoin Diamond”. Bitcoin Diamond coin could win over a lot of Bitcoin users with its faster transaction times, lower fees and easier access to new users. Bitcoin is a hugely popular coin but it can be quite difficult to use! Many critics of Bitcoin argue that the coin won’t be a valid replacement for normal money until users can make small purchases; quickly and easily. A network offering these features will also appeal to small businesses dealing in low priced, high-volume goods like coffee or fast food. However, in my opinion the price of Bitcoin Diamond will have to be more stable before it attracts any big-brand clients like Starbucks or McDonalds. One of the main safety features of blockchain technology is encryption. Private personal information is hidden using computer code. Some critics of Bitcoin think that not enough user information is encrypted. For example, all transactions and their amounts can be seen by anyone using the Bitcoin network. This can make tracing the real identities of users fairly easy for governments and other organizations. The team behind Bitcoin Diamond wanted to encrypt more user information. However, they have recently decided not to add more privacy features to BCD. They feel that governments will soon start passing laws that stop cryptocurrencies from hiding user data. In a statement published on Medium, the team noted Japan and Russia as examples of this trend. Bitcoin Diamond is processing much larger blocks than Bitcoin in the same amount of time. Larger blocks mean more transactions and a quicker average transaction time. Bitcoin Diamond makes it easy to mine BCD with less powerful computers. GPU mining allows more users to get involved in supporting the network and this can only be a good thing. Bitcoin is the world’s top cryptocurrency but it’s still quite difficult to use. Diamond coin’s high transaction speeds and low price could make it perfect for buying and selling small and inexpensive products like coffee or bus tickets.","links":"http://btcd.io/","market_cap":16368600,"market_cap_rank":1198,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitcoin-diamond/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}