{"name":"IndoWealth Token","id":"indowealth-token","symbol":"iwt","description":"The IndoWealth Group is made up of, and administered by, a group of professionals across multiple jurisdictions with a large range of expertise and qualifications in fields such as investment banking, blockchain IT, financial advisory, entrepreneurship and more who have come together to realize a shared vision. Through its unique position of entering a developing multi-billion-dollar economy (that is set to soon become a multi-trillion-dollar G7-level economy in the very near future) over a decade ago and long before it became “fashionable”, the IndoWealth Group is able to harness its local network and connections to harvest the best deals in the fastest growing industries with the highest paying yields. Members of the IndoWealth Group have concluded billions of dollars’ worth of deals in the past for large institutions and high net-worth individuals, and now they have formed the IndoWealth Group to bring those same deals to the everyday investor through the power of blockchain technology. By combining the foundational templates of large-scale business enterprise with an investment-focused financial services lens boosted by the utility of blockchain technology, IndoWealth Group is the first entity to create a new investment model that is transcends traditional financial institutions and service providers. In so doing, the IndoWealth Group aims to be the bridge between the everyday investor and mega-projects that previously only the wealthy have access to. By harnessing the power of blockchain technology and appealing directly to the lifeblood of crypto funding that is every individual crypto investor, the IndoWealth Group is much bigger than the sum of its parts. IndoWealth Group aspires to build to create a permanent income-producing, self-sustaining network that does the following: - Improve the crypto investment landscape by making large “unobtainable” deals available to its community - Continuously unlock the economic potential of one of the fastest growing economies in the world - Provide investors access to unprecedented investment opportunities at “ground-level” before the local market becomes oversaturated - Building up the infrastructure and livelihoods of the target investment destination, leading to long-term profit generation and sustainability and - Pay high yields and provide real value that reward investors for taking part in this future forward endeavor.","links":"https://www.indowealth.group/home","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/indowealth-token/logo.png","detail_platform":{"solana":{"decimal_place":7,"contract_address":"rTCAfDDrTAiP2hxBdfRtqnVZ9SF9E9JaQn617oStvPF","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/rTCAfDDrTAiP2hxBdfRtqnVZ9SF9E9JaQn617oStvPF"}}}