{"name":"Sui Pepe","id":"sui-pepe","symbol":"spepe","description":"What is the project about? Sui PePe is a meme-themed cryptocurrency platform that aims to create a community-driven ecosystem where users can create, share, and trade meme-inspired tokens and NFTs. Our mission is to democratize the meme economy by making it accessible, fun, and rewarding for everyone. What makes your project unique? Sui Pepe stands out due to the following features: - A user-friendly website for creating and trading meme tokens and NFTs. - Innovative tokenomics that incentivize community engagement and rewards active participants. - Integration with popular social media platforms, enabling seamless sharing and promotion of meme content. History of your project. Our project was conceptualized in 1 month by a group of meme enthusiasts who saw the potential for a decentralized meme economy. Since then, we have assembled a team of experienced developers, designers, and marketers to bring our vision to life. We launched the platform on May-5 and have already attracted a growing community of users and creators. What’s next for your project? - Expanding the platform's features to include additional tools for meme creation and curation. - Introducing staking and yield farming opportunities for our native token holders. - Establishing partnerships with popular meme creators and influencers to promote our platform. - Organizing community events and contests to foster engagement and drive user adoption. What can your token be used for? Our native token, sPEPE, serves multiple purposes within our ecosystem: Users can stake sPEPE to earn rewards and participate in governance decisions. The token can be traded on popular decentralized exchanges, providing liquidity and price discovery. Holders of sPEPE can access exclusive content, events, and promotions within our platform.","links":"https://www.suipepe.wtf/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sui-pepe/logo.png","detail_platform":{"sui":{"decimal_place":9,"contract_address":"0x85bfbe773f5cc51aa6e5e9839c9f9d20305e7be4b9fd6e849253ed5aeebc6526::pepe_coin::PEPE_COIN"}}}