{"name":"Chickenus Maximus","id":"chickenus-maximus","symbol":"chickenus","description":"Chickenus Maximus, the feathered star of a memecoin launched in April 2025, has pecked its way into the crypto and gaming worlds, inspired by Elon Musk’s quirky antics in Path of Exile 2. In this unforgiving action RPG set on the dark continent of Wraeclast, Musk introduced Chickenus Maximus during a livestream on April 7, 2025, as the loyal companion to his high-level character, Kekius Maximus. The memecoin, riding the hype of Musk’s eccentric persona, exploded on X, blending blockchain buzz with gaming lore. Kekius Maximus, a name dripping with meme culture (think “Kek” from Pepe fame), is Musk’s hardcore-mode warrior in Path of Exile 2, a game notorious for its brutal difficulty and permanent-death stakes. Chickenus Maximus, revealed as his mount, injects humor into this grim world—a Roman-inspired chicken strutting beside a battle-hardened exile. Musk’s naming moment sparked a frenzy, with X posts on April 10, 2025, showing fans minting tokens and memes in its honor, amplifying the coin’s viral ascent. In-game, Chickenus Maximus isn’t just a pet; it’s a symbol of Musk’s flair for the absurd. While Kekius Maximus carves through foes with top-tier gear, Chickenus clucks along, a bizarre duo defying Wraeclast’s darkness. The memecoin mirrors this oddity—its value tied less to utility and more to Musk’s cult-like influence. Yet, skepticism lingers. Gamers question Musk’s skills, suspecting boosted accounts behind his leaderboard rank. Chickenus Maximus, and its token, don’t prove his prowess—they’re a distraction, a clucky sideshow. Still, the memecoin thrives on Musk’s narrative. Chickenus Maximus, paired with Kekius Maximus, embodies his knack for turning niche hobbies into cultural phenomena. In Path of Exile 2’s brutal landscape, this chicken stands out—a feathered anomaly fueling a crypto craze. Whether Musk grinds or buys his way to glory, Chickenus Maximus and its memecoin cluck onward, a testament to his ability to merge gaming, absurdity, and market hype into one eccentric legacy.","links":"https://chickenusmaximus.com","market_cap":12374.35,"market_cap_rank":9352,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chickenus-maximus/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xd2b69d3518c3820e97ea910a4a22d699a6c39272","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xd2b69d3518c3820e97ea910a4a22d699a6c39272"}}}