{"name":"Phala","id":"pha","symbol":"pha","description":"What Is Phala Network (PHA)? Phala Network is a coprocessor for blockchains. Developers deploy “Phat Contracts,” off-chain program for coprocessors, enhancing dApps with connectivity, internet access, and heavy computation, overcoming web3 constraints. Phala Network has one of the largest Trusted Execution Environments (TEE) on Intel Software Guard Extensions (SGX) hardware, which means that any code/data on Phala Network is protected from unauthorized access by users. Phala addresses developer concerns with expanded developer language support such as JavaScript and more, and ready-to-deploy Templates for seamless Phat Contract integration, streamlining the experience for web3 developers. Phala stands at the forefront of Web3 innovation, fostering development through its Builders Program. How Many PHA Coins Are There in Circulation? There is a maximum supply of 10 billion PHA. As of January 17th, 2024, the circulating supply of PHA tokens is 663,448,259. Please note that the circulating supply is dynamic. For the most up-to-date information on the circulating supply, please visit the API here. Who Are the Founders of Phala Network? Marvin Tong: CEO of Hash Forest Technologies. Senior Product Manager. Ex Tencent and Didi. 【X】【LinkedIn】 Hang Yin: CTO of Hash Forest Technologies. Founder and Lead Developer of Bitcoin Gold. Senior Developer at Google. 10 years of coding experience. 【X】【LinkedIn】【Github】 Where Can I Buy Phala (PHA)? As one of the most potential Polkadot and EVM ecosystem projects in terms of coprocessor, PHA is available on some top-ranked exchanges below Binance Kraken OKX Kucoin Uniswap 1inch HydraDX Omnipool For the full list, please visit here. PHA resources Introduction to PHA the native token of Phala Blockchain PHA Governance X Discord Phala Network Blog Phala Network Docs GitHub YouTube CMC community What Makes Phala Unique? Phala Networks pioneers DePIN for CPUs, optimizing performance. Decentralized compute enhances blockchain coprocessors, ensuring secure transactions. The future entails AI-Web3 synergy, with Autonomous Agents providing scalable, autonomous data processing. Phala Network distinguishes itself through its Phat Contracts, a paradigm-shifting concept in decentralized off-chain computation. The key uniqueness of Phat Contracts lies in their role as decentralized computation units, surpassing the limitations of on-chain smart contracts. These contracts run off-chain, facilitating complex computations seamlessly and cost-effectively. Unlike traditional on-chain solutions, Phat Contracts enable connections across diverse blockchains, supporting EVM and Substrate-based chains like Ethereum, Polygon, Polkadot, and more. Phat Contracts empower developers with a range of tools—such as the Rust SDK and JavaScript and TypeScript—providing flexibility based on their programming background. Phat Contract applications include Zurf for web3 social rewards, Phat OTP for secure on-chain authentication, Phat Strategy in GameFi, Lens Phite for dynamic NFTs, Smart Cookie for AI-driven content tailoring, and LensAPI Oracle for seamless integration of Lens data in smart contracts. PHA is the native utility token that is used for: Trusted Computing Resources: Phala Networks empowers users with $PHA to access TEE computation resources. Seamlessly deploy Phat Contracts, supporting smart contracts as self-host oracles on various EVM blockchains. Security Guarantee: Gatekeepers must stake a certain amount of PHA tokens, which may be slashed for misbehavior. Governance: Stakeholders who own a certain amount of PHA are able to join the Phala DAO to participate in community governance. Phala products include: Phat Contract SubBridge inDEX PhalaWorld","links":"https://phala.network/","market_cap":142266897,"market_cap_rank":367,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pha/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6c5ba91642f10282b576d91922ae6448c9d52f4e"},"sora":{"decimal_place":18,"contract_address":"0x0033271716eec64234a5324506c4558de27b7c23c42f3e3b74801f98bdfeebf7"}}}