{"name":"PHALA","id":"pha","symbol":"pha","description":"What Is Phala Network (PHA)? Phala Network (https://phala.network/) is the Execution Layer for Web3 AI, enabling AI to interact with blockchains and unlocking Web3 for the first billion users. Phala’s multi-proof system solves the AI execution problem, allowing you to build tamper-proof and unstoppable AI Agents that integrate with smart contracts through the AI-Agent Contract. 1. Agentize Smart Contracts: Develop AI Agents for smart contracts using natural and programming languages. 2. Connect to Multi-Agents: Make your agents accessible to other cross-chain AI Agents. 3. Launch AI Agents and Earn: Own your agents and build a profitable token economy. PHALA as the AI Execution Layer: Phala leverages AI Agents to interface with blockchain technology, ensuring behavior aligns with intentions and preventing fraud. Using Phala's Blockchain-TEE hybrid system, AI Agents can act like smart contracts with decentralized hosting, governance by smart contracts, protected prompts, and low latency with no gas fees. Phala Network’s AI Ecosystem: Phala leads Web3 and AI integration with: 1. AI Agent Contract (https://docs.phala.network/ai-agent-contract/getting-started): For building decentralized AI applications. 2. Agent Wars (https://agentwars.phala.network/home): A platform to create, interact with, and monetize AI agents. 3. Redpill (https://red-pill.ai/join): An AI aggregator optimizing multiple AI models, increasing network usage and computation power. How Many PHA Coins Are There? The maximum supply is 1 billion PHA. As of May 29, 2024, the circulating supply is 724,199,827 PHA. For updates, visit the API here (https://khala-circulation-api.phala-dev.workers.dev/). Where Can I Buy Phala (PHA)? PHA is available on Binance, Kraken, and other major exchanges. For a full list, visit here CoinGeko PHALA listing page.","links":"https://phala.network/","market_cap":66517531,"market_cap_rank":440,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pha/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6c5ba91642f10282b576d91922ae6448c9d52f4e"},"sora":{"decimal_place":18,"contract_address":"0x0033271716eec64234a5324506c4558de27b7c23c42f3e3b74801f98bdfeebf7"}}}