{"name":"Pocket ProjecT","id":"pocket-project","symbol":"ppt","description":"<What is the project about?> Pocket Project is created to keep as many people active as possible, using a reward system to motivate users to move more. Pocket project is consist of a service platform \"Pocket Gym\" focused on business feasibility and a token platform \"Pocket pop\" with blockchain technology. The “Pocket Gym” service platform provides activity goals to users through a means called Quest, and gives point rewards when the Quest is completed through an accurate verification system. Those points can be exchanged for blockchain based tokens within the “Pocket Pop” token module. <What makes your project unique?> Kcal point, which has been compensated through various contents, can be exchanged with Pocket Project Tokens (PPT) through Pocket pop token platform, and can also be used in offline. Kcal Points exchanged for PPT are immediately incinerated, and conversely, when PPT is converted into Kcal points, points are created immediately, and the PPT's transaction data is stored on the blockchain network and the point's transaction data is stored in the pocket pop module. Pocket project enables decentralization of both tokens and points. <History of your project.> The Pocket Project was first planned in 2021. In 2022, we launched 'Pocket Gym', a Q2E platform. Since then, we have developed 'Pocket Pop', a blockchain module, and included it in the 'Pocket Gym' ecosystem. <What’s next for your project?> Our project aims to partner with affiliate sales of 30 million USD and 500 offline fitness centers by 2024. <What can your token be used for?> 1.Tokens can be exchanged for app points (Kcal) 2.App points (Kcal) can be exchanged for tokens (PPT) 3.Purchasing Quest and content in the app. 4.Purchasing affiliate products(sports wear, Galaxy watch, etc.) and using offline affiliate services","links":"https://pocket-project.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pocket-project/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0x60b6cc2b8cf4687dafa08c2078f7677eab23df7e"}}}