{"name":"Oxya Origin","id":"oxya-origin","symbol":"oxyz","description":"What is Oxya Origin : Origin Game is a French Web3 gaming studio with a mission to create a fully integrated, interoperable gaming ecosystem. Despite challenging market conditions, Origin Game has remained steadfast in its core values, pushing the boundaries of blockchain gaming and player empowerment. Ecosystem : Oxya Origin’s ecosystem stands at the crossroads of traditional gaming, blockchain technology, and interoperability. Built on the environmentally-friendly Immutable zkEVM blockchain, this infrastructure connects multiple games under a single IP, a common currency, and a unique simple login (Immutable Passport) fostering an ecosystem that transcends traditional gameplay. Oxya avoids the common pitfalls of play-to-earn and pay-to-win models, instead promoting long-term engagement and player ownership across multiple games. Introduction to Road to Genesis : RtG is a Third-person shooter that blends intense, tactical combat with rich dungeon exploration, challenging you with every Rundown of a high-stake extraction looter. You'll face ever-changing environments that test your skills, requiring strategic use of consumables, careful health management, and precise ammunition control to survive. RtG Key features : Diverse Room Types: Road to Genesis offers high-stakes tactical action. Players face waves of enemies with increasing difficulty in hand-crafted level designs that still provide endless possibilities for how you approach each challenge. The game supports both solo and co-op modes, letting you choose whether to fight with brute force or sneak past your enemies. The extraction system adds tension, offering you a chance to escape—or push your luck with a “double or nothing” risk. Every decision, every gamble, comes with consequences: Face up to your own greed and make the right decisions to survive. -Technical quality oriented: Designed to deliver a visually stunning experience with high-quality graphics and a main focus on detailed environments, Road to Genesis takes you in a dark and gritty world that feels alive with danger and opportunity. -Collaborative Play: Form a squad with friends, strategize together, and tackle increasingly tough dungeons in the universe to deep dive into an intensive and immersive gameplay. Every choice is crucial and matters in your fight for survival. -Dynamic Development: Witness the game grow and change with regular updates. Be part of a living project where your insights help refine gameplay mechanics, visuals, and more. Oxya HQ: The HQ launch introduces foundational management and strategy elements to the Oxya Origin ecosystem, enhancing $OXYZ utility and paving the way for future cross-game interoperability. As a web-based management hub, the HQ enables players to manage resources, craft items, and engage in strategic mining activities that integrate directly with Road to Genesis and future Oxya titles.","links":"https://www.oxyaorigin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/oxya-origin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd0623da373f754c4b6762209ea77de59b21dd667"}}}