{"name":"Bithashex","id":"bithashex","symbol":"bhax","description":"Bithashex OU is an Estonian company focused on the Fintech sector and Blockchain solutions, it has a fully valid license for crypto, fiat, wallet holding and is actively developing various blockchain-based solutions including crypto exchange platforms, with BNC based BHAX token as its primary currency for trading. Product & Services: BHAX is a Bithashex Exchange utility token, The tokens can be used to trade in cryptocurrencies as an internal currency. It is based on the Binance Smart Chain blockchain. Bithashex Exchange is an upcoming crypto project that facilitates an excellent decentralised blockchain-enabled platform that allows users to buy, sell and trade popular fiat and cryptocurrency. It is a fully licensed and PCI DSS compliant crypto exchange with a robust Integrated KYC and Remittance model. Bithashex GID Matrix is a decentralized blockchain-powered platform that allows you to control your digital identity and prevents identity theft. It is a revolutionary blockchain automated algorithm that puts users back in control of identity management. The existing identity management system is neither secure nor reliable. At every point, users are asked to identify themselves through multiple government-authorized IDs like Voter ID, Passport, Pan Card, etc. Features: GID Matrix provides an innovative, unique solution to the identity management challenges of the digital world. The solution is built on blockchain technology and has enormous potential for mass adoption. GID Matrix is making digital identity a reality for everyone. GID Matrix is a solution that will make our lives easier and secure. Other Products: - e-Wallet - Smart Card - Educational Content - AI Trading Bot - Real-Time Transaction Insights - Token Filter What are the Bithashex Ecosystem and its security level? Bithashex Ecosystem is built on decentralized Blockchain Technology allied with Artificial Intelligence, Machine Learning and Data Analytics: - 2 FA - KYC Verification: SOAP / JSON API , AML Face Recognition, SMS & Email Gateway - Google Recaptcha - Email ID Encryption - IP Whitelisting / Masking - Geofencing What are the project key takeaways? - Working with regulators, governments, and big entities to ensure that our solutions are secure and compliant. - Fully licenced - Secure & centralized data storage in a complex encryption - Enhanced privacy with KYC / AI - Minimum financial & technical risk hedging","links":"https://www.bithashex.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bithashex/logo.png"}