{"name":"Whole Earth Coin","id":"whole-earth-coin","symbol":"wec","description":"The Whole Earth Foundation The Whole Earth Foundation is an Organization established to democratize the management of our infrastructure and environment. Our goal is to provide the world's first trusted infrastructure data ecosystem to revolutionize how infrastructure is managed. Mission Statement We, the people, unified as a collective whole, have the capacity to overthrow any governing authority. It is our right and responsibility to have a voice in maintaining the integrity of our infrastructure and environment that monopolies have traditionally governed. The power of the individual to make decisions based on information is the principal outcome of the digital age. Therefore, tools that promote access to information and data-driven learning are sought and promoted by the WHOLE EARTH FOUNDATION. What makes WEC unique? Whole Earth Coin (WEC) is an ERC20 Token running on the Ethereum chain used to power the Whole Earth Access Platform, a one-of-a-kind data exchange ecosystem that provides tools and resources to put general citizens in control of their infrastructure. Using applications running on smartphones, we can crowdsource detailed data on infrastructure traced by geolocation. This data can then be used to develop intelligent AI to make predictions that provide novel insights that allow for more efficient infrastructure management. We believe that deeds that contribute to the greater community should be recognized and rewarded. Ultimately, our goal is to create an ecosystem of users who actively oversee and manage their local infrastructure, provide them with access to information, and work closely with organizations that have traditionally governed infrastructure assets in their communities. Token information The WEC launched on 1/5/2021 with an original supply of 1 billion. Before its official listing on ProBit and CoinsBit exchanges, a one-time token burn on 70% of the total token supply was performed on 5/20/2021, setting the new total volume to 300 mil.","links":"https://wholeearthfoundation.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/whole-earth-coin/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"6y8W5YwAuzostqrS4YDJufBvksosfSi47Pd8U4A5vrBC"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x3623f2b63d8f50b477849d29e7c9a6625331e89d"}}}