{"name":"Bonk 2.0","id":"bonk-2-0","symbol":"bonk 2.0","description":"Missed out on $BONK? Fear not! Introducing Bonk 2.0, your gateway to a generational wealth opportunity that doubles the fun and doubles the potential gains with $BONK2.0! Embracing the essence of meme culture, Bonk 2.0 aims to amplify the thrill of the crypto space with its purely meme-driven concept. Bonk 2.0 is the evolution of the original $BONK, designed to provide enthusiasts and investors with an enhanced and reinvigorated experience. Building on the success and enthusiasm generated by its predecessor, $BONK2.0 promises an even wilder ride into the world of meme coins. Key Features of Bonk 2.0: Twice the Potential: With Bonk 2.0, participants have the opportunity to explore a meme coin that doubles the excitement and doubles the potential rewards. Don't miss this chance to seize a renewed wave of speculative fun and potential gains. Meme Culture at its Core: Bonk 2.0 embraces the irreverent and humorous spirit of meme culture, offering a lighthearted yet thrilling investment avenue. Join a community that revels in memes while exploring the potential of the crypto market. Community-Driven: The heart of Bonk 2.0 lies within its community. Engage with like-minded individuals, meme enthusiasts, and crypto aficionados who share a passion for humor, speculation, and the thrill of the crypto rollercoaster. Our Mission: Revitalize the Meme Coin Experience: Bonk 2.0 aims to breathe new life into the meme coin space, injecting fresh enthusiasm and excitement for participants seeking a unique and entertaining crypto venture. Inclusive and Playful Environment: We strive to create an inclusive and playful environment where community members can enjoy the meme coin journey, participate in discussions, and revel in the unpredictability of the market. Enhanced Opportunities: By doubling the stakes and offering $BONK2.0, we aspire to provide enhanced opportunities for our community members, creating a space where fun and potential gains coexist. Join the Bonk 2.0 rev","links":"https://bonkcoin-20.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bonk-2-0/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"Gh9AcyeZezm5DBvVpG9eSwN1pArtFGNU9q7RzLKkkQ8n"}}}