{"name":"TOKEN","id":"token","symbol":"token","description":"TOKEN powers the Token.com ecosystem, the revolutionary video-first crypto platform that's redefining how people discover, engage with, and trade crypto. The platform combines content-driven discovery with trading capabilities through a mobile-first interface. Token.com's core feature is its TikTok-style video feed that allows users to discover and trade cryptocurrencies directly within their content feed. This innovative approach simplifies the often complex world of crypto investing, making it more accessible to a broader audience. By integrating video content with trading functionalities, Token.com encourages users to engage with projects in a more dynamic and interactive manner. The platform has demonstrated significant early traction with users, creators and crypto projects all onboarding and creating value daily. Why TOKEN The crypto world is drowning in complexity - endless tokens, scattered platforms, and intimidating interfaces that push away mainstream users. While social media platforms engage billions, crypto remains stuck at just 90 million active users. $TOKEN is looking to change the game and enable the vision of the Token.com platform. At token.com, 580,000 people downloaded the app during the initial launch, with 97,000 fully-verified users exploring crypto socially. It’s clear that they're already demonstrating real user adoption and solving real problems in the crypto space. TOKEN is the token empowering users, creators and investors on the app. What does TOKEN do? The token, which was launched on the Base blockchain, brings everyone that uses token.com - users, creators and token projects - utility and real-world use: For Users - Access exclusive Micro-Airdrops straight from their video feed - Stake their $token, get rewarded with your share of trading fees - Be the first to discover the next big thing through their video feed For Creators - Unlock revenue from every trade made throught their content on token.com - Earn more when projects boost your content - Join a community of 175+ top crypto creators already creating on token.com Projects - Amplify their story on token.com through native tokens boosting - Reach & collaborate with top creators on the platform - Power the micro-airdrop economy with their token Token.com's approach to token discovery challenges the traditional model used by centralized exchanges, which typically list cryptocurrencies based on market capitalization. Instead, Token.com allows various projects to gain visibility based on user preferences and engagement metrics. This democratization of exposure could potentially give smaller or newer projects more opportunities to reach interested investors. The platform aims to create a more inclusive and diverse token economy by enabling users to support projects that resonate with their values and interests. This model could reshape how people interact with and invest in the crypto space, making it more accessible and engaging for a wider audience. As with any investment platform, users should be aware of the risks associated with cryptocurrency trading and conduct their own research before making investment decisions. By prioritizing transparency and user education, Token.com seeks to empower its community members to make informed choices in their crypto journeys.","links":"https://www.token.com/token-launch/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/token/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x49ad42aac28a982fb5ff6a4172ba73f0ccdf73c9"}}}