{"name":"MobiFi","id":"mobifi","symbol":"mofi","description":"MobiFi is building a web3 travel platform to connect digital nomads globally and create impact to the businesses locally. Our web3 travel platform is now innovatively bifurcated into two distinct yet synergistic components. Firstly, we offer a blockchain-based marketplace, a platform where users can list local services specifically tailored to cater to the needs of travelers. This approach not only enhances the travel experience but also nurtures local economies. Secondly, the platform empowers companies to provide web2 travel and mobility services (e.g., parking, hotel, car rental), leveraging our sophisticated web3 technology stack. This dual approach not only streamlines service offerings but also significantly enriches the user experience, positioning MobiFi at the forefront of the evolving travel industry. Our MobiFi app seamlessly integrates both pillars of our platform—blockchain-based marketplace and web2-based travel services—ensuring superior user experience and simplicity. Our team is diligently developing an innovative structure that facilitates the customization of mini-apps within our mobile application. This enhancement is designed to enable a broader range of service providers to join our platform in the future. The blockchain-based marketplace operates under the governance of our community, utilizing our new governance token, which is scheduled for listing in 2024. This approach ensures fair and transparent operations, aligning perfectly with the values and expectations of our end users and community members. Concurrently, the web2-based travel and mobility services are managed directly by the service providers. This model ensures that our users receive the highest level of support, akin to traditional web2 companies, including reliable email and phone customer service. This hybrid approach not only leverages the strengths of both web3 and web2 paradigms but also guarantees a comprehensive and user-centric service experience.","links":"https://mobifi.io/","market_cap":195651,"market_cap_rank":3912,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mobifi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb2dbf14d0b47ed3ba02bdb7c954e05a72deb7544"},"polygon-pos":{"decimal_place":18,"contract_address":"0xf689e85988d3a7921e852867ce49f53388985e6d"}}}