{"name":"Navcoin","id":"nav-coin","symbol":"nav","description":"What is Navcoin (NAV)? Navcoin, launched in 2014, is an open-sourced digital currency offering fast and reliable payments with innovative technological and privacy features. Storing coins on a Navcoin wallet allows for making public or private transactions, earning rewards through staking (for network validation) or mixing coins (for privacy enhancement), and having a vote in project proposals. Unique to Navcoin’s cryptosystem is that public NAV coins can be converted 1:1 to xNAV, the revolutionary privacy coin that guarantees untraceable transactions. Additionally, Navcoin has launched wNAV, a wrapped representation of NAV, that can be used in ecosystems such as Ethereum and Binance Smart Chain (BSC). Navcoin was launched without pre-mining or an ICO to achieve a fair and transparent initial distribution of the supply. The project operates as a fully Decentralized Autonomous Organization (DAO), without a central decision making authority (unlike most other projects). Anyone can participate by simply staking NAV in their wallet, thereby obtaining a say in protocol governance and a vote on proposals that arise from within the community. How are Navcoin’s privacy-enhanced features achieved? Navcoin’s philosophy is to provide people with privacy preserving solutions that allow them to express themselves financially and transact as they desire. This has resulted in the development of xNAV, a privacy coin based on the decentralized, trustless, and permissionless technologies of the future. First of all, xNAV is built on top of the self-developed privacy protocol blsCT that merges Boneh-Lynn-Shacham (BLS) Signatures and Confidential Transactions (CT). BLS compresses a group of signatures into a single compact signature that authenticates the entire group, thereby shielding the origin of individual transactions. CT is a well-established privacy protocol that obfuscates the amount of coins in a transaction. On top of that, xNAV ensures personal privacy by using Stealth Addresses, public-key cryptography and the innovative Dandelion++ protocol. Stealth Addresses are private addresses which ensure complete privacy for the receiver of a transaction. Dandelion++ is a communication mixing protocol which breaks the link between a message and its source. When using blsCT, two xNAV transactions can be merged into one, and transactions can be aggregated an infinite number of times. This allows Navcoin to scale effectively and support a high quantity of transactions across the network and users’ transactions are completely shielded and untraceable. Anyone trying to monitor transactions being made through Navcoin’s network is unable to tell if a transaction has been aggregated or not, and users are able to merge their coins with other individuals making transactions. When doing so, a user’s wallet uses Dandelion++ to send an anonymous request for coins from other nodes. These nodes can then connect and communicate between them using public-key cryptography to broadcast the session and their coins to mix. From those, the sender can randomly select several coins from the responses received. These coins are in turn mixed together with the original user’s coins, and then sent to the network, and this system ensures true privacy while also enabling anyone who helps to facilitate the mixing-process by providing liquidity to receive a fee for their service, and generate a passive income. Combining these technologies, xNAV stands out in scalability and privacy, effectively supporting high quantities of transactions across the network with shielded and untraceable transactions. How is Navcoin’s network secured? Navcoin’s network is secured by a Proof of Stake (PoS) consensus mechanism, which means that anyone can use their NAV to help validate transaction blocks. By comparison, Bitcoin’s Proof of Work (PoW) consensus mechanism requires miners to calculate huge mathematical problems to process transactions and earn rewards. This requires expensive hardware and is extremely energy intensive. Navcoin’s PoS consensus mechanism does away with these resource intensive requirements; even a 5 Volt Raspberry Pi can take part in securing the network. Navcoin’s users can earn passive income in two distinct ways. First of all, users can help secure the network by staking NAV to validate transactions. With block times of 30 seconds, the block reward is 2.5 NAV. Of each reward, 2 NAV are for the staker, and 0.5 NAV are held in a decentralized treasury, the Community Fund, used for self-funded community initiatives. Users can also mutually merge their xNAV coins over various nodes to facilitate the mixing process that ensures xNAV’s privacy and anonymity. Users are rewarded a fair compensation fee in return for this service. How is Navcoin’s network governed? In addition to helping to secure the network, Navcoin’s PoS consensus mechanism enables all public NAV holders to get involved with governing their platform. There is no central authority controlling Navcoin, and community members play a crucial role in maintaining a fair and decentralized system of decision making. As a result, Navcoin operates as a Decentralized Autonomous Organization (DAO) with all protocol administration and consensus changes being subject to an open voting system. All community members holding their NAV on the public side can participate in the DAO by staking their coins, and each stake is the equivalent of one vote. This gives each wallet holder a say in protocol governance, and allows them to vote on any proposals that arise. To ensure widespread participation, there is also no minimum staking amount required for anyone to take part in voting. Navcoin’s governance system also incorporates a Community Fund to ensure that contributors and projects can be compensated and funded by the network.","links":"http://www.navcoin.org","market_cap":2427918,"market_cap_rank":2441,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nav-coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"binance-smart-chain":{"decimal_place":8,"contract_address":"0xbfef6ccfc830d3baca4f6766a0d4aaa242ca9f3d"}}}