{"name":"Daft.Exe","id":"daft-exe_solana","symbol":"daft","description":"Daft.Exe is an innovative full-stack web app OS that combines zero-knowledge (ZK) cryptography with interactive features for secure, privacy-focused trading and analytics. The platform includes three core modules: a ZK Trading Strategy Marketplace, a Private Portfolio Analytics tool, and a zkML Signal Marketplace, all built around encrypted data and cryptographic proofs. The ZK Trading Strategy Marketplace allows users to create, buy, rent, and license encrypted trading strategies, with performance verified through ZK proofs like Sharpe ratios and win rates. Strategy battles provide a competitive edge, and all transactions are tracked with royalty agreements. The Private Portfolio Analytics tool lets users create encrypted snapshots of their holdings, prove portfolio values without revealing exact amounts, and access private analytics for risk, tax, and rebalancing insights. Whale tier verification (from Bronze to Diamond) unlocks exclusive perks. The **zkML Signal Marketplace** facilitates the creation and subscription of time-locked trading signals, with performance verified through ZK proofs, ensuring that users can trust the accuracy of predictions without exposing the underlying algorithms. All three systems are powered by Daft.Exe’s Core ZK Service, which generates encrypted performance proofs, balance range proofs, time-lock commitments, and reputation verifications. Daft.Exe offers a secure, decentralized environment for advanced trading strategies, private portfolio management, and ML-driven signal predictions, all backed by cutting-edge cryptographic technology.","links":"https://daftsystems.pro/","market_cap":27067,"market_cap_rank":9204,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/daft-exe_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"F4ZL8sHPXAoUaAQ6DVY4Si6uhHu9T5dvciNozdPZdoge","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/F4ZL8sHPXAoUaAQ6DVY4Si6uhHu9T5dvciNozdPZdoge"}},"is_native":false}