{"name":"Phantasma","id":"phantasma","symbol":"soul","description":"<a href=\"https://phantasma.io/\">Phantasma</a> is a decentralized, feature rich Layer 1 blockchain. Being developed in C#, Phantasma is the chain of choice for Unity Developers. Phantasma has an easy-to-use connector between dApps, wallets and blockchain via Phantasma Link. Additional support for developers can be found through Phantasma AI, Phantasma Hub and developer documentation. With its innovative staking mechanism, dual token system, sustainable tokenomics model and advanced eco-friendly and ground-breaking smartNFT technology, the chain is designed to be used for digital goods & services, for communications, entertainment, marketplaces and on-chain storage solutions for dApp creators and enterprise clients. With mainnet live since October 2019, it has proven to be the infrastructure platform of choice for Gaming and NFTs. Not only because of its low minting and transaction fees but also because of its smartNFT technology that has been built on chain level. It’s also the first certified carbon negative blockchain. SmartNFTs are NFTs with dynamic properties that can change based on certain conditions. They provide game developers the opportunity to make dynamic in-game items decentralized, which is not possible with traditional NFTs. They also allow for time-based NFTs, multi-layered NFTs, infused NFTs and locked content within an NFT that can only be accessed by the owner of the NFT. The NFTs can be minted on-demand at a fraction of the costs compared to other blockchains so there is no need to mint NFTs in advance which might never be sold.","links":"https://phantasma.info","market_cap":12853732,"market_cap_rank":1625,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/phantasma/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x75858677e27c930fb622759feaffee2b754af07f"},"binance-smart-chain":{"decimal_place":8,"contract_address":"0x298eff8af1ecebbb2c034eaa3b9a5d0cc56c59cd"}}}