{"name":"Hope.money","id":"hope-2","symbol":"hope","description":"What is the project about? The HOPE Ecosystem, featuring the distributed stablecoin $HOPE, aims to provide frictionless and transparent next-gen financial infrastructure and services accessible to everyone. By bridging CeFi and TradFi use cases to DeFi, the all-in-one HOPE Ecosystem provides a comprehensive set of use cases for $HOPE, including swap, lending, custody, clearing, and settlement, while incentivizing users to participate in the ecosystem and community governance through $LT. What makes your project unique? Integrating $HOPE with the broader DeFi ecosystem across different blockchains, attracting new users, investors, and builders to further fortify the HOPE Ecosystem. HopeConnect creates an array of applications built on top of it, enabling $HOPE in a wide range of CeFi and TradFi use cases, further establishing $HOPE as the unit of account. History of your project. Since its inception in March 2023, Hope.money has achieved several significant milestones towards its goal to become the “Next Gen Money”. In the short term, Hope.money is developing $HOPE into a high-liquidity bridge between DeFi, TradFi, and CeFi applications, making it easy-to-borrow and universally accepted as collateral. In the long term, $HOPE will become a universally accessible payment vehicle, ensuring everyone can enjoy frictionless and transparent financial services. Key infrastructures have been built include: $HOPE: Hope.money’s native money, fully-backed and powered by the best decentralized, crypto-native assets such as BTC and ETH. $LT: The governance token, granting holders ownership, governing rights, and exclusive rewards within the HOPE Ecosystem, as well as long-term upside participation of the ecosystem and the broader crypto scene. HopeSwap v1: The native decentralized exchange (DEX) establishing $HOPE as the medium of exchange. HopeLend v1: The native decentralized lending platform establishing $HOPE as the store of value. HopeCard Beta: The card solution offering seamless real-life spending with on-and-off chain rewards. What’s next for your project? With the successful launches of HopeSwap and HopeLend, the two pillars supporting the entire ecosystem — the exchange rate and interest rate markets for $HOPE, are established. Hope.money is ready to create a flourishing ecosystem of protocols and products. Key infrastructures to be built include: LSDs as collateral: Incorporating ETH LSDs into the $HOPE Reserve Pool to enhance yield opportunities and capital efficiency for the community. HopeConnect v1: The on-chain custody, clearing, and settlement solution, the bridge between DeFi, CeFi, and TradFi. There will initially be two main applications: 1. HopeCard Integration: A step-up from HopeCard Beta, establishing $HOPE as the unit of account for on-and-off ramping and real-life transactions. 2. Nebula: Decentralised prime brokerage between DeFi and CeFi, with $HOPE as the unit of account. What can your token be used for? $LT aims to be the single utility token for all protocols within the HOPE Ecosystem, with a total supply of 1 trillion tokens, creating a unified ecosystem and generating non-dilutive value accrual to $LT. Rewarding our community, users, and partners with $LT, providing them with transparent governance power. Locking $LT holders can receive veLT by vote locking their $LT. By doing so, they not only gain voting power but also enjoy benefits such as sharing Gov Fees and the potential to boost their $LT rewards. Voting veLT holders can participate in governance by casting votes. They can vote for gauge weights, which determine the allocation of daily $LT inflation and are closely related to their base rewards. They can also vote for various DAO proposals that will be presented in the future. Boosting Liquidity providers who hold veLT can potentially boost their $LT rewards by up to 2.5x compared to those without veLT, by taking action to activate the boost. Earning To incentivize veLT holders participation in the governance process, they can earn Gov Fees based on the Fee Distribution mechanisms in place, which allows veLT holders to receive a share of the fees generated by the HOPE Ecosystem.","links":"https://hope.money/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hope-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xc353bf07405304aeab75f4c2fac7e88d6a68f98e"}}}