{"name":"Zeebu","id":"zeebu","symbol":"zbu","description":"1. What is the project about? Zeebu is World's first loyalty Utility token created for Telecom Carrier Businesses. Zeebu loyalty utility token is an ERC 20 token designed to incentivize and reward Telecom Carriers participating in the Zeebu Ecosystem. Zeebu is a powerful and redeemable loyalty token that raises telecom carriers' bottom line by rewarding loyalty benefits and significantly lowering invoice costs. The core value proposition of the Zeebu token is to offer a loyalty and rewards system tailored to the Telecom Carrier market. 2. What makes your project Unique? Zeebu token comes with an end-to-end tailor-made platform for the telecom carrier industry. Only token that is designed for loyalty rewards for B2B transactions. Zeebu token has a real-world utility with USD120 billion industry. 3. History of your project. Telecom companies utilize the exact payment processing mechanisms via traditional banks and service offerings. These offerings are outdated and not tailored to the needs of the telecom industry, causing high­ cost payments that continually affect customers' bottom line on each transaction. The Zeebu ecosystem aims to reduce friction within remittances, cross-border payments, invoice settlement, and payment delays. By implementing new technologies such as blockchain, along with a comprehensive understanding of the telecom service architecture, Zeebu transforms invoice settlement and transaction processing for the industry. 4. What's next for your project? Zeebu has established a collaborative partnership with a prominent industry leader, generating an annual revenue of $3.2 billion within a market size of $120 billion. Zeebu aims to expand its market share in the next five years by incorporating additional vendors. 5. What can your token be used for? Cost-savings in cross-border settlements - Zeebu loyalty utility tokens eliminate the need for conventional banking channels and intermediaries to complete the cross-border settlement. Conve","links":"https://www.zeebu.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zeebu/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8f9b4525681f3ea6e43b8e0a57bfff86c0a1dd2e"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4d3dc895a9edb234dfa3e303a196c009dc918f84"}}}