{"name":"SONE","id":"sone","symbol":"sone","description":"Sake Finance is an integrated liquidity protocol on Soneium. Sake is pioneering a new era of decentralized finance, where different modules work together seamlessly to provide the smoothest user experience. At launch, Sake Finance is going live with 3 different modules: Lending and Borrowing: Our lending and borrowing protocol is the backbone of the Sake ecosystem. It offers a diverse range of assets and provides the main source of liquidity that drives the rest of the protocol. It also implements solutions such as E-Mode to enhance portfolio return and efficiency. Overcollateralized Stablecoin: The second piece of the puzzle is our overcollateralized stablecoin, securely backed by yield-bearing tokens of the lending protocol. This stablecoin offers not only a reliable store of value but also extreme composability, enabling users to generate superior returns across our partner protocols. Leveraged Liquidity Strategies (LLS): Sake Finance's leveraged liquidity strategies offer an effortless way to leverage your assets, utilizing the liquidity and versatility of our lending, borrowing, and stablecoin. Powered by an innovative isolated smart contract design, these strategies offer users customizability while minimizing the complexity—perfect for both DeFi novices and veterans alike. The New Era of DeFi: Modular Integration The future of DeFi lies in integrated solutions that provide the seamless, user-friendly experience of centralized exchanges—without the custodial risks. Sake Finance is leading this charge by offering a fully integrated suite of decentralized financial tools within a single platform. From lending and borrowing to stablecoin and automated strategies, everything you need is in one place. This unified approach ensures that users can navigate their DeFi journey effortlessly, with complete control over their assets.","links":"https://app.sakefinance.com/","market_cap":479046,"market_cap_rank":5179,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sone/logo.png","detail_platform":{"soneium":{"decimal_place":18,"contract_address":"0xf24e57b1cb00d98c31f04f86328e22e8fca457fb","geckoterminal_url":"https://www.geckoterminal.com/soneium/tokens/0xf24e57b1cb00d98c31f04f86328e22e8fca457fb"}}}