{"name":"Shyft Network","id":"shyft-network-2","symbol":"shft","description":"Shyft Network is a public blockchain protocol designed to aggregate and embed trust and validation into data stored on public and private ecosystems, and permissioned and permissionless networks. By facilitating bridging across siloed datasets, Shyft allows for layering of context on top of data, ultimately turning raw data into meaningful information. Shyft Network is developing regulatory-compliant tools for Decentralized Finance that bridge the gap for centralized and decentralized organizations to ease their entry into the blockchain space. The goal is to aid mainstream financial institutions venture into DeFi and participate in a compliant manner. By lowering risk and exposure to money laundering, the Shyft Network could open up the crypto industry to large capital inflows and, potentially, millions of users from the mainstream markets. Additionally, Shyft Network has been developing identity solutions that help centralized and decentralized applications become compliant with existing regulations. In this regard, they have partnered with various other entities in the space, notably virtual asset services providers (VASPs) who must comply with the FATF Travel Rule. Veriscope, Shyft Network’s proactive approach to regulatory compliance, has been applauded for its ability to bring together some of the most prominent liquidity providers in the space and to accelerate the potential mass adoption of decentralized applications. Founded in 2017 in Bridgetown Barbados, Shyft Network was built by a group of founders that have collectively launched several successful companies in the ecosystem since as early as 2012. The Shyft Network core team is responsible for technical development of the network architecture, establishment of use cases for the network and for the SHFT token, and guiding the vision for network growth and development.","links":"https://www.shyft.network/","market_cap":843860,"market_cap_rank":3835,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shyft-network-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb17c88bda07d28b3838e0c1de6a30eafbcf52d85","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xb17c88bda07d28b3838e0c1de6a30eafbcf52d85"}}}