{"name":"FinnDuck","id":"finnduck_binance-smart-chain","symbol":"fduck","description":"FinnDuck ($FDUCK) is a BSC-based charity token dedicated to supporting autistic children through transparent blockchain technology. Launched in October 2025, FinnDuck represents every autistic child in need, with a mission to deliver sustainable assistance through the power of decentralized finance. Project Mission FinnDuck was created to address the challenges faced by autistic children from underprivileged families. Traditional charity models often lack transparency and sustainability. FinnDuck solves this by combining blockchain technology with social impact, ensuring every donation is traceable, transparent, and continuous. Our symbol, the duck with an orange, represents delivering love and hope to autistic children. The orange symbolizes warmth and care in autism awareness campaigns worldwide. Core Functions FinnDuck provides comprehensive support through four key pillars: 1. Continuous Financial Assistance: Direct cash aid to families of autistic children from low-income backgrounds, functioning as a long-term family fund rather than one-time donations. 2. Professional Rehabilitation Support: Systematic and scientific rehabilitation education guidance designed specifically for autistic children's developmental needs. 3. Personalized Education Platform: A free teaching APP (under development) that provides customized learning programs based on each child's unique condition and progress. 4. Complete Transparency: Each supported child has a dedicated on-chain wallet address with detailed case records. All fund flows are publicly disclosed and monitored by the community. Tokenomics and Mechanism FinnDuck implements a 3% transaction tax on every trade. This sustainable funding mechanism ensures: - Direct donations to autistic children families - Community operations and project development - Token buyback and burn for long-term value All tax revenue is managed through multi-signature wallets (current 2/3 multisig, upgradeable to 3/5 based on community growth), ensuring maximum security and transparency. Proven Impact Since inception until October 29, 2025, FinnDuck has successfully supported 16 autistic children families. Every single donation is documented with complete transparency. Supporters can verify all assistance records through our public Airtable database, including: - Recipient wallet addresses - Donation amounts and dates - Case documentation and progress updates - Video records of assisted families All data is cross-verifiable on BSC blockchain, demonstrating our commitment to accountability. Technical Implementation Built on Binance Smart Chain (BEP-20), FinnDuck leverages blockchain's inherent transparency and immutability. The project employs: - Multi-signature wallet system for fund management - On-chain verification for all donations - Smart contract-based automatic tax collection - Transparent token distribution tracking In October 2025, the project migrated to a new contract with enhanced tax mechanism. All previous holders' balances were technically mapped to the new contract, ensuring community continuity. Community and Governance FinnDuck operates with strong community governance principles. Our multi-language social media presence (Chinese and English Twitter, YouTube channel) keeps the community informed and engaged. Core holding members are invited to participate in multi-signature wallet management, embodying true decentralization. Vision FinnDuck aims to become a benchmark for blockchain-powered charity, proving that cryptocurrency can transcend speculation to create real social impact. We believe transparent, continuous support can genuinely improve lives of autistic children and their families. This is not just another meme coin—it is a warm promise to every autistic child, delivered through blockchain technology. FinnDuck demonstrates that decentralized finance can be a force for good, bringing love beyond slogans into tangible action. Join us in lighting up the world for autistic children, one transaction at a time.","links":"https://www.fangya.fun/","market_cap":164600,"market_cap_rank":6216,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/finnduck/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1094814045fe0c29023df28698ca539296cf7777","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x1094814045fe0c29023df28698ca539296cf7777"}},"is_native":false}