{"name":"Horizon Dollar","id":"horizondollar","symbol":"hzd","description":"•••WHAT IS HorizonDollar(HZD)? Horizon Dollar Token is a cryptocurrency created on the Binance smartchain. The Horizon Dollar ( HZD ) is created to increase worth across different sectors of life activities. The current financial transformation is offering a lot in stabilizing the activities of the financial world. Many communities across the world, most especially the community of young individuals have embraced the financial revolution and invested in cryptocurrency with high return in value. •••WHAT IS THE GOAL OF HZD? The Horizon Dollar Project has also outline to bring investment opportunities using cryptocurrencies and other fiat currencies, this will give chance and play a huge role in removing the burden of induviduals by alleviating poverty and paving the way to financial freedom. HZD project has aimed in bringing solutions to educational obstacles by introducing the charity activities easier in order to help those in the less previledge societies. The Horizon Dollar has come in place introduce the blockchain revolution to the global local communities, this will greatly help the people by simply educating those at the grassroot level about the blockchain technology. The HZD Token is aimed at becoming the best and diversed token that provides the most effective and simplified transactions across different sectors in the world of financial freedom. The HZD Foundation ecosystem comprises of communities with different functions. •••USE CASE? HZDeal is the most important part of the HZD project ecosystem, this is the market where one can buy or sell goods using the HZD and hence called ( HZD Market place). HZDVest is also an important part of the HZD ecosystem, people can be able to invest using HZD Token and other accepted crypto and fiat currencies. H Z D F r e e l a n c i n g job is the one where persons works for themselves, rather than for a company. While freelancers do take works on contracts for companies and organizations, they are ultimately self-employed. HZD Charity is also an important arm in the HZD ecosystem. It is very important to offer something good to the community. This is the trading platform where HZD can be traded or exchanged for other cryptocurrencies or some fiat currencies. HZD Contract is an API integration of smart contracts, where one can call a self executable smart contracts and sign for a sealed and most secured deal to ensure maximum security for business activities globally. Workers of the HZD Foundation will be paid using the HZD token and can immediately, sell or swap the HZD into other cryptocurrencies or fiat currencies. In the future people can be able to buy hash powers using BNB, TRON, USDT and BTC to mine the HZD token. This will help in increasing the value of HZD relative to increase in its number of holders, 1 billion coins will be available for mining. HZD EduHelp will provide materials needed for education at all level at a very discounted rate for the students and purchase can be made using the HZD token.","links":"https://www.hzdfoundation.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/horizondollar/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":4,"contract_address":"0xfefbbeebbeef18e3e4a2909f2b2729ca2fc61347"}}}