{"name":"Galactic Bonk","id":"galactic-bonk_solana","symbol":"g-bonk","description":"G‑Bonk is a memecoin built on the Solana blockchain that aims to combine fun community engagement with serious utility. Memecoins have captured the imagination of the cryptosphere, but many lack long‑term plans. G‑Bonk differentiates itself by coupling a lively mascot and viral appeal with a clear roadmap and real‑world applications. Our freshly redesigned website reflects this philosophy: a seamless journey through a unified starry backdrop that highlights how easy it is to join the adventure. New holders can now acquire $GBONK directly via multiple trusted portals – Dexscreener, DexTools and the GMGN swap aggregator – using popular wallets such as Phantom or Binance Wallet. This variety ensures a smooth onboarding experience regardless of your preferred trading interface. Vision & Mission Our vision is to create a vibrant ecosystem where holders are rewarded not only through speculative price appreciation but also through concrete utility. We will foster an inclusive community, provide innovative financial products and empower users to be part of a playful yet purposeful crypto project. Why Invest in G‑Bonk? Memecoins thrive on hype, but enduring value comes from substance. G‑Bonk offers both. The tokenomics are intentionally deflationary — a portion of the supply is permanently burned and the mint authority has been revoked — so the number of $GBONK in circulation can only decrease over time. Liquidity is locked and a treasury funds future listings, marketing and partnerships. The team allocation follows a vesting schedule to align long‑term incentives. Beyond the numbers, G‑Bonk is building real products. Holders will soon be able to stake their tokens for yield, trade on our custom DEX (G‑Trade) and even use a fiat–crypto bridge (G‑Bank). A thriving community of bonkers is already forming on X and Telegram, and the project has been listed on multiple DEXes and aggregators. By participating early you’re helping to shape a meme with a mission — and positioning yourself for future rewards.","links":"https://galacticbonk.com/","market_cap":32600,"market_cap_rank":8872,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/galactic-bonk_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"AjdCzXwien2FmTx3GDZeA6YX34A6rzhQCCZXSa7tqXJ4","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/AjdCzXwien2FmTx3GDZeA6YX34A6rzhQCCZXSa7tqXJ4"}},"is_native":false}