{"name":"Holdr","id":"holdr","symbol":"hldr","description":"Holdr is a Balancer Friendly Fork on the Aurora Chain. It's a multi-token automated market maker (AMM) that functions as a self-balancing weighted portfolio protocol. It allows anyone to create or add liquidity to customizable pools and earn trading fees. It mimics the concept of an index fund where assets are regularly being reallocated based on the price and returns of the assets. Index fund is a common financial instrument that helps investors to achieve risk diversification by maintaining a controlled risk exposure to a portfolio. Rather than paying a portfolio manager to actively or programmatically manage users' funds, Holdr helps solve a similar problem with smart contracts. How it works: 1. Weighted Pools Weighted Pools are highly versatile and configurable pools. They are ideal for general cases and enable users to build pools with different token counts and weightings, such as pools with 80/20 or 60/20/20 weightings. 2. Stable Pools For certain assets that are expected to consistently trade at near parity (e.g. different varieties of stablecoins or synthetics) a more efficient design is the StableSwap AMM as popularized by Curve. These pools allow for larger trades of these assets before encountering significant price impact. 3. Boosted Pools Boosted Pools will bring the best of both worlds to Liquidity Providers and Swappers. Swappers get access to deep stablecoin liquidity with near-parity exchange rates while Liquidity Providers get their liquidity positions sent to external protocols, such as Bastion. Tokenomics: The total supply of HLDR will be 100,000,000 HLDR tokens and distributed through the following allocations and schedules: 5% - Balancer (4% provided to the Balancer DAO Treasury (2y linear vesting, 6mo cliff). 1% provided as an airdrop to BAL holders) 15% - Solace DAO This allocation will be awarded across Solace DAO, Solace Launch DAO, and the active team members to compensate for the on-going work and to support Holdr protoco","links":"https://www.holdr.fi/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/holdr/logo.png","detail_platform":{"aurora":{"decimal_place":null,"contract_address":""}}}