{"name":"DOOM","id":"doom_solana","symbol":"doom","description":"$DOOM, based on Solana, is not just a token; it’s a bold declaration of fun, rebellion, and living life on your terms. It serves as a rallying cry for those who believe in seizing the moment and living it up before the world goes boom. Forget playing it safe – $DOOM is here to remind you that life’s too short not to YOLO. By holding $DOOM, you’re not merely holding a coin; you’re securing a front-row seat to crypto’s most exhilarating and unpredictable adventure. More than just a meme token, $DOOM represents a unique philosophy—a lifestyle centered around embracing chaos with humor, resilience, and audacity. It’s a celebration of living life to the fullest, even in the face of global uncertainty, financial turbulence, and societal challenges. $DOOM invites its community to embrace the unpredictability of the world and turn it into an opportunity for fun, value, and connection. Whether you're a seasoned investor or just joining the crypto space, $DOOM offers a thrilling experience like no other. Initial steps focus on expanding visibility through listings on major platforms like Coingecko, followed by a strategic push across Solana’s DEX ecosystem. These efforts are the foundation for $DOOM’s broader ambition to evolve into a multichain token. Looking further ahead, $DOOM’s ultimate goal is to secure listings on centralized exchanges (CEXs) in Q1 2025. The roadmap also includes exciting utility additions, such as integrating an AI conversational agent and launching a series of engaging games to foster community interaction and offer practical use cases for the token. At its core, $DOOM remains steadfast in its commitment to its community, delivering not only value but also a sense of joy and purpose. It’s more than a cryptocurrency; it’s a movement, a mindset, and a lifestyle. With $DOOM, the world of crypto becomes a stage for bold ideas, thrilling experiences, and a vibrant community united by the spirit of YOLO. Whether you’re in it for the fun, the gains, or the philosophy, $DOOM invites you to embrace the chaos and enjoy the ride.","links":"http://Doom.live","market_cap":23093,"market_cap_rank":9495,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doom_solana/logo.png","detail_platform":{"solana":{"decimal_place":3,"contract_address":"8Fvp3K1KxbDALnyVdy8Pvy8Xw96XVWjpauXLi7pXmygj","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/8Fvp3K1KxbDALnyVdy8Pvy8Xw96XVWjpauXLi7pXmygj"}},"is_native":false}