{"name":"Atlas Aggregator","id":"atlas-aggregator","symbol":"ata","description":"What is the project about? Atlas aggregator is a decentralized multi-chain yield optimizer that allows users to earn compound interest on their crypto assets. What makes your project unique? Atlas aggregator can provide investors with the highest APY yield in absolute safety. Atlas, a powerful aggregator, will support the income of every investor and will continue to strengthen the entire cryptocurrency community. History of your project. Atlas is a very young project on Arbitrum, the main project Atlas offering is the Vault. Atlas Vault is an investment tool for yield farming with specific strategies. They use automation to continuously invest and reinvest deposited funds, which helps achieve a high level of compounding. Instead of manually acquiring and selling rewards, buying more tokens, and constantly reinvesting them, the vault does all of this automatically at high frequency. Using Atlas vault to compound your earnings, you can save thousands of transactions, their associated gas costs, and valuable personal time. What’s next for your project? Atlas aggregator is a decentralized organization proudly governed by our $ATA token holders. This includes our founders, core contributors, and community members, as well as some external holders. All the big decisions of Atlas aggregator are made and voted on by our $ATA holders, including how the fees are set, where the protocol and its contributors are funded, how we market Atlas, and The direction of the future plans. What can your token be used for? ATA is the governance token of Atlas Aggregator. The use case and benefit of holding ATA is: ATA holders earn a portion of the Atlas aggregator's interest, and both holders and stakeholders have the right to participant in important governance.","links":"https://atlasfi.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/atlas-aggregator/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x296a0b8847bd4ed9af71a9ef238fa5be0778b611"}}}