{"name":"Panjea","id":"panjea","symbol":"panj","description":"What is Panjea (PANJ)? Panjea is a creative content focused blockchain designed to distribute equitable revenues to creators, curators and contributors. Value provided to the network is compensated by the protocol, based on the interactions and usefulness of the contribution. The entire system is designed to be a ‘user created’ or ‘content first’ network where rewards are distributed in a daily rewards pool. The protocol is an open source, full disclosure Layer 2 blockchain designed to incentivise, stimulate and promote user interaction, community and platform health and be rewarded in turn. It’s fundamentals are founded in the original ideas behind the internet, which are reimagined through the power of the blockchain. Panjea is a blockchain with a mission. Behind the platform sits a belief that the creator is the most important person on the web, and that their creativity and ideas have a huge value and benefit to mankind. Current financial models on the internet have sought to commoditise creators for the benefit of big business and advertising – Panjea seeks to redress this balance. The Aleph Zero blockchain was selected for the Panjea project, due to the speed and enterprise scalability on this privacy first system – and the company was founded on the 14th April 2021. The protocol aims to put the following functions into the hands of its community: • Content creation – adding different content types to the network • Curation – deciding on the links and structure of the network • Moderation – policing and maintaining health of the network • Contribution – running nodes and validating the network Who is behind Panjea? The team behind Panjea combines a wealth of disciplines across several industries. The original idea was created by long-time maverick thinker Kieron Bain, an early advocate of the web who had grown disenfranchised by the route the medium has taken in the last 15 years. He was joined by Luke Jobling (development), Lee Kerr (crypto t","links":"https://panjea.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/panjea/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}