{"name":"PointPay","id":"pointpay-2","symbol":"pxp","description":"PointPay is a cryptocurrency banking platform that has been in operation since 2018. The company is based in St. Vincent & the Grenadines, Estonia and Lithuania. The company serves more than 1 million active users worldwide. We strive to provide the broadest range of crypto banking services to every person with Internet access. Our Lithuanian company UAB Point Pay EU has a license to operate with digital assets. PointPay's ecosystem includes a blockchain-based bank, an exchange platform, a crypto wallet, and a payment system. PointPay crypto bank allows users to earn daily interest on their funds and get instant loans. We will soon launch crypto debit cards that will enable users to make online and in-store purchases just like with the usual debit card. PointPay Crypto Exchange offers three types of interfaces - Classic, Advanced and Quick Exchange. The Classic and Advanced versions are designed for experienced customers, while the Quick Exchange offers simplified exchange functionality. We also provide some of the lowest trading and withdrawal fees on the market. The PointPay crypto wallet provides a way to store digital assets on the blockchain, easily send them via email, and track their value over time. Our payment system allows customers to buy the most popular digital assets directly from debit and credit cards for fiat currencies such as USD, EUR, GBP, etc. The PointPay blockchain-based bank allows users to earn interest on 13 of the most popular digital assets, including stablecoins USDT, USDC, and DAI, by simply funding Checking or Savings accounts. We offer a transparent and simple interest rate that allows anyone to earn up to 8% APY on their assets. Furthermore, users can stake PXP tokens to earn up to 20% per year on their PXP token holdings. With just a few clicks, our customers can lock their holdings for 3, 6, or 12 months to earn rewards on a progressive scale - the more tokens they invest, the higher the reward will be at the end of the period. Crypto banks allow anyone to apply for a loan and receive funding within minutes. PointPay customers can lend seven popular cryptocurrencies with USDT as collateral. Crypto loans typically do not require a credit check because digital assets serve as collateral for transactions. We believe that the future of banking will be built on blockchain technology. PointPay is excited to be at the forefront of the crypto banking revolution, providing a platform with the broadest range of crypto banking services in-house. Our goal is to enable financial freedom by offering universally accessible crypto banking services.","links":"https://pointpay.io/referral/40d2c818-a4e9-4834-bcda-c4f11a1b243d","market_cap":1523224,"market_cap_rank":2789,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pointpay-2/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x15fa5d3dbd11a831b72b92c1705bc9f801e233cb"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x15fa5d3dbd11a831b72b92c1705bc9f801e233cb"},"ethereum":{"decimal_place":18,"contract_address":"0x15fa5d3dbd11a831b72b92c1705bc9f801e233cb"}}}