{"name":"ADreward","id":"adreward","symbol":"ad","description":"What is the project about? ADreward is a WEB 3.0-based platform, and AD Token is used as a reward for purchasing advertising products and advertising rewards. AD tokens are used when registering advertisements, and users and influencers who participate in advertisement products receive AD tokens as rewards. Ad product purchasers can use Adreward's AD Token to register ads, which are used as user rewards. Buyers of advertising products can also use their own separate tokens as rewards. Users can receive rewards for completing Telegram channel entry, twitter follower, YouTube subscription, Discord channel participation, and kakaotalk entry. You can also receive compensation from other advertisements registered by the purchaser of the advertisement product. What makes your project unique? Global SNS marketing and rewards are available. 1. Confirmation of accurate marketing activities 2. Available to all users through B2B, B2C, C2C marketing 3. Marketing with various rewards History of your project. Since 2014, we have been servicing global mobile games and have also served as marketing agencies. In addition, by developing a global SNS marketing solution based on experience as a marketing agency, it was possible to apply blockchain technology, the best technology that allows users to voluntarily register for SNS advertisements and give rewards to participants, and common payment and rewards for global users became possible. What’s next for your project? It is to provide more convenient services by creating various global SNS marketing solution updates and mobile applications. What can your token be used for? It is used for advertising purchases and advertising activity rewards. • Purchase of advertising products • advertising rewards • Participate in event after deposit","links":"https://adreward.io","market_cap":2587.78,"market_cap_rank":10349,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/adreward/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe973e453977195422b48e1852a207b7ee9c913c7","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe973e453977195422b48e1852a207b7ee9c913c7"}}}