{"name":"MARBLEX","id":"marblex","symbol":"mbx","description":"MARBLEX, under the slogan “Fun Comes First,” uses blockchain technology to build a next-generation gaming and content ecosystem that prioritizes fun and immersion. By leveraging global success stories, expertise in virtual economy construction, and a diverse portfolio of game genres, MARBLEX delivers a Web3 entertainment experience to users. The MBX token serves as the main currency in the MARBLEX ecosystem and lets users engage with blockchain games and services integrated to MARBLEX. Through Marblex's Game, GameFi, and NFT services, users will gain access to a wide array of entertainment options and tangible value. Features and Highlights [Game] -Netmarble & 3rd Party Games The MARBLEX ecosystem features various games, including Netmarble’s AAA titles such as cartoon-rendered MMORPG Ni No Kuni: Crossworld, casual board game Meta World: My City, and idle growth game Pocket Girls: Idle RPG. -MBX Station The MBX Station makes it easy for users to exchange in-game currency for MBX tokens, and provides minimal integration friction for game developers seeking to access Web3. -Creator Program MARBLEX runs a smart contract-based global sponsorship program for game creators. This program rewards core gamers and followers for their contribution to the ecosystem. [Game-Fi] -MBX Swap MARBLEX ecosystem participants can swap MBX tokens for various game tokens or across different networks, and also stake MBXL tokens. -MBX Wallet The MBX Wallet lets users store, view, and transfer tokens within the MARBLEX ecosystem. By linking sign-up and login processes, MARBLEX streamlines connections between games and blockchain services. [NFT] -NFT Adventure NFT Adventure offers an interactive NFT service that gamifies popular IPs or game characters, with the most notable example being Koongyaz Restaurants. -MBX NFT Users can level up, combine, and upgrade NFTs to earn benefits such as game coupons and rewards.","links":"https://marblex.io","market_cap":41647387,"market_cap_rank":765,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/marblex/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf95a5532d67c944dfa7eddd2f8c358fe0dc7fac2"},"aptos":{"decimal_place":8,"contract_address":"0x665d06fcd9c94430099f82973f2a5e5f13142e42fa172e72ce14f51a64bd8ad9::coin_mbx::MBX"},"klay-token":{"decimal_place":18,"contract_address":"0xd068c52d81f4409b9502da926ace3301cc41f623"}}}