{"name":"Arcane Owls","id":"arcane-owls_base","symbol":"owls","description":"Arcane Owls are not just NFTs — they are fragments of an ancient prophecy. 5060 mythical creatures return on Base, each carrying secrets of light and shadow. At the heart of their power lies $OWLS — the energy of the flock, binding Keepers together and fueling the future of our community. The Legend of the Owls Chapter I: The Prologue Before gods, before men, there was only chaos. And from chaos came the Owls — ancient witnesses of creation, guardians of both Light and Darkness. Their eyes reflected stars that did not yet exist. Their feathers carried whispers of futures yet to come. They did not build kingdoms, nor kneel to gods. They were above them all — the Watchers. The Keepers of Prophecy. Chapter II: The Age of Silence For thousands of years, the Owls wandered between worlds. They entered human dreams, marking their souls with signs of fate. Some called them omens of death. Others believed they were bringers of wisdom. But the truth was greater: Each Owl carried a fragment of the Great Prophecy, written not in ink, but in shadow and starlight. Chapter III: The Falling Star On the night when the tenth moon bled, the skies were torn apart. From the rift between worlds, the Arcane Owls returned — 5060 mythical beings, each holding a piece of destiny. Their glow pierced the dark. Their presence bent reality. But they did not come for all. They came to choose. Chapter IV: The Chosen Keepers Those who hold an Owl are not mere collectors. They are Keepers — bound to the eternal covenant. Each Owl does not obey. It chooses its bearer. Some are drawn to seekers of truth. Others — to hunters of power. But every Keeper becomes part of the Prophecy. Chapter V: The Prophecy of Night Wings Legends speak of a time when all 5060 Owls find their Keepers. When that happens, the Prophecy will awaken. From feathers, a map will form. From eyes, the skies will burn. And with the light shall rise an ancient Darkness, older than men, older than gods. Only the united Flock will stand against it. Chapter VI: The Age of $OWLS From the return of the Owls came a new power — $OWLS, the crystallized energy of their wings and cries. $OWLS are not mere tokens. They are fragments of myth, shards of magic fallen from the eyes of the Owls themselves. They bind Keepers together, reward the loyal, and unlock rituals, artifacts, and hidden worlds yet unseen. Epilogue: The Awakening Arcane Owls are not just an NFT collection. They are a living legend, reborn on the blockchain. 5060 Owls. 5060 fragments of prophecy. Each choosing its Keeper. The question is not if the Prophecy will be fulfilled. The question is when.","links":"https://arcaneowls.com/","market_cap":15729.61,"market_cap_rank":10248,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arcane-owls/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xe6603e9d1d2bd411e2d2815e44a197b6ff8402b7","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xe6603e9d1d2bd411e2d2815e44a197b6ff8402b7"}},"is_native":false}