{"name":"Moon The Cat","id":"moon-the-cat","symbol":"moon","description":"Introducing Moon the Cat, the purr-fect memecoin clawing its way to the top of the crypto universe! Inspired by our adventurous feline friend named Moon, this coin isn't just another digital asset—it's a cosmic journey. Moon's mission? To visit the moon and conquer the stars, taking every holder along for the ride. From launch day, Moon the Cat captured the hearts of crypto enthusiasts and meme lovers alike. Our mascot—a whimsical cat in astronaut gear—symbolizes the coin's quest for astronomical heights. Investing in Moon the Cat means joining a community as lively and curious as a kitten chasing a laser pointer. But what's a memecoin without solid tokenomics? Moon the Cat is designed with its community in mind. Every transaction redistributes a portion to existing holders, so your stake grows just by holding—much like a cat accumulating hidden treasures. Another portion feeds the liquidity pool, ensuring stability as Moon makes its lunar leap. Social media is abuzz with Moon the Cat memes, fan art, and animated clips. The community's engagement showcases the coin's viral potential. Influential crypto voices are taking note, spotlighting Moon the Cat as a promising new player in the altcoin arena. But Moon the Cat is more than just a memecoin; it's a movement fueled by transparency and community engagement. The development team hosts regular AMA sessions, welcoming feedback and ideas. Their roadmap includes listings on major exchanges, NFT integrations, and partnerships with animal charities—because supporting our furry friends is part of the mission. Imagine being part of a crypto project where every milestone feels like a collective victory. When Moon the Cat hits new highs, it's not just about financial gains; it's about celebrating a shared journey from Earth to the stars. The coin embodies the adventurous spirit of its namesake, always reaching for the next big leap.","links":"https://moonthecat.com/","market_cap":174188,"market_cap_rank":4524,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/moon-the-cat/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"FHHeb1ji8Qm5Nq68S8zPV9HCPbE7YBdBmV7fgqYRpump"}}}