{"name":"CYC'Lock","id":"cyc-lock","symbol":"cyc","description":"Cyc'Lock's ambition is to develop over the years different services through IoT; the first project concerns bicycle parking. Cyc'lock creates and makes accessible closed parking lots with its locking system and its connected garage. Once the parking lots are connected, we make them accessible to cyclists via our smartphone application. To create this parking network, we offer companies and administrations two different products: - If they already have one or more garages, we equip them with our connected locking system. This allows us to integrate them into the Cyc'lock network. - If they do not already have garages, we offer them our own model, composed of individual and connected boxes. The cyclist will then be able to access the network of bike garages using his smartphone, for a monthly subscription fee. The Use of the $CYC token: In order to quickly offer a sufficiently dense network, Cyc'lock wishes to invest in the network by financing part of the development of the garages (equipped parking spaces, etc.) on spaces made available by partner municipalities. The $CYC token allows investors to contribute to the development of the parking network and to the growth of the company while getting a fair return. One of Cyc'Lock's core values is sharing. Through the business model we have developed an idea that allows all stakeholders in the ecosystem to benefit in their own way. The economy of the $CYC token is built around NFTs, staking offers and benefits for the services offered by the company. Investors can diversify their portfolio by supporting a real-world project with a long-term vision to improve urban mobility services. Your opinion is important to us, owning $CYC tokens gives you access to the governance of the project by voting for the proposed consultations.","links":"https://www.cyclock.co/token-en","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cyc-lock/logo.png","detail_platform":{"elrond":{"decimal_place":9,"contract_address":"CYC-b4ed61"}}}