{"name":"Orbler","id":"orbler","symbol":"orbr","description":"What is the project about? Orbler is an innovative Web3 application platform designed to bolster the activities and interactions of Web3 projects on social media. By introducing a unique \"Mission\" format, we enable captivating digital adventures that drive community engagement and strengthen the online presence of a Web3 project. What makes your project unique? Orbler stands apart in its approach to community engagement. Unlike typical platforms, we intertwine entertainment and task accomplishment through our \"Mission to Earn\" concept. This not only provides rewards but also offers curated tasks that enhance connectivity among peers and fosters an enriched Web3 experience. History of your project. Orbler began as a Play-to-Earn (P2E) game project, dabbling with NFTs and aiming to create a bridge between gaming and the blockchain world. Recognizing the expansive potential of Web3, Orbler pivoted, leveraging its core strengths to cater to Web3 projects, enhancing their social media footprint and community engagement. What’s next for your project? The future looks bright and expansive for Orbler. We are on the brink of unveiling a refreshed website, a brand-new logo, and, most importantly, our application platform. All these are deeply rooted in our mantra, 'From Community, For Community'. Our goal is to further the reach and potential of Web3 projects and communities, giving them the tools and platform they need to thrive. What can your token be used for? While the precise utilities of the Orbler token will be detailed in our forthcoming whitepaper, anticipate its pivotal role in powering the \"Mission to Earn\" concept. It will act as a reward for users engaging with missions and possibly play a role in staking, and other functionalities that drive the Orbler ecosystem forward.","links":"https://orbler.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/orbler/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xda30f261a962d5aae94c9ecd170544600d193766","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xda30f261a962d5aae94c9ecd170544600d193766"}}}