{"name":"Konan of Kaspa","id":"konan-of-kaspa","symbol":"konan","description":"$KONAN of Kaspa: The Dog and Hero of Kaspa $KONAN of Kaspa is a unique memecoin created in honor of a heroic military dog who has been recognized by world leaders for his extraordinary missions. This token goes beyond traditional cryptocurrency by embodying the values of loyalty, unity, and world peace, with the mission of positively impacting communities across the globe. What sets $KONAN of Kaspa apart is its 100% Fair Launch and community-driven approach. From day one, the project was designed to ensure equal access for everyone, with no pre-sales, team allocations, or special advantages. The community is at the heart of $KONAN of Kaspa, making all decisions through decentralized governance. This fair and transparent model ensures that every holder is a vital part of the project’s success. Running on the Kaspa Proof-of-Work (PoW) blockchain, $KONAN benefits from fast, secure, and scalable transactions, while staying true to the principles of decentralization. Kaspa’s PoW system guarantees that the network is highly secure and energy-efficient, while enabling a trustless environment where users can engage without intermediaries. This technological foundation allows $KONAN to focus on growth, innovation, and the well-being of its global community. More than a financial tool, $KONAN of Kaspa is a symbol of collective strength, inspired by the loyalty and heroism of the dog who stands at its core. The project envisions uniting people across the world, fostering a spirit of collaboration and promoting global peace. As $KONAN of Kaspa grows, it aims to use its platform to drive meaningful change and inspire others to do the same, creating a better world for all. With a focus on transparency, community involvement, and technological innovation, $KONAN of Kaspa is positioned to not only thrive in the blockchain space but to make a lasting positive impact on a global scale.","links":"https://konanofkaspa.com/","market_cap":1551872,"market_cap_rank":3440,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/konan-of-kaspa/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}