{"name":"Soy Finance","id":"soy-finance","symbol":"soy","description":"## Soy Finance Launched on the 1st of October 2021, SOY Finance is a decentralized exchange providing trading, yield farming, and blockchain-based financial services on the Callisto Network blockchain. According to the team, SOY Finance is the world’s safest decentralized exchange, adhering to industry best practices and adopting the highest level of security and standards: - Whitelisting of audited tokens. - Hybrid ERC20 and ERC223 token standard. - Decentralized insurance. To date, SOY Finance has processed nearly 2 million transactions for over $70 million in value. ## Decentralized Insurance The decentralized platform ensures that tokens that have been audited through its whitelisting process are insured by its own decentralized insurance fund, guaranteeing users' losses in the event of a hack or software error. ## Soy Token SOY Finance has its own utility token used for fees for processing assets listing and paying for the SOY platform services. SOY tokens will provide voting rights on certain governance decisions, once the governance system will be deployed. ## Roadmap Part of the SOY Finance roadmap [roadmap](https://soy.finance/roadmap) includes the deployment of SOY Finance DEX on the leading blockchains, which will allow reaching an unprecedented level of liquidity. ## Upcoming Milestones: - Multi-chain deployment - SOY advanced cross-chain bridge - Advanced NFTs Integration - Soy Multi-Dimensional Staking - Improved User Interface - Governance System - CryptoBot Wallet integration","links":"https://soy.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/soy-finance/logo.png","detail_platform":{"callisto":{"decimal_place":18,"contract_address":"0x9fae2529863bd691b4a7171bdfcf33c7ebb10a65"},"ethereum-classic":{"decimal_place":18,"contract_address":"0xcc67d978ddf07971d9050d2b424f36f6c1a15893"},"bittorrent":{"decimal_place":18,"contract_address":"0xcc00860947035a26ffe24ecb1301ffad3a89f910"}}}