{"name":"The American Dream","id":"the-american-dream_solana","symbol":"dream","description":"The American Dream was never meant to be a shortcut. It was never a guarantee, a lottery ticket, or a viral moment away from success. At its core, it was an agreement between the individual and the system: if you are willing to work, learn, take risks, fail, and try again, you deserve the opportunity to build something meaningful over time. The American Dream Coin exists to reclaim and preserve that original meaning. In today’s world, the Dream has been distorted. Social media compresses decades of effort into highlight reels. Financial markets reward hype more than substance. Many people feel locked out—told the game is rigged, that hard work no longer matters, that only insiders win. The result is cynicism, impatience, and disengagement. The American Dream Coin is a counter-narrative to that mindset. This coin is not about getting rich overnight. It is about honoring the long road. It represents the reality behind every true success story: years of uncertainty, invisible work, rejection, and persistence. It stands for the immigrant who arrives with nothing but skills and belief. The founder who fails multiple times before finding product–market fit. The artist, builder, or worker who compounds effort quietly while the world looks elsewhere. The American Dream Coin is symbolic before it is financial. It is a reminder that value is created, not extracted. That progress is nonlinear. That failure is not disqualification—it is tuition. Holding this coin is meant to feel like holding a commitment: to self-reliance, to discipline, to growth over time. Not because success is guaranteed, but because the attempt itself is meaningful. Importantly, the coin does not deny structural challenges or inequality. Instead, it asserts something equally important: agency still matters. Choices still matter. Time and effort, when consistently applied, still change outcomes. The Dream has never been equal in starting points—but it has always been about the right to try, to build, and to rise without asking permission. The American Dream Coin also serves as a cultural signal. It says we value builders over speculators, resilience over clout, and long-term thinking over instant gratification. It aligns with people who see wealth not just as money, but as skills, ownership, freedom, and optionality. People who understand that the most valuable things compound slowly. Ultimately, this coin is not a finish line. It is a flag planted at the start of the journey. A shared belief that the American Dream is still alive—not as a myth, but as a process. Difficult. Imperfect. Worth it. The American Dream Coin exists to remind us that dreams don’t expire. They’re earned.","links":"https://adusd1.com/","market_cap":124483578,"market_cap_rank":361,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-american-dream/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"51akgSdiNy3UvFqSu82wL2TNYPtXZJ1yWXGENp9obonk","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/51akgSdiNy3UvFqSu82wL2TNYPtXZJ1yWXGENp9obonk"}},"is_native":false}