{"name":"The Atlas Coin","id":"the-atlas-coin","symbol":"$atlas","description":"Atlas is a Metaverse Project with Triple Yield Income System- Atlas Vault ,Yield Farms, Super-App The Atlas Project works to revolutionize upon the ever-growing concepts & thematics found within the crypto & web3 spaces by offering unique products that will contribute to the expansive growth that this sector is to see within the coming years. The Native Token of the Atlas Project, $ATLAS, is custom designed & fitted with a triple-yield earning structure that works to ensure investors benefit fortuitously in multiple ways on a consistent basis. All of which backed & supported by a sustainable protocol. This revolutionary earning structure consists of the: Rebase Engine, Vault, & Yield Farms. The Atlas Project also has may exciting products under its fold that vary in developmental progress overall. The first being the heart of the Atlas Project, \"Petoverse Pets Adventure\" MMORPG! Petoverse is an interactive animal themed mmorpg being built in the metaverse. Here investors can immerse themselves in a world designed for adventure with a major focus on social elements paired with the ability to earn! Next on the Atlas product watchlist is the \"Atlas Super App\". A customized mobile app thats features prioritize asset management while introducing social elements in order create an all in one investment/social platform. One that will be uniquely tied into the Atlas Ecosystem & incorporable in all future Atlas products & ventures. The Atlas Team is proud to welcome the next major stage in the Petoverse Game development roadmap, which is the commencement of our “Open to All” testing. This phase signifies the first major public release of the Petoverse Game. However, it is important to remember that the game is still in its test phases & is near its final product.","links":"https://www.theatlascoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-atlas-coin/logo.png"}