{"name":"Coinlocally","id":"coinlocally","symbol":"clyc","description":"CLYC is the native cryptocurrency token of the crypto trading platform of Coinlocally Exchange. It is a decentralized digital asset which will launch first BNB network (BEP20). And can be purchasable by BNB. Coinlocally Forms a route for all types of people from beginners to experts by preparing all-in-one platforms such as Demo Trading , Spot Trading , Derivatives and Futures Trading, Margin, Staking, Savings, NFT marketplace, ... and expanding its community by tools like, social trading, copy trading, profit sharing, .... to empower and grow cryptocurrency market and in general all financial markets. they provide both Centralized Exchange and Decentralized (DEX), however It’s not only an exchange, it works like an ecosystem to reach out its final goal which is a Bank DEX (a Decentralized Bank) governed by people. This ecosystem tries to prepare all the tools to assist people achieve financial freedom. “ Their Vision is financial freedom for people“ Coinlocally has been launched officially in the early of 2022 by starting its partnership with Binance, as an approved Broker to use the binance infrastructure and most volume trading depth market. However there are going to be also some different aspects to make it more unique on this huge market. Based on their roadmap for 2023 its next project is copy trading and social trading platforms which both would be done in the first quarter of 2023. Creating its own token of cryptocurrency allows Coinlocally makes their users get more involved in whole process and use their value and, to build a comprehensive marketing strategy to grow its platform by having a huge community in order to attract more users and accelerate it. There are many benefits of CLYC token, such as using discount for trading, listing token on coinlocally, withdraw fee and for holders who wants to stake their CLYC, they can take profit monthly, also there is an VIP users in some levels to get benefited from all features of CLYC Coin.","links":"https://coinlocally.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coinlocally/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa43d3e03d001492eb586db0990cb90d0c3bbe511"}}}