{"name":"altFINS","id":"altfins","symbol":"afins","description":"What is altFINS? altFINS is a cloud-based platform for retail and institutional investors to conduct technical and fundamental investment analysis, trade and track digital assets across exchanges and wallets. altFINS was founded in June 2018 and the platform was launched in August 2020. What makes altFINS unique? altFINS platform ingests over 500M price and volume data records per day and calculates 120 analytics (MACD, RSI, EMA, etc.) across 5 time intervals (15 min, 1 hour, 4 hrs, 12hrs, 1D) and over 8,000 coins and assets. This amounts to over two billion of computations a day, which requires a robust data management infrastructure and processes. Users can interact with the platform though the web and mobile apps. altFINS platform focuses on pre-trade analysis of altcoins. It offers a unique market scanner that enables traders to create their own custom filters using 120 technical indicators. This enables traders to find trading ideas among thousands of altcoins in a timely and efficient manner. The platform also automatically recognizes certain trading chart patterns (Wedges, Triangles, Channels, Head and Shoulders, etc.) and predicts future price trajectory, giving traders another useful trading tool. It also enables alerts, portfolio monitoring across exchanges and wallets, Twitter news aggregation across thousands of altcoins, and execution via exchange APIs. It's the only platform that will capture the full trading workflow: pre-trade analysis, trade execution, post-trade performance analysis and asset tracking. altFINS Education Program The platform offers trading education webinars and content. AFINS HODLers get access to a comprehensive education program that includes a series of 10 webinars that teach traders basic technical analysis (TA) concepts and how to take full advantage of the platform's capabilities. AFINS is a native utility token used for: - Access into the platform - Access to trading education - Access to fundamental research","links":"https://altfins.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/altfins/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xb648fa7a5f5ed3b3c743140346e3dc3fe94a9125"}}}