{"name":"Humanize","id":"humanize","symbol":"$hmt","description":"We are a cryptocurrency trading company specializing in education and support for novice and professional traders based in Dubai - UAE. We believe that cryptocurrency and all technologies should be more “humanized” and accessible to everyone. In recent years, we have seen many people lose their money and life savings due to market manipulation or simply the lack of knowledge due to how complex the entire crypto sphere is for the average human being. We exists to humanize automated and cryptocurrencies trading and make it available to everyone. In our academy, we will make our technical analysis algorithm available, we will explain how to correctly approach the market, topics such as risk management will always be present and it will be the topic where we will apply a lot of attention and support. We will introduce multilingual support to break this barrier. Our support team will be made up of experienced traders and aligned with the company's philosophy. Our HMT Token will be used to pay the academy fees, for the stakers or holders we will give special discounts and advantages. HMT runs natively on BSC, 95% of the total supply will be locked and released according to pre-established rules, this guarantees its users that the team and the company will remain committed in the long term. We will use part of the profits of the business to buyback tokens and burn them so that, in this way, we can constantly reduce the HMT circulation supply. We have a project being developed by the legal and IT team that will solve a \"humanization\" problem in the crypto sphere. We are not going to announce it yet to protect the idea but we are sure it will be well accepted by the crypto community. It will also be beneficial for users of our HMT token. “The measure of our lives is not determined by what we achieve for ourselves; it’s determined by what we share, give, and contribute to others.” – Marie Forleo This sentence clearly reflects our mission, we will use the proceeds from sales of our NFT collection and allocate part of the profits to our Humanize Foundation to spread kindness and help for those who need it most. We will never forget our planet, which also needs the intervention of all of us to minimize the damage that human beings have caused over the last few decades. A project made by people for people.","links":"https://humanizecrypto.com/index.php","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/humanize/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":8,"contract_address":"0x71e67b8d88718d113fc7edbd95f7ca380222b3c6"}}}