{"name":"WingRiders","id":"wingriders","symbol":"wrt","description":"About WingRiders Wingriders Cardano DEX offers token-to-token swap, swapping in stableswap pools, ADA auto-staking, and yield farming. The platform brings the possibility to gain rewards in 6 ways. Supports Ledger and Trezor hardware wallet integrations including direct Android connection, and is DAO-operated. What Makes WingRiders Unique? WingRiders is a Cardano DEX offering DeFi services including swapping, staking and yield farming. Aiming to be the best DEX on Cardano since inception, WingRiders is one of the top two DEXes on Cardano by TVL and volume, facilitating token to token swaps not only via ADA but across multiple Cardano tokens; WingRiders were also the first to bring stablecoins and stableswap pools to Cardano; First to integrate directly with top hardware wallet services and even more. History of WingRiders WingRiders has been live on Cardano Mainnet since April 2022. The platform went live with a direct token-to-token swap, liquidity providing, ADA auto-staking, and selected token yield farming. What’s Next for WingRiders WingRiders aims towards platform full decentralization while building partnerships with other technological projects to support Cardano's open-source world for the whole ecosystem's benefit. Users can look forward to new single and double-yield farms, Vasil-compatible version of smart contracts with v2 features resulting in faster and cheaper transactions, continuous improvements of UX/UI, and features either requested by, beneficial to, or oriented on the community. Due to the ecological problems the whole world is facing, WingRiders plans donations via an eco fund aimed at rewilding our planet. What Can WingRiders Token Be Used For? WRT, The Wingriders Governance token, can be used for DAO governance and voting, it's farmable and can be used for yield boosting of Cardano tokens on the platform via the boosting vault. With full breakdowns on all token benefits here - https://www.wingriders.com/wrt","links":"https://www.wingriders.com/wrt","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wingriders/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"c0ee29a85b13209423b10447d3c2e6a50641a15c57770e27cb9d507357696e67526964657273"}}}