{"name":"WingRiders","id":"wingriders","symbol":"wrt","description":"WingRiders is an Automated market maker (AMM) decentralized exchange (DEX) on top of the Cardano eUTxO model live on the main chain. The project's code base is powered by VacuumLabs, one of the most widely respected developers in the Cardano space from its inception. It is the only DeFi Eco on Cardano with Stablecoins Nearly 100% of the USDC and USDT on Cardano is on Wing Riders' smart contracts. The net amount is growing rapidly, at a pace of 60% each week. Wing Riders is utilizing the opportunity to become the complete DeFi Hub on Cardano, a $15B+ economy. WingRiders is the first platform to introduce stablecoins to the Cardano ecosystem. It’s been done via partnership with Milkomeda by bridging Ethereum assets to Cardano (namely wrapped USDC, USDT, ETH and wBTC). Another first in Cardano is the ability to stake ADA provided in liquidity pools, thus supporting Cardano’s decentralization - the users are able to vote to which pool the ADA is delegated. Additionally, WingRiders are the only DEX on Cardano with direct integration of HW wallets, thus being the most secure one. It supports direct use on Android via a Ledger connected by a USB-C cable. WingRiders token holder can participate in the voting on key decisions for the project’s future, like protocol and fee parameters,... new features,... upgrading smart contracts… or which farms will be enabled, including their reward allocation. Having the token in certain amount tiers gives you access to advanced platform statistics. It will have its own farm allowing you to maximize your gains from activity on the platform. By holding WRTs you can farm higher yields, rather than without them. Also, you can buy selected NFTs and FTs for lower prices when paying with WingRiders tokens. During various campaigns for the community you’ve got a higher probability of airdrops. When decentralization of the agent comes, their collateral will be collected in WRTs. Without them you won’t be able to become an agent.","links":"https://www.wingriders.com/wrt#metadata","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wingriders/logo.png"}