{"name":"EGG","id":"egg","symbol":"egg","description":"Egg is a decentralized meme coin that pays homage to the viral Instagram egg of 2019, with an ambitious goal to flip Pepe as the reigning meme in the crypto space. As it embarks on this exciting journey, Egg aims to become the most viral meme on the Solana blockchain. Serving as a playful and entertaining cryptocurrency, Egg offers a unique platform for community engagement and rewards. Its standout utility lies in enabling users to participate in meme battles, providing both entertainment and potential rewards. With its presence across multiple chains and a community-driven ethos, Egg is more than just a meme coin; it's a lighthearted yet promising venture for investors and meme enthusiasts looking for a dynamic and engaging experience in the crypto world. Once upon a time, in the bustling world of cryptocurrencies and internet memes, there was a visionary known as Klaid \"MemeMaster\" Eggerson. Klaid, the founder and CEO of EGG, was as quirky as he was brilliant. The story goes that one sunny afternoon, while scrolling through social media, Klaid stumbled upon the record-breaking Instagram egg of 2019. As he chuckled at the egg's simplicity yet viral nature, a lightbulb flickered in his mind. \"Why not create a meme coin that's just as fun and community-driven?\" he thought. Thus, EGG was born. But here's the twist: Klaid always believed that the true essence of a meme is its ability to belong to everyone and no one at the same time. So, he decided that while he may have cracked the egg, it was the community that would make the omelet. Klaid is known to say, \"I might have laid the first EGG, but it's the community that hatches it.\" He envisioned EGG as a project where everyone could crack jokes, share laughs, and maybe even make a few bucks along the way. Egg is built on the Solana blockchain, renowned for its high-speed and low-cost transactions. This technical foundation is key to Egg's ability to offer a seamless and efficient user experience.","links":"https://cryptoegg.org/","market_cap":630380,"market_cap_rank":3018,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/egg/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"4ynyx6BzY2XGFgjjun9Cruj1bSRo8FLsAqNnPsW6jDsu"}}}