{"name":"MonaCoin","id":"monacoin","symbol":"mona","description":"MonaCoin is an open source digital currency and a peer-to-peer (p2p) payment network. Dubbed by its creators as “the first Japanese cryptocurrency,” the coin has become somewhat of Japan’s national alternative to <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> or <a href=\"https://www.coingecko.com/en/coins/litecoin\">Litecoin</a>. Like its predecessors, the coin was created purely to serve as P2P electronic cash, a decentralized digital currency aimed at Japanese citizens. There are a few key differences that set it apart from the coins that came before it, and this guide is dedicated to drawing out these differences. Conceived in December of 2013, Monacoin was officially born on January 1st, 2014 with no premine. A Bitcoin Talk Forum on the same date details the coin’s launch and its specifications. A soft fork was executed at block 937440 to implement Segwit, a move made to keep it in line with Bitcoin, Litecoin, <a href=\"https://www.coingecko.com/en/coins/vertcoin\">Vertcoin</a>, and other payment-focused cryptocurrencies. In addition, the Monacoin team has reportedly implemented the Lightning Network for their coin. Speaking of soft forks, Monacoin is actually a hard fork of Litecoin, something we’ll take into account further as we look into its specs below. Monacoin was originally founded by the pseudonymous Mr. Wantanabe, no doubt in homage to Bitcoin’s Satoshi Nakamoto. Besides this pen name, the rest of the coin’s team is completely anonymous, so there’s nothing to report on here. In addition, the project has no visible roadmap on its site or anywhere else online. The team does seem to stay on top of updates and upgrades, however, as the Segwit and <a href=\"https://www.coingecko.com/en?hashing_algorithm=Lyra2RE&view=market\">Lyra2REv2</a> updates and Lightning Network implementation suggest. It is popular in Japan where it was developed. It Uses Lyra2REv2 and Dark Gravity Wave v3 algorithm to ensure fairer mining opportunities, success rate and difficult levels of mining process respectively. Monacoin is the first cryptocurrency from Japan. It has received wide support and success in the country and is not crossing the national boundary to try and become a global phenomenon. While that is not going to happen in the next year or two, it does have the making of a good crypto token. It is steadily improving its service and has constantly strived to give its users the best possible experience. When <a href=\"https://www.coingecko.com/en?hashing_algorithm=Scrypt&view=market\">Scrypt</a> compliant ASIC miners appeared they switched to Lyra2REv2 to ensure the mining MONA remains a fair battle between miners from around the world. The instance of a Japanese national using Monacoin to buy land made news in the country and beyond, spreading the popularity of the coin.","links":"http://monacoin.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/monacoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}