{"name":"GOLCOIN","id":"golcoin","symbol":"golc","description":"GolCoin is the main key powering a complete ecosystem including an investment (staking) platform, a pioneering exchange, a revolutionary Metaverse, a mining facilitation platform, and the next generation of NFT marketplaces. As a multichain token, GolCoin makes sure that the token holders can access their assets easily and don't miss any opportunities on different networks. Each part of this ecosystem has lots of innovations presented to the crypto world. Agharta, the metaverse: The metaverse, named Agharta, offers a great metaverse with graphics much more powerful than any other blockchain-based metaverse, along with different sub-platforms mentioned below. MetaGol: An innovative VR game is the perfect evolution in a long line of social technologies. MetaNow: A messaging and Calling cross-platform application that focuses on speed, privacy, and security. MetaNow users can securely exchange messages with high encryption capabilities including photos, videos, and documents of any type and format, and are compatible with HOLOGRAM technology. MetaConnect: A central metaverse-based social network for broadcasting news, and conducting social conversations for other digital currency communities. Staking Platform: GolCoin Staking Platform helps users invest and earn returns on their assets. The annual interest is paid weekly and can be tracked by the second. The platform has several perks including share allocation and rewards. The NFT marketplace: The NFT marketplace in Golcoin’s ecosystem presents the next generation of NFTs with real-world utilities to the crypto world for the first time! These NFTs provide lots of practical solutions for businesses and individuals. Mining Facilities: GolCoin focuses on using solar power to decrease the harm of traditional mining systems, and offer an equal opportunity for everyone to take profit from the crypto mining industry. Golex: Being one of the well-known crypto exchanges in the MENA region, the Golex cryptocurrency trading pla","links":"https://golcoin.io/","market_cap":49067,"market_cap_rank":4092,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/golcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x095797fd4297fb79883cc912a5ba6313b15c445d"},"tron":{"decimal_place":18,"contract_address":"TDXyBerEqKHrGLEQFH9S3prXHPQiqaDsTA"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xeb52620b04e8eacfd795353f2827673887f292e0"}}}