{"name":"Libra Protocol","id":"libra-protocol_binance-smart-chain","symbol":"lbr","description":"What is the project about? Libra $LBR is the most innovative decentralized protocol and cloud mining APP of the moment. We have the most up-to-date equipment of the Antminer brand for the mining of bitcoin , which you can rent for a certain period of time just using your #LBR tokens. In addition to this, if you are one of the first investors supporting our project, you will have a unique access to the whitelist for our Staking in USDT, in which you can earn up to 6.5% in daily interest based on your invested capital. What makes your project unique? Staking in USDT for our first 1500 holders, this staking will offer a unique return of 6.5% in interest every 24 hours and to be able to use it $Libra investors will only have to lock their tokens $LBR for the amount of time that they wish to stake them and receive USDT, all of this will help us increase the value of our project and the token in general by offering this unique benefit. Our staking is the most attractive on the market, it offers you an APY 2,340.00% in USDT with Rewards sent every 15 minutes directly to your wallet in a stablecoin. (Only for the first 1500 holders) don’t miss this opportunity. It is also a program designed to increase the price of our token, which makes it a unique opportunity to invest in its launch. The idea with the USDT staking program is to lock up most of the circulating supply of #LBR, reduce sales, increase purchases, and thus drive the unit price of LBR sky high. History of your project. $LBR was founded by software developer Duffield , Before launching $LBR , Duffield was a software developer with experience in finance, from his time working at Hawk Financial Group, as well as in public relations, having developed machine learning algorithms and search engines. What’s next for your project? Issue Physical prepaid card for use of funds anywhere in the world and more. What can your token be used for? Lock $LBR tokens to earn $USDT , rent antminer miners with $LBR tokens","links":"https://libracrypto.info/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/libra-protocol_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x566a9eeac9a589bf0825222bca083ecdb9c86c82","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x566a9eeac9a589bf0825222bca083ecdb9c86c82"}},"is_native":false}