{"name":"The Employment Commons Work","id":"the-employment-commons-work-token","symbol":"work","description":"The $WORK Rewards (“$WORK”) of the Employment Commons (the “Commons”) aligns economic incentives between Commons Members to support the future of the independent, self-sovereign worker. There are two types of Members in the Commons; Employee and Coalition. - Employee Members are independent workers actively co-employed through the ecosystem - Coalition Members provide new Member referrals, technology and/or services to the Commons - Initially, Employee Memberships are limited to those who are qualified to work in the United States - The Commons anticipates eventual global expansion - All U.S. and international persons, organizations, and DAOs are qualified to be Coalition Members The Commons economic model allows for Stakeholder Capitalism in a collectively owned, for-purpose (and profit) digital employment cooperative, as discussed in the Opolis Off-White Paper. $WORK is designed as a Cooperative Patronage Rewards token used as a means of incentivizing stakeholders to engage in certain patronage activities deemed valuable by the Commons. $WORK tokens are a unit of account to determine the amount of patronage profits a Member is entitled to if/when they are declared by the Commons. Functionally, the Commons offers Employee Members the ability to: - Reap the benefits of group purchasing power for reduced costs on products and services (e.g. group healthcare insurance, technology tools, and shared services) - Share in profits with other stakeholders based on patronage - Become an “owner” in a shared network that protects its Members’ best interests - Participate in the governance of the Commons Members earn $WORK for patronage in the Commons ecosystem via: - Using the Commons for the processing of payroll, employment benefits, and shared services as an Employee Member - Direct referrals of new Employee Members - Staking rewards by staking $WORK - The Commons Trustee, Opolis, Inc., as a team member, contributor, advisor, or shareholder","links":"https://opolis.co/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-employment-commons-work-token/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x6002410dda2fb88b4d0dc3c1d562f7761191ea80"}}}