{"name":"I wish I held","id":"i-wish-i-held","symbol":"regret","description":"I Wish I Held ($REGRET) $REGRET is the ultimate token of reflection and resilience, born from the lessons of missed opportunities and fleeting moments in crypto. It serves as a reminder that persistence, patience, and belief in the journey are the keys to avoiding the pangs of regret. The Vision $REGRET isn’t just a token; it’s a movement. It embodies the powerful realization that true success comes not from chasing every trend but from committing to a strategy and holding firm when doubt clouds judgment. It speaks to every trader, investor, and dreamer who has ever whispered, \"I wish I held.\" The Mission The $REGRET token aims to inspire the crypto community to embrace discipline, endure market turbulence, and trust in the long-term potential of their investments. By holding $REGRET, you're holding more than a token; you're holding a commitment to growth, learning, and seizing future opportunities. Key Principles: Persistence Pays: Highlighting the importance of consistency and a long-term mindset. No More \"What Ifs\": Empowering the community to act with conviction and avoid the pain of looking back with regret. Learning Through Reflection: Turning past mistakes into fuel for a more confident and determined future. The $REGRET Narrative Crypto is full of \"what ifs.\" $REGRET flips the script, offering a token that isn’t about missed chances but about owning your choices and making them count. Whether you’re here to HODL, learn, or inspire, $REGRET reminds us that the biggest regret isn’t what you did—it’s what you didn’t do. Join the $REGRET movement and ensure your future self thanks you for the choices you make today. Persistence is key. Don’t just wish you held. Hold.","links":"https://pump.fun/coin/9Lht1MHib4CV7R92wMkippu9wUNTpQjxTqhzeardpump","market_cap":5866.82,"market_cap_rank":11345,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/i-wish-i-held/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"9Lht1MHib4CV7R92wMkippu9wUNTpQjxTqhzeardpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/9Lht1MHib4CV7R92wMkippu9wUNTpQjxTqhzeardpump"}}}