{"name":"chrono.tech","id":"chronobank","symbol":"time","description":"What is Chronotech? Chrono.tech provides blockchain-based solutions for recruitment, HR and payment processes, reducing the barriers to accessing work and transferring funds securely in the global labor marketplace. The project’s suite of services - and native governance token TIME - are hosted on multiple blockchains and include LaborX.com, a peer-to-peer freelancer marketplace, TimeX.io, a Plasma-based cryptocurrency exchange; AUDT, an Australian dollar-backed stablecoin; and PaymentX, a crypto invoicing and payroll solution. TIME token The TIME token is the native token of the Chrono.tech ecosystem and can be used within its products, e.g. to secure premium account status, as well as staking TIME on TimeWarp.finance to receive the revenues generated by all services. In November 2020, the original TIME token was upgraded to the new ERC677 standard, enabling it to be integrated with other DeFi protocols, allowing lower-cost transactions, and providing other advantages, while remaining fully ERC20-compatible. The new TIME 2.0 token contract also included up-to-date metadata about the project. Chrono.tech products and ecosystem Chrono.tech aims to solve a series of problems in the global recruitment and employment markets. LaborX is Chrono.tech’s freelance work portal. The service allows freelancers and customers to organise work via digital agreements, powered by smart contracts. All payments are escrowed and made in cryptocurrency. Once a job is completed, escrowed payments are released automatically. A dispute resolution service is available in case of disagreement. TimeX is Chrono.tech’s cryptocurrency exchange. TimeX is a hybrid Plasma-based exchange that offers the benefits of both centralised and decentralised technologies. Use of Plasma allows for fast, secure trading of digital assets. The conventional interface provides a user-friendly trading experience. Based in Australia, TimeX is licensed and compliant with rules and best practices required by AUSTRAC, the country’s financial intelligence agency. TimeX is listed on CoinMarketCap https://coinmarketcap.com/exchanges/timex/ TimeWarp is the ecosystem’s DeFi yield farming application where TIME holders can stake their token to earn revenues generated by all products of the Chrono.tech product range. All 100% of revenues generated are being distributed to TIME holders on a weekly basis. AUDT is a stablecoin, hosted on the Ethereum blockchain and backed 1:1 with Australian dollars (AUD). Use of AUDT enables traders to move money into and out of the blockchain ecosystem from an Australian bank account, to store value in AUD on the blockchain and transfer funds anywhere in the world, quickly and easily. AUDT is one of the key fiat currencies traded on TimeX. AUDT is fully compliant with AUSTRAC requirements and undergoes regular audits conducted by a licensed, third party accounting firm. PaymentX is a multi-currency crypto payroll solution that enables individuals as well as businesses to integrate crypto payments into their day-to-day invoice processes. Contractors can submit professional invoices and specify a crypto wallet for payment. Companies can pay multiple invoices with one click, while the software converts the dollar-equivalent amount due into crypto automatically at the point of transaction, avoiding the need for manual calculations. TimeBridge is an in-house developed multi-blockchain tokenbridge that supports multiple blockchains such as Ethereum and BSC. It allows transferring of TIME tokens between networks.","links":"https://chrono.tech","market_cap":11065583,"market_cap_rank":1135,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chronobank/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x485d17a6f1b8780392d53d64751824253011a260"},"binance-smart-chain":{"decimal_place":6,"contract_address":"0x3b198e26e473b8fab2085b37978e36c9de5d7f68"}}}