{"name":"MetaBeat","id":"metabeat","symbol":"$beat","description":"What is MetaBeat: METABEAT is an incentivization community platform, created in South Korea, based on NFT music blockchain technology. On METABEAT, Creators/Artists and Fans grow as partners through engagements and rewards. MetaBeat has created a leading copyright bounded NFT platform that empowers the relationship between creators/artists and Fans. By creating their own social economy, Fans can now convert their Fan activities into something bigger than a hobby. MetaBeat platform services: MetaBeat consists of 4 essential services; Drops, Mingle, Shout Out, and Marketplace. Drops: Fans receive their share of the royalties generated from their IP ownerships. Through DROPS, fans have direct access to own a piece of music IP, amongst many other creative projects, from their favorite creators/artists through NFT auctions. Mingle: With MINGLE, fans can stake their $BEAT tokens without a direct purchase of NFT to support their artists and receive rewards. They increase their $BEAT tokens by participating in Mingles of their favorite artists and build their MINGLE portfolio. Whether it’s a big or small show of support, they can control how much they’d like to stake and when. Shout Out: With SHOUT OUT, fans will be getting tokenized rewards for what they’ve already been doing this entire time, fan activities. When they register their personal social media accounts into the MetaBeat platform, MetaBeat’s Shout_Out Bot will calculate their rewards based on engagement. Fans can also continue receiving $BEAT Tokens by participating in all the missions and challenges that will be launched within the platform. Marketplace: On MetaBeat’s MARKETPLACE, fans will be able to trade their already acquired MetaBeat NFTs with other users, giving them more opportunities to be a part of their favorite creator/artist’s NFTs. Also in the Marketplace, Fanart can become validated NFTs, which can then be sold and traded within the platform, using $BEAT.","links":"https://metabeat.foundation/","market_cap":687420,"market_cap_rank":3469,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metabeat/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}