{"name":"Smudge Cat","id":"smudge-cat","symbol":"smudcat","description":"What is the project about? Smudge Cat Coin is a revolutionary memecoin inspired by the famous \"Woman Yelling at a Cat\" meme featuring the adorable and expressive Smudge the Cat. SMUDCAT is more than just a memecoin; it represents the power of community, the joy of laughter, and the potential for limitless growth in the cryptocurrency space. What makes your project unique? SMUDCAT is driven by its passionate and tight-knit community. With 100% tokens dedicated to the community and LPs burned, your project emphasizes inclusivity, transparency, and the power of collective decision-making. History of your project. Smudge Cat itself is an internet sensation, recognized and loved globally. Using Smudge Cat as your project's mascot creates an instant connection with millions of cat lovers worldwide, giving SMUDCAT a unique and endearing charm. What’s next for your project? Growing the Community: Continue nurturing and expanding the SMUDCAT community through engaging content, exciting events, and collaborations. Cultivate a sense of belonging and camaraderie among supporters to strengthen the project's foundation. Listing on Major Exchanges: Seek listings on prominent centralized exchanges (CEXs) to increase liquidity and accessibility for a broader audience. This will attract new investors and boost SMUDCAT's visibility in the crypto space. What can your token be used for? Voting and Governance: Token holders can actively participate in community governance by voting on proposals, such as new initiatives, partnerships, and charity contributions. This democratic approach empowers the community to shape the project's future. Merchandise and NFTs: SMUDCAT tokens can be used to purchase exclusive merchandise, like t-shirts, mugs, and other cat-themed goodies. Additionally, they can unlock access to unique NFT collections featuring rare and adorable Smudge Cat artworks. Payment for Services: As SMUDCAT's popularity grows, it can be adopted as a means of payment for products or services within the project's ecosystem or even beyond. This could include subscription fees, event tickets, or special privileges for token holders.","links":"https://smudgecat.ai","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/smudge-cat/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x22dc834c3ff3e45f484bf24b9b07b851b981900f"}}}