{"name":"Soul Society","id":"soul-society","symbol":"hon","description":"What is the project about? Soul Society is at the forefront of creating a Web3.0 Social ID, revolutionizing daily life with Growth-Type Soul Bound Tokens (SBTs). It turns everyday activities into rewarding quests, offering a unique blockchain-based social identity that adds value to daily actions and integrates them into a personalized Web3 experience. What makes your project unique? The Growth-Type SBTs that Soul Society offers are embedded with users' daily lives. Through effort and investment, users can enhance their SBTs selectively based on their own preferences and hobbies. This approach goes beyond the traditional focus on asset and wallet reliability found in standard SBTs. It also introduces a unique Web 3.0 Social ID, specially designed to reflect each user's individual hobbies and preferences. History of your project.? The SoulSociety project was initiated on November 1, 2022. In the first half of 2023, our focus was on creating the whitepaper and advancing the project's development. During the second half of the year, we dedicated efforts to establishing partnerships and executing pre-booking event marketing. These activities led to the successful launch of the (Beta1) pre-season. Currently, we are actively running (Beta1) Phase 1. As of now, the project has successfully attracted a total of 20,575 users. We are recording a daily active user (DAU) count of 2,484 and a monthly active user (MAU) count of 13,051. The project has also shown remarkable growth, generating approximately 8,000 to 10,000 transactions per day. What’s next for your project? - Implementation of Social Features - User Recommendation System - Friend & Party Function - Social News Feed Feature - Development of Soul Creation Tool - Implementation of Business (Client) Interface - SBT Data Analysis System Development - Development of SBT Minting Tool & System - Establishment of SNS & Community Environment - Building SBT-based Data Management Platform (Data Mart) - Support for Ex","links":"https://about.soulsociety.gg/","market_cap":73927,"market_cap_rank":4191,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/soul-society/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xebdb54e76bfec9ab4e06ccf6e484e4126f81befc"}}}