{"name":"INOFi","id":"inofi","symbol":"fon","description":"What is the project about? 'Inovation Finance' INOFi is a NFT equity platform created for blockchain NFT-based management and transactions of financial assets such as stocks, bonds, and real estate. The INOFi platform is designed based on three principles to solve the problems of the existing platform system. Using FON Token, which has a solid business model, is used to create valuable NFT issuance and existing NFTs. In addition, the user provides a convenient platform that can utilize NFT, DeFi, Token, etc. within one platform. To create valuable NFTs and make existing NFTs more valuable Token that has a solid business model suitable for any of DeFi Porotol Penetrating focus on providing user friendly interface and convenient platform that can utilize NFT, DeFi, Usage of Token What makes your project unique? \"INOFi\" is an integrated NFT equity platform created to manage and trade financial assets such as stocks, bonds, and real estate based on blockchain NFT. Within the INOFi platform, you can trade with FON tokens, the main means of transaction. The DeFi Staking Model rewards FON tokens. In addition, technical issues can be solved because individuals can easily issue tokens within the INOFi platform. History of your project. 1. INOFi is not a project that has grown rapidly, but a healthy project that grows steadily little by little. 2. INOFi is Korea's first and the world's second launch platform by creating a liquidity platform that is essential for the sculpture investment market. 3. INOFi will create an activation of FON tokens by making all NFTs sold within the marketplace available as FON tokens. 4. The FON token will be used in multi-chain such as Ethereum, Polygon, BNB, Clayton, etc. for user convenience. 5. INOFi's Wallet Dynamic G's VER.2 will be updated with a fully decentralized wallet. What’s next for your project? Currently, INOFi is planning to broadcast a real love entertainment program on Netflix and VCT, a Vietnamese public broadcaster. Also, a romantic web drama will be aired on Coupang Play, a Korean OTT platform. INOFi has signed an MOU with Miss Korea, a Korean beauty pageant, and can use related content. It will also be exclusively provided to marketplaces that can be purchased and sold through FON tokens. And the FON token will be used as a payment system at Dream Urban Square in Jinju, Korea What can your token be used for? The user purchases NFT using ETH/BNB/KLAY/MATIC including INOFi's own token, FON. The purchased NFTs are used in various ways, such as real estate use or sale, goods use, music copyright fees, and VIP concerts, depending on their unique characteristics.","links":"https://www.inodream.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inofi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa4be4cdc552891a6702e1ae9645ef445179a4463"}}}