{"name":"xSPECTAR","id":"xspectar","symbol":"xspectar","description":"xSPECTAR is an exclusive society developed by top professionals in Law, Real Estate, IT, Art, Finance, and Gaming. With the vision of creating a private ecosystem, serial entrepreneur Dirk Schepens along with other experts joined forces to establish an exclusive metaverse on the XRP Ledger (XRPL), a high-performance decentralized blockchain. xSPECTAR will provide a complete ecosystem with a virtual economy and world built on Unreal Engine 5, showcasing clean aesthetics as well as providing interactive and visual advantages. Users, also known as agents, have exclusive access as members of the xSPECTAR society enabling the opportunity to meet and access business ventures in the metaverse. Furthermore, by collaborating with other members of the community, agents may obtain the potential to earn profits within the virtual ecosystem. The foundational items of the xSPECTAR society are the native token and NFTs which will grant members access to the exclusive society and unlock the privileges in all lines of utility. Through the native NFT of xSPECTAR, users will gain private access to the xSPECTAR society and the benefits offered within it. Each xSPECTAR NFT is a unique agent - avatar and your ultimate access ticket. The NFTs are high-quality 3D characters made by the award-winning character company REBLIKA. The native token (XSPECTAR), with a maximum supply of 88.8 million tokens, is the key to entering, collaborating and engaging within the ecosystem. The token plays an integral role in the ecosystem serving as a key functioning element of the virtual economy.","links":"https://xspectar.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xspectar/logo.png","detail_platform":{"xrp":{"decimal_place":null,"contract_address":"rh5jzTCdMRCVjQ7LT6zucjezC47KATkuvv","geckoterminal_url":"https://www.geckoterminal.com/xrpl/tokens/rh5jzTCdMRCVjQ7LT6zucjezC47KATkuvv"}}}