{"name":"Cracle","id":"cracle","symbol":"cra","description":"What is the project about? CRACLE is an innovative Total Metaverse Platform that combines blockchain and various content services. Also, CRACLE introduced a new concept metaverse called ‘X2E’. X2E is an abbreviation of ‘X to Earn’, where ‘X’ stands for ‘infinite scalability’. This is not only P2E (Play to Earn) and M2E (Move to Earn) games or services familiar to existing users, but also L2E (Listen to Earn), S2E (Sleep to Earn), and T2E (Trade to Earn) categories. It is a more comprehensive and progressive metaverse platform than ever before, infinitely expanded. In addition, the CRACLE Token of the CRACLE project is a coin specialized for WEB 3.0 so that anyone can easily use X2E. What makes your project unique? CRACLE aims for X2E where blockchain and lifestyle are naturally harmonized. Participants in the CRACLE X2E ecosystem (hereinafter referred to as ‘players’) can directly participate in the CRACLE ecosystem by playing their favorite games or services on the X2E platform and receive CRACLE Token rewards as compensation. These actions of players contribute to the development of CRACLE into a sustainable ecosystem and realize the value of CRACLE's first VISION, 'PLAY X2E with CRACLE'. Furthermore, based on the value of 'PLAY X2E', CRACLE has the second vision of dreaming of leaping to the WEB 3.0 Global Metaverse Platform that can continuously be with various players around the world. History of your project. What’s next for your project? The core of the CRACLE platform is X2E Contents, to which the concept of ‘infinite scalability’ is applied. In other words, X2E Contents not only form the structure of the CRACLE X2E platform, but are also a core component of CRACLE X2E. The CRACLE X2E platform, as the X2E Total Metaverse Platform, is equipped with game and service contents that cross the boundary between reality and metaverse based on blockchain technology. What can your token be used for? CRACLE, as the currency that integrates CRACLE X2E, will play t","links":"https://cracle.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cracle/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":5,"contract_address":"0x0fc0b3f6f5c769c138088266ac21760ab33f76ca"}}}