{"name":"Mansioncoin","id":"mansioncoin_solana","symbol":"mansion","description":"Mansioncoin is a community-driven memecoin on the Solana blockchain, designed to embody themes of luxury, aspiration, and resilience in the cryptocurrency space. The project's core purpose is to foster a dedicated holder base around the concept of \"building mansions\" – symbolizing wealth creation and recovery from setbacks – through transparent tokenomics and active community engagement. Functionally, it operates as a standard SPL token with no built-in taxes or utilities beyond trading and holding, emphasizing deflationary mechanisms via voluntary burns and long-term locks of supply to reduce circulating tokens and promote scarcity. The token serves as a medium for community interactions, such as meme contests, airdrops, and raids on social platforms like X and Telegram, where participants create and share content related to luxury lifestyles and AI-generated art. Utility includes enabling participation in project events, rewarding active contributors with token distributions, and facilitating trades on decentralized exchanges like Pumpswap and Raydium. The project's governance is led by a single CTO who has taken over post-initial rug pull, committing to ongoing supply management to build trust. Overall, Mansioncoin aims to create a fun, thematic ecosystem for memecoin enthusiasts, focusing on long-term holder retention through consistent updates, locks (currently 27% of supply locked for up to 2 years), and burns (3.5% burned), while avoiding complex DeFi features to keep it accessible and simple for retail users.","links":"https://webuymansions.club/","market_cap":44740,"market_cap_rank":8385,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mansioncoin/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"3srdiFxca22oK1g7qdbGGe9qXy4aS9QGVdTETCBFpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/3srdiFxca22oK1g7qdbGGe9qXy4aS9QGVdTETCBFpump"}},"is_native":false}