{"name":"Step App","id":"step-app-fitfi","symbol":"fitfi","description":"Step App (FITFI) is the governance token for the Step Labs Ecosystem, which is all about pushing the boundaries of fitness and gaming. Here’s the lowdown: Step App: A Web3 move-to-earn app. The app's augmented reality technology bridges the gamified metaverse with the real world, turning fitness into a social experience where mechanics allow people to compete and win. By downloading Step App, users can earn by walking, running, competing with friends/app users, chatting, exploring the metaverse or the real world. The Step App functionality is designed to attract and connect users, inspiring them to engage in daily physical activity and regular exercise. Step Hero: Think of it as the ultimate platform for gamers and Web3 fans in Telegram. Step Hero is building something that’s here for the long haul—a spot where the rewards just keep rolling in. We’re merging gaming with Web3 in a way that makes play-to-earn a real deal, not just a buzzword. With Step Hero, you’ll find opportunities to earn while having a great time. If you’ve been waiting for endless airdrops, you’ve hit the jackpot—we’ve got your back. We’re not just about tokens; we aim to be the main hub for fresh games and platforms that want to draw in new fans. This approach not only fuels development but also hooks users up with generous rewards for getting involved. Step Health: A User-Friendly Fitness App for Your Wellness Journey. StepHealth is a comprehensive fitness app designed for those seeking a user-friendly and accessible approach to health and wellness. With features like AI-powered coaching, personalized workout programs, social fitness to invite and track friends' progress, and seamless integration with Apple Health and Google Health, achieving your fitness goals has never been easier. Step Wallet: Step Wallet is the official Step wallet app designed to better interact with the Step ecosystem. It is available for both Android and iOS users. StepEx: StepEx is the first DEX for mainstream usage and is plugged into apps that target tens of millions of mass consumers. This is Defi delivered to the masses, through built-in integrations to mass usage apps. Step Protocol: Step Protocol is a network for life, a network for the pursuit of lifestyle, fitness, and consumption. Step blockchain is an EVM-compatible blockchain. It's built on the base of Avalanche code with added elements. This brings the proven network security of an established codebase to faster throughput. This is a foundation for internet-scale apps for life. Step Launch: Your entry into the Step Labs Ecosystem. Catch the projects before they become public. Step Bridge: Trusty tool to move your Avalanche C-Chain FITFI to Step Network. Step Staking: Stake your FITFI to get passive income.","links":"https://step.app/","market_cap":8100598,"market_cap_rank":1953,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/step-app-fitfi/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x714f020c54cc9d104b6f4f6998c63ce2a31d1888"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7588df009c3d82378be6ab81f2108fa963c10fc8"},"step-network":{"decimal_place":18,"contract_address":"0xb58a9d5920af6ac1a9522b0b10f55df16686d1b6"}}}