{"name":"Cat Token","id":"cat-token-2","symbol":"cat","description":"Catmeme is a cat theme token that focuses on community decentralization and adoption. $CAT is designed to make memeCoins great again. $CAT is for the people, always. Fueled by pure meme power, $CAT will lead the way. CAT: A New Wave on Binance Smart Chain Amidst the countless dog-themed memecoins, only one cat-themed memecoin has captured global attention—$CAT. More than just another memecoin, $CAT is a symbol of love for cats and relentless creativity. With $CAT, we are not merely launching a token; we are building a global community where cat lovers can connect, share their passion, and inspire one another. Much like in ancient Egypt, where cats were not only revered as animals but also considered symbols of protection and spirituality, associated with the goddess Bastet, $CAT carries similar meaning. It represents protection and trust in the bright future we are building together. Cat lovers will find in $CAT a friendly, creative, and inspiring community. $CAT: A Community-Owned Memecoin and Its Mission to Reignite Binance Smart Chain What makes $CAT truly special is that no one individual or entity owns it—it belongs entirely to the community. There is no organization or individual controlling $CAT. We are merely the creators of joyful memes, spreading positivity to the cat-loving community worldwide. The community itself is the driving force behind growth and success. You—the cat lovers—are the true strength behind its continued expansion. The launch of $CAT not only brings a fresh breeze to the cat-loving community but also breathes new life into Binance Smart Chain (BSC). With the participation of millions of cat lovers from around the globe, combined with Binance's large user base, BSC will once again become a vibrant hub in the world of cryptocurrency. The cat-loving community, with its creative spirit, will invigorate the BSC ecosystem, bringing positive energy and a colorful, dynamic space. Join us on this journey, spread your love for cats, and help build a future filled with joy and inspiration. The story of $CAT begins with the community, and you are an essential part of that journey!","links":"https://catmeme.finance/","market_cap":133259,"market_cap_rank":5874,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cat-token-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x5971f6ecf4092824ed8229154d97c21317a04764"}}}