{"name":"DCAI","id":"dcai_base","symbol":"dcai","description":"DCAI is a decentralized infrastructure token developed under the Dynachain ecosystem, aimed at powering artificial intelligence (AI) computation, decentralized storage, and incentive models across Web3 infrastructure. The project is designed around the DePIN (Decentralized Physical Infrastructure Network) framework, where users contribute real-world hardware resources (e.g., compute and storage devices) and are rewarded with tokens in return. DCAI serves as the core utility token that facilitates this exchange between physical resource contribution and on-chain rewards. Built on the Base blockchain, DCAI combines two participation layers: a smart contract-based staking mechanism and a hardware-based mining/infrastructure reward system. The staking mechanism—called Vanguard Circle—allows users to lock their DCAI tokens in return for yield rewards based on a tiered APY system. The APR dynamically adjusts based on total value locked (TVL) to maintain economic sustainability. On the infrastructure side, users can deploy authorized edge devices to support decentralized AI tasks, distributed storage, and other data-intensive operations. These participants receive DCAI tokens from a designated on-chain pool. Out of the total supply of 100 million tokens, 66% is locked in a smart contract and can only be accessed via hardware participation. There are no presales, private rounds, or team pre-allocations for this portion, ensuring that the tokens enter circulation strictly in line with actual network utility and infrastructure usage. DCAI thus aligns real-world contributions with token issuance in a verifiable, permissionless way.","links":"https://www.dcai.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dcai_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xb8147ce9b0dac5f8165785dec6494e57748e4b78","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xb8147ce9b0dac5f8165785dec6494e57748e4b78"}},"is_native":false}