{"name":"Arthur Adventure - BSC","id":"arthur-adventure-bsc_binance-smart-chain","symbol":"arthur","description":"Arthur Adventure is a blockchain-based side-scrolling action RPG. Here, your battles, gear, and adventures are recorded on-chain. Explore unknown maps, defeat monsters, and collect rare NFT equipment. Strengthen your character during the journey, forge weapons, and trade freely in the open marketplace. Every battle is a real operation of the on-chain economy. Backstory It is said that after the ancient great war, the Eternal Sword shattered into ten soul fragments,each guarded by an ancient beast corrupted by greed. Only one with a pure soul can reforge the holy sword on-chain and bring Eldoria back to the light. You—the player—will awaken as Arthur again in an endless cycle. In the ruins of the Eldorian kingdom devoured by darkness, a wanderer in a red cloak sets out on a destined journey. Walk through the Cursed Forest, the Blazing Forges, and the Forgotten Ruins to recover the long-broken Eternal Sword and write your story into the chronicles. Hero Marketplace A decentralized marketplace for adventurers, where freedom and fate are traded together. Weapons, armor, and rare skins Monster cores and forging materials Limited characters, skills, buffs, and potions Token System Function Description Reward Token Obtained by defeating monsters, clearing stages, and completing quests. Energy Resource Required to enter boss stages, forge weapons, and upgrade skills. Governance ARTHUR holders can vote on future stages, enemies, and event directions. Staking System Staking ARTHUR unlocks “Knight’s Blessings” — increased experience gains and higher rare drop rates. Total Supply: 1,000,000,000 Loot and Drop Mechanics Monsters in Arthur Adventure do not drop only gold; they drop fragments of history. Normal Monsters Materials, scrolls, minor runes Elite Monsters NFT equipment with randomized attributes Bosses Legendary relics with unique IDs and rarity All drops are initially soulbound,and must be purified in the “Alchemy Forge” by spending ARTHUR before they can be listed for trading in the Marketplace of Heroes. Roadmap Phase 1 — Awakening Game launch · Stage clearing and monster slaying · NFT equipment and marketplace open · ARTHUR goes live Phase 2 — Rise of Heroes New classes and skill trees · Boss dungeons · PvP arena Phase 3 — Realms Expansion Unlock new maps and scenes · New monsters and equipment drops · Pets and weather systems Phase 4 — Guild Era Open guild system · Guild wars and land building · Community co-created skins Phase 5 — Eternal Adventure Seasonal updates · Multi-character co-op · Player-created dungeons The Forge of Time descends, and the gods dwell within it, encoding destiny into chains that cannot be broken. Forge your legend, and let the song of the sword resound through eternity.","links":"https://arthuradventure.xyz/","market_cap":18988.51,"market_cap_rank":9884,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arthur-adventure-bsc_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x694c0ac0f5bf9acda2ca81bcc0f212fa33f8350f","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x694c0ac0f5bf9acda2ca81bcc0f212fa33f8350f"}},"is_native":false}