{"name":"Coinflect","id":"coinflect","symbol":"wcflt","description":"What Is Coinflect (CFLT)? Coinflect is a developing layer one blockchain that functions as a platform for decentralised applications and custom networks. This is made possible by Coinflect’s architecture consisting of three distinct blockchains with all nodes validating transactions: CX-Chain, CE-Chain and CC-Chain. Each chain possesses a different consensus mechanism based on its use case. Coinflect will be the most recognized and feasible way to bridge assets and migrate to multiple chains through bridging on DeFi. Coinflect is developing its own ecosystem of DApps. Different Ethereum-based projects such as dApploy are being integrated within the Coinflect network. Furthermore, the platform is always improving utility between its own ecosystem and Ethereum. Coinflect Blockchains and Subnets Coinflect has three primary built-in blockchains: The Exchange Chain (CX-Chain) The CX-Chain uses directed acyclic graph (DAG) technology to send and receive funds on the Coinflect network. Transaction fees are fixed in CFLT, and the CX-Chain provides speed benefits over the Platform Chain (CE-Chain). The Platform Chain (CC-Chain) Used for staking CFLT and facilitating validator activities. Users can become a validator or defer to one to collect their CFLT rewards on the Contract Chain (CC-Chain). The Contract Chain (CE-Chain) The Contract Chain is the chain used for smart contract and DeFi apps. Most of Coinflect DApps are housed here and compatible with MetaMask. These three networks are secured and validated by a special subnet called the Primary Network. All custom subnets need to validate on the Primary Network by staking minimum amounts set by the network. Coinflect subnets or subnetworks, are dynamic sets of validators working together to achieve consensus on the state of a set of blockchains. Every blockchain is validated by one subnet, whereas one subnet can validate various blockchains. Validator nodes can be a member of multiple subnets.","links":"https://www.coinflect.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coinflect/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc73d9b9616e855df4a0b32c3f1ef2ed5dc9c1990"}}}