{"name":"Salad","id":"salad_ethereum","symbol":"sald","description":"What is the project about? Salad is an organization dedicated to creating economic opportunities that can improve people's lives. The project has been a trailblazer in the field of decentralised web3 labor. Their objective is to promote a more equitable world where individuals can participate in the future of work. What makes your project unique? Salad is dedicated to creating earning opportunities on the blockchain by empowering their community through various platforms such as Play2Earn, Learn2Earn and and Decentralized Labor Exchange. The project also aims to support the growth and market penetration of other web3 projects while remaining committed to building a more sustainable and equitable future of work for all. History of your project. Salad raised a seed round led by Multicoin Capital, and subsequently a private round with a stellar roster of investors including C Squared Ventures, Brevan Howard funds, Gemini Frontier Fund, Winklevoss Capital and Polygon Studios. These rounds also saw notable angels such as Santiago Roel and Anthony Pompliano added to the cap table. The project began their journey in early 2021 as a modest P2E guild, uniting over 1,000 skilled players and providing them with the necessary resources to thrive and generate income within the P2E domain. What’s next for your project? Salad has since levelled up their internal capabilities, moving towards an ecosystem play. They have a Learn2Earn Platform known as Apollo Academy, a Play2Earn Platform known as Arcaden, and are working on a Decentralised Labour Exchange (DLX) known as Maslow. What can your token be used for? $SALD will serve as the key to unlocking Salad's products and innovations, and will be integral to the ecosystem's growth and sustainability. It can be used as a medium of exchange within our ecosystem, a reward mechanism and a governance token.","links":"https://salad.ventures","market_cap":1025.76,"market_cap_rank":13112,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/salad/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5582a479f0c403e207d2578963ccef5d03ba636f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x5582a479f0c403e207d2578963ccef5d03ba636f"}},"is_native":false}