{"name":"XFL","id":"xfl-token","symbol":"xfl","description":"What is the project about? Pixl is building NFT infrastructure for the modular blockchain world and is currently live on Ethereum mainnet with its aggregator product. As the blockchain infra goes modular, we will see applications like NFT marketplaces and minting platforms use app-specific infra that is custom built to serve app needs better. What makes your project unique? Aggregates liquidity from 150+ marketplaces, allowing users to sell into bids from all supported marketplaces. If you are a holder of marketplace tokens, you can enjoy royalty free and no fee listings. Marketplace tokens currently supported are: $XFL, $BLUR, $SUDO, $X2Y2, $LOOKS. Bulk List, bid and cancel your bids without paying any gas fees. History of your project? Pixl was initially known as Flow and embarked on its development journey in October 2021. Since then, the project has undergone significant progress and refinement. The Pixl team has dedicated their efforts to create and enhance a rollup-centric NFT ecosystem. What’s next for your project? Deploy Pixl as an app specific rollup (aka L2) where Data availability, Consensus and Settlement layers are modular and swappable. Settlement layer could be leveraged by other NFT rollups for composability. Custom built off-chain indexing and compute infra to host off-chain data like images and perform matching logic. Introduce Creator tooling for easily creating and deploying NFTs all on the rollup tailored for NFTs. What can your token be used for? XFL holders enjoy 0 fees and royalties on the aggregator. XFL holders will also be airdropped $PIXL which is the main token powering our rollup and ecosystem going forward. XFL holders enjoy boost on reward points available on the platform as well as will get the $PIXL airdrop before anyone else.","links":"https://pixl.so","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xfl-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8ae452d9f8f08f21ff81c94260cb85302a31ac30"}}}