{"name":"Block Browser","id":"block-browser","symbol":"block","description":"What is the project about? Block Browser is a web browser built specifically for the cryptocurrency and decentralized finance space. It integrates the core tools, communities, data, and services crypto users depend on into one unified portal. This includes trading terminals, wallet management, NFT galleries, DeFi apps, news aggregation, price charts, launchpad trackers, and more. The goal is to streamline access to the rapidly expanding blockchain ecosystem as a frictionless gateway for the next generation of crypto traders, investors, and builders. What makes your project unique? Block Browser's uniqueness stems from converging the fragmented crypto workflow into one browser-based command center. Instead of juggling dozens of exchange tabs, blockchain explorers, communities, analytics sites, etc, everything is integrated natively. This solves the constant context switching and tab overload. Block Browser is tailored for power crypto users' specific needs versus a general browsing experience. The all-in-one access, tools, and functionality can't be found in any other browser. History of your project. The idea for Block Browser emerged in early 2023 from the difficulty of managing the increasingly complex blockchain space spread across so many platforms. After 6 months of planning, the team began building, starting with the browser architecture and $BLOCK tokenomics. Version 1 is on track for a Q3 2023 launch as a desktop crypto browser MVP for early adopters. 2024 will expand into mobile, trading, DeFi, NFTs, news, and more functionality. The goal is to scale to over 1 million monthly active users by 2025 as a mainstream gateway to Web3. What’s next for your project? The next major milestone for Block Browser is the initial crypto browser release in Q3 2023 on desktop. This will establish the foundation for users to access web3 sites and tools directly in the browser. The team will quickly build on it by expanding into iOS and Android apps in 2024. Advanced trading terminals, a DeFi suite, NFT galleries, tax tools, news aggregation, and cross-device syncing are other key 2024 roadmap items to boost adoption. What can your token be used for? The $BLOCK token will serve multiple utilities, including participating in platform governance, earning rewards, accessing premium features, receiving discounts on transactions, staking, and enabling Web3 partner integrations. As adoption grows, $BLOCK will be integral to the browser experience, similar to how BAT serves a key role in the Brave browser. The token powers the ecosystem.","links":"https://BlockBrowser.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/block-browser/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x226d6d842d49b4d757bef1632053a198d5d9c8aa"}}}