{"name":"MariCoin","id":"maricoin","symbol":"mcoin","description":"What is the project about? MariCoin is the cryptocurrency for and by the LGTBIQ+ collective, a currency that embodies the value and struggle of the collective. A social, ethical, transparent and transversal means of payment. In addition to Algorand, as a native blockchain for MariCoin, and with additional scalability in mind, the project is cross-chaining to also run on Ethereum's L2 (Layer 2) blockchain, Polygon. What makes your project unique? Referenced asset for all those businesses and people who sympathize with the LGTBIQ+ cause and want to contribute to the fight for its claims. Source of financing for initiatives and projects of associations and groups around the world. History of your project. MariCoin is the dream of Juan Belmonte, better known as Juan por Dios, a hairdresser from Chueca, the iconic neighborhood in the center of Madrid, to create a currency for the LGTBIQ+ community around the world. A virtual means of payment that values ​​the struggle of the collective and that serves as a link for all those who feel represented by any of the LGTBIQ+ acronyms and for all those people who think that equality, non-discrimination and freedom to be and love whoever you want are fundamental rights. What’s next for your project? - FIAT-MCOIN and MCOIN-FIAT exchange platform (ramp-on and ramp-off). - Real launch of adoption in businesses associated with MariMap, sale and purchase of services with MariCoin. - Participation in the Polygon Village Wonders program. - Start of Mariwallet v2 Multichain Android, iOS - Marketing campaign and Listing on centralized exchanges. - Launch of MariFund, impact investment fund in crypto (sustainable) What can your token be used for? - Become the means of payment (real, useful and used) of the LGTBIQ+ community and of all those who share the values ​​of MariCoin. - Contribute financially to value the work that associations and organizations around the world have been doing.","links":"https://maricoin.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/maricoin/logo.png","detail_platform":{"algorand":{"decimal_place":3,"contract_address":"499213551"},"polygon-pos":{"decimal_place":3,"contract_address":"0x34ad6a664b4112a9c6bac7b54b4094a05e3ff775"}}}