{"name":"Bitago","id":"bitago","symbol":"xbit","description":"Bitago represents a mobile application that empowers everyday consumers to earn cryptocurrency as shopping rewards, with its proprietary $XBIT token serving as the platform's governing asset. Our mission revolves around facilitating the accumulation of cryptocurrency for individuals at every juncture of their daily routines, courtesy of a mobile app intricately integrated with both the $XBIT token and NFTs. The core objective of our app is to transition the conventional Web2 shopping experience into the realm of Web3, thereby introducing cryptocurrencies to individuals who may not necessarily have intentions of directly purchasing or investing in the crypto market. Bitago extends an extraordinary opportunity to ordinary users, enabling them to monetize their daily activities and accrue crypto, NFTs, and other enticing rewards. Whether engaged in shopping, completing various tasks, viewing advertisements, or participating in $XBIT staking, our platform offers a versatile range of avenues to accumulate valuable assets. This innovative business model streamlines the process, granting everyday individuals the potential to receive crypto cashback as a seamless shopping reward, eliminating the need for additional steps in their routine shopping endeavors. This transformative approach is poised to redefine the global landscape of loyalty and cashback programs. In addition to these groundbreaking features, Bitago introduces micro-task rewards, allowing users to swiftly complete surveys and other straightforward marketing activities in exchange for further cryptocurrency rewards. Activities such as watching advertising videos or interacting with brand marketing campaigns present users with additional opportunities to bolster their cryptocurrency holdings.","links":"https://www.bitago.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitago/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xc4a0e0915d538b5ec2e6895261d34f70c64fb13d"}}}