{"name":"Based Zlurpee","id":"based-zlurpee_base","symbol":"zlurpee","description":"Zlurpee is a surreal, slushy-brained creature from the warped, colorful imagination of Matt Furie, the underground comic artist known for creating absurdist characters that blur the line between stoner comedy, psychedelic weirdness, and internet meme culture. True to Furie’s aesthetic, Zlurpee is both ridiculous and oddly profound — a sticky, brain-freezing being who embodies the essence of cool chaos. With his frozen swirl of a head and eternally chilled attitude, Zlurpee isn’t just some mascot slapped on merch — he’s the spiritual and cultural leader of a countercultural movement wrapped in neon and slush. At the center of this movement is the Ripperz Crew, a gang of 11 outlandish skaters and surfers who live in a dimension where reality is optional and vibes are everything. These aren’t your average board-riding misfits. The Ripperz exist in a hyper-stylized, Furie-esque dreamworld where skating through time-loops, surfing through cosmic slush waves, and dropping into reality glitches is just another Tuesday. Their style is loud, unfiltered, and 100% based — meaning they do what they want, how they want, without bending to mainstream expectations. They’re anti-establishment, anti-boring, and completely immersed in a world of technicolor rebellion. Among the crew are Andy and Birddog, two characters pulled directly from Boys Club, Furie’s cult-classic comic that birthed many iconic figures, including the now-notorious Pepe. Their inclusion connects Zlurpee’s reality-warping world to the larger Boys Club universe, anchoring this new generation of characters in the same irreverent legacy of absurdist counterculture. But Zlurpee and his crew aren’t just fictional skaters — they’re also part of a crypto-native storytelling experiment. Through the icy veins of this universe flows $ZLRP, a token or cryptocurrency that represents more than digital currency — it's the lifeblood of the Ripperz ethos. Whether used in collectibles, community access, gamified content, or decentralized storytelling, $ZLRP symbolizes the intersection of digital ownership, community-driven culture, and next-level art. Zlurpee is, in essence, the avatar of this movement — the chill-faced prophet of a new kind of blockchain mythology. At its core, the Zlurpee project is about merging art, culture, and crypto in a way that doesn’t take itself too seriously, yet holds serious creative power. It’s a world where meme logic meets visionary storytelling, where every character has a life beyond the screen, and where decentralization isn’t just about finance — it’s about freedom of expression. Matt Furie’s world has always walked the line between innocent weirdness and cultural critique, and Zlurpee continues that tradition — this time, with a frosty middle finger to the mainstream and a skateboard aimed at the metaverse.","links":"https://basedzlurpee.vip/","market_cap":17446.54,"market_cap_rank":10030,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/based-zlurpee/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x42081cf59a145ca4ca51edcee577fc4be3b35dbd","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x42081cf59a145ca4ca51edcee577fc4be3b35dbd"}},"is_native":false}