{"name":"Crust Network","id":"crust-network_ethereum","symbol":"cru","description":"What is Crust Network? Crust Network provides a decentralized storage network and cloud solutions for both, the Web 3.0 as well as Web 2.0 ecosystem and is build on Polkadot’s Substrate framework. It provides an unique incentive layer for the IPFS protocol and utilizes blockchain technology to enhancesecurity, privacy, performance and ownership of data. How does the roadmap look like? The mainnet launched on the 1st of September 2021 and currently holds a storage capacity of around 2,300 PetaBytes provided by more than 7,000 individual nodes. Crust Network already integrated with many blockchains and provides a fully decentralized storage layer for Ethereum, BSC, Polygon, Solana, Near, Elrond, Heco and others. In the future Crust will implement its storage services for even more networks in order to provide its storage solutions for every ecosystem. Some of the biggest blockchain projects already use Crust Network to store their data or host their websites and dApps via Crust’s infrastructure. These for example are Uniswap, AAVE or Polkadot Apps. In future, Crust Network is thriving to provide even more services for the Web3 and Web2 landscape for projects and companies to utilize and to build on. Crust's architecture also has the capability of supporting a decentralized computing layer and building a decentralized cloud ecosystem. Crust Ecosystem and Use Cases: • Providing the technical infrastructure for the Metaverse • Mint, Store and exchange NFTs fully decentralized • Hosting of Websites, dApps, Video streaming and more • Web 3.0 Gaming and decentralized social media • Personal Cloud storage to access your data from anywhere • File sharing and streaming services What are the CRU token utilities? Crust ($CRU) is a utility token within the Crust ecosystem which serves many different utilities. The most important utilities and functionalities of the CRU token are listed below: • Staking to maintain GPoS consensus • Collateral for storage providers to provide storage services • Used to cover transaction fees • Purchase storage or other cloud services • On-Chain governance mechanism Can I try Crust Networks storage solution? Yes, you can enjoy the benefits of our networks in many ways. For example you can upload files to a fully decentralized Web 3.0 cloud solution on crustfiles.io where you can keep your data safe and always accessible. Just sign in with your Crypto wallet and enjoy storing your files in the easiest and most secure way possible. For NFT lovers, artists and collectors we also offer a decentralized NFT market platform where users can mint, store, trade and display their NFTs on a 100% decentralized infrastructure. Feel free to try out our NFT dedicated application on switchswap.io How does Crust network compare to traditional cloud services? Compared to traditional and centralized storage providers like AWS, Google, Azure or Alibaba Cloud, Crust Network offers many advantages due to its decentralized infrastructure: Availability: Crust eliminates the “Single-Point-of-Failure” dilemma and the risk of downtime by on average creating 80 replicas distributed over individual nodes in the network. This maintains a high level of redundancy to keep your data always available and accessible. Security: High resistance against DNS hijack attempts or DDOS attacks. Additionally all data is encrypted by the IPFS protocol as well as Crust’s TEE mechanism. Not even node operators or any other centralized organisation can access or tamper user data. Performance: Due to many replicas on many nodes all over the world you can retrieve your files without any server-side bottlenecks. Data can be sourced and processed from many nodes at the same time to realize many benefits in regards of performance. Costs: Cloud storage costs on Crust Network are only 25-50 % of the costs compared to traditional Web 2.0 products on a centralized infrastructure. (Compared to AWS S3 Cloud Server) Can I start mining Crust? Crust network is a public and totally permission-less network that everybody can join at any time. Thanks to our MPoW (Meaningful Proof of Work) mechanism there is no need for expensive and energy consuming GPUs or high-end CPUs. All you need is a reliable internet connection, a CPU with TEE functionality and some free storage. For more information please refer to: https://wiki.crust.network/docs/en/nodeOverview","links":"https://crust.network/","market_cap":607367,"market_cap_rank":4338,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crust-network_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x32a7c02e79c4ea1008dd6564b35f131428673c41","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x32a7c02e79c4ea1008dd6564b35f131428673c41"}},"is_native":false}