{"name":"Charlie","id":"charlie-4_base","symbol":"charlie","description":"Meet Charlie — your new Web3 best friend. Charlie is your new Web3 best friend — a project built on community, transparency, and real-world impact. While most meme tokens live only on hype and speculation, Charlie stands out by combining fun, culture, and meaningful human connection with genuine charitable action. The vision is simple: create one of the biggest and most beloved projects in the space, and use that success to help real animals in need. Charlie rises, and others rise with him. At the heart of the project is The Charlie Charity Initiative, a program built to provide direct support to animal shelters and rescue teams around the world. Many crypto charity attempts get lost in bureaucracy or unclear accounting, but Charlie is designed differently. Donations go straight from the community to the organizations that need them most — without intermediaries, without hidden costs, and without complicated systems. Every contribution is recorded publicly, payment proofs are shared openly, and updates from supported shelters are posted for the community to see. Food, medicine, operations, shelter costs — every donation becomes real help at ground level. The mission behind Charlie is driven by a simple belief: every animal deserves safety, care, and a chance to live. The project supports the people and shelters who dedicate their lives to rescuing abandoned, injured, or mistreated animals. Charlie helps not because it is easy — but because it is right. Beyond charity, Charlie is also a culture project. The community plays a central role in shaping the future — from partnerships and brand growth to global visibility and real-world utility. Holders have a voice, and the brand grows through authenticity rather than hype. As momentum builds, Charlie is expanding into merchandise, collaborations, and ecosystem utilities that bring Web3 culture into everyday life. Shirts, hoodies, hats and more will allow supporters to represent the project proudly, turning an online meme into a global symbol of kindness and community identity. Charlie’s growth is fueled by people who believe in more than profit — people who want to build, help, and be part of something positive. Whether someone contributes to charity, joins the community, spreads the message, or simply supports the project, every action pushes Charlie forward. This is a movement built on transparency, honesty, and heart. No empty promises — only visible results. Every donation helps an animal. Every supporter strengthens the mission. And every step forward brings Charlie closer to becoming a global force for good in Web3. Charlie isn’t just a token. He’s a friend. He’s a mission. He’s a community. And anyone can join.","links":"https://basedogcharlie.com","market_cap":134542,"market_cap_rank":6543,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/charlie-4_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x806b6f3d576744c6b05088e4e49e3aadbca110cc","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x806b6f3d576744c6b05088e4e49e3aadbca110cc"}},"is_native":false}