{"name":"Liquid Mercury","id":"liquid-mercury","symbol":"merc","description":"Liquid Mercury is a technology company led by Tony Saliba that delivers best-in-class institutional-grade trading infrastructure, workflow automation, and Real World Asset (RWA) marketplaces. This platform and components meet the performance, security, and reporting standards of the most demanding traditional finance firms. The MERC is an ERC-20 utility token that can be used within the Liquid Mercury eco-system to create value for LM customers in 3 primary ways. 1. The MERC allows customers of Liquid Mercury to create discounts on their Liquid Mercury invoices via the “Discount Farming Staking Program” (see the Liquid Mercury website). Discount Farmers (the MERC holder who stakes) produce monthly discounts called “Element Tokens” (ETs) based on the number of MERCs staked. ETs produced monthly by the Discount Farmer can be applied to your invoice if you are a customer or traded for cash equivalents in a private secondary market, where Liquid Mercury customers and ET holders (non-customer MERC holders) can meet to buy/sell ETs. 2. The MERC also gives access to exclusive research/content, curated trading tools, and trading rebates for individual users. Staked MERC holders also receive a “staking reward” in the form of 10% (annually) paid in MERCs. 3. As Liquid Mercury expands its RWA presence, the MERC will play a larger role in this new expansion of tokenization.","links":"https://liquidmercury.com/","market_cap":10232398,"market_cap_rank":1773,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/liquid-mercury/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6ee2f71049dde9a93b7c0ee1091b72acf9b46810","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x6ee2f71049dde9a93b7c0ee1091b72acf9b46810"},"base":{"decimal_place":18,"contract_address":"0x8923947eafaf4ad68f1f0c9eb5463ec876d79058","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x8923947eafaf4ad68f1f0c9eb5463ec876d79058"},"solana":{"decimal_place":8,"contract_address":"72hdqAZq83HUYz9kxsswbS2r7NBGEnxtnugCSzi4coWY","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/72hdqAZq83HUYz9kxsswbS2r7NBGEnxtnugCSzi4coWY"}}}