{"name":"StorageChain","id":"storagechain","symbol":"wstor","description":"StorageChain, based in Los Angeles, CA, was founded in November 2022 to provide next-generation decentralized storage and file sharing solutions. Our mission is to revolutionize the web2 cloud data storage industry by leveraging innovative web3 technologies that ensure data security, privacy, file upload speed, and accessibility. The first 150GB of storage space is provided free to the user. At StorageChain, we understand the importance of decentralized storage in an environment of massive global data breaches. To enhance the capabilities of our storage solutions, we have integrated the InterPlanetary File System (IPFS) into our product ecosystem. IPFS is a distributed file system that allows for an ultra secure, peer-to-peer storage and retrieval of data. By leveraging IPFS, we provide our customers with a robust data storage infrastructure that ensures file upload speed, data integrity, availability, and security. The cost of the service is about 75% less than web2 cloud storage solutions. The StorageChain technology is built on the Substrate framework, which provides a flexible and scalable foundation for blockchain development. Our native chain utilizes the Ethereum Virtual Machine (EVM), enabling compatibility with Ethereum-based blockchain and smart contract features. This compatibility empowers our users to leverage the full potential of standardized Ethereum functionalities, including the creation of wrapped coins (ERC-20) and the minting of non-fungible tokens (ERC-721). Our storage node network, consisting of several thousand storage/validator nodes, forms the backbone of our decentralized storage ecosystem. Through the utilization of a Proof of Stake (POS) consensus mechanism, we ensure the efficient and secure operation of our network while promoting energy efficiency and reducing environmental impact. Project participants can earn STOR coins by providing storage and bandwidth services hosted on their own local or virtual machines.","links":"https://storagechain.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/storagechain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x50b275a15e4f5004aa96f972a30e6a9c718b203f"},"polygon-pos":{"decimal_place":18,"contract_address":"0xcfa0bfa4972423eaf8d3b7af7e2ace41c56515f7"}}}