{"name":"ALTAVA","id":"altava","symbol":"tava","description":"ALTAVA GROUP is a Singapore-based company with a strong operating presence in South Korea. We build bespoke brand experiences that enrich the evolving World of Expressions in the metaverse and beyond, working across physical and virtual worlds and providing a seamless bridge for both consumers and brands. We have created ALTAVA Worlds of You, a gamified social commerce platform for luxury fashion, to enable multiple expressions of self in the metaverse - to discover, curate, and play. ALTAVA MARKET is an extension of ALTAVA Worlds of You, where consumers can shop, curate, and collect Worlds of Expressions in the form of NFTs for use in the metaverse. ALTAVA is the metaverse of fashion brands, as the luxury-good-gamified- social and e-commerce platform. It brings culture-defining brands into the metaverse through it virtual platforms and access to others. ALTAVA GROUP has built a formidable line of partnerships with the world’s most prestigious fashion brands including PRADA, Burberry, Armani, Bulgari, Balmain, Thom Browne, A.P.C., Moncler, Christopher Kane, Gentle Monster, Miu miu, Sandro, Fabrizio Viti, Maje, Alexa Chung, and many more. 1- ALTAVA Worlds of You: ALTAVA Worlds of You is our gamified social commerce platform for luxury fashion. We believe that people are more than one thing. Self expression and style should never be limited by society, physicality or otherwise. The ALTAVA digital destination exists to enable multiple expressions of self in the metaverse so that people can discover, curate, and play with Worlds of You. 2- ALTAVA Market: ALTAVA Market is where users can buy and trade exclusive premium luxury fashion NFTs and virtual collectibles as either primary or secondary purchases. On the primary market, we will host private auctions on a regular basis where new NFTs are initially released. On the secondary or resale market, purchasers can buy and sell their personally-owned fashion NFTs.","links":"https://altava.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/altava/logo.png","detail_platform":{"":{"decimal_place":18,"contract_address":"0xdebe620609674f21b1089042527f420372ea98a5"}}}