{"name":"Open Exchange Token","id":"open-exchange-token","symbol":"ox old","description":"What is the project about? OPNX (Open Exchange) is the world's first exchange for trading crypto spot, derivatives, and claims on public orderbooks. OPNX's vision is to create a new standard for a radically transparent and accessible financial world. We help traders and investors who are seeking a credible exchange to experience more fair and transparent financial markets. What makes your project unique? OPNX is a way for those affected by crypto crises to rebuild and take control of their financial future. Over $20 billion of claims are trapped in the bankruptcy proceedings of FTX, Voyager, Celsius, Genesis, BlockFi, Hodlnaut, Mt Gox, 3AC, and other firms. OPNX solves this by being the first to provide tokenized claims trading on order books which can also be used as collateral to trade crypto futures. History of your project. OPNX officially launched on April 3, 2023, as the world's first crypto and claims exchange. On May 31, 2023, OPNX launched its new token $OX, a new staking and governance platform called The Herd, and claims trading for Celsius. What’s next for your project? Following Celsius, we plan to offer FTX claims trading shortly in June. We aim to offer claims trading for as many bankruptcy estates available. The Herd is a staking / DAO type system for users to stake OX and is available at ox.opnx.com. We will be issuing various tokens into the What can your token be used for? $OX introduces a new exchange token model at the heart of the Open Ecosystem, comprising OPNX, The Herd (where users stake $OX and vote on governance), and a host of upcoming products. $OX disrupts the typical CEX token incentivization model by pioneering a staking fee discount model that is democratic, dynamically adjusting, and promotes alignment between the exchange and traders. Every user can receive up to a 100% fee discount in perpetuity by staking $OX tokens proportional to their share of trading activity.","links":"https://opnx.com/","market_cap":1698112,"market_cap_rank":2378,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/open-exchange-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x78a0a62fba6fb21a83fe8a3433d44c73a4017a6f"},"polygon-pos":{"decimal_place":18,"contract_address":"0x78a0a62fba6fb21a83fe8a3433d44c73a4017a6f"}}}