{"name":"Decentrawood","id":"decentrawood_binance-smart-chain","symbol":"deod","description":"Decentrawood is a metaverse platform that uses blockchain, virtual reality, and artificial intelligence technology to create a virtual world where users can live, work, and interact with each other. The platform is designed to simulate the evolution of human civilization and allow users to contribute to the world by creating buildings, objects, and animations, which are referred to as user-generated content. This content is one of the unique features of Decentrawood that allows users to own and earn from their creations. Decentrawood also features social gatherings, live concerts, press conferences, and college classes that users can attend. Additionally, users can buy land on the platform and create their own structures, such as gardens, forests, temples, clubhouses, gaming stations, and even cities. The platform supports augmented and virtual reality, artificial intelligence, and interoperability between different platforms, creating endless possibilities for users to interact with virtual environments and experiences. The platform's native token is DEOD, which is deployed on the Polygon blockchain and used for all transactions within the platform. The tokens are minted according to a schedule and a percentage of the tokens earned by the platform is burned. Decentrawood's aim is to create a user-generated global community on an interoperable multiplatform where anyone can create a space and share their games and other creations with the world.","links":"https://decentrawood.com/","market_cap":2686085,"market_cap_rank":2663,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/decentrawood/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7f4b7431a4e1b9f375ef0a94224ea4ef09b4f668","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x7f4b7431a4e1b9f375ef0a94224ea4ef09b4f668"}},"is_native":false}