{"name":"Scro","id":"scro","symbol":"scroh","description":"S-CRO is a community-driven project that aims to bridge the gap between convenience and security in DeFi. The S-CRO Token powers the SafeSend DApp, our decentralized escrow solution, and will be instrumental in supporting future innovation. \"S-CRO\" is derived from \"escrow,\" a secure type o f transaction where two parties agree to have a third party hold the funds until the terms of the transaction are fulfilled. S-CRO's main use cases are remittance, simple payments, scheduling salaries, sending tokens as a gift and sending S-CRO tokens without incurring any tax. The \"S\" in S-CRO stands for Security, Simplicity, and Sustainability, principles that are ingrained in everything we do. Our primary utility, \"SafeSend,\" is inspired by traditional escrow, and works similarly to escrow in many ways. The key difference is that our service is 100% decentralized. SafeSend is offered as a turnkey solution for remittance, simple payments, scheduled salaries, sending tokens as a gift, and transferring SCRO tokens without tax. The S-CRO token powers our primary utility and fuels the development of more utilities. It has a balanced tax structure that enables the project to succeed in crypto's highly competitive environment. Tax is applied to each transaction including buys, sells, and transfers. Holders can use the SafeSend DApp to transfer S-CRO tokens to another wallet without tax. Safe Send also lets you specify a holding period during which the recipient won't be allowed to withdraw the tokens to their wallet. While in Time Lock, the tokens are held safely in the contract, and only the sender is allowed to take any action. The sender may opt to release the tokens to the recipient before the Time Lock elapses. The sender may also opt to cancel the transaction at any time before the tokens are claimed by the recipient, which will result in a Recall.","links":"https://s-croholdings.com/home/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/scro/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x73a058da53220d25bcb2c4cb8ff8520626ea26e7"}}}