{"name":"Antfarm Token","id":"antfarm-token","symbol":"atf","description":"What Is Antfarm Token (ATF)? Antfarm Token (ATF) is an ERC20 token used to pay all swapping fees on Antfarm Finance, a decentralized exchange (DEX) on Ethereum. It was introduced to fit all the needs of the different stakeholders in the ecosystem. What Makes ATF Unique? Being deflationary (15% of the paid fees are burned after every swap) is a core property of the ATF token. This mechanism aims at protecting its holders. With every burn, the value of ATF increases theoretically. Liquidity Providers can claim their fees at any moment, without any impact on the pool value or volume as these fees are paid with the ATF token. This has many advantages: - LPs can further custom their strategy by deciding if they should reinvest their collected fees, diversify into new pools or simply keep them in ATF. By introducing the ATF, we give LPs the ability to create new source of earnings, independently from their initial pool strategy. - Crypto-native projects are incentivised to launch liquidity pools with their own token in the Antfarm ecosystem. It gives them the opportunity to put their stack at work. They can use their collected fees (in ATF) to pay their day-to-day expenses as a company. It prevents them from selling their own token to do so. - For very risky pairs, if one asset value goes to 0, the LPs will lose all their stake in the pair. Thanks to Antfarm's fee system in ATF, even if one of the assets goes to 0, they would be compensated with a certain % from swapping fees. This is a strong risk mitigation. Antfarm is even greater when markets are turbulent! This is when most swappers will be drawn to our pools. As ATF are required to pay for all swapping fees, the demand for ATF will be become substantial in such times.","links":"https://antfarm.finance/","market_cap":829248,"market_cap_rank":3867,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/antfarm-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x518b63da813d46556fea041a88b52e3caa8c16a8","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x518b63da813d46556fea041a88b52e3caa8c16a8"},"polygon-zkevm":{"decimal_place":18,"contract_address":"0x40df0c3bbaae5ea3a509d8f2aa9e086776c98e6c","geckoterminal_url":"https://www.geckoterminal.com/polygon-zkevm/tokens/0x40df0c3bbaae5ea3a509d8f2aa9e086776c98e6c"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xfb9fbcb328317123f5275cda30b6589d5841216b","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0xfb9fbcb328317123f5275cda30b6589d5841216b"},"avalanche":{"decimal_place":18,"contract_address":"0x8af94528fbe3c4c148523e7aad48bcebcc0a71d7","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0x8af94528fbe3c4c148523e7aad48bcebcc0a71d7"}}}