{"name":"PAID","id":"paid-network","symbol":"paid","description":"PAID is a decentralised crowdfunding platform revolutionising how Web3 projects raise capital. Our mission is to bring certified crowdfunding opportunities to our community, simple and accessible. Through our pioneering LowFDV Community Offerings (LCO) model, we connect thoroughly vetted projects with community funding at significantly reduced valuations compared to traditional raises. The PAID Flywheel powers a sustainable ecosystem where Protocol Revenue drives token buybacks and burns, staking rewards fuel community growth, and successful launches attract more high-quality projects - creating a virtuous cycle of value. Our platform features a multi-tiered system designed to accommodate all participant levels. The EarlyPool offers guaranteed allocations with 5% Protocol Revenue for those staking 75,000+ PAID tokens, while OpenPool ensures accessibility for everyone - no staking required. All pools are conducted with stable coins. We've integrated robust security measures, multi-chain support, and a transparent dashboard for informed decision-making. PAID has facilitated over $35 million in capital across 110 investments and is integrated with more than ten blockchain networks. Our track record includes successful launches like Thetan Arena (264x ATH ROI), Star Atlas (194x ATH ROI), and AIOZ Network (184x ATH ROI). With a thriving community exceeding 250,000 members, PAID continues to democratise access to high-quality investment opportunities while maintaining rigorous due diligence standards. Our commitment to compliance and transparency has made us a trusted gateway for both seasoned crypto enthusiasts and newcomers entering the Web3 space.","links":"https://paidnetwork.com/","market_cap":44171715,"market_cap_rank":982,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/paid-network/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x655a51e6803faf50d4ace80fa501af2f29c856cf"}}}