{"name":"Element","id":"element","symbol":"elmt","description":"ELMT - The ELMT Token is the ERC-20 of the bridged digital rewards from the Element Blockchain, which is using blockchain based technologies to fight destructive mining practices globally. Whereas some tokens are created from ICOs, or Initial Coin Offerings, the ELMT Token is minted on and by the Element Blockchain as a digital reward for node owners who own and host node licenses that power the blockchain. The ELMT Token is an ERC-20 Token that has been bridged over to the Ethereum Network from the Native Element Blockchain. The Element Blockchain is managed by the community of node owners and governed by the Element Distributed Governance Framework (DGF) Charter that was voted in and approved by node owners. Element United, the company, neither promotes the token nor handles its listing on exchanges and does not create liquidity. The company remains focused on building blockchain-based products and services. The company operates independently from the Blockchain, aiming to navigate the intricate regulatory landscape with complete transparency and compliance. Element United is a company working to fight destructive mining practices worldwide with the use of blockchain technologies. This is done in a variety of ways including partnering with mines to create alternate revenue, creating blockchain-based products such as NFTs and interactive gaming, mining certification programs that encourage environmental stewardship and tokenized carbon offset programs. Project Launch Date: 04/21/23 – First Bridge of Token Country of Origin: The majority of the dev team and headquarters is in the United States. Sales team/business developer in Jakarta, Indonesia. Node Owners globally including some mines in Tanzania. Media Coverage: https://coinstore-support.zendesk.com/hc/en-us/articles/24500483280409-Coinstore-Lists-ELMT-USDT-Trading-Pair https://www.pollutiononline.com/doc/element-united-pioneering-global-decarbonization-efforts-0001 https://apnews.com/press-release/ein-","links":"https://www.elementunited.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/element/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x600d601d8b9eb5de5ac90fefc68d0d08801bfd3f"}}}