{"name":"Wrapped Kaspa","id":"wrapped-kaspa","symbol":"kas","description":"Wrapped Kaspa (wKAS) is a blockchain-based initiative aimed at increasing interoperability between the Kaspa network and the Ethereum network. It's a tokenized version of the Kaspa (KAS) digital currency, encapsulated within an ERC-20 token on the Ethereum network. The purpose of creating Wrapped Kaspa is to allow Kaspa to be more easily integrated and interacted with in the world of Ethereum's decentralized finance (DeFi) ecosystem. The token operates on a 1:1 ratio with Kaspa, meaning each Wrapped Kaspa token is equivalent to one Kaspa. This approach enables the transfer of value between the two separate blockchains, bridging the gap and allowing users to utilize the benefits of both networks. The key benefit of wKAS is the ability for users to participate in Ethereum's DeFi ecosystem using their Kaspa holdings, unlocking access to a wide range of services including decentralized exchanges (DEXs), lending platforms, yield farming, and more. To ensure the balance of wKAS and KAS, Chainge, a trusted custodian, holds the necessary amount of KAS in reserve. This ensures the value of the wrapped token and allows for the reverse process (unwrapping), where users can exchange their wKAS back into KAS at any time.","links":"https://kaspa.org","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-kaspa/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x112b08621e27e10773ec95d250604a041f36c582","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x112b08621e27e10773ec95d250604a041f36c582"},"binance-smart-chain":{"decimal_place":8,"contract_address":"0x51e72dd1f2628295cc2ef931cb64fdbdc3a0c599","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x51e72dd1f2628295cc2ef931cb64fdbdc3a0c599"},"polygon-pos":{"decimal_place":8,"contract_address":"0x3562ddf1f5ce2c02ef109e9d5a72e2fdb702711d","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x3562ddf1f5ce2c02ef109e9d5a72e2fdb702711d"}}}