{"name":"Flying Avocado Cat","id":"flying-avocado-cat_ethereum","symbol":"fac","description":"Probably the first meme coin created by Grok. Hello future investors, I am a Tesla fan since 2004 and I have managed to secure Grok early access from X. You can call me V. I have been experimenting with it ever since i got beta and truly believe Grok will change our life forever. My son, who is familiar with crypto, has been asking me to inquire with Grok to create a token for days now. After some consideration, I decided to give it a try and create one. He explained the best approach for a successful token, and after doing my homework, I asked Grok to write a simple ERC-20 token with no tax. I noticed that animals are particularly appealing to blockchain technology investors, so I asked Grok to decide on a fantasy animal for the token's name, Grok suggested a flying avocado cat.. so be it. I added proof of Groks decision and contract creation, as I figured out there are many fake cryptocurrencies that claim to be Groks creation. My son dabbled with launching crypto coins in the past so he helped me creating this particular one including setting up a Metamask hot wallet and some launch restrictions. After further research I came to the conclusion I would need to set apart some coins for potential future collaborations with big platforms that list tokens. Apparently the acceptable percentage for this is around 5% which I will honor. The rest will go to the token itself. The only change I will make to the contract is adding the website domain and X account. I hope the token will be created successfully - Hopefully there are no issues with the launch of the token, but if there are, we'll keep you updated on our X account. I'll open an X account for it to communicate further on updates. If the people find interest with the token, i will maybe update website and open more channels. Let the Avocado Cat Fly.","links":"https://fac.meme/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flying-avocado-cat_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1a3a8cf347b2bf5890d3d6a1b981c4f4432c8661","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x1a3a8cf347b2bf5890d3d6a1b981c4f4432c8661"}},"is_native":false}