{"name":"SUPERCATS","id":"supercats","symbol":"s-cats","description":"SUPERCATS INTRODUCTION Welcome to Supercats, a project on the Ethereum Network. This project was created by a group of experienced individuals who have years of experience in the crypto world. The team’s aim is to turn Supercats into one the biggest and most respected projects of 2022 and beyond. Past experience has shown us just how powerful cat meme coins can be. Not only will this project bring you amazing utility and use case, but Supercats will be known for years to come as the superhero to many struggling projects. Supercats will be launching on the 31st of July 2022 with the mission to conquer the world of crypto. MISSION STATEMENT The Supercats team holds the following values dear to its heart and at the core they represent who we are: Community – Working collaboratively with the community is at the heart of our work. Because, when people come together, we can accomplish so much more than we ever could alone. Integrity and Accountability We deeply value the trust that the community has placed in us, and we work tirelessly to ensure that this trust will always be well founded Transparency At Supercats the team always encourages open communication between the team and the community members. This transparent and open dialogue is one of the strongest of our pillars and works on trust within the community to go the distance. VALUATION In traditional business practices, the value of an asset is determined by factors such as risk, cost of operations and other determinants of growth. Over the years and with the rise of the Dotcom era, especially in the meme coin realm, other factors such as hype and community surpasses these traditional valuations. Supercats aim, as you take this journey with us, will be to gain your trust and belief in the project and its value. As this is accomplished with the amazing reach and brand recognition, this will become a self-fulfilling prophecy for the team and you as our community.","links":"http://Supercats.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/supercats/logo.png"}