{"name":"Crypton","id":"utopia","symbol":"crp","description":"Crypton (CRP) is the monetary unit and digital currency of the Utopia P2P ecosystem. It is a decentralized cryptocurrency where transactions are instant, irreversible, and completely untraceable. When Cryptons are sent, the Peer-to-Peer network of Utopia confirms the transaction immediately, without delay. There is no centralized, or decentralized, authority capable of reversing a transaction on the Utopia network. uWallet balances of Cryptons cannot be seized or even identified by any authority. Crypton transactions are completely anonymous and cannot be tracked on the blockchain. Only the sender and receiver have any record of a transaction. Newly mined Cryptons are distributed every 15min block to nodes helping to maintain the network which meet the minimum requirements. Utopia is an ecosystem designed to protect the privacy of interactions and to preserve the security and confidentiality of each participant's personal data. The network went live on November 18, 2019, and is supported by the people who use it, based on Peer-to-Peer (P2P) technology. With no central server involved in data transmission or storage, it has no single point of failure and is truly decentralized. Each node, including your Utopia client, transmits network data using secure Curve25519 high-speed elliptic curve cryptography. The data transmitted cannot be intercepted by any third-party, only the recipient is able to read it. All personal account data is stored on a Utopia user's local device in an encrypted file using 256-bit AES encryption. Utopia enables users to bypass online censorship and firewalls, allowing them to freely communicate and interact with whomever they want, whenever they want. Users can privately send instant text and voice messages, transfer files, play games and create censorship-resistant group chats, channels, and websites, as well as make and accept payments denominated in Utopia's fully integrated digital currency, Crypton.","links":"https://u.is/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/utopia/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}