{"name":"Inflation Adjusted EURO","id":"inflation-adjusted-euro","symbol":"ieuros","description":"The core thesis of the Spice Trade protocol is that, there's a massive need for a decentralized, on-chain, open-source, value-stable, scalable, modular, cross-chain, and capital-efficient system for trade among people of the world. Furthermore, such a system should have deep, long-term, and protocol-owned liquidity to reduce friction and maintain tight pegs. It is our belief that creating such a system brings us one step closer to creating a more peaceful and prosperous future for mankind. The first step in building such a system is to re-think 'money' based on the following principles: On-chain and decentralized: Reduce custodial risk. This stands in direct contrast to centralized stable coins that may have significant custodial risk. Value-stable: Frictionless trade requires using money whose value does not significantly fluctuate. Value stable is a relative term. For example, depending on the use case, the best money should be designed to be stable relative to national currencies (Such as USD or Euro), a basket of currencies, an inflation adjusted currency, in-game virtual currencies, reward points (imagine a stable coin that traces a hotel or airline point system on chain) etc. The Spice Trade platform allows building appropriate on-chain decentralized money for all these use cases. Scalable: Money is a tool of trade. The last thing a successful trade network needs is friction in scaling its monetary system. Modular: As we will demonstrate in the rest of this whitepaper, the Spice Trade protocol is fully modular to accommodate both immediately predicted needs as well future unknown use cases. Open-Source: Creating an open-source ecosystem where anyone with a good idea can contribute and build on top of the Spice Trade protocol is one of our core values Capital-Efficient: While over-collateralized on-chain stable coins pioneered the non-custodial money movement, we believe they will play a relatively smaller role in the future of money.","links":"https://spicetrade.ai","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inflation-adjusted-euro/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xd7a5197b78e6c139531c3d2ff064215902b72c2e"},"ethereum":{"decimal_place":18,"contract_address":"0xc87f0a3f3671f7d01278625561dc6e284b62dae9"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6458df5d764284346c19d88a104fd3d692471499"},"polygon-pos":{"decimal_place":18,"contract_address":"0xb66930d1299eaf9f6b8354c539e5f83b75794ac4"}}}