{"name":"Rubic","id":"rubic","symbol":"rbc","description":"# **What is Rubic?** Rubic is a Cross-Chain Tech Aggregator for users and dApps. Our vision is that Rubic’s new umbrella SDK will aggregate the best Web3 cross-chain tech - from signals and oracles, to tokens and NFT bridges, in ready-made templates for DEXs, Lending/Farms, and more. This will help developers easily make their Web3 dApps cross-chain, regardless of what their function is. Right now, Rubic aggregates 26 major blockchains, 90+ DEXs and bridges, and enables swapping of 15,500+ assets with the best rates, highest liquidity, and transaction speeds - in one click. Users can do it on https://app.rubic.exchange/, but we also provide tools for dApps to enable cross-chain swaps. On top of that, Rubic’s app and our cross-chain widget provide fiat-on-ramp services, making crypto easy to access and buy. ### RBC token utility The Rubic token serves as fuel for Rubic’s ecosystem and has the following token utility: * SDK subscriptions & Integration Service Fee in RBC * Grant programs for SDK integrators will be covered in RBC * Governance * Token holders can participate in decentralized decision-making. * Low fees for RBC holders * Cut costs of cross-chain calls, exchange fees, and gasless fees. * Distribution of partners’ airdrops to RBC holders ### Rubic’s Value Proposition Rubic is the ultimate solution for users and projects that seek to harness cross-chain, aggregating blockchains, bridges, and DEXs. Rubic is the all-cross-chain-solution aggregator for users and dApps: token and NFT bridges, signals, oracles, and smart contract executors. For example: - Now, by implementing Rubic into your project, users will be able to swap tokens and NFTs for any of 15,500 assets (including fiat payment methods with 250+ currencies) across EVM and non-EVM chains, without leaving your website. - Your project will be able to communicate with other networks in a variety of ways, regardless of what blockchain they’re built on. https://docs.rubic.finance/","links":"https://app.rubic.exchange/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rubic/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3330bfb7332ca23cd071631837dc289b09c33333"}}}