{"name":"Kingdom Karnage","id":"kingdom-karnage","symbol":"kkt","description":"\"What is Kingdom Karnage? Kingdom Karnage is an Animated Combat NFT Trading Card Game on Enjin’s JumpNet network. Kingdom Karnage is currently playable cross platform from Browser, Google Play, Steam and soon will be supported on iOS. Simple to play, hard to master. Kingdom Karnage equips you with an army of up to 30 cards, and challenges you to deplete the health of the enemy hero before his army is able to defeat yours! Characters and Equipment are not just virtual assets, they are also NFT’s, powered and infused with Enjin Coin. Players can trade the NFTs on the Enjin Jumpnet Blockchain and in future our in-game auction house. The $KKT token is a native currency used for Our in-game auction house Item Rentals Entry to King of Karnage mode Catacomb Key rentals Tournament entry and/or prizes Monthly PvP league prizes Locking in Mida’s vault - Unlock voting rights and an exclusive character. Securing a discount in the Kingdom Karnage shop. A Unique Play & Earn Gaming Experience Kingdom Karnage delivers a rewarding and enriching experience whatever your budget. Players can start to play&earn completely free, with the game’s Campaign supplying you with a free deck with which to start your journey. There’s always something going on at Kingdom Karnage. For free you can partake in: Seasonal events, including exclusive characters. Weekend mini events EVERY weekend. Bounty targets offering card packs at the start of each week. Personal weekly PvP targets rewarding NFT characters. Monthly PvP leagues rewarding $KKT prizes. One of our Monthly PvP leagues is a balanced mode. Both players are given a pre-set deck ensuring only skill separates you from your opponent in your battle to secure $KKT prizes. For those with established decks higher $KKT prizes await in our standard PvP mode. Those who do have funds to spend will find interesting and unique opportunities including our Midas $KKT vault, Dynamic Cards & Catacombs Keys. Midas Vault: Lock your precious $KKT in our Midas Vault to receive unique perks and opportunities: Vote each month in our governance polls to receive $KKT rewards Receive Midas himself as a playable character who levels faster the more $KKT you have locked in his vault. Access exclusive item sales not available elsewhere. Dynamic Characters: Characters that go on sale as common cards, but scale all the way up to legendary cards as players join the game. A new Dynamic is added with each race & the Elves are set to be added to Kingdom Karnage in 2022. Catacomb Keys: Catacombs is the top dungeon of Kingdom Karnage, with exclusive loots and high drop rates. Each key can only be used once daily and only 1000 Catacombs Keys exist. Key owners can currently choose to use that daily use to: Use the key themselves Rent the key to another player Pay another player a $KKT fee to run the dungeon for them, securing them a game loot. We also have a lively and committed community that you can find on both Telegram and Discord. You’ll even find the odd event held there, with regular quizzes and even giveaways! We hope you’ve convinced you that Kingdom Karnage offers an exclusive experience whatever your budget, find some useful links below & we hope to see you in-game soon!\"","links":"https://kingdomkarnage.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kingdom-karnage/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe64017bdacbe7dfc84886c3704a26d566e7550de"}}}