{"name":"Prime Staked XDC","id":"prime-staked-xdc","symbol":"psxdc","description":"The XDC Liquid Staking System offers an accessible way for XDC holders to stake their tokens and earn rewards from masternodes without the usual barriers, such as high capital requirements, KYC restrictions, or hosting expenses. How It Works Stake and Receive Liquid Tokens When you stake 1 $XDC in the system, you receive 1 $pstXDC (Proof-of-Stake XDC) in return. The exchange rate is always 1 $XDC = 1 $pstXDC. $pstXDC represents your staked XDC and can be freely used across the ecosystem. Vault or Masternode Minting To stake, you first mint an XDC Vault or an XDC Masternode through the platform. Deposit your $XDC into the Vault or Masternode. Once deposited, $pstXDC is automatically credited to your wallet. Ecosystem Integration $pstXDC can be used in DeFi applications, providing liquidity, earning yield, or for trading, all while your staked $XDC continues to earn rewards from masternodes. Key Features and Benefits Access to Masternode Rewards: By staking through the liquid staking system, users earn rewards generated by XDC masternodes without needing to host or maintain the infrastructure themselves. No KYC or High Entry Barriers: Traditional masternode participation often requires significant capital (e.g., 10M XDC tokens) and compliance with KYC regulations. The liquid staking system eliminates these hurdles, making it accessible for all XDC holders. Lower Costs: Hosting expenses are managed at the protocol level, removing the technical and financial burdens on individual users. Flexibility with $pstXDC: $pstXDC acts as a liquid staking derivative, allowing holders to retain liquidity while earning staking rewards. This token can be transferred, used in decentralized applications, or redeemed for the original $XDC at any time. Security and Transparency Smart Contract-Driven: The staking system operates on secure smart contracts, ensuring your funds are safe and transactions are transparent. Decentralized Reward Distribution: Rewards from masternodes are distributed proportionally and transparently to all participants.","links":"https://primestaking.xyz/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/prime-staked-xdc/logo.png","detail_platform":{"xdc-network":{"decimal_place":18,"contract_address":"0x9b8e12b0bac165b86967e771d98b520ec3f665a6","geckoterminal_url":"https://www.geckoterminal.com/xdc/tokens/0x9b8e12b0bac165b86967e771d98b520ec3f665a6"}}}