{"name":"just memecoin","id":"just-memecoin-2","symbol":"memecoin","description":"Meme coins are community-driven digital assets fueled by internet humor, viral trends, and decentralized spirit. Born from memes, powered by the people, and amplified by social media, meme coins defy traditional finance with pure cultural energy. No need for whitepapers or roadmaps — just vibes, conviction, and a loyal community. In the world of meme coins, laughter builds consensus, and every meme has value. Buy the meme, ride the dream. Meme coins are community-driven digital assets fueled by internet humor, viral trends, and decentralized spirit. Born from memes, powered by the people, and amplified by social media, meme coins defy traditional finance with pure cultural energy. No need for whitepapers or roadmaps — just vibes, conviction, and a loyal community. In the world of meme coins, laughter builds consensus, and every meme has value. Buy the meme, ride the dream. Meme coins are community-driven digital assets fueled by internet humor, viral trends, and decentralized spirit. Born from memes, powered by the people, and amplified by social media, meme coins defy traditional finance with pure cultural energy. No need for whitepapers or roadmaps — just vibes, conviction, and a loyal community. In the world of meme coins, laughter builds consensus, and every meme has value. Buy the meme, ride the dream.Meme coins are community-driven digital assets fueled by internet humor, viral trends, and decentralized spirit. Born from memes, powered by the people, and amplified by social media, meme coins defy traditional finance with pure cultural energy. No need for whitepapers or roadmaps — just vibes, conviction, and a loyal community. In the world of meme coins, laughter builds consensus, and every meme has value. Buy the meme, ride the dream. Meme coins are community-driven digital assets fueled by internet humor, viral trends, and decentralized spirit. Born from memes, powered by the people, and amplified by social media, meme coins defy traditional finance with pure cultural energy. No need for whitepapers or roadmaps — just vibes, conviction, and a loyal community. In the world of meme coins, laughter builds consensus, and every meme has value. Buy the meme, ride the dream.","links":"https://meme-coin.world","market_cap":27086,"market_cap_rank":9494,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/just-memecoin-2/logo.png","detail_platform":{"ethereum":{"decimal_place":2,"contract_address":"0x108f9fe948e7f07a42bf8957de773f5d2c97a00d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x108f9fe948e7f07a42bf8957de773f5d2c97a00d"}}}