{"name":"OAKI","id":"oaki","symbol":"oaki","description":"OAKI is a groundbreaking regenerative finance protocol that transforms token activity into real-world ecological impact, specifically, planting trees. More than a cryptocurrency, OAKI is a community-owned, Web3-native engine for reforestation, climate coordination, and decentralized impact. At its core is the TerraLoop mechanism: a continuous, automated system that converts token treasury sales into verifiable donations to Team Trees, a trusted environmental initiative where $1 directly funds the planting of one tree. As OAKI’s market cap increases, the daily rate of tree planting scales accordingly, turning market activity into measurable climate action. But OAKI isn’t just financial. It’s built as a living strategy game, where users interact with a digital Earth that evolves as real trees are planted. . OAKI also introduces Proof-of-Plant, a transparent, on-chain verification model that tracks every donation and tree planted. This shifts the narrative from vague ESG claims to fully auditable impact. The tokenomics are simple but purposeful: 70% of the token supply goes directly to reforestation via TerraLoop. 20% fuels new climate partnerships. 10% rewards community participation and growth. Airdrops are distributed to active contributors — not just to speculate, but to reward real involvement in growing both forests and the movement. Through this design, OAKI becomes the first cultural layer of ecological regeneration in Web3 — combining smart contracts, transparent giving, and community storytelling to restore the planet. It invites collaboration from NGOs, gamers, DAOs, investors, KOLs and anyone seeking to build a future where finance heals rather than harms. Project: oakiworld.com Trees: teamtrees.org Twitter: @oakiworld","links":"https://oakiworld.com/","market_cap":44992,"market_cap_rank":7707,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/oaki/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"J3feEguzMNVuksDh3JRhCqoiTcYX4PaLZyBQDxHFpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/J3feEguzMNVuksDh3JRhCqoiTcYX4PaLZyBQDxHFpump"}}}