{"name":"Geodnet","id":"geodnet","symbol":"geod","description":"What is the project about? The Global Earth Observation Decentralized Network (GEODNET) is a decentralized network of Space Weather mining stations that report the real-time influence of the Sun’s solar winds on the Global Navigation Satellite System (GNSS) signals. This data is commonly used to accurately correct GNSS (GPS and other navigation satellite) signals to provide centimeter level positioning accuracy and improve absolute time accuracy to nano-second level. What makes your project unique? GEODNET is a leading DePIN (Decentralized Physical Infrastructure Network) project with strong demand/user-side revenue growth and token burn. GEODNET serves numerous existing applications with a world-class network of >3000 nodes supporting Automotive/Autonomous Navigation, Agriculture/Construction Vehicle Machine Control, Earthquake/Geohazard Monitoring, and traditional Land Survey. History of your project. Project was first presented at the 2021 GNSS+ conference run by the Institute of Navigation. It received Best Presentation Award. (https://www.ion.org/publications/abstract.cfm?articleID=17882) GEODNET Mining Stations were deployed from March 2022, and the network has been growing rapidly to 3000+ now. On-chain revenue occurred in April 2023 (https://twitter.com/GEODNET_/status/1651977929260167169). Bordeless Capital lead a $1.5M token pruchase investment in July 2023 (https://medium.com/borderless-capital/borderless-leads-a-1-5m-investment-into-geodnet-to-bring-high-accuracy-positioning-to-the-masses-ccd2c1b9ce97) What’s next for your project? * Growing data users in the area of robotics, drones, and mobile phone apps * Staking to create high value regions for improved network coverage in areas needing additional station coverage What can your token be used for? *Fees for providing GEODNET data streams and services * Rewards to Space Weather Miners * Staking to create new high value SuperHex * Used for governance votes to determine how network resources are allocated * Mining equipment discounts and purchases","links":"https://geodnet.com/","market_cap":57475832,"market_cap_rank":800,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/geodnet/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xac0f66379a6d7801d7726d5a943356a172549adb"},"solana":{"decimal_place":9,"contract_address":"7JA5eZdCzztSfQbJvS8aVVxMFfd81Rs9VvwnocV1mKHu"}}}