{"name":"BUSINESS","id":"business","symbol":"business","description":"What is the project about? $BUSINESS is a cryptocurrency project that stands out in the crypto space for its emphasis on humor, authenticity, and community. It's not just about financial gains; it's a platform where meme enthusiasts and crypto fans come together to enjoy the lighter side of the crypto world. What makes your project unique? What sets $BUSINESS apart is its commitment to transparency and safety. We've implemented key features like liquidity locking, contract ownership renouncement, and developer doxxing to ensure our community's trust. We're not just a project; we're a community that values humor and the joy of memes. History of your project $BUSINESS was born out of a desire to create a crypto community that's different from the norm. We recognized the need for trust and authenticity in a space often marred by uncertainty. That's why we took steps to lock liquidity, renounce contract ownership, and disclose our developer's identity. Since our inception, we've been fostering a supportive community of meme enthusiasts. What’s next for your project? The future of $BUSINESS is filled with excitement. We'll continue to grow our community, host meme contests, and provide a platform for meme creators to shine. We aim to become a go-to destination for those who appreciate humor in crypto. Further decentralization and community-driven initiatives are also on our horizon. What can your token be used for? Our $BUSINESS token can be used within our community for various purposes. It's a way to participate in our ecosystem, engage with other community members, and even vote on important decisions. While it holds value in the crypto market, we encourage its use within our community to enhance the meme-sharing experience and strengthen our bond.","links":"https://businesserc.vip/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/business/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8a4584f0eefda8a9b459264dc7a0d62bba9b5484"}}}