{"name":"Credit","id":"credit","symbol":"credit","description":"What is Credit (CREDIT)? - Credit is the LOW COST decentralized smartchain that is designed with scalability in mind. Our Solidity based smartcontracts make DeFi & NFT virtually free. The Credit WEB3 Universe - The TerraCredit network supports the creation of CRC20 smartcontracts. Using EVM we are able to provide an instantly compatible environment where all ERC20 tokens can exist and function much faster as a CRC20 tokens in our more cost effective blockchain. Defi, NFT and any other type of ERC20 token can be submitted to the Credit network in minutes, for less than $0.0001 Community - The TerraCredit community stands out globally for one thing, apart for being large with over 100,000 users globally, Credit holders are amongst some of the newest crypto users. Credit is a passport to decentralization and our work in the offline communities is key to mass adoption, which is one of the founding principals of TerraCredit. Our platform is built around our users, for many reasons the community are the project, the leaders and role players are merely members who have contributed enough to play a higher role of service to the project. There is an open door policy, anyone can join us. Roadmap - Our development team is in the process of creating an Ethereum scaling solution. The Credit Smartchain Network will join the CREDIT platform as an Ethereum side chain. The focus of our work is to vastly improve transactions per second (TPS) and to lower the fee's to a suitable level that would encourage mass adoption of Web3 and cryptocurrency. How is CREDIT secured? - The current Credit smartchain is secured using POS, anyone can support the network with a free hardware wallet. Instead of earning fee's from transactions, our nodes compete for block rewards. every 2 minutes a new block is created and 50 coins new coins are sent to the successful miner.","links":"https://creditsmartchain.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/credit/logo.png"}