{"name":"ArchLoot","id":"archloot","symbol":"al","description":"What is the project about? ArchLoot is a UGC (user-generated content) NFT game with loot-style composability and playability. What makes your project unique? Built on BNB Chain, ArchLoot provides the first interactive NFTgameplay in the industry, which fully enables on-chain implementation of upgradeable characters/props NFTs and unleashes its potential for playability and user-generated content robustness. The technology is made possible by our unique protocol, EIP 4985 and BEP 129. These two innovative protocols allowed user modifications within the game to be logged on chain. Powered by the interactive NFT technology, all the NFT body parts are more than static jpegs, but ‘live’ parts that their metadata can be changed and protected by a treasury contract to unleash their long-term value. History of your project. Launched in 2022, ArchLoot has gathered talents from the world's leading gaming publishers, blockchain projects, and financial elites, the team now has 40 experienced members and is currently operating across continents. Important events: Official Marketing Operation - April 1, 2022 Closed Beta Test Phase 1 - May 18, 2022 Mystery Box Sales 1st Wave - June 10, 2022 Mystery Box Sales 2nd Wave - August 8, 2022 Closed Beta Test Phase 2 - August 18, 2022 Closed Beta Test Phase 3 - October 20, 2022 Token listing - November 23, 2022 What’s next for your project? Major milestones in 2023 can be found here: https://docs.archloot.com/roadmap Open beta test Official launch New features of the partner incentive system New gaming mode Enhancement of Open World UGC-NFT collection showcase room UGC-NFT marketplace & OpenSea integration What can your token be used for? ArchLoot adopts a dual-token economic system, which includes both a governance token and in-game gold. ALT functions as an access token, so by holding ALT, users can participate in community governance and voting, and obtain exclusive access to content and other in-game benefits.","links":"https://archloot.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/archloot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x046bad07658f3b6cad9a396cfcbc1243af452ec1"}}}