{"name":"Swych","id":"swych","symbol":"swych","description":"What is the project about? Swych token empowers the Swych ecosystem, many features, and earning capabilities. Thanks to the Swych token, investors can take advantage of incredible earning opportunities, such as Staking. Swych also has incredible features such as SuperLotto, Launchpad, and a Decentralized Exchange. With plans to expand daily, the Swych token is the heart of an evergrowing ecosystem. Swych will become a Protocol-owned asset that is self-sustaining and grows thanks to a cyclical flow of fees while paying real yield to the Swych holders. What makes your project unique? The Swych token powers the Swych ecosystem, meaning its functionality can continue to grow with its development. With the Swych token, users can participate in high-yield staking, SuperLotto, and other features like farming and perpetual exchange. The Swych token's goal is to provide a real yield to investors and continued growth thanks to the expansions of the ecosystem. History of your project. With the development of the Decentralized Exchange Swych came the need for a token to be paired with it, which is a Swych token. The team behind Titano Finance saw a need for a token that could benefit users thanks to a thriving ecosystem of utilities and transformed an old project into something new and exciting. What’s next for your project? Swych's development comes in two phases, with the initial phase being distribution. During this phase, investors can stake and earn Swych tokens. There are also elements to protect larger price dips, such as taxes and our ATB system. During phase two, the Swych token will evolve into a protocol-owned asset, allowing users to generate Real Yield, remove taxes and fees, and expand our listing to other areas of the crypto world. What can your token be used for? The Swych token can be used for features such as Staking, Farming, SuperLotto, and much more.","links":"https://swych.finance","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/swych/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9334e37fad7c41cd6c9565bff3a97ce31cee52a3"}}}