{"name":"LFIT","id":"lfit_polygon-pos","symbol":"lfit","description":"LFIT is a new healthcare WEB3 service that improves healthcare privacy and security. Life, transforming our lives healthier and more vibrant, providing and managing the healthcare services we need, FIT. The goal is to ensure that healthcare data is securely managed on a blockchain, allowing you to experience a reliable total healthcare service. Team We participated in anticipation of the potential to bring innovation to medical data management and healthcare services in the global market through the synergy effect of private blockchain technology and total healthcare services. Ed Shon | CEO / Co-Founder Ed Shon is the CEO of LFIT and leads the company with outstanding leadership and vision. Based on his strategic thinking and business operation skills accumulated through many years of experience, he is leading the growth of LFIT into a global blockchain technology leader. Jeremy OH | CMO | Head of Strategic Planning jeremyoh studied business administration and has many years of experience in the advertising, sales, blockchain, and IT platform industries. With a keen interest in blockchain, he has participated in blockchain-related planning and projects for many years and gained experience. Based on this experience, he has become a key member of a new project in the healthcare blockchain industry. Terry Ko | CTO | LFIT CTO Terry Ko is the Chief Technology Officer, and has been in charge of architecture design and development of backend systems. He is a technology development expert who has been working on blockchain core technology development and blockchain engine improvement for many years since becoming interested in open source blockchain projects. He is currently in charge of blockchain mainnet development and bridge system development that connects private and public chains.","links":"https://www.lfit.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lfit/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x5b901182b9b2820a713ff5d88519999c550d40e8","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x5b901182b9b2820a713ff5d88519999c550d40e8"}},"is_native":false}