{"name":"Gangs Rabbit","id":"gangs-rabbit","symbol":"rabbit","description":"What is the project about? WE ARE GANGS RABBIT!! Gangster Rabbit: Evolution is a collection of 7777 Gangs — unique avatars hosted on the Ethereum blockchain.Your Gangster grants you access to a community comprised of 50 gangs, each one representing distinct characteristics. In the fight for supremacy, hierarchy is vital. GAS: Evolution employs a dual-rarity system. The first rarity layer is determined by the gang your Gangster belongs to. The second layer is a factor of your Gangster’s traits.The GangsRabbit army has been deployed with advanced equipment Jetpack - Airplane - Car to be able to conduct monster killing campaigns & collect $RABBIT for stockpile. Journey to kill enemies and run endlessly Like Endless GangsRabbit What makes your project unique? Supported by social media influencers & 600++ KOLS, No Token & No Unlock Development Team, Big Marketing Wallet, Renounced ownership, DIDBTOK, AMABinance, Super Burn token, Marketing MiniDoge x200 in the past, KYC-AUDIT - BASED - TAX REDUCTION , CEX PRE-LIST on VINDAX, 3% tax reward holder , Binance Live - Binance Post, CG , CMC , CG China, CMC China 12-48hrs, Mint 777 GangsNfts at launch, Game Run & Shoot , 600++ Kols & Twitter influencers History of your project. What’s next for your project? Used $35000 for BINANCE , Huobi , BTOK , Marketing....Before launch. AFTER LAUNCH Advertising on large squares and subways - BUYBACK and SUPERBURN in 5-15 minutes at launch -»» Moon, CG & CMC charts only 12-48 hours, CG China & CMC China coming soon... Trending Twitter, CMC, CG ,dextools, avex, CG, CMC... after 4-7 days to complete updates on platforms-»»» Vindax, P2B, Bkex, Cointiger, Coinbase, LBank and Bitmart, Mex and Huobi... What can your token be used for? Charity - gamefi - mint nfts - SuperBurn - stacking...","links":"https://gangsrabbit.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gangs-rabbit/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xf8f95f20cd1fb6f1fa6f7776c359214220f49aa6"}}}