{"name":"Ankr Staked ETH","id":"ankreth","symbol":"ankreth","description":"ETH Liquid Staking with Ankr Ankr Staking offers Ethereum token holders the opportunity to stake ETH and, in return, claim ETH Liquid Staking tokens — ankrETH. ankrETH also offers instant liquidity for your staked ETH, enabling you to connect ankrETH with DeFi platforms and earn several more layers of rewards. ankrETH is a reward-bearing token, meaning that the fair value of 1 ankrETH token vs. ETH increases over time as staking rewards accumulate inside the token. Benefits - Generate Multiple Layers of Rewards: Use ankrETH on DeFi platforms to enable you to multiply your earning potential in APY on top of your staking rewards! - Low Impermanent Loss: Contributing ankrETH for liquidity with tokens like ETH means a low risk of impermanent loss, expanding the upside of providing liquidity for a more stable and profitable experience. - Compound Your Staking Rewards: Your staking rewards will compound daily as the value of ankrETH in your wallet increases vs. ETH. - Support & Secure Ethereum: Staking ETH directly supports the Ethereum network and helps validate transactions. Ankr’s staking system distributes staked tokens intelligently across the Ethereum ecosystem to achieve optimal decentralization. - Elastic Supply: Users can trade their ankrETH tokens for their staked ETH anytime.","links":"https://www.ankr.com/about-staking/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ankreth/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe95a203b1a91a908f9b9ce46459d101078c2c3cb"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xe05a08226c49b636acf99c40da8dc6af83ce5bb3"},"fantom":{"decimal_place":18,"contract_address":"0x12d8ce035c5de3ce39b1fdd4c1d5a745eaba3b8c"},"polygon-zkevm":{"decimal_place":18,"contract_address":"0x12d8ce035c5de3ce39b1fdd4c1d5a745eaba3b8c"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe05a08226c49b636acf99c40da8dc6af83ce5bb3"},"avalanche":{"decimal_place":18,"contract_address":"0x12d8ce035c5de3ce39b1fdd4c1d5a745eaba3b8c"}}}