{"name":"Cuberium","id":"cuberium","symbol":"iland","description":"## What Is Cuberium? Cuberium is a blockchain-based virtual world allowing users to create, build, buy and sell digital assets in the form of a game. By combining the powers of DeFi and the create-to-earn model, the Sandbox creates a decentralized platform for a thriving gaming community. The Cuberium platform’s main mission is to introduce blockchain technology in mainstream gaming successfully. The platform focuses on facilitating a creative “create-to-earn” model, which allows users to be both creators and gamers simultaneously. Cuberium employs the powers of blockchain technology by introducing the iLand utility token, which facilitates transactions on the platform. ### Who Are the Founders of Cuberium Cuberium is the brainchild of BitcoinWide, a company founded in 2018 under the leadership of Anton Tsekhanovskyi. Anton, serving as the CEO of both BitcoinWide and Cuberium, brings substantial experience to the cryptocurrency sphere. The development of Cuberium resulted from collaborative efforts, notably involving Strategic partner Paul Makarenko, Managing partner Daniil Semenov, and Product partner Nikita Sverdlichenko. ## What makes Cuberium unique Masterworld is the general virtual world of the Cuberium Metaverse, where users can own, manage, and develop a part of this world in the form of islands with ownership backed by NFT smart contracts on the Ethereum blockchain. Islands owners have the only right for Cuberium Metaverse native tokens mining which will be possible during the fixed period of mining epochs. Every user in the Cuberium can expand the metaverse by creating their own virtual worlds, developing these spaces, and providing access to these worlds for other users. Worlds owners may use the platform tools to monetize their virtual worlds by creating Play-to-earn games, integrating advertising, and attracting players to the built realms. Brands and companies can easily create virtual space and represent themselves in the Masterworld.","links":"https://cuberium.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cuberium/logo.png","detail_platform":{"ethereum":{"decimal_place":null,"contract_address":""}}}