{"name":"Employees","id":"employees_binance-smart-chain","symbol":"yes","description":"Employees is a cooperation of competencies, geographic location, cultural values and community resources without an administrative and management superstructure, allowing to build sustainable business ties with minimal costs and financial losses in a horizontally integrated holding, where benefits are distributed among community members. The Employees concept has no territorial, sectoral, country and labor restrictions and development is underway in all business areas proposed and approved by the community. Projects in the field of business support and maintenance, audit, logistics, storage and sale of goods, customs affairs have already been implemented and are in effect. At the moment, a new direction in the field of education is being implemented, allowing to create an electronic platform for obtaining remote general, additional and professional education for absolutely any person with the receipt of documents on education or qualifications of the desired state. Employees coins are issued in a fixed amount of 77 million coins without the possibility of additional issue. Currently, coins are used as a confirmation of participation and stimulation of the community in the development of Employees by receiving benefits from such development in the form of the exchange rate of coins. This mechanism allows the community to be protected from low-efficiency or obviously unprofitable decisions, the consequences of which may be reflected in a decrease in the exchange rate of coins. By decision of the community, 50% of the coins are directed to the formation of the Investment Fund, 5% is the Reserve Fund, and the remaining coins are distributed among the community members.","links":"https://employees.world","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/employees_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x10da22d5ba1a9f8da586172784aa03f959dcb2fb","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x10da22d5ba1a9f8da586172784aa03f959dcb2fb"}},"is_native":false}