{"name":"Diva Staking","id":"diva-staking_ethereum","symbol":"diva","description":"** What is the project about? Diva Staking is an Ethereum Liquid Staking protocol powered by Distributed Validator Technology (DVT) What makes your project unique? ** Diva uses its own DVT to provide better uptime and risk management with no centralized parties: Diva's DVT system provides novel risk mitigation mechanisms, thanks to its fault tolerance and consensus mechanisms preventing single Operators from causing damages. This has been designed to mirror Ethereum's rock-solid Proof of Stake mechanisms. 🏦 Economic protection: Diva Operators are collateralized, providing skin-in-the-game and economic guarantees for Stakers against any potential losses. 💬 Censorship protection: Diva Operators are permissionless, potentially being run by thousands of independent entities with diverse setups and geographies. 🔐 Hack protection: Diva Operators don't have access to validator keys, so even if they're hacked, they can't unilaterally cause damage to the protocol. 🛡️ Takeover protection: Diva isn't run by any single entity. Diva is a decentralized platform in which decision making power is held its participants, including Stakers and Operators. In comparison, Lido is operated by a whitelisted set of ~30 Node Operators, which are permissioned and uncollateralized. This is commonly referred to as \"Proof of Authority\". ** History of your project. The idea of Diva came to life 2022, the project was founded by an experienced team of Cryptographers and participants of the Ethereum ecosystem. The project was funded late 2022. Testnet has been launched in summer 2023 and the mainnet launch of the protocol will happen late 2023. ** What’s next for your project? The protocol mainnet launch later this year (the Diva Dao is already live on mainnet). ** What can your token be used for? The Diva Token is intended for governance of the Diva DAO. Please visit https://www.tally.xyz/gov/diva to see more details and community engagement.","links":"https://www.divastaking.net/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/diva-staking/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbfabde619ed5c4311811cf422562709710db587d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xbfabde619ed5c4311811cf422562709710db587d"}},"is_native":false}