{"name":"Maro","id":"ttc-protocol","symbol":"maro","description":"What is the project about? - Maro blockchain is a decentralized, high-performance, and secure blockchain platform that was designed to support the development of decentralized applications (dApps). The platform is built on a multi-chain architecture that allows developers to create customized side chains that can run independently of the main chain. As an open blockchain infrastructure, users and developers can directly connect to and build upon the global economy with Maro. What makes your project unique? - MARO distinguishes itself from other mainnet projects with its superior processing speed and user-friendly features, which enable users to conveniently participate in selecting representatives. Our platform offers a range of user-friendly mobile applications and software development kits History of your project. - The history of the Maro Blockchain project, formerly known as TTC, dates back to 2018. Key milestones in the project's development include the completion of many services and solutions, such as MARO mainnet, Acorn Protocol(AI, DAO, SocialFi), Tigris Protocol(Defi), ByteBridge(Data SaaS). What’s next for your project? - The next steps for the Maro Blockchain project involve several significant developments. We plan to update our EVM-compatible supporting tools and further enhance the Acorn Protocol base on MARO by integrating Generative AI technology. This integration will empower individuals to create and generate value through the use of cutting-edge technology. We will update the MVM for Maro Blockchain and expand offerings with the launch of an Open Labor Marketplace. What can your token be used for? - Voters(Holders): MARO holders who contribute to the governance of consensus will be rewarded with MARO. - Developers: To develop a DApp, developers need to use gas to perform the necessary tasks within the DApp, and users who execute these tasks within the DApp also need to pay for the gas required to perform these tasks.","links":"https://ma.ro/","market_cap":1360304,"market_cap_rank":2562,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ttc-protocol/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}