{"name":"Token Teknoloji A.Ş. USD","id":"token-teknoloji-a-s-usd_polygon-pos","symbol":"usdot","description":"Launched in September 2023, USD Token (USDOT) is an asset-backed token redeemable 1:1 for 1 US dollar. Issued by Token Teknoloji Anonim Şirketi, this token is fully backed by US dollar on the blockchain at a 1:1 ratio and indexed to the price of USD. For every USDOT created, an equivalent amount of USD is held as collateral in the company's reserves. USDOT provides a cost-effective, fast and secure solution for global users, offering direct ownership with no storage costs and high accessibility for 24/7 transactions and transfers, regardless of geographical boundaries. Unlike fiat US dollar transaction limits in the market, there are no minimum transaction limits for USDOT. USDOT transactions are executed instantly and any amount of USDOT tokens can be converted to fiat currencies, ensuring quick and efficient transactions. USDOT is created and runs on the Avalanche C-Chain and Polygon blockchain, and it is compatible with all blockchain wallets that support EVM. It uses smart contracts to automatically manage the collateralization process. As the demand for USDOT tokens increases, Token Teknoloji Anonim Şirketi will add the equivalent amount of US dollars to its reserves for each USDOT token upon request from institutions wishing to meet their demand. This ensures that the 1:1 ratio between US dollar and USDOT is maintained whilst keeping the market in balance between supply and demand. And a coin burn function is built into the blockchain's smart contract to remove a pre-determined amount of USDOT tokens from circulation when needed, ensuring a balance between USDOT and the US dollar. Thanks to this mint-and-burn mechanism, the price of USDOT is always in equilibrium with the price of the US dollar.","links":"https://www.token.com.tr/en/reserve-tokens/usd-token-usdot/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/token-teknoloji-a-s-usd_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x2f5de51823e514de04475ba8db1eeba5b244ba84","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x2f5de51823e514de04475ba8db1eeba5b244ba84"}},"is_native":false}