{"name":"Koakuma","id":"koakuma","symbol":"kkma","description":"Koakuma is a multiplayer online ARPG game with immersive combat systems and mechanics within a graphics-intensive metaverse. Players will play a role and fight in epic battles using specially designed NFT assets. CHOOSE A CHARACTER Choose from the many characters that suit you best: the mighty Grane with a giant sword; the graceful huntress who traverses the forest; the wise and lovely mage; the sharp and cunning secret assassin; and the simple and honest bear. BATTLE ALONGSIDE FRIENDS The continent of Laria is filled with terrible forces of evil, and not all places are easy to go alone. When you need extra hands, call up your friends, and the powerful match-making system can easily help you find adventurer partners. Explore mysterious dungeons with your friends, challenge powerful bosses, cooperate with each other in times of crisis, save your dying partners and get them back into the fight! FIGHT FOR THE LADDER TOURNAMENT The Ladder Tournament is a competitive system that connects adventurers from all over the world and provides a fair playing field. The ladder Tournament consists of seasons, with each season awarding rewards based on player rankings, and some extremely rare NFTs are only available to those warriors who reach the top of the ladder. Challenge players from different countries, styles, and characters; hone your skills; choose the right combination of skills and runes for yourself; and keep challenging and growing to reach the top of the ladder throne. EXPLORE THE ENDLESS LARIA The vast continent of Laria is made up of many regions, each with unique topographical features: lush forests, mysterious underground palaces, cold swamps, hot deserts, and more. Travel through the continent of Laria, discover the dusty legends, and let your name spread in this mysterious continent. BECOME A GOD OF WAR Improve your skills, collect legendary equipment, use runes reasonably, understand every opponent, and stand up from failure again and aga","links":"https://koakuma.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/koakuma/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x18d3be5ecddf79279004e2d90d507594c2d46f85"}}}