{"name":"Zebra DAO","id":"zebra-dao","symbol":"zebra","description":"Launched in Q3/Q4 2021 by a team based in Switzerland, Zebra DAO is a solution that combines a DAO system with NFTs platforms to let users enjoy the advantages of decentralized governance and to put an end to organizational hierarchy. Our goal is to improve transparency and automation in the way NFT platforms are governed so that all users can actively decide, vote and contribute to the management of DAOs. HOW DOES IT WORK? Voting power: DAO-enabled NFTs platforms allow its users to vote on changes to the platform. Rewards: DAO-enabled platforms can implement a reward system based on each user's vote or action. APY: DAOs can provide fully transparent and fair returns to all users. Zebra DAO can help to transform the structure of a company (small or large), by giving back decision making powers and responsibilities to the communities. Our goal is to provide a new democratic process through a 100% decentralized governance. DAO MODELS : DAO Protocol: Voting is used to enforce decisions about protocol changes or decisions to be made. DAO Investment: Uses and centralizes investment operations for different projects (most often DeFi). DAO Service: Acts as a regulator for talent acquisition activities for companies and individuals. DAO Social Media: Supports decentralized platforms on social media and community engagement. OWNERSHIP BENEFITS : A DAO-enabled platform allows users to review and vote on content moderation policies, asset policies, and key decisions for the platform. Users can have an influence over the platform's future, suggest changes to governance and functionality, add members to the security council, and even intervene in tokens allocation (tokenomics). VOTING POWER : In a DAO-enabled platform, users are involved in decisions through a 3-step voting process: Proposal, vote and result. Voting on DAO allows each user to play a major role in decision making, which is transparent and fair to all. This model brings consistency and allows us","links":"https://zebradao.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zebra-dao/logo.png"}