{"name":"Global Innovative Solutions","id":"global-innovative-solutions","symbol":"gsi","description":"GSI mission is to enter the market and establish ourselves by focusing on innovative projects and support for the environment. GSI aims to clean up the environment from water and air pollution, developing activities and projects that respect nature and are ecologically sustainable. Every token issued on the market corresponds to and is truly supported by tangible physical results. No money can be generated if it does not correspond to a real and concrete reduction in pollution. We believe that many small actions can be initiated to create big changes, enabling eight billion people to help make our planet a better place. A new direct and innovative way of involving individuals in the sustenance of the environment with the use of the GSI token. We aim to provide new inflationary tokenomics with the intention of reinvesting 21% of profits monthly. We will also play a definable role of “broker”, acquiring the orders on behalf of TESIMAG and Soluzioni&Azioni. Clients will send full payment to the broker. On the other hand, once the work has been completed, the companies will receive their remuneration half in euros and half in GSI. The broker will use half of the payment received to invest in GSI, buying the tokens on the market and will pass them on to the executing company. This passage marks a clear boundary with any other project. Whenever there is a request for services from companies, we will intervene strongly on the market and for each order received from Global Innovative Solutions there will be an inevitable increase in the value of the company and as a result, of the token as well. In this way, we set ourselves a double goal, the progressive increase of the GSI token and concrete support for the environment. In addition, GSI will donate 2% of the profits to charity for water purification in Africa and beyond, following the objectives of “Agenda 2030“. The pace of mining will come from a real impact on the environment. On every","links":"https://www.gsi.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/global-innovative-solutions/logo.png"}