{"name":"BNPL Pay [OLD]","id":"bnpl-pay_ethereum","symbol":"bnpl","description":"BNPL Pay is a decentralized lending protocol that puts credit in the hands of those who need it the most, namely, those who cannot meet the requirements to take on collateralized loans. To that end, we have created the BNPL Pay Protocol, an uncollateralized lending platform that services such a need. We tackle the counterparty risk associated with uncollateralized borrowing through a distributed network of Banking Nodes. Our system delegates the tasks of credit checks, risk assessment and other due diligence requirements to pool operators, and creates a set of incentive structures that reward and punish these operators based on performance. Banking Nodes manage pools of liquidity, and have the autonomy to delegate these funds to potential borrowers in the parameters they see fit, while lenders can choose an operator that suits their risk-reward preferences to conduct interest bearing activities based on fully transparent data. Borrowers can apply for credit from any or all Bank Nodes, and if approved, are issued loans on fully customizable and agreed upon terms. Unlike established protocols within DeFi, uncollateralized borrowing presents an entirely new avenue of risk that is yet to be tackled within blockchain networks, namely, counterparty risk. BNPL Pay seeks to address this risk by delegating the tasks of credit checks, risk assessment and other processes conducted by traditional credit facilities to our node operators. With this, node operators lie at the heart of our protocol, and connect lenders with borrowers. The BNPL token is the governance token within the BNPL Pay protocol and has multiple utility functions including bonding a banking node and staking banking nodes as a form of insurance in the event of a default.","links":"https://bnplpay.io","market_cap":64142,"market_cap_rank":7786,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bnpl-pay/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x84d821f7fbdd595c4c4a50842913e6b1e07d7a53","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x84d821f7fbdd595c4c4a50842913e6b1e07d7a53"}},"is_native":false}