{"name":"Particl","id":"particl","symbol":"part","description":"Particl is an open-source and decentralized privacy platform built on the blockchain specifically designed to work with any cryptocurrency. It allows decentralized applications (Dapps) of all sorts to be built within a secure, highly-scalable environment and be integrated directly into Particl’s flagship wallet: Particl Desktop Particl's mission is to foster a new decentralized, private and democratic economy supported by its platform and native currency (PART). All the fees generated by the platform are paid to the PART coin holders who are securing the network. PART is a privacy coin built from the Bitcoin Core codebase and is always updated to its latest version (currently 0.16.0). Capitalizing on the latest Bitcoin codebase not only allows the Particl platform to benefit from both Bitcoin’s stability and security, but also enables developers to leverage and easily fork any product, service and technology development from the Bitcoin developer community. Particl Cold Staking is enabled by smart-contract functionality and lets users securely delegate staking powers to “staking nodes” which contain no coin. The purpose of these “staking nodes” is to provide a dedicated resource connected to the Particl blockchain and stake on behalf of another wallet without being able to spend its coins. In other words, it allows users to stake offline coins. Particl's decentralized marketplace is built with privacy at its core and offers a low-cost, secure and scalable e-commerce experience. Designed to work with almost any coin, it uses several privacy-enhancing features such as default private transactions, encrypted data, secure messaging, IP address anonymization, metadata stripping, private listings and more. It is exclusively governed by the Particl community which also earns all the fees generated by the marketplace. Particl is designed so that users can easily use and build decentralized applications that can then be integrated directly into Particl Desktop. These applications foster the decentralized, private and trustless Particl economy and are built using native privacy smart-contracts. PART can be sent as three different privacy states, each with their own degree of privacy and cost: Public, Blind, Anonymous. Each state has a purpose within our privacy platform and also provides the user full control of the linkability and traceability of their transactions. Particl is the first coin in history to deploy these privacy protocols on a Bitcoin Core codebase. The Particl platform accepts a wide range of cryptocurrencies and provides maximum privacy at the same time. By using atomic swaps and third-party integrations, all incoming currency transactions are automatically converted into PART, Particl’s native currency. This way, you can use your favorite cryptocurrency while being protected by PART’s powerful privacy features.","links":"http://particl.io/","market_cap":3091701,"market_cap_rank":1875,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/particl/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}