{"name":"Backed HIGH € High Yield Corp Bond","id":"backed-high-high-yield-corp-bond_arbitrum-one","symbol":"bhigh","description":"What is the project about? Backed brings real-world assets (RWAs) such as stocks or ETFs to blockchain rails. For example, our product bHIGH tracks the iShares € High Yield Corp Bond UCITS ETF, representing an index of Euro-denominated high yield corporate bonds. What makes your project unique? Backed issues permissionless tokens (bTokens) that represent ownership of structured products. Backed tokens are 1:1 backed by the underlying assets, held by Swiss third-party custodians, and are bankruptcy remote book-entry securities. History of your project. Backed was incorporated in 2021 in Switzerland due to the regulatory clarity the Swiss DLT Act provided to the project. Backed released its first tokenized product on Ethereum in early Q1 2023. Backed now supports issuance and redemption on many different blockchains. What’s next for your project? Backed is working to create the standard for tokenization with a network of protocols benefitting from RWAs on-chain. What can your token be used for? Backed enables clients to access sustainable, low-risk yields while keeping their funds entirely on-chain. There is no need to go through TradFi onboarding processes or off-ramp crypto to fiat. bTokens are utilized by the likes of Gnosis, Angle Protocol, Ribbon Finance, Aragon, and Blueberry to name a few. Disclaimer: Backed Finance AG and its subsidiary Backed Assets GmbH are not affiliates of or licensed by BlackRock Inc, BlackRock Fund Advisors and any of its affiliates (\"BlackRock\"). BlackRock is not responsible in any way to bIB01 products. Backed DOES NOT sell its tokens to U.S. Persons or for the account or benefit of U.S. Persons, and tokens are not marketed, offered, or solicited in the U.S. or in any other prohibited jurisdiction. For a full list of prohibited and restricted countries and review of legal documentation, please visit https://www.backedassets.fi/legal-documentation (edited)","links":"https://backed.fi/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/backed-high-high-yield-corp-bond/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x20c64dee8fda5269a78f2d5bdba861ca1d83df7a","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x20c64dee8fda5269a78f2d5bdba861ca1d83df7a"}},"is_native":false}