{"name":"zkApes Token","id":"zkapes-token","symbol":"zat","description":"What is the project about? zkApes is a metaverse project built on zkSync Era, called Apeverse. Apeverse aims to bring people together from all around the world for entertainment, education, interaction, and expression. Apeverse is developing a whole metaverse ecosystem based on Apes NFTs (dNFTs), users can exchange your NFT(AMM), play games, make money in Apeverse. What makes your project unique? zkApes is the first metaverse project built on zkSync Era, which is developing a whole metaverse ecosystem, including 8 products: Apes NFT, dNFT, mutant NFT, NFT DEX(AMM), NFT browser, NFTFI, zkSync Name Service and game lobby. zkApes has the largest NFT community on zkSync Era, with 100,000 discord members and 140,000 twitter followers now. zkApes has launch the zkApes token($ZAT), with more than 200,000 onchain holders now. Ranked second in trading volume of NFT on Mint Square. History of your project. zkApes was launched on Sep. 1st, 2022, released Apeverse roadmap on Oct. 28th, 2022, deployed the first NFT contract on zkSync Era mainnet on Mar. 24th, 2023, launched the first NFT browser on Apr. 12th, 2023, launched the first NFT DEX on Apr. 28th, 2023. zkApes is conducting the biggest airdrop on zkSync for zkSync users. What’s next for your project? zkApes is launching dNFT and NFTFi, users can stake and lend NFTs (dNFTs) on NFTs DEXs, they can also stake zkApes token for $ZAT. zkApes is setting up cooperations with several game projects, they will be listed on Apeverse game lobby. In addition to new products, zkApes is updating NFTs traits, NFT DEX and NFT browser constantly. The future of Apeverse belongs to the DAO community, and the role of the zkApes token for enabling community-driven DAO governance. What can your token be used for? Stake, lend zkApes NFTs and earn $ZAT, stake $ZAT and earn $ZAT, buy dNFT by $ZAT, community governance by $ZAT.","links":"https://zkape.io","market_cap":86736,"market_cap_rank":4361,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zkapes-token/logo.png","detail_platform":{"zksync":{"decimal_place":18,"contract_address":"0x47ef4a5641992a72cfd57b9406c9d9cefee8e0c4"}}}