{"name":"Wrapped MinoTari","id":"wrapped-minotari","symbol":"wxtm","description":"Tari is a layer 1 blockchain protocol built in Rust with an ingenious approach to scaling its on-chain user base to millions of people and a native app distribution platform that gives developers access to every user. Building a thriving, loyal, on-chain user base is one of the most challenging things to do in our industry. Existing protocols struggle with this because airdropped tokens predominantly end up in the hands of farmers and Sybils. Their on-chain user bases evaporate rapidly as the farmers and Sybils sell their allocations and move on to the next airdrop. Their only alternative is to route users through high-friction and low conversion rate on-ramps. As a result, most blockchain protocols have few loyal on-chain users. The challenge for existing protocols continues beyond building an ardent on-chain user base. When protocol teams attempt to recruit developers to build on their protocol, they face a catch-22: the best developers want to create applications on platforms with many users, but users demand great applications that keep their attention. The result is a wasteland of protocols with few users, limited apps, and minimal chance of success. Tari is the ultimate solution to this multifactorial problem. Tari is proof of work and uses an ASIC-resistant hashing algorithm. Anyone can download and run the Tari miner to mine Tari on their laptop or desktop. There is no complicated, multi-step onboarding process required. It is easier to become a native Tari user than it is to become a native user for any other blockchain protocol. For developers, Tari introduces a revolutionary approach to app distribution. The Tari miner will have a built-in application launcher. Everyone who mines Tari will have instant access to every Tari application through an interface that looks and feels like an app store. With Tari's unique dual-layer system, developers get the distribution benefit and security of a Rust-based proof of work L1 with the scalability, fast finality, and low fees of a high-performance, native L2. The result is magical: a high-performance, low-fee blockchain protocol that will rapidly scale its on-chain user base to millions and enable developers to reach all of them.","links":"https://www.tari.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-minotari/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}