{"name":"TurtleCoin","id":"turtlecoin","symbol":"trtl","description":"Turtlecoin is a <a href=\"https://www.coingecko.com/en?category_id=37&view=market\">privacy coin</a> that is forked from <a href=\"https://www.coingecko.com/en/coins/bytecoin\">Bytecoin</a>. Because of this, turtlecoin has Bytecoin’s privacy aspects to it called RingCT. This coin is more of a meme coin, but there are a lot of serious tech advancements as well. For example, they have a 30-second block time. They also plan on having simple smart contracts sometime soon, since they say they already started development. They have 35 developers on the team and they also plan on somehow making the blockchain smaller to sync faster, but this is TBA on the roadmap, and the details of this are not out yet. Turtle coin uses the cryptonight_lite_v7 algorithm so it is ASIC resistant. Born on the 9th day of December 2017, TurtleCoin faced a backlash from a couple of online forums, not because it had such a funny name, but since its initial single command line and included TRTL giveaways. Luckily, TurtleCoin of about three months later is grown a lot and has various versions compatible with Apple, Windows and Linux OS. Turtlecoin could be the ideal project to get involved in while it is still in the initial stages. There is more potential for return on investment with a microcap coin than there are with established altcoins. Moreover, you do not have to hand over tokens in an overhyped crowd sale to be a part of this. All you really need to do is download the mining software and get hashing. The coin is one of the easiest to mine as was the developer’s intention. Moreover, given the exciting roadmap that the team has ahead for the project, the future prospects also look quite promising. Private smart contracts and no sync blockchains could push the coin towards mass adoption. <b>Fast</b> With blocks being created every 30 seconds on the Turtlecoin blockchain and transactions taking just seconds, sending and paying with TRTL is a breeze. <b>Easy</b> Having an extremely active development team and a lively, helpful community, you can start using TRTL in minutes, no matter your familiarity and/or expertise with cryptocurrencies in general. Mining TRTL is also very easy to get into with simple, detailed how-to guides. <b>Safe</b> With its beginnings as a fork of Bytecoin, Turtlecoin offers the same degree of privacy and anonimity with its use of ring-signatures. Just like using paper cash, paying with TRTL allows you to spend your money the way you want. Being completely open source, the TurtleCoin project is growing daily. We actively encourage the community to jump in with fresh ideas, no matter your skillset or level of experience. Just hop into the discord and say hello!","links":"https://turtlecoin.lol","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/turtlecoin/logo.png"}