{"name":"RocketSloth","id":"rocketsloth_solana","symbol":"rslt","description":"RocketSloth (RSLT) is a community-driven meme coin built on the Solana blockchain that combines humor, transparency, and a fair distribution model. Its entire supply—18.4 quadrillion RSLT—is owned by the community; the initial liquidity is permanently locked across several decentralized exchanges (Raydium, Orca, Meteora), and the mint authority has been renounced. The tokenomics allocate 35 % of the supply to liquidity, 20 % to airdrops, 15 % to marketing, 10 % to the team and 20 % to a burn reserve ,ensuring no single party controls the supply or can inflate it. What makes RocketSloth unique is its interactive airdrop and deflationary system. Anyone with a Solana wallet can claim a base reward of 3 000 RSLT and earn an extra 250 RSLT per referral through a form on the official site A real-time dashboard shows the number of participants and tokens distributed, encouraging organic growth and transparency. On the other side, RocketSloth is programmed to shrink its supply: an automatic burn mechanism destroys small amounts of RSLT continuously (tracked on a public “burn tracker” page) with the goal of burning 20 % of the supply Each burn transaction is visible on Solscan, and thousands of micro-burns are carried out over time to reduce the circulating supply. The project’s roadmap reflects its ambition to evolve from a fun meme coin into a credible community asset. Following the launch phase—deployment on Solana, liquidity lock, mint renunciation, community airdrop and burn activation—it plans progressive burns, community growth campaigns, strategic partnerships and major listings on CoinGecko, CoinMarketCap and centralized exchanges. Ultimately, RocketSloth seeks to prove that even the laziest rocket can reach the moon through collective effort, humor and transparent token economics.","links":"https://rocketsloth.io/","market_cap":0.00005137,"market_cap_rank":13190,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rocketsloth/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"A2orqVJJVhSTr61dUvRWciTduc3TaZMZADJxmK4UWfGJ","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/A2orqVJJVhSTr61dUvRWciTduc3TaZMZADJxmK4UWfGJ"}},"is_native":false}