{"name":"IMMORTAL.COM","id":"immortal-com","symbol":"immortal","description":"Expediting Longevity We estimate that without proper structuring and focus, indefinite lifespans for the human population will arrive too late for the 8.000.000.000 people currently living on earth. Our goal is to build a bridge between human capital and longevity research to attain longevity sooner; soon enough to prevent senescent death for ourselves and our backers. IMMORTAL represents human interest in longevity. We wish to build a strong and passionate community of like-minded individuals, collaborate with leading research organizations dedicated to aging and longevity, and generate public interest on the matter. We can consolidate existing research and bring specialists of the field together to find solutions for extending human lifespans within our lifetime. By leveraging our capital, we can generate widespread enthusiasm and awareness about longevity research. This momentum will help us encourage the \"mega-rich\" to invest in longevity initiatives, significantly increasing funding in this critical field. Benefits for Holders As an IMMORTAL holder, you will get: Exclusive Insights: Gain first-hand information on our initiatives. Active Participation: Exercise voting rights on funding decisions, influencing when, how, and whom we support. Priority Access: Receive prioritized consideration for clinical trials and early access to future longevity products. Community Engagement: Connect with like-minded individuals committed to driving the future of human longevity. Join Humanity's Greatest Ambition By becoming an IMMORTAL, you join a profound endeavor that has captivated humanity since the times of Gilgamesh—to live indefinitely. Whether you're inspired by our mission or intrigued by its potential rewards, this is the ultimate goal of our century. Together we can survive. So, why die?","links":"https://immortal.com","market_cap":164534,"market_cap_rank":5956,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/immortal-com/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"AnnyAUDoKXn5f7hWDsywsqchv1pTMu5JiPK8WcWqpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/AnnyAUDoKXn5f7hWDsywsqchv1pTMu5JiPK8WcWqpump"}}}