{"name":"Maia","id":"maia_arbitrum-one","symbol":"maia","description":"What is the project about? Maia is the yield powerhouse of Metis with its community rooted in this Ethereum L2. With a 100% fair launch via bonds Maia is a truly community owned token. Maia aims to be a one stop shop for different financial instruments, a fully fledged trading hub with Hermes being the first piece of the puzzle. In order to sustainably bootstrap our surrounding ecosystem, Maia plans to keep on-boarding long term partnerships with protocols that ultimately add value to both our holders and partners. What makes your project unique? $MAIA is a utility and governance token that drives the coordination mechanisms behind the whole Maian ecosystem. This allows us to decentralize the decision making process while at the same time entitling the token stakers of their share of the profits generated by the Maian Treasury. As a DAO we constantly push towards improving our decentralized governance structure and processes. History of your project. A group of partially doxxed friends who have been navigating crypto this last 5 years and have expertise in different fields ranging from smart contract and front end development, economics and marketing as well as a deep interest and understanding in the tokenomics, incentive systems and DeFi primitives behind Solidly, Curve and Olympus. What’s next for your project? Maia V2 will some of these new features. 1. Emissions and Tokenomics - Detailed emissions and supply information leading up to and from V2 Launch. 2. Improved Earnings - New layer of revenue for Maians. 3. Increased Utility - Additions to the token’s utility. What can your token be used for? Currently Maia token can be staked and when you stake, you lock MAIA and receive an equal amount of sMAIA. Your sMAIA balance rebases up automatically at the end of every epoch. sMAIA is transferable and therefore composable with other DeFi protocols.","links":"https://maiadao.io","market_cap":234723,"market_cap_rank":5663,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/maia/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x00000000ea00f3f4000e7ed5ed91965b19f1009b","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x00000000ea00f3f4000e7ed5ed91965b19f1009b"}},"is_native":false}