{"name":"Indigo Protocol iBTC","id":"ibtc-2","symbol":"ibtc","description":"iBTC is synthetic Bitcoin released in November of 2022 as part of Indigo Protocol v1. The Indigo Protocol is a CDP (Collateralized Debt Position) based DeFi protocol that brings capital-efficient synthetic assets to the Cardano ecosystem. Users can purchase iBTC from a DEX just like any Cardano native asset, or can mint iBTC within the Indigo Protocol by depositing ADA as collateral. When users mint iBTC within the Indigo Protocol, they must deposit sufficient ADA such that their CDP remains above the applicable Minimum Collateralization Ratio (MCR) - meaning a user deposits collateral in the form of ADA that ensures over-collateralization. If the value of a user's ADA collateral begins to decrease toward the MCR, a user can choose to add more collateral to keep their iBTC position above the MCR. If a user’s collateral becomes worth less than the MCR of their iBTC debt, the Indigo Stability Pool providers will allow the user to keep their iBTC but will exchange Stability Pool iBTC for the user’s higher value ADA collateral. Thereby ensuring that iBTC remains overcollateralized and that the Indigo Protocol remains solvent via its efficient liquidation process. Unique to Indigo, users still receive their ADA staking rewards from stake pool delegation while ADA is being used as collateral in a CDP. This CDP Liquid Staking feature presents a unique use case for iBTC in trading strategies. The Indigo DAO controls the iBTC parameters and can therefore vote to raise or lower the Minimum Collateralization Ratio for iBTC and all Indigo iAssets.","links":"https://indigoprotocol.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ibtc-2/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"f66d78b4a3cb3d37afa0ec36461e51ecbde00f26c8f0a68f94b6988069425443","geckoterminal_url":"https://www.geckoterminal.com/cardano/tokens/f66d78b4a3cb3d37afa0ec36461e51ecbde00f26c8f0a68f94b6988069425443"}}}