{"name":"EVERY","id":"every_solana","symbol":"every","description":"EVERY (EVERY) — Detailed Project Description EVERY is a utility-focused cryptoasset that powers the Every.meme ecosystem, a launchpad designed to support the creation, deployment, and management of meme-oriented and community-driven tokens. Launched on 12/1/2025 by a team based in the United States, EVERY serves as the core asset used across the platform’s infrastructure, fee systems, community functions, and creator tools. Every.meme was developed to address common challenges that creators encounter when launching new tokens, including technical setup, liquidity management, compliance workflows, website generation, and community tooling. The platform is structured as a “business-in-a-box” framework. It provides automated resources such as project pages, branding kits, smart-contract deployment, listing assistance, and concierge-style support for creators who may not have access to development or operational teams. EVERY coin acts as the underlying medium that enables these system components to operate cohesively. Within the ecosystem, EVERY is used for platform fees, selected creator services, staking programs, and access to optional enhancement features. Some creator services—such as advanced analytics, promotional tools, or extended project support—may require payment or discounts through EVERY. This creates a unified asset that connects platform activity with user participation while allowing the launchpad to operate without relying on external tokens. The project includes on-chain fee mechanisms tied to the launchpad’s operational model. When creators deploy tokens using Every.meme’s automated systems, a portion of the associated platform fees is directed into the ecosystem’s treasury structure. Treasury allocations may support development, creator incentives, growth programs, and long-term platform sustainability. The project’s documentation outlines transparent percentages for each allocation category, with vesting schedules applying to certain segments such as ecosystem funds, marketing, and team allocations. EVERY’s supply is fixed at 1,300,000,000 tokens, with distribution designed around migration from the earlier EVCN token, public liquidity for market operations, staking and reward pools, ecosystem growth funds, marketing allocations, team and advisor shares, and a reserve for future development. The migration process for legacy holders was structured to maintain proportional ownership while adjusting for the new tokenomics model introduced under the Every.meme platform. The project operates across multiple chains, with initial deployment on Solana and planned expansion to Base and other compatible networks over time. Multichain integrations are intended to align the platform with the broader meme-coin and creator-token ecosystem, allowing projects built on Every.meme to access liquidity and user bases across multiple networks. EVERY does not position itself as an investment vehicle. Its purpose is to function as an operational asset within the launchpad environment. The project’s documentation emphasizes risk factors, including market volatility, token liquidity, smart-contract limitations, and the general uncertainty associated with early-stage blockchain ecosystems. Users and creators interacting with the token or platform are encouraged to conduct independent research and consider the risks before participating in ANY token-based activity. As the ecosystem evolves, EVERY will continue to be used as the central token for platform-level functions, governance-related discussions, and creator services. All technical specifications, tokenomics details, and platform documentation are accessible through the project’s official communication channels.","links":"https://EVERY.MEME","market_cap":2302627,"market_cap_rank":2837,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/every/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"EaC6EBUBtNiqZoDEnE3qJ7SDPn6zUzqH6SLzfWWqEVRY","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/EaC6EBUBtNiqZoDEnE3qJ7SDPn6zUzqH6SLzfWWqEVRY"}},"is_native":false}