{"name":"AZCoiner","id":"azcoiner","symbol":"azc","description":"Immerse Yourself In The Simplicity And Comprehensiveness Of The AZcoiner Ecosystem – Everything About The World Of Cryptocurrency, All Within A Single App. Currently, we are focusing on developing an \"All in one platform\" that connects all aspects of the blockchain field in a single dApp: News-Advertising, Airdrop, Web3, and DeSocial. With just one application, users will experience: 1. Hot News: Continuous updates with the latest information and trends from the cryptocurrency market, ensuring you don't miss any opportunities. 2. Profit Sharing: Every day you access our app and website, you will share in the profits from the AZCoiner ecosystem. Ecosystem profits include: - Profits from news products, from advertising, revenue from collaboration and support of other projects through the airdrop program, as well as from the AZC.social network. - Service fees from AZ-web3 products such as: Digital wallets, swap exchanges, Perpetuals exchanges, trading, copy trading, NFT trading platforms, launchpads... 3. Transparent Airdrops: We provide a fair and transparent playground for new projects wanting to conduct airdrops through the AZCoiner app. 4. Dedicated Support: Every new investor joining the crypto market through us will be accompanied by 3-5 expert consultants, ensuring every investment decision you make is carefully considered. 5. Launchpad for the Future: We don't just provide services, we also support and develop potential cryptocurrency projects. The AZ ecosystem's main goal is to develop tools to help pioneers earn additional income. Specifically, AZCoiner's profits come from sources like: - Digital Wallets, bridges - Swap Exchange: https://app.azcoiner.com/ - Perpetuals Exchange: https://perp.azcoiner.com/ - News: https://azc.news/ - Web3 Social Network: http://azc.social/ - NFT Trading Platform The project's goal is to create an \"All in one platform\", where everyone can access all products, features, and enjoy the tremendous benefits.","links":"https://azcoiner.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/azcoiner/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}