{"name":"Truebit Protocol","id":"truebit-protocol","symbol":"tru","description":"What Is Truebit (TRU)? Truebit allows software running outside a blockchain environment to provide trusted results to smart contracts and applications running within a blockchain. The platform allows practically unlimited external compute resources to be applied in a trusted way to extend the performance, throughput, and scalability of its host blockchain. Research began in 2015 on this verification solution which today connects blockchains to both on-chain and off-chain data while enabling smart contracts to securely perform complex computations in standard, easy-to-use programming languages at significantly reduced gas costs. Unlike sharding and other methods for distributing high transaction throughput, Truebit processes complex and large transactions via a consensus mechanism involving a minimal number of redundancies, making it a novel solution for Web 3.0 infrastructure. The bulk of computation occurs with off-chain resources. Verifier’s Dilemma - What Makes Truebit Unique? Rather than relying on external, cryptographic proofs of correctness, Truebit brings scalable computation to blockchains by leveraging game theory principles and financial incentives to increase the on-chain computation power of existing networks and reduce marginal gas costs. While smart contracts can perform small computations correctly, large computation tasks pose security risks for blockchains due to the Verifier's Dilemma. Truebit counteracts this via a retrofitting oracle that achieves correct computational results. Truebit’s microeconomy ensures trustless verification through a financial incentive layer atop a dispute resolution layer. Who is the founder of Truebit (TRU)? Truebit was founded by mathematician and computer scientist Jason Teutsch who co-authored the whitepaper with Ethereum’s Solidity creator and team lead, Christian Reitwiessner. Jason holds a PhD in Mathematics, was a two-time US Fulbright Fellow, and co-discovered the Verifier’s Dilemma. Applications Applications include: Layer-2 settlements DeFi settlements and bookkeeping Batch verification of cryptographic signatures Checking proof-of-work Performing operation(s) with high computational complexity Any smart contract can issue a computation task to Truebit in standard languages (C, C++, or Rust) without concern for Ethereum’s gas limit. Truebit’s WebAssembly-based architecture can read functions and data from Ethereum bytes, smart contract program code, or IPFS. What kind of token is Truebit (TRU)? The supply of TRU tokens may fluctuate over time. Learn more about Truebit: Getting started with Truebit on Ethereum https://medium.com/truebit/getting-started-with-truebit-on-ethereum-ac1c7cdb0907 An Intro to TrueBit: A Scalable, Decentralized Computational Court https://medium.com/@simondlr/an-intro-to-truebit-a-scalable-decentralized-computational-court-1475531400c3 Learn more about Ethereum: Ethereum https://ethereum.org/en/","links":"https://truebit.io/#home","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/truebit-protocol/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf65b5c5104c4fafd4b709d9d60a185eae063276c"}}}