{"name":"Uniwhale","id":"uniwhale","symbol":"unw","description":"Uniwhale is an oracle-based decentralized on-chain perpetual trading exchange where you can trade, with up to 200x leverage, BTC, ETH, and many mainstream crypto assets, directly from your wallet. Compare to our competition, - We offer some of the highest leverage on the market, up to 200x on crypto assets, all directly from your wallet. - We use Pyth, which has much lower latency than other oracles, which makes it far better suited to leverage trading. - Our liquidity pool is anchored to USDT, but you can provide liquidity or post margins in likes of USDC, BUSD, etc. Uniwhale was founded in 2022 by a team of crypto / finance / web experts, who set out to build a platform that provides high leverage perpetual trading, without credit risk, with lower risk of liquidation and zero price impact. On January 3, 2023, we launched Testnet on BNB Smart Chain, followed by the Mainnet launch on March 6, 2023. Currently, we offer 6 trading pairs (ETH/USD, BTC/USD, BNB/USD, MATIC/USD, SOL/USD, APT/USD). Since our launch on Mar 6, 2023, the total trading volume is, as of Mar 20, 2023, more than $30 million, generating almost $30,000 trading fees, based on more than 2,400 trades by 171 unique traders. Data source: https://dune.com/uniwhale/uniwhale-overview Following a successful mainnet launch, we are now executing our product roadmap that integrates automated trading strategies, aggregates other oracle providers, launches a mobile app and expands into likes of Arbitrum, Polygon and Avalanche. UNW is our tradeable and transferrable token. Its holders can stake UNW to participate in the distribution of the value accrued as well as in the token emission. However, UNW is not the governance token. Its holders must convert UNW into esUNW in order to participate in the governance. UNW can be converted into esUNW anytime.","links":"https://www.uniwhale.co","market_cap":13425.69,"market_cap_rank":9252,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/uniwhale/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x5b65cd9feb54f1df3d0c60576003344079f8dc06","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x5b65cd9feb54f1df3d0c60576003344079f8dc06"}}}