{"name":"Bluefin","id":"bluefin","symbol":"blue","description":"What is the project about? Bluefin is an orderbook-based derivatives exchange that uses the most innovative decentralized infrastructure to support both first-time users and professional traders. Bluefin is backed by Polychain Capital, Susquehanna, Cumberland DRW, Brevan Howard Digital, Alliance and other leading investors. What makes your project unique? Bluefin is a Web3 protocol for asset exchange, combining the performance of CeFi with the benefits of decentralized finance (DeFi). Initially targeted at the perpetual swap market, Bluefin protocol is extensible and customizable, designed to keep pace with the innovation and market dynamics in the digital assets space. Bluefin offers its traders the following advantages: - Non-Custodial - Permissionless & Accessible - Value Flow to Traders -Transparent History of your project. Bluefin was founded in 2020. No more space to write. What’s next for your project? Following this release on Arbitrum, Bluefin will also launch on the Sui blockchain. On Arbitrum, Bluefin brings the order book based trading experience to a growing and easily accessible Ethereum-based ecosystem. On Sui, Bluefin will offer a level of scale and performance previously only possible on centralized exchanges. For more information about Bluefin on Sui and the next generation of the exchange, please visit here: https://bluefin.io/blog/introducing-bluefin-and-the-road-ahead What can your token be used for? The BLUE token has been carefully engineered to foster community-led growth and the long-term self-sustainability of the network. The DAO governance has the power to upgrade all exchange contracts through Improvement Proposals. The token has several uses, with more that can be added over time via governance: - Grants holders governing power over Firefly - Used to pay reduced transaction fees on the exchange - Gives value back to traders and bootstraps liquidity - On-chain distribution programs determined by the DAO","links":"https://bluefin.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bluefin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}