{"name":"Wam","id":"wam","symbol":"wam","description":"WAM is a unique play-2-earn platform, with hyper-casual games tournaments where you can enter to compete against other players. You pay an entry fee in $WAM tokens to enter a tournament and if you find yourself among the top performing players of that tournament, you win more coins. The concept of making money by playing hyper-casual games based on skill is new in the gaming industry and WAM.app is the first platform in the world that let you do this. All you need in order to play on the WAM.app platform is a few minutes of your time and the desire to be the best. You can participate in tournaments all around the world, wherever you have internet access. Players don’t have to be connected at the same time, and that is very good for players because each can compete whenever they find the time to do so. The WAM ecosystem will offer multiple roles that users can voluntarily take up and be incentivised to be the best with token gains. 1. Player — play 2 earn; If you play any WAM game, you can begin making money based on how competitive you are. 2. Owner — own 2 earn; If you own a WAM game as an NFT, you will win a percentage of all of the WAM coins that accumulate as entry fees in every tournament. You can buy a game and if the brand value of the game goes up, you can sell it for profit on the WAM Marketplace. 3. Marketer — Market 2 earn; You can rent a game from an owner and organize tournaments for that game. You will get your own percentage of all of the WAM coins the tournament accumulates through entry fees. Renting will be very easy and percentage based. The Owner will split with you a percentage of the revenue you bring him with the tournaments you organize and market. 4. Developer — Develop 2 earn; You can develop games and sell them on the WAM Marketplace. Every time your game is sold, you will receive a lifetime commission from the sale. You can also choose a percentage of the WAM Coins accumulated by tournaments to be distributed to you, regardless of who currently owns the game. These roles will be the backbone of the WAM ecosystem economy. WAM will benefit from everything happening in the ecosystem.","links":"https://wam.app","market_cap":2060516,"market_cap_rank":3219,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wam/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xebbaeff6217d22e7744394061d874015709b8141"}}}