{"name":"WETH","id":"weth_tron","symbol":"weth","description":"What is WETH (Wrapped ETH)? WETH is the tokenized/packaged form of ETH that you use to pay for items when you interact with Ethereum dApps. WETH follows the ERC-20 token standards, enabling it to achieve interoperability with other ERC-20 tokens. This offers more utility to holders as they can use it across networks and dApps. You can stake, yield farm, lend, and provide liquidity to various liquidity pools with WETH. Also, unlike ETH, which doesn’t conform to its own ERC-20 standard and thus has lower interoperability as it can’t be used on other chains besides Ethereum, WETH can be used on cheaper and high throughput alternatives like Binance, Polygon, Solana, and Cardano. The price of WETH will always be the same as ETH because it maintains a 1:1 wrapping ratio. How to Wrap ETH? Custodians wrap and unwrap ETH. To wrap ETH, you send ETH to a custodian. This can be a multi-sig wallet, a Decentralized Autonomous Organization (DAO), or a smart contract. After connecting your web3 wallet to a DeFi exchange, you enter the amount of ETH you wish to wrap and click the swap function. Once the transaction is confirmed, you will receive WETH tokens equivalent to the ETH that you’ve swapped. On a centralized exchange, the exchange burns the deposited ETH and mints a wrapped form for you. And when you want to unwrap it, the exchange will burn the wrapped version and mint the ETH on your behalf. What’s Next for WETH? According to the developers, hopefully there will be no future for WETH. According to the website, steps are being taken to update ETH to make it compliant with its own ERC-20 standards.","links":"https://ethereum.org/en/wrapped-eth","market_cap":7469833337,"market_cap_rank":24,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/weth/logo.png","detail_platform":{"tron":{"decimal_place":18,"contract_address":"THb4CqiFdwNHsWsQCs4JhzwjMWys4aqCbF","geckoterminal_url":"https://www.geckoterminal.com/tron/tokens/THb4CqiFdwNHsWsQCs4JhzwjMWys4aqCbF"}},"is_native":false}