{"name":"Sowaka","id":"sowaka","symbol":"swk","description":"The SWK token, a utility token issued by the Avacus ecosystem, is designed to generate advertising revenue for various communities. Built on top of Avacus, a Web3 super-app, it seamlessly integrates messaging with Web3 wallets. Users can send cryptocurrencies and NFTs on Ethereum and EVM-compatible blockchains to friends as easily as sending a message. Avacus envisions a world where this super-app becomes the central hub for all your needs, with Web3 advertising being the key to its success. Avacus goes beyond messaging by offering native community management features. This provides an alternative to popular platforms for group and community building within the Web3 space. These features will foster a variety of communities within the Avacus ecosystem, such as those between NFT creators and fans, musicians and followers, or groups with shared hobbies or goals. These communities themselves become platforms for advertising, allowing them to generate income through incentive-based advertising (ads with token rewards), thereby revitalizing the community itself. Currently, external income options in Web3 are limited to DeFi transaction fees and NFT sales commissions. Avacus introduces a new channel for earning through Web3 advertising. The ecosystem empowers users to: Earn income by managing or participating in communities. Save Avacus-generated income for asset management in DeFi. Make purchases using Avacus. Avacus aspires to become a daily-used Web3 super-app, ultimately realizing its vision of a self-sustaining Avacus ecosystem fueled by Web3 advertising.","links":"https://sowaka.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sowaka/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xddfbe9173c90deb428fdd494cb16125653172919"},"polygon-pos":{"decimal_place":18,"contract_address":"0xe3c8f0d7f978aadf1929cbbfb116419175844f04"}}}