{"name":"CUBISWAP","id":"cubiswap","symbol":"cubi","description":"CUBISwap is a Decentralized Autonomous Organization (DAO) that offers a full suite of tools to explore and engage with decentralized finance opportunities. Using the products within our DeFi Hub, users and partners can tap into this new wave of financial innovation in a secure, transparent, and globally accessible way. Our community and partners can tap into the next generation of financial innovation through our decentralized exchange, utility token staking, premium launchpad, lending network, and NFT projects in a secure, transparent, and globally accessible way. Getting started on the CUBISwap platform only requires a supported cryptocurrency wallet. We do not require customers to register, and do not have a \"know your customer\" process. To get started with CUBISwap: Join by interacting with our community, using our DeFi platform, and purchasing our native utility tokens, $CUBI Swap between different cryptocurrency tokens on opBNB using our decentralized exchange Create liquidity between cryptocurrency token pairs to receive liquidity provider (LP) tokens, which can earn trading fees (liquidity mining) and be staked in Yield Farms to earn $CUBI Stake $CUBI in Staking Pools to earn tokens from partner projects Lend and borrow crypto assets with the CUBISwap Lending Network Participate in IDO for new crypto projects Purchase Treasury Bills with LP to receive discounted $CUBI or partner tokens that vest over time Crypto projects can partner with CUBISwap to: List their tokens on our decentralized exchange Receive advisory services from our team Network with our robust partnership ecosystem Co-market with us to acquire new users Create Yield Farms to incentivize users to add liquidity for their token on our exchange Raise capital through IDO Whether you're new to crypto or a DeFi veteran, CUBISwap has the tools and the community to support your decentralized finance needs.","links":"https://www.cubiswap.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cubiswap/logo.png","detail_platform":{"opbnb":{"decimal_place":18,"contract_address":"0xb01d49c26416a352fac4fbb3d555d5f2543e3247"}}}