{"name":"ShibaPoconk","id":"shibapoconk","symbol":"conk","description":"ShibaPoCONK, popularly known as CONK, is a cryptoasset that took the Fantom Opera network by storm in early 2023 and is a uniquely innovative project that began as nothing more than a silly memecoin, but quickly garnered a passionate community of die-hard believers during its Liquidity Generation Event. During the longest bear market the cryptocurrency industry has ever experienced, CONK became a shining light that sparked a sense of hope and reassurance at a time when all of us were feeling nothing but fear and doubt. Before even having launched officially, ShibaPoCONK was met with such unwavering support from an entire community right from the get-go, which was a testament to CONK’s potential for growth and success. The people behind ShibaPoCONK are the community members themselves; CONKers. With no central authoritative entity, the CONK community is a diverse group of individuals from all over the world, united by their love for Web3 technology and its potential application in all aspects of business and life. With autonomy at its core, the CONK community take it upon themselves to drive the project forward, contributing their skills and expertise in developing the website, creating marketing materials, and even organising their own events. Their passion for the project is a reflection of what CONK fundamentally represents; a gold-standard in a decentralised, permissionless and self-sustaining way of life. ShibaPoCONK is for the culture, and for the people. From its humble beginnings as a DeFi token experiment, ShibaPoCONK has grown into a thriving community of Web3 enthusiasts. The project has set its sights on creating the CONK World, a virtual hub for Web3 professionals, artists, and creatives. Within the CONK world, $CONK tokens will continue to be used as a means of payment, and ShibaPoCONKs offical collection of NFTs will be used intrinsically at the forefront of every interaction within the CONK World, essentially serving as membership passes or tic","links":"https://conkme.com/","market_cap":50699,"market_cap_rank":7546,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shibapoconk/logo.png","detail_platform":{"sonic":{"decimal_place":18,"contract_address":"0x63a522f6e7d5b96f7aebb74d2648545e9e14078d","geckoterminal_url":"https://www.geckoterminal.com/sonic/tokens/0x63a522f6e7d5b96f7aebb74d2648545e9e14078d"}}}