{"name":"Cheelee","id":"cheelee","symbol":"cheelee","description":"What is Cheelee? Cheelee is a short video platform where users are rewarded for watching the content. Cheelee was created under the premise of the Attention Economy concept stating that human attention should be converted into income using modern technologies. The Attention Economy was introduced by Herbert Simon, the Nobel Prize laureate, in the 1970s. Considering that today people spend an average of 2.5 hours of their time on social networks daily and get nothing in return, Cheelee took on a difficult mission to provide everyone with the opportunity to monetize their time spent on watching the content. The platform introduces NFT and GameFi mechanics, allowing for the collection, leveling up, and trading of NFT Glasses – the crucial element of the Cheelee ecosystem. Through this, the audience of the platform earns by converting their attention into CHEEL tokens. Who Are the Founders of Cheelee Cheelee was founded in 2019 by Roman Alekseev, a serial entrepreneur and venture capitalist with more than 20 years of experience in the international market. It was co-founded by Ruslan Sharov and Yuriy Kardonov. Ruslan Sharov is the current CEO of the platform. As an entrepreneur and a business angel with 20 years of experience, he co-founded KSK Group consulting company, Mazalt Group holding, and Gift to an Angel charity fund. Yuriy Kardonov is the CEO and founder of neurotechnologies and virtual reality startup CommON. He is also an organizer of global hackathons for IT developers. What Makes Cheelee unique? Cheelee is the first social media to offer its users and creators rewards for viewing or creating content. Apart from this, the platform also allows buying, selling, upgrading, minting, staking, or collecting NFT Glasses. Once signed up every user receives free NFT Glasses, a collectible item, a tool for earning on the platform, and the crucial element of the gaming design.","links":"https://cheelee.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cheelee/logo.png"}