{"name":"AstroBirdz","id":"astrobirdz","symbol":"abz","description":"Introducing the game changing NFT Reward Mechanism, along with Staking and P2E Games! The AstroBirdz are Earth’s first line of defense! Orbiting in the NFT Energizing Space Terminal (N.E.S.T.) in low orbit Earth, they engage in battle to protect Earth from exotic invasions. They are no ordinary birds, as you may have guessed. Cybernetically enhanced, they are capable of wielding powerful armaments and defensive capabilities using NFT nanotechnology that can be morphed and upgraded to combat ever increasing threats to Mother Earth. Until now, the utility of NFTs has mainly focused on one of three areas: artwork, memorabilia, or gaming. We are introducing a novel application of NFT technology: rewards-based NFTs that incentivize holding with dynamic rewards features. As if this wasn’t enough, the NFTs will also be usable in a play-to-earn gaming format. Every AstroBird starts as an egg! Holders will have to stake the egg until it hatches into a baby AstroBird. Baby AstroBirdz can be fed $ABZ tokens which activates earnings at a basic APY, feed till the Nano-Tech gauge is full and your bird matures. When feeding the NFTs $ABZ tokens, 75% are sent to the rewards pool to replenish it and 25% are burned to positively impact the chart. Astrobirdz NFTs will be available to mint with a limited supply. Level of rewards will be dependent on the rarity of the Astrobirdz. For example, some NFTs will allow holders to earn token reflections and if you possess a rarer Astrobirdz, your reflections will be higher. Every AstroBirdz NFT can be morphed with a special attribute NFT, which creates a new F-NFT (fractionalized NFT). The previous two NFTs get burned, increasing the scarcity for the holders. The newly morphed NFT will contain all the attributes, items, and all the information of the previous two NFTs. Each Special Attribute NFT will have a rarity level of Unique, legendary, rare, uncommon, common. AstroBirdz introduces a staking program which works within a tiered system. The more native $ABZ tokens you stake, the more eggs you receive at the marketplace launch. Eggs can be staked in our marketplace to hatch. In many tiered systems, the more tokens you stake initially, the higher APY you receive.","links":"https://www.astrobirdz.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astrobirdz/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7f3e9bdb55a0fa72bd6025c0ee1dfc3276ce3cf9"}}}