{"name":"DGEN","id":"degen-knightsofdegen","symbol":"dgen","description":"## What Is DGEN? DGEN is an ERC-20 governance and utility token launched by the Degen DAO. DGEN is used to exert control over the Degen DAO and the assets it holds, including the Degen DAO treasury (which can be used to incentivize community builders and bring awareness to the community). DGEN is also incorporated in the Knight of Degen, Inc.’s (a.k.a., “KOD”) decentralized sports and entertainment community and powers tournaments, fantasy games, and other contests on the KOD platform via the KOD mobile and web apps. ## What is the Degen DAO? The Degen DAO is a decentralized ecosystem of web3 sports and competitive entertainment products built for a global community of fans. ## Mission Statement The Degen DAO is building a community-led Sports and Entertainment ecosystem where fans come to celebrate sports, action, and competition with friends and fans around the world. All of the applications and products developed for the Degen DAO ecosystem are connected in their mission of innovating on-chain for communal sports fandom and in-game action, creating new experiences and opportunities, elevating the sports they love. ## Community The launch of the Degen DAO establishes a framework by which the community adjacent to the Knights of Degen, Inc.’s platform can build alongside the core contributors and receive rewards in DGEN for developing key parts of the ecosystem (e.g., guilds and sub-DAOs, bounties, quests). ## Knights of Degen Inc. Knights of Degen Inc. is a web3 sports entertainment and gaming company, dedicated to building innovative games and intellectual property that leverage blockchain technology to unlock innovative experiences that align with the core mission of the Knights of Degen ecosystem and the Degen DAO. ## Where Can I Learn More About DGEN? Whitepaper: https://medium.com/knights-of-degen/knights-of-degen-whitepaper-7f00b405672a Purple Paper: https://knightsofdegen.gitbook.io/the-purple-paper/introduction/the-knights-of-degen","links":"https://www.knightsofdegen.io/token","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/degen-knightsofdegen/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x45f93404ae1e4f0411a7f42bc6a5dc395792738d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x45f93404ae1e4f0411a7f42bc6a5dc395792738d"},"polygon-pos":{"decimal_place":18,"contract_address":"0xdbb5da27ffcfebea8799a5832d4607714fc6aba8","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xdbb5da27ffcfebea8799a5832d4607714fc6aba8"}}}