{"name":"EMG Coin","id":"emg-coin","symbol":"emg","description":"EMG aims to be the first web3 telecom superapp to revolutionise the way people interact with digital assets. The all-in-one EMG superapp is your one-stop destination for instant messaging, video calls, e-commerce,CRM, mobile money transfer and many other exciting features. With our app, you can stay connected with loved ones, shop for the latest products, and easily transfer money all from the same place. Say goodbye to multiple apps and hello to convenience with the EMG superapp. The superapp will be powered by the EMG coin, a utility token that is used to facilitate transactions within the app. EMG is ready to take the telecoms industry by storm with the help of Emeldi, a seasoned telecoms company millions active users and partners across the globe. As a Web3 company within the Emeldi Group, EMG will leverage Emeldi's extensive expertise, technology, business relationships, and overall experience to launch quickly and at scale. Get ready for the future of telecoms with EMG and Emeldi leading the charge! In addition to the features already mentioned, the EMG super app also offers the following: A secure and decentralized platform for storing and managing digital assets, including crypto assets A seamless and user-friendly interface for making voice and video calls, sending messages and media, and creating group chats An integrated e-commerce platform with a wide range of products and services available for purchase using the EMG coin A comprehensive CRM (customer relationship management) system for managing and organizing customer interactions and data A mobile money transfer feature that allows users to easily send and receive money using their mobile devices Integration with popular payment methods such as credit cards and popular e-wallets A loyalty program that rewards users for using the app and participating in various activities A marketplace for buying and selling various digital assets, including NFTs (non-fungible tokens) A range of other usef","links":"https://www.emgroups.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/emg-coin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x08ce2d030cdd9b4661933504cf4dade5679a76ec"}}}