{"name":"EMG SuperApp","id":"emg-coin","symbol":"emgs","description":"What Is EMG Coin (EMG)? EMG aims to be the first web3 telecom superapp to revolutionise the way people interact with mobile devices. The all-in-one EMG superapp is your one-stop destination for instant messaging, video calls, e-commerce,CRM, mobile money transfer and many other upcoming features. With our app, you can stay connected with loved ones, shop for the latest products, and easily transfer money all from the same place. Say goodbye to multiple apps and hello to convenience with the EMG SuperApp. The superapp will be powered by the EMG coin, a utility token that is used to facilitate transactions within the app. EMG is ready to take the telecoms industry by storm with the help of Emeldi, a seasoned telecoms company millions active users and partners across the globe. As a Web3 company within the Emeldi Group, EMG will leverage Emeldi's extensive expertise, technology, business relationships, and overall experience to launch quickly and at scale. Get ready for the future of telecoms with EMG and Emeldi leading the charge! What are features of EMG SuperApp? E-Commerce: Shop for the latest products and trends from your favorite brands, all in one place. Create your own digital store within a few clicks. A peer-to-peer commerce channel for you to kickstart your business. NFT Marketplace: Discover and collect unique digital assets, including art, music, and collectibles. Video Calling: Stay connected with friends and family through high-quality video calls. Instant Messaging: Manage your personal and professional conversations all on a single platform through instant messaging and group chats. EMG Pay: Send and receive money instantly, pay bills, and make purchases safely and securely with our mobile money transfer feature. Games: Play your favorite games and discover new ones in our extensive game library. Car/Taxi App: Book a ride with just a few taps and get where you need to go quickly and safely. Rewards: Get rewarded and avail exclusive deals o","links":"https://www.emgroups.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/emg-coin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xa0af9f13e067562aae8e52a5fb6a74febfcf7d41"}}}