{"name":"Inscription DAO","id":"inscription-dao","symbol":"icda","description":"Inscription DAO is dedicated to creating a decentralized autonomous organization (DAO) for the inscription sector, with the goal of inspiring and driving the vibrant development of a multi-chain inscription ecosystem. By merging blockchain technology with the passion of cultural enthusiasts, we bring the magical charm of inscriptions into a new era of blockchain. Inscription DAO is propelled by the cultural force of the community, with the core philosophy of fostering the innovative development of inscription culture and digital assets through the collective power of the community. We focus on connecting cultural enthusiasts globally, building an open and inclusive platform to facilitate diverse exchanges between inscription culture and traditional blockchain. Here, every individual is a builder of the inscription ecosystem, striving for creative and unique cultural value. The vision of Inscription DAO extends beyond integrating inscriptions into the digital world; it aims to breathe new life and meaning into inscriptions. Through blockchain technology, we fuse traditional inscription culture with modern digital assets, creating digital inscriptions that are more practical and forward-thinking. This is not merely a tribute to tradition but also an exploration of the future. 图片描述 图片描述 图片描述 图片描述 图片描述 图片描述 Development roadmap 2023 to 2024 Plan December 2023: Release BRC-20 and ERC-20 versions of $ICDA inscriptions, and list on CEX Q1 2024: Develop the DAO organizational ecosystem, launch creator marketing subsidies, and go live with a multi-chain inscription NFT marketplace. Q2 2024: Introduce new inscription NFT trading protocols, NFT aggregator, and staking modules. Q3 2024 (Tentative): Explore the metaverse and aggregate multi-chain ecosystems.","links":"https://www.inscriptiond.top/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inscription-dao/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"ordinals":{"decimal_place":18,"contract_address":"bff5163c7f66b18f82250174f789e8ca19a9f476f0a1f40e80e16de622acd4a9i0"}}}