{"name":"Kazoku INU","id":"kazoku-inu","symbol":"kazoku","description":"Kazoku intends to be the next meme coin of the year. Having behind one of the most exeprienced and transparent team on BSC (with utility projects hitting over 4 millions MC) and well known influencers, Kazoku INU is prepared to strike on Binance Smart Chain. The team is very experienced and completely transparent with the community about the project’s income and decisions. The name of Kazoku is also very powerful. It indicates the noble class that existed in modern Japan from 1869 to 1947. Kazoku was formed by Kuge kazoku that originated in kuge (court nobles), Daimyio kazoku (that originated in the lords of the domains in the Edo period, Shin kazoku who were raised to the kazoku class due to their distinguished contributions to the nation and Koshin kazoku who descended from the class of the Imperial family to the class of the subjects. Another meaning of Kazoku in Japanese is \"family\" with reference to the strong community behind the project. Kazoku INU intends to develop several utilities on the way. A swap that will compete with the biggest platform that are already live such as Pancakeswap, Uniswap and others, having as goal to breake barrier of the crypto world for newbies and newcomers. Beside the swap platform the team is also developing a staking functionality which will have unique, sustainable APIs that no other platform offers. They will also release an NFT collection that will offer investors some premium functionalities on the swap platform while offering you the opportunity to stake with 10-70% more rewards than the standard stake. About taxes, Kazoku INU has 8% procents for buys and sells, 1% going to liquidity and 7% to marketing","links":"https://kazokuinu.net","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kazoku-inu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x594d541ab4767ad608e457f310045740b5cc6071"}}}