{"name":"Cycle Network","id":"cycle-2_ethereum","symbol":"cyc","description":"Cycle Network is a foundational infrastructure protocol that provides a settlement layer for digital assets and decentralized applications (dApps). Incubated by YZi Labs and backed by institutional investors including Vertex Ventures, a sub-fund of Temasek Holdings, Cycle is designed to unify asset flows and application logic across blockchain environments. The core goal of Cycle is to solve a growing problem in decentralized finance: while applications and assets are distributed across multiple chains, there is no shared foundation for ensuring state consistency, settlement finality, or unified user experience. Cycle addresses this gap by introducing a verifiable settlement infrastructure, where assets and application state can move and resolve securely under a common framework. Cycle uses a cryptographic mechanism called Verifiable State Aggregation (VSA) to verify the validity of actions and balances across environments, without requiring users or developers to rely on token bridges or duplicated deployments. Through its core primitives — Rollin and Rollout — Cycle enables applications to onboard user assets and settle them across supported chains with a single interface, removing the need for users to switch networks, hold multiple tokens, or manage gas on multiple chains. For developers, Cycle provides an SDK that abstracts away the complexities of building in a fragmented blockchain landscape. Projects can integrate Cycle to gain access to unified liquidity and composable infrastructure, without redeploying smart contracts or managing fragmented user states. For users, Cycle simplifies the way they interact with digital assets. Whether making a payment, investing in DeFi, or interacting with tokenized real-world assets (RWA), users can transact in their native token — such as USDC — and let Cycle handle the logic of execution and settlement in the background. Cycle has already been integrated by live applications such as Golden Goose, a gamified DeFi platform that allows users to deploy yield strategies without needing to manage different chains or protocols. The native token of Cycle, $CYC, serves as the utility and governance asset of the protocol. It is used for validating settlement transactions, incentivizing network participation, and enabling long-term sustainability through protocol-driven economics. By building a modular, verifiable, and user-centric infrastructure layer, Cycle aims to power the next generation of Web3 applications — where execution is seamless, liquidity is abstracted, and settlement is trusted.","links":"https://www.cyclenetwork.io","market_cap":1644042,"market_cap_rank":3163,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cycle-2_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5845684b49aef79a5c0f887f50401c247dca7ac6","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x5845684b49aef79a5c0f887f50401c247dca7ac6"}},"is_native":false}