{"name":"Ravencoin","id":"ravencoin","symbol":"rvn","description":"Ravencoin is a blockchain specifically dedicated to the creation and peer-to-peer transfer of assets. Just as <a href=\"https://www.coingecko.com/en/coins/monero\">Monero</a> is solely focused on privacy, Ravencoin specializes in asset transfer – nothing more, nothing less. Although you can exchange assets over other blockchains, like <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> and <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a>, that’s not their intended purpose. And the lack of specialization leads to problems that are specific to transferring assets. Ravencoin enables you to create and trade any real-world (e.g., gold bars, land deeds) or digital (e.g., gaming items, software licenses) assets on a network with only that in mind. Ravencoin doesn’t have an established team. It’s an open-source project led by the core developers: RavoncoinDev, Tron, and Chatturga (discord usernames). Bruce Fenton, Board Member of The Bitcoin Foundation, advises the team. The core developers launched Ravencoin on January 3rd, 2018 and Fenton kicked off the launch with a Tweet announcing the start of mining. The project gained some notoriety when Overstock CEO Patrick Byrne announced that his company had made a multi-million dollar investment into the team. Since then, the team has been building out the core functionality of asset support and rewards capabilities. The release of the Ravencoin mainnet and increase in activity on the platform should help the price. Any news of notable companies or financial institutions utilizing the platform should also have a positive effect. Ravencoin offers just one thing: tokenized asset transfer. And that singular focus isn’t a bad thing. When projects attempt to solve a bunch of problems at once, they often create a bunch of half-baked solutions. Ravencoin is avoiding that. As a young project with seemingly endless competition, it’s difficult to predict how successful Ravencoin will be. An active community and backing from one of the most respected names in online retail are positive indicators, though. There’s a clear trend toward the tokenization of all types of assets. However, we have yet to see whether or not Ravencoin will be leading that change.","links":"https://ravencoin.org/","market_cap":416187480,"market_cap_rank":253,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ravencoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}