{"name":"Perpy Finance","id":"perpy-finance","symbol":"pry","description":"What is the project about? Perpy is a fully on-chain protocol allowing access to social trading on decentralized perpetual exchanges What makes your project unique? Our copy trading solution is built on top of GMX via a set of smart contracts. As an Investor, Perpy allows you to copy the most successful traders and as a Trader, Perpy allows you to monetize your trading skills by getting a performance fee from your investors. Perpy offers full transparency on the traders performance as well as how the strategies are structured and operated. Moreover, the architecture of our smart contracts ensures that your assets are safe and secure, your money goes where you want it to, whenever you want it. Differentiators from our only competitors STFX: ✅ Persistent vaults (No need to re-enter a vault after a trade, you can enjoy the ride with your trader as long as you wish) ✅ Customizable performance fees for traders (adapt your fee to market conditions, your reputation, …) ✅ No fundraising period (create your vault in a few clicks, start trading and attract investors' money) ✅ No funds lockup (get in or out when you want) ✅ Strategy privacy (no trade disclosure in advance) ✅ Seamless trading engine, best-in-class UI History of your project. June 2022 start of work on smart contracts Beta live on November 2022 Successfull Public sale on march 2023 What’s next for your project? Integration of major partner perp dex like gains (gtrade), Level Finance add vault on forex, stocks, commodities Lens integration for social aspect Dao treasury tools management on perpetual What can your token be used for? $PRY is the native token of Perpy, it has a hard capped supply of 1 billion units and has deflationary properties over time. $PRY is designed as a 100% Real Yield token that serves many key functions within Perpy. Real Yields, Fee rebates, Lens interaction, Gouvernance, Vault advertising,","links":"https://www.perpy.finance/","market_cap":890119,"market_cap_rank":4043,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/perpy-finance/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x1824a51c106efc27d35a74efb56d9bf54ddb22d4"}}}