{"name":"PICASSO","id":"picasso","symbol":"pica","description":"PICA Price Live Data Composable Finance aspires to build an entire ecosystem around the Composable and Picasso parachains. Built on the Kusama network, the Picasso Parachain offers enhanced interoperability, customisation, and security over traditional blockchain structures. By leveraging parachain technology, we do not have to recruit our validators for security, which gives us more excellent finality guarantees and lowers the risk of cross-chain transaction failures. Picasso aims to supply dApp developers with all the necessary tools to build seamless interoperable financial applications as pallets on our chain, with decentralised, stake-based governance. We’re facilitating an entire ecosystem from the ground up, onboarding pallets that help to create the building blocks required for DeFi primitive, core, and application functionalities to thrive. Our initial pallets deployed on Picasso are Apollo, the very first MEV-resistant oracle pallet in the Kusama ecosystem and Cubic, the first-ever vaults pallet on Kusama. angular…bribe…whirlpool… Pallets in our expansive Picasso environment will have the chance to mature and thrive. Over time, the most promising pallets will have the opportunity to graduate onto our Polkadot parachain upon its launch. This graduation process will be approved by the Picasso token (PICA) holders who ensure actions are taken in the best interest of our ecosystem. Moving assets intra-ecosystem is becoming more intuitive. Composable is on a mission to unlock the interconnected ecosystem of blockchains via a cross-chain, cross-layer networking fabric. In the future, both developers and users can interface with multiple ecosystems in a user-friendly, scalable, provable, and decentralised manner.","links":"https://www.composable.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/picasso/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}