{"name":"Global Dollar","id":"global-dollar","symbol":"usdg","description":"Global Dollar (USDG) is a single currency stablecoin pegged to the US dollar that is regulated under the Monetary Authority of Singapore (MAS). USDG is issued by Paxos Digital Singapore (PDS) and will always be fully redeemable from Paxos on a one- to-one basis for US dollars. USDG combines the stability and reach of US dollars with the added security and efficiency of blockchain technology. USDG is always available and accessible, offering high transfer speeds and programmability. USDG is always available for 1:1 redemption for US dollars, 24/7. Paxos Digital Singapore Pte. Ltd. (PDS), the issuer of USDG, has secured full approval from the Monetary Authority of Singapore (MAS) as a Major Payments Institution (MPI) to offer digital payment token services. This approval aligns USDG with MAS' forthcoming stablecoin framework, positioning it at the forefront of regulatory compliance. MAS, a globally recognized prudential regulator, is known for its robust oversight of stablecoins and commitment to stringent consumer protection standards. USDG's issuance will adhere to strict regulatory standards, including requirements for value stability, capital adequacy, redemption and par and comprehensive disclosure. Specific regulatory obligations include substantial capital reserve requirements, frequent regulatory examinations, monthly independent attestations of reserve assets, monitoring of operating procedures and annual audits of reserve assets. It also provides protection from bankruptcy by holding stablecoin reserve assets in segregated accounts held on trust by PDS for the benefit of USDG holders. USDG represents the pinnacle of regulated stablecoins, offering unparalleled stability, security and compliance in the rapidly evolving world of digital finance.","links":"https://globaldollar.com","market_cap":29228682,"market_cap_rank":1149,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/global-dollar/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}