{"name":"Generaitiv","id":"generaitiv","symbol":"gai","description":"Generaitiv is a community-driven Artificial Intelligence (AI) platform built to empower AI contributors. With community built open source AI Models, users can generate AI visual art and list it as an NFT in seconds. The problem with current AI generative platforms is a credit system paid in fiat. Typically those credits are locked into a single ecosystem without interoperability. $GAI is a utility token to power the platform, and exchange for compute time. Stakers on the network will be compensated to validate compute tasks. Alternative Open Source AI projects do not properly compensate AI model creators. The AI models that are available are community built, and an entire ecosystem has been built around incentivizing an open and free AI. Royalties on AI visual art sales will be paid out immediately, and a portion of fees on sales will be sent to the original AI model creators. The value chain of a traditional NFT marketplace is Collector -> Artist, with Generaitiv the ecosystem will compensate Collector > Artist > AI Model Creator. Both Technical Founders have an extensive background in AI, 2014 launched a physical autonomous robot which included a chatbot which received nationwide attention, and computer vision / AI in production use around the world in enterprise applications. Both founders have also provided development services in the web3 space from DeFi to NFT platforms. Generaitiv was launched February 14th, 2023 as a vision to ensure that AI remains open source, and not behind controlled centralized, walled gardens owned by large corporations. Our platform went live as of February 21st, 2023 Generaitiv is developing a decentralized protocol, and crowd sourced network of AI compute requests. Additional platform support of synthetic media, videos, chat, music generation is also planned.","links":"https://generaitiv.xyz/","market_cap":289536,"market_cap_rank":5127,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/generaitiv/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0d8ca4b20b115d4da5c13dc45dd582a5de3e78bf"}}}