{"name":"Harbor Protocol","id":"harbor-2","symbol":"harbor","description":"\"What is the project about? Harbor protocol is the dApp on the Comdex chain (powered by the Cosmos SDK and CosmWasm smart contracts) that enables safelisted assets to be locked in Vaults and mint Composite - CMST stablecoin. HARBOR token is the governance and recapitalization token for Composite - $CMST stablecoin. HARBOR and CMST have a similar relationship as MKR and DAI tokens. More details: https://docs.harborprotocol.one/harbor-protocol What makes your project unique? Harbor Protocol enables minting of stablecoin CMST with a wide range of interchain assets by opening CDPs. HARBOR tokenomics is unique and inspired by Andre Conje ve(3,3) model. Tokenomics blog: https://blog.comdex.one/understanding-harbor-tokenomics-bf092eb50285 History of your project. Harbor protocol was launched in Dec 2022 and now has around 1 million TVL locked with multiple assets including DAI, USDC, ATOM, WETH, WBTC and more. HARBOR tokens was airdropped to over 20+ chains. What’s next for your project? Next in Harbor protocol there will Liquity styled vaults which will enable minting of stable coins at lower collateral ratios of 110% which will improve the capital efficiency of the users. What can your token be used for? HARBOR tokens are used for; 1. Governance of the Harbor protocol which sets CR ration, Drawdown fees etc for different vaults. 2. Recapitalisation, the HARBOR tokens are used to maintain the CMST peg under specific market conditions. 3. Rewards, HARBOR tokens are given to veharbor stakers and to vault owners as emissions. They are also used to incentivise CMST pools on various DEXs.\"","links":"https://harborprotocol.one/home","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/harbor-2/logo.png","detail_platform":{"cosmos":{"decimal_place":6,"contract_address":"ibc/BAEA8E5E532DD3442D8938DA6E3C456EEE52CFD2CCC1B3512B0A77E7BEDB2F45"}}}