{"name":"PUMLx","id":"pumlx","symbol":"pumlx","description":"PUMLX Price Live Data PUMLx is the Move to Earn, Fitness and Wellness token from PUML Better Health. After successfully launching Move to Earn for Corporates in 2021 and signing major Corporates such as Deloitte SEA, LVMH, Singapore/Malaysia, Western Union and many more, we were able to generate strong revenue and growth. We are now expanding our Web3 tech into retail Move to Earn with Athlete and wearable NFTs using PUMLx. Our vision is to gamify healthy behaviours via our virtual challenges and reward communities through gamification of both physical and mental health challenges like step, meditation, sleep and more. Encompassing both Move to Earn and Move to Own mechanism we have produced the world's first Movement Finance platform. We have a two token model with a game token PUML and utility/governance token called PUMLx. The game token PUML is burnt for PUMLx. PUMLx has unique tokenomics around earning, owning, staking and burning. Athlete NFTs and our very own PUMLWear (Wearable watch NFTS) are used as challenge entry and multipliers within the solo game experience to reward our users on a daily basis for adopting healthy habits. Corporates, Athletes, Brands and game developers act as Nodes within the ecosystem and are required to buy PUMLx and stake it to get access to our API and Challenge platform. Nodes can then reward their community for participation in healthy actions within the gameplay throughout their games, platforms or metaverses. Our sophisticated platform allows developers to use our API to instantly reward in-game movement based on wearable technology such as Fitbit, Garmin, Samsung and Apple Watch. By providing a challenge platform and an openAPI, Corporates, Brands and Metaverse developers can participate in our ecosystem and improve engagement and earning capabilities for their communities. Improving their health and wealth with PUMLx.","links":"https://pumlx.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pumlx/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8c088775e4139af116ac1fa6f281bbf71e8c1c73"}}}