{"name":"Antspace","id":"antspace","symbol":"ant","description":"What is the project about? In the world of the internet, each of us is as tiny as an ant, with weak individual strength and small stature, and we are never taken seriously in the crypto world. However, web3 users span the globe, and while the power of a single ant is weak and its voice goes unheard, our collective strength is invincible. We may be ordinary, but we can still create miracles. What makes your project unique? $ANT token community is brought together by a shared love of memes, promoting community communication and interaction through digital newsletters or exclusive Discord groups. $ANT will continue to increase its utility, such as by collaborating with other platforms or projects to expand the token's use cases, or by launching merchandise or services related to the token. History of your project. $ANT Coin is poised to redefine digital assets, with each $ANT representing a symbol of power. With its no pre-sale policy, automatic liquidity addition, transaction burn, and permanent renunciation of $ANT privileges after launch, $ANT belongs to everyone and owning $ANT means owning the future What’s next for your project? Phase 1--Public Offering Stage Launch SANT and holda public offering at thesame time.Reach an initial holdingof 5,000 addresses. Phase 2--Infrastructure Building List SANT on CoinGecko and Coinmarketcap.Obtain over 20,000 holdersUse our unique MEME power to make SANTpopular on Twitter. Phase 3--Community Building Collaborate with the community and release theAnt Times digital newsletter. Establish a TokenGated Discord group, Ant Palace, open only toholders, more details coming soon.List on major centralized exchanges,obtain over 50,000 holders. ........... What can your token be used for? As $ANT gains more attention and recognition from users, it will be adopted by more people, leading to the creation of more products and services on top of it, thereby increasing the token's usage and demand.","links":"https://antspace.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/antspace/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":9,"contract_address":"0x4406509b532b111bd39b5b579561001cbf0d7acf"}}}