{"name":"COLLIE INU","id":"collie-inu","symbol":"collie","description":"The most intelligent and smartest dog in the world. Collie Inu is loyal and protective. He loves to work, defend his family and please both owners and holders. His mission is to provide a safe place for the Investor community by protecting their bags with additional security measures. Collie Inu aims to be the most known and most used cryptocurrency in the world. Collie Inu is run by dedicated and experienced team members, we have multiple utilities and a well-planned long-term roadmap. You can check our information via https://github.com/CollieInuToken. Cyberscop has audited our smart contract, you can check it via: https://github.com/cyberscope-io/audits/blob/main/collie/audit.pdf Also, you may check our 💳 KYC Certificate https://github.com/coinscope-co/kyc/blob/main/collie/kyc.png For the whitepaper, you may find it via https://collieinu.net/files/CollieInuWhitepaper.pdf Token liquidity is locked on GemPad for 1 year. https://gempad.app/presale-liquidity-lock-detail/0x27b95D612cB4910C611A8F4B6e04ef389ba412ec Team Tokens Vested for 6 months, you may check the dates via: https://gempad.app/presale/0x27b95D612cB4910C611A8F4B6e04ef389ba412ec?chainId=56 We have 3 staking pools: 7, 15, and 30 days lock. 100%, 125%, and 200% APY https://www.collieinu.app/stake We burned around 19% of the total supply. https://bscscan.com/token/0x31491c35c094a0336f4859dd94ab9466709dec45?a=0x000000000000000000000000000000000000dead The Dead wallet will receive tokens automatically from each buy/sell, It will be burned inside LP Holder forever. Thus, coins are burned with each on-chain transaction. We are going to develop a 3d NFT and NFT staking in phase 3/4. Our mini-game is under development. Total Supply 1,000,000,000,000 10% Total buy/sell as the following: 2% Development 3% Liquidity 5% Marketing","links":"https://collieinu.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/collie-inu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x31491c35c094a0336f4859dd94ab9466709dec45"}}}