{"name":"Zillion Aakar XO","id":"zillion-aakar-xo_binance-smart-chain","symbol":"zillionxo","description":"ZILLIONXO is a simple utility token created with an existence on Binance Smart Chain. As the name suggests, this token encompasses the entire crypto universe in one circle. It can be used to transact directly among the users. It is available on DEX and CEX platforms. The primary function being paying for different kinds of transactions flawlessly. ZILLIONXO is not restricted to any particular domain, it can be utilised for all sorts of online payments ZILLIONXO aim is to be a community governed decentralised platform that eliminates third-party platforms charges such as Software as a service, transactional platforms, and high fee payment gateways. 1. ZILLIONXO will enable direct real-time peer-to-peer business and consumer connectivity, service delivery, and low fee stable currency and Cryptocurrency payment processing at a fraction of a cost. 2. It will enable free cross-chain asset transfer for retail payments and rewards. 3. ZILLIONXO is all in one decentralised platform will enable small retailers to create free online stores with one click and connect with consumers in real-time without needing the third-party platform. The platform will enable real-time business payment settlement. The platform will charge a fixed transaction fee of 0.57%, whereas token holder will only pay 0.47%. 4. ZILLIONXO will be the blockchain for e-commerce and point of sale transactions. 5. ZILLIONXO Mobile application will be integrated with stable currency infrastrcuture to process low fee payments.","links":"https://www.zillionxo.io/","market_cap":32267,"market_cap_rank":8891,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zillion-aakar-xo_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x9a2478c4036548864d96a97fbf93f6a3341fedac","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9a2478c4036548864d96a97fbf93f6a3341fedac"}},"is_native":false}