{"name":"PIVX","id":"pivx","symbol":"pivx","description":"PIVX, a cutting edge User Data Protection oriented blockchain project and cryptocurrency, announced on November 25th 2015 and fair-launched on January 30th 2016. Upon its launch (based on the quark Proof of Work algorithm), it had no ICO, no instamine or perpetual developer premine. PIVX switched to a Proof of Stake algorithm on August 17th 2016 and has pioneered Proof of Stake as well as User Data Protection protocols ever since. Its user data protection comes through SHIELD, which is a highly customized anonymity protocol based on zk-SNARKs Sapling integrated into Proof of Stake. PIVX is a decentralized, open-source blockchain/cryptocurrency project managed, developed, governed and stewarded by a community-driven decentralized autonomous organization (DAO). It is a Proof-of-Stake (PoS) protocol using its own custom-developed PoS consensus engine with a native cryptocurrency, denominated as “PIV”. PIVX integrates other features including a 2nd layer of functionality through a Masternode network that provides a decentralized governance mechanism of voting; and is currently developing new features for this layer such as the Deterministic Masternode Lists, Long Living Masternode Quorums (LLMQs) and more, as well as including the addition of the anonymity protocol zk-SNARKs Sapling to all transactions and staking – all of these heavily customized. PIVX’s coin-supply occurs as a direct result of a static/fixed block emission rate plus any monthly budget allocation payouts. PIVX also has a dynamically calibrated coin-supply restrained by the burning of all transaction fees. PIVX is an independent, application and payment agnostic blockchain. It uses its native cryptocurrency (PIV) as both a means of user data preservation, near-instant digital currency exchange as well as the reward for those who help secure, build, decentralize, and govern the PIVX network protocol. PIV is purchased and/or obtained to be held or staked (hot or cold) or locked in masternodes by individuals who want to participate in the network.","links":"https://www.pivx.org/","market_cap":29946867,"market_cap_rank":1206,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pivx/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}