{"name":"DIAMOND TOKEN 💎","id":"diamond-token-2_binance-smart-chain","symbol":"dit","description":"Diamond Token (DIT) – Utility & Governance of DIORA Diamond Token (DIT) is the beating heart of the DIORA ecosystem. Unlike speculative projects, DIT has a clear and tangible foundation: every token is backed by certified diamond jewelry, securing a minimum redemption value in the Diamond Club store. DIT functions as a utility token with multiple layers of use: • Redemption Utility – DIT can be redeemed for luxury diamond jewelry through Diamond Club, creating a direct bridge between blockchain and real-world assets. • Ecosystem Utility – DIT powers staking, tipping, NFT memberships, and exclusive rewards within DIORA. • Governance Utility – DIT holders participate in governance decisions of DIORA through Diamond Club, ensuring a decentralized and member-driven structure. About DIORA DIORA is a new era of Web3 social networking — a decentralized hub where identity, reputation, and ownership are tied to blockchain. Unlike Web2 platforms, DIORA rewards engagement with Presence Points, NFT tiers, and token incentives, all while protecting user privacy and ensuring true ownership of content. At its core, DIORA is: • A social hub built on blockchain, replacing likes and follows with real value. • A membership-based ecosystem, governed by Diamond Club and fueled by Diamond Token. • A bridge between digital and physical worlds, integrating luxury products, travel experiences, and lifestyle perks with Web3 technology. Summary Diamond Token (DIT) isn’t just another token — it’s a utility voucher, a governance right, and a gateway to real-world value. As the core currency of DIORA, it combines the timeless value of diamonds with the cutting-edge opportunities of decentralized social technology.","links":"https://www.diamond-club.io","market_cap":14315838,"market_cap_rank":1303,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/diamond-token-2_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbfa362937bfd11ec22a023abf83b6df4e5e303d4","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xbfa362937bfd11ec22a023abf83b6df4e5e303d4"}},"is_native":false}