{"name":"delta.theta","id":"delta-theta","symbol":"dlta","description":"Delta.theta (DLTA) is a peer-to-peer asset option trading platform. Currently, the solution is implemented on the following blockchains: Binance Smart Chain and Ethereum. The platform architecture, as part of the implementation on the Binance Smart Chain blockchain and Ethereum, supports the following functionality: ● Unlimited expirations ● Pairing of any coins for the corresponding blockchain ● American-style options (execute at any time prior to expiration date) ● Limit and market orders. Limit order - user chooses the parameters (price, term). Market order - the user buys/sells what is available in the trading terminal. ● 2-level system of commissions. Maker fee - if the user adds liquidity to the order book (puts an order not at the current market), a reduced commission is applied to it. Taker fee - if the user removes liquidity from the order book (takes out the current orders), the standard commission is applied to him. ● Sellers of options pledge 100% of the collateral, thus the failure of the contract is not possible. ● Option sellers can participate in the Liquidity Incentivize Program. Their placed orders can be forwarded to protocols like Venus/Compound, where option sellers can earn extra money. delta.theta is a simple, clear and functional product for \"farmers\". By using delta.theta LITE, in 3 clicks any farmer can qualitatively increase his APY by choosing a simple ready-made risk management scheme. Our product solves two major pains of \"farmers\": 1. First, through delta.theta, farmers buy protection during the farming period. The farmer invests in stablecoins and \"strong\" coins (ETH, e.t.c.), and the output is a coin that is subject to a significant drop. Thus, the farmer needs to get protection from the dump of the token that is being farmed. 2. Efficient capital management. Today's farmers in search of APY growth use quite a wide range of products, from simple farming to flashloans solutions. Options allow them to participate with less capital leverage. We started out with a simple one - by allowing farmers to sell options. You sell an option - and you make money. The farmer has an opportunity to make money on his desire to use his own capital more efficiently. Example: A farmer wants to sell a coin at a higher price and comes to delta.theta, he uses the Sell High option and places a limit order through the delta.theta LITE app and the magic begins: a. first, his order can go into LIP (disabling feature) - this means that his order is deposited on the Venus protocol and the farmer is paid the appropriate APY b. Secondly, if the buyer bought the farmer's option, he paid him a premium. But the option may not be executed. So, the farmer has already earned in 2 places just on his desire to be efficient.","links":"https://deltatheta.tech/","market_cap":445831,"market_cap_rank":3203,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/delta-theta/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0000000de40dfa9b17854cbc7869d80f9f98d823"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x3a06212763caf64bf101daa4b0cebb0cd393fa1a"}}}