{"name":"PulseCrypt","id":"pulsecrypt","symbol":"plscx","description":"PulseCrypt is a a premier locker solution for the Pulse Chain. PLSCX is the ERC20 token behind PulseCrypt, which can be used as a payment method to lock liquidity using the PulseCrypt locker on PulseChain. Why use PulseCrypt? Locking liquidity can prevent malicious actors from manipulating the price of a token. When liquidity is locked, it shows a commitment by the token issuer to the project and can boost investor confidence in the token's long-term potential Locked liquidity protects token holders by preventing sudden price drops that could lead to losses. It also ensures that there is always liquidity available for buyers and sellers How to use PulseCrypt? Step 1 - Choose a Network Enter our Dapp. Pulse Chain is already selected by default. Step 2 - Choosing an Exchange and Connecting your Wallet After selecting a network, you'll see a list of exchanges available (new exchanges will keep being added in the future) Select the exchange of the token whose liquidity you want to lock, and you'll be asked to connect your wallet. Pulsecrypt works better with Metamask wallets. Step 3 - Paste your Token's Address At this stage, you will only need to paste the contract address of your token. If you are in the correct network, you will see the name of your token. Step 4 - Settings You will see a screen to choose the right settings for your lock. Token amount: Refers to the amount of Liquidity Tokens you want to lock Unlock date: The Liquidity Tokens will be locked until a specific date. Note that you will not be able to withdraw them before the chosen date under any circumstance Lock ownership: You can also transfer the lock ownership to another wallet. That wallet will be able to withdraw the tokens after the unlock date is reached. Fee options: Pulsecrypt holders do not have to pay extra lock fees Step 5 - Confirm transaction You did it! All you need to now is sign the transaction using your wallet.","links":"https://pulsecrypt.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pulsecrypt/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6cd079f296c10eb84a64239b893d4edfa2e1d779"}}}