{"name":"ShoeFy","id":"shoefy","symbol":"shoe","description":"ShoeFy is an innovative decentralized platform that combines Non-Fungible Tokens (NFT) and Fungible Tokens (FT). It is a futuristic NFT project that utilizes cutting-edge DeFi tools to maximize returns. ShoeFy can amplify the NFTs potential by including both farming and staking to generate passive income. ShoeFy will have two tokens namely, $SHOE(ERC-20), the native Fungible Token and sNFTs (ERC-721) which are randomly generated on-chain. Each NFT is an algorithmically programmed unique digital shoe on the platform. Shoebeasts (Shoe collectors) can flex their new digital sneakers on Snapchat and other apps. ShoeFy provides special shoe racks for your digital kicks, and when you (the shoebeast) stake them on the platform, you can earn passive income in the form of $Shoe tokens. The project is led by a team of experienced blockchain venture capitalists, creative NFT developers, and top-tier marketing experts spanning from Europe to Canada and onto South Korea & Thailand in SE Asia. ShoeFy has a long-term vision to innovate and evolve over time. ShoeFy will tap into the different ecosystems of Gaming, Collectibles, and establish a presence in the metaverse, with digital kicks that are unique. Later this will lead to expansion to different other merchandise, partnering with reputable fashion brands. ShoeFy is about to drop the most exhilarating collection of digital kicks on the market, be ready to cop or mint when the announcement comes. NFT and DeFi markets are launching into the sky of the limitless future digital world, and we have just the shoes you need for this journey.","links":"https://www.shoefy.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shoefy/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0fd67b4ceb9b607ef206904ec73459c4880132c9"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc0f42b31d154234a0a3ebe7ec52c662101c1d9bc"}}}