{"name":"Gamepass","id":"gamepass","symbol":"gpn","description":"Gamepass Network is a decentralized and interactive platform for gamers that aims to solve common problems and limitations in the gaming industry. Launched on May 1st, 2023 by an anonymous team, Gamepass Network uses blockchain technology to allow gamers to communicate with each other, earn rewards by playing popular games, and buy and sell game-related assets and items in a secure and transparent marketplace. The platform uses its own cryptocurrency called GPN coin and has a unique reward reducing algorithm that reduces the block reward by 1% each month. This ensures that the supply of GPN coins remains stable and predictable over time. Gamepass Network has a roadmap outlining its plans and goals for future development. The roadmap is divided into four stages: Launch, Development, Growth, and Evolution. During these stages, the platform will focus on integrating with popular games, improving network security and performance, developing a marketplace for game-related assets and items, expanding its user base, and developing partnerships with game developers and publishers. One of the key features of Gamepass Network is its game rewards system. Gamers can earn GPN coins by playing popular games on the platform. The rewards are based on the performance and stats of players in each game and are calculated by a separate system that uses official publicly available APIs provided by game developers. In addition to game rewards, Gamepass Network also plans to develop a marketplace where players can buy and sell game-related assets and items such as accounts, skins, etc. The marketplace will support collateral and escrow mechanisms to ensure compliance and prevent cheating. Gamepass Network also aims to support many games and platforms that can be integrated into its network via an API or SDK. This will allow game developers and publishers to enhance their games with cryptocurrency technology and attract more users.","links":"https://gamepass.network","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gamepass/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}