{"name":"LilAI","id":"lilai","symbol":"lilai","description":"What is the project about? LilAI is on a mission to revolutionize community management by leveraging the power of artificial intelligence. Our vision is to create a future where managing communities is seamless and communities thrive, powered by the cutting-edge technology of LilAI. We believe that the collective imagination, energy, and passion of our users will fuel this revolution. What makes your project unique? LilAI will deliver an intuitive, efficient, and effective solution for Telegram and Discord that will help communities thrive. Our platform will offer several key features, including: Answering questions about the project and roadmap based on machine learning Ensuring compliance with community guidelines Tracking positive contributions from community members for possible future rewards Allowing for admin-controlled tone calibration (e.g. hype, enthusiasm, sarcasm) Combating FUD (Fear, Uncertainty, and Doubt) Using daily/monthly analysis to generate visual memes for the community to share Making suggestions for community-led marketing campaigns What’s next for your project? Any start up in crypto knows that the community becomes the heart and core of the project. Hiring multiple community managers with experience to cover all time zones can become an expensive quest. Beside cryptocurrencies projects, LilAI aim to find its utility in any business which requires community management. What can your token be used for? Every community that utilizes LilAI must market-purchase $lilAI at market value, with the quantity dependent on the community size. This will be locked for the duration of their contract. In addition, the project must give the LilAI Treasury $5000 of their native token. If the token doubles in value while in the custody of LilAI, $5000 will be sold to market-buy $LilAI and locked in the project Treasury. This will continue every iterative 2x of the token value.","links":"https://lilai.co","market_cap":2231064,"market_cap_rank":3099,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lilai/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x655a6beebf2361a19549a99486ff65f709bd2646"},"ethereum":{"decimal_place":18,"contract_address":"0x85cf7f10683c73359e7b06c082eef5851ff2956d"}}}