{"name":"Solidus Ai Tech","id":"solidus-aitech","symbol":"aitech","description":"AITECH - The worlds first deflationary artificial intelligence utility token Solidus has successfully constructed an environmentally conscious, state-of-the-art High-Performance Computing (HPC) Data Centre spanning over 8,000 square feet. This facility is strategically situated in a highly secure European location. In conjunction with this remarkable achievement, Solidus is poised to unveil the world's pioneering deflationary Artificial Intelligence token, known as AITECH. This token will serve as a payment gateway for licensing Artificial Intelligence as a Service (AIaaS), Blockchain as a Service (BaaS), and accessing HPC resources via their Infrastructure as a Service (IaaS) platform. Furthermore, Solidus intends to establish an exclusive marketplace catering to software developers, enabling them to launch Artificial Intelligence software applications for end-users to license. Through this innovative initiative, developers will partake in a profit-sharing model, thereby gaining substantial benefits. AITECH, as the core token fueling the Solidus AI Tech ecosystem, presents a comprehensive solution for procuring all services available on the platform. In addition to facilitating token payments, Solidus offers the convenience of accepting traditional payment methods. The conversion of fiat currency transactions to AITECH occurs seamlessly on the backend, with the entire process conducted on the Blockchain utilizing AITECH tokens. As an integral component of our deflationary token economy, a percentage ranging from 5% to 10% of AITECH tokens utilized for acquiring services on the platform will be systematically burned. This meticulous process ensures the utmost transparency, as the precise number of tokens subjected to burning can be readily monitored through our comprehensive dashboard.","links":"https://aitech.io","market_cap":104938451,"market_cap_rank":457,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solidus-aitech/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x2d060ef4d6bf7f9e5edde373ab735513c0e4f944"}}}