{"name":"fanC","id":"fanc_ethereum","symbol":"fanc","description":"fanC integrates Web2 and Web3 technologies, connecting creators, users, and social platforms to enable content ownership and user participation in platform operations for profit-sharing. It aims to foster a new era of social AI platforms through participant interconnection, creator rights protection, and user engagement. fanC offers CELEBe, a rewards platform, and fanC Wallet for point conversion and virtual asset management, supporting various blockchains and offline payments. CELEBe is a short-form rewards platform that recognizes the value of viewers by allowing them to earn rewards while watching content. It features a pioneering Watch to Earn (W2E) system, the first of its kind in South Korea, where viewers earn points for watching short-form videos. CELEBe also offers CELPICK, a voting game, and Shortply, a curation service to be launched soon, aiming to create a sustainable ecosystem for both viewers and creators. With over 7.5 million members and a significant rise in engagement (app retention increased from 5% to 20% in a year), CELEBe is committed to fostering a vibrant community. The platform also supports a Create to Earn (C2E) model, rewarding creators and allowing point exchanges through the fanC Wallet. CELEBe points earned from participating in CELEBe activities can be convertible to fanC tokens through the fanC Wallet. fanC Wallet is a virtual asset wallet developed by fanC, providing storage for virtual assets, point swapping, Dapp, and 3rd Party app connectivity. It supports various blockchains, including Ethereum and fanC Token, and can store fanC Point, CELEBe Point, and DAEMDAEM Point (Tmoney).","links":"https://www.fanc.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fanc_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbb126042235e6bd38b17744cb31a8bf4a206c045","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xbb126042235e6bd38b17744cb31a8bf4a206c045"}},"is_native":false}