{"name":"Permission Coin","id":"permission-coin_base","symbol":"ask","description":"“ASK” is the currency for permission. Its primary use case is to power a global digital ad system built on permissioned data and opt-in engagement. The project aims to offer an antidote to some of the most significant problems of Web 2.0 - surveillance capitalism, data exploitation and interruptive marketing - by enabling users to securely grant permission and monetize their data across the web, while providing an enterprise solution for marketers seeking better return on their ad spend. Global privacy regulations, ad blockers, and dramatic changes in ad tech are forcing a new advertising model based on consent. By enabling marketers to build opt-in audiences and ask permission for engagement, and by ensuring users are rewarded for the data they volunteer to share, Permission sees ASK as foundational to helping tech platforms and marketers compete in Web 3.0. Currently, users earn ASK by securely sharing their data and opting in to receive relevant ads and content. The experience is delivered primarily through declared data-sharing activities and engaging with video ads on Permission.io. Advertisers can also deploy ASK as an incentive mechanism on their own digital channels, driving loyalty and personalized ad campaigns. Additionally, the ability to earn and spend ASK via merchants on the Shopify platform is in the pipeline, with other major eCommerce platforms to follow. The project’s other goals include deeper development of its proprietary technology, “Data Algebra,” for which it has been awarded 9 patents. The breakthrough technology can liquify data currently stored in silos and applications, making it possible for individuals to aggregate and monetize their full data set and for companies to gain permissioned visibility over the most comprehensive data sets possible.","links":"https://permission.io/","market_cap":2654322,"market_cap_rank":2670,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/permission-coin/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xbb146326778227a8498b105a18f84e0987a684b4","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xbb146326778227a8498b105a18f84e0987a684b4"}},"is_native":false}