{"name":"BIBI","id":"bibi_binance-smart-chain","symbol":"bibi","description":"What is the project about? BIBI is a purely community-driven organization that was built by the BIBI leaders, BIBI builders, and BIBI holders. BIBI is not just about crypto, but more about one kind of meme culture which is represented by BIBIERS, a group of brave and positive WEB3 new immigrants. What makes your project unique? We believe in the ideology - Putting community before the product We believe in a key web3 concept: Don’t treat your community as your customer. Nowadays, the so-called founders used to fully develop and test the product before offering it to customers in most Web3 projects, but this methodology became obsolete in the Web3 space. BIBI created a different style by attracting early adopters, distributing ownership through BIBI tokens and retaining supporters until the final product development stage. History of your project. The issuance and distribution of bibi is a fair game. On the night of May 7th 2023, there were about 3,500 KOLs on Twitter Spc who witnessed the birth of BIBI. It was just an ordinary night where a group of KOLs were chatting casually that we have PEPE from the West, shall we have some cool meme coin from the East. One KOL volunteered to issue the token. And once the smart contract was issued, its permission was renounced, and LP tokens were burned. 96.54% of the tokens were sent to the liquidity pool, and the remaining 3.46% were sent to the blackhole. So bibi, a zero-tax token with no presale, was born. What’s next for your project? Global expansion What can your token be used for? BIBI is a \"social internet\" owned by BIBIERs, orchestrated with tokens as the link to uniting everyone. BIBI token (bibi),which started as a memecoin and a social experiment in decentralized spontaneous community building,is the main token of BIBI ecosystem. It brings the power of a decentralized, community-led currency to millions across the globe. bibi is a zero-tax token with no presale. Once the founder issued the smart contract, its permission was renounced, and LP tokens were burned. 96.54% of the tokens were sent to the liquidity pool, and the remaining 3.46% were sent to the blackhole. In the future, bibi will be accepted as a form of payment at hundreds of locations, either directly or through third-party intermediaries.","links":"https://bibibsc.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bibi_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xfe8bf5b8f5e4eb5f9bc2be16303f7dab8cf56aa8","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xfe8bf5b8f5e4eb5f9bc2be16303f7dab8cf56aa8"}},"is_native":false}