{"name":"Zephyr Protocol","id":"zephyr-protocol","symbol":"zeph","description":"What is the project about? Zephyr Protocol is an Over-Collateralized Private Stablecoin Protocol inspired by Djed Protocol on a native Monero based chain, inheriting all privacy features for all assets. Zephyr Protocol uses a three asset model: ZEPH, ZephUSD and ZephRSV. What makes your project unique? First Native Chain implementation of the Djed Protocol. First private Over-Collateralized stablecoin protocol History of your project. Launched on 29/05/2023 - Grassroots community - no VC funding What’s next for your project? Public Testnet for Djed implementation is soon. Q4 2023 mainent hardfork for Djed Implementation What can your token be used for? ZEPH is the Base coin which is used for the collateralization in the stablecoin protocol as well as minting ZephUSD and ZephRSV by adding the equivalent ZEPH value to the reserve. ZephUSD is a Private Stablecoin, backed by at least 400% equivalent value in ZEPH at time of minting. ZephRSV is the Reserve coin. Users are rewarded with ZephRSV when they add ZEPH to the reserve. ZephRSV coins act as shares of the reserves equity and the value of ZephRSV is formulaically calculated in protocol. Simplified, the value of ZephRSV is correlated to the reserve ratio, dropping when reserves are low and increasing when reserves are high. To avoid dilution for the ZephRSV holders, there is a maximum reserve ratio of 800% at which time no more ZephRSV can be minted. Reserve Provider Incentives Leveraged Position: as ZEPH's value increases the amount of ZEPH each ZephRSV is redeemable for increases. Collect Fees for Actions: When users mint or redeem ZephUSD, they incur a fee which is added to the reserve. Spot and MA Price Deviation: The value returned for performed actions is calculated by the worst price between the Spot and MA. This value discrepancy is added to the reserve. Block Reward: A portion of the block reward is added to the reserve directly which serves as a pseudo-staking reward mechanism","links":"https://www.zephyrprotocol.com/","market_cap":7364773,"market_cap_rank":1446,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zephyr-protocol/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}