{"name":"IOI Token","id":"ioi-token_ethereum","symbol":"ioi","description":"IOI Token is revolutionizing the gaming world by incorporating the latest in blockchain technology. This token is designed to enhance gaming experiences, offering players unique rewards and opportunities. Participants can earn IOI Tokens by engaging in various gaming activities, reaching milestones, and showcasing their skills. These tokens can be used within the gaming ecosystem for exclusive access to in-game items, unlocking new levels, or trading in the marketplace. Emphasizing the integration of NFTs, IOI Token allows gamers to acquire, trade, and collect unique digital assets. These NFTs represent rare and valuable in-game items, enriching the gaming experience with a sense of ownership and exclusivity. Initially focused on Trade Race Manager racing games, IOI Token has expanded its scope to include a broader range of casual games. These new offerings, developed using Unreal Engine 5, include engaging and entertaining mobile games. IOI Token also offers staking options with attractive APY. Through staking, users can earn returns on their investment, further motivating their participation in the gaming ecosystem and attracting more traders to the market. Moreover, IOI Token holders have the opportunity to play a role in its governance. Token holders can participate in DAO voting, allowing them to share their views and influence key decisions in the gaming world. This involvement not only lets them benefit from the token's value appreciation but also empowers them to shape the future of gaming.","links":"https://traderacemanager.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ioi-token/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x8b3870df408ff4d7c3a26df852d41034eda11d81","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x8b3870df408ff4d7c3a26df852d41034eda11d81"}},"is_native":false}