{"name":"Cigarette","id":"cigarette-token","symbol":"cig","description":"The Cigarette Token is a token issued by a part of the Cryptopunk community. Its goal is quite open yet and has to be determined by the whole PUNK community, but currently it is the token used in the social game of the $CIG webpage: There is a \"CEO of Cryptopunks\", and there can only be 1. His role is associated with a unique NFT on the Ethereum Blockchain, proving him to be the CEO, which changes from Ethereum address according to who is the new CEO. The way to become the new CEO is by paying the chosen amount X of $CIG presettled by the previous CEO. If this amount X is too low, then someone stealing his CEO position will be more likely. But if it were too high, then the tax that the CEO has to pay (0.1% of the amount X) would be too high and the deposit that the previous CEO had to put initially would run out faster. There is the game equilibrium. The \"CEO of Cryptopunks\" can write a Graffiti message in the web so that everybody can see it. They can also change the emission rate of $CIG by 20% each time, with a cooldown time of 2 epochs. It starts from 1000 $CIG emmitted per block, which is the maximum, and there is also a minimum emmision rate. The $CIG are emmitted to the LPers of the CIG-WETH pair in Sushiswap in a linearly proportional way, just as in any other liquidity mining program. It can also be considered a Christmas airdrop to the PUNK community, where each PUNK holder is gifted with 100k CIG per PUNK they hold. It is similar in spirit to the style of the $SOS token, but focused on the more specific PUNK community. Hopefully, the PUNK community revolves around it with time and may use it for a wider variety of purposes, like a more advanced game or a DAO. Due to the decentralized nature of the project, it is not possible yet to determine how will it evolve.","links":"https://cigtoken.eth.limo/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cigarette-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcb56b52316041a62b6b5d0583dce4a8ae7a3c629"}}}