{"name":"Spellfire","id":"spellfire_binance-smart-chain","symbol":"spellfire","description":"Spellfire is a unique Play-2-Earn collectible card game, proposing the first-ever hand-held NFT collection that can be placed in an actual drawer and generate passive income. Longing for realism, but being an NFT pioneer, Spellfire has moved time-tested concepts into the future to bridge the card fan generations together. Bringing nearly 30 years of history to the blockchain, whilst boasting an established community of avid and dedicated fans has led industry giants DAO Maker and Shima Capital to support the project as leading investors. Physical cards have a digital state, where some feature voice or gesture-empowered actions to create unique interactions for gamers avoiding age barriers, geo limits, and technology gaps. Spellfire’s interactive augmented reality cards are sure to create a unique feeling of immersion. Digital and physical cards are connected through a QR code printed on the back of each card, making them traceable, upgradable, and playable online and offline. The game connects three realities together - the Physical, the Digital and the Augmented reality. Ensuring that no one gets left behind, Spellfire is going multichain, making it one of the first to support multi chain NFTs. Imagine a “BSC vs Solana NFT battle” - it will be the new Spellfire’s reality. Limited edition NFT cards have been created to ensure that Spellfire’s community shares in the success of the game. Each card has been beautifully and uniquely illustrated and contains delicate artistic flourishes in addition to meticulous detailing. Every player is sure to find something to love. Original NFT cards are issued in playing card copies ranging from 1000 for legendary to 100,000 for common. Original NFT Card owners are eligible to earn up to 10x return on investment in passive income from the subsequent sales of cards, while also growing in value as a rare NFT. Unlike comparable NFTs on the market that offer little to no value to the long-term holder, Spellfire NFT cards allow the community to earn revenue through passive card ownership or active gameplay by earning Spellfire’s native $Spellfire token. The $Spellfire token is essential within the game’s ecosystem and offers owners various forms of utility. A total supply of 640,000,000 will be available with 128,000,000 reserved exclusively for distribution through in-game rewards and tournaments to ensure viable longevity for the game and its community. In addition to being Spellfire’s in-game currency for all forms of transactions, $Spellfire can also be staked, unlocking extra rewards for its holders.","links":"https://spellfire.com/","market_cap":28201,"market_cap_rank":9135,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spellfire/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd6f28f15a5cafc8d29556393c08177124b88de0d","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xd6f28f15a5cafc8d29556393c08177124b88de0d"}},"is_native":false}