{"name":"CoinGhost","id":"coinghost","symbol":"gst","description":"Although blockchain and digital assets are currently evaluated as core technologies of the 4th Industrial Revolution, there is not much space to obtain professional information, mainly through blockchain portals. Instead, existing socalled blockchain portals have many lowquality contents such as advertisements, fake news, in flammatory writings, and unverified facts. In addition, these days it is difficult to find a space where users vol untarily share professional information related to blockchain and digital assets. And it can be said that this kind of phenomenon is caused that because there is no adequate compensation system and feedback ac— cording to the contribution level such as information production and distribution Coinghost aims to be a more specialized blockchain portal by supplementing the problems of other blockchain platforms. Google, Naver, and Daum have grown into mega portal sites by providing a variety of services that users need, such as news, information search, and shopping, games and so many more. Coinghost also intends to grow into the largest portal in the blockchain industry with expertise by providing services that anyone may need and is interested in, such as news, user participation space, shopping, UGC and games. In an era where false information is spreading as the Internet is activated, Coinghost aims to provide accurate information based on articles of major media in the blockchain industry. Coinghost also aims to expand its service world wide, providing users multi language service. Coinghost will be providing a platform where users can interact with one another, share information. Moreover Coinghost implements a reward system that pays GST to users who have contributed to the creation and spread of useful content. The reward system is used to induce users to voluntarily participate in the process of generating excellent content and expand Coinghost's eco system. Many crypto users collect crypto currency, however it is a fact that tokens collected are not much used or even remotely usable. Considering such facts, Coinghost provides a variety of services and features that can actually use GST tokens. Users can use tokens for various purposes, including Cogo Bank, a staking service with high interest rates, and VOD payment for COGO TV, a streaming service specializ- ing in crypto content.","links":"https://coinghost.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coinghost/logo.png"}