{"name":"Bunni","id":"bunni","symbol":"bunni","description":"Bunni v2 helps LPs build yield-maximized, dynamic, and automated liquidity pools. Our rehypothecation hook boosts LP returns by pairing steady APYs from lending vaults with swap fees, driving higher yields to our pools before incentives. • Liquidity Density Functions (LDFs): Enable complex liquidity shapes with constant gas cost swaps. These are really nice and offer more customization than our competitors. For example, we are more gas-efficient and customizable than our competitors. • Shapeshifting: This allows for programmatic shifting, morphing, or switching of liquidity distributions. LPs love this. For stablecoins, we have a custom LDF that will actually allow you to buy the dip! TLDR, you can start with a center-heavy shape and automatically switch to edge-heavy before going back to create deep liquidity at the peg again. • Autonomous rebalancing: Maintains optimal token ratios without external keepers. • am-AMM: Recaptures MEV and optimizes fees via auctions. https://x.com/bunni_xyz/status/1788629395487572246 This is a cool feature for LPs and can give market makers a competitive advantage. They \"rent\" the rights to swap fees so for arbitrage purposes they are essentially trading without a swap fee, just rent. • Surge fee: Protects against sandwiching. • Rehypothecation: Let's idle liquidity outside of the current price tick earn throughout defi, so we could have an LP pool that rehypos the USDC in your pair to a number of projects. Aave, Yearn, Euler, Morpho, for example would work. They love this because it's essentially a new form of TVL. • Volatility-based swap fee: This is a dynamic fee model that adjusts to price volatility. We can use it by default or automatically if the am-amm doesn't get renters. • Auto-compounding: Automatically reinvests fees into liquidity positions.","links":"https://bunni.xyz/","market_cap":6421670,"market_cap_rank":1870,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bunni/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x000000c396558ffbab5ea628f39658bdf61345b3"}}}