{"name":"Triumph","id":"triumph_immutable","symbol":"tri","description":"🛡 Triumph Games The AI-Powered MMO/RPG Studio Scaling Free-to-Play, Skill-to-Earn, and UGC Across Web2 & Web3 Triumph Games is building the next generation of multiplayer gaming, where free-to-play meets real digital ownership, and where skill, not spending, drives rewards. By fusing Web2 accessibility with Web3 economies, Triumph unlocks a massive addressable market of both traditional and crypto-native players. Its proprietary AI powers intelligent NPCs and dynamic UGC systems, enabling scalable content generation and immersive, player-driven storytelling. This fuels multiple revenue streams, ranging from in-app purchases and ads to digital asset sales and marketplace fees. With over five years of development and leadership from AAA veterans (Telltale Games UK, Die Hard Trilogy, Alien Trilogy), Triumph is uniquely positioned to lead the convergence of mainstream gaming and blockchain. 👑 Flagship Titles and Tech • BattleRise – D&D RPG (10K MAU, 65K+ downloads, 3K NFTs sold out). • Legends of Elumia – MMORPG, Backed by Animoca, Spartan Capital, Crypto.com and now Immutable (4K DAU IMX PlayHub, #5 ZKEvm charts). • ArmourX – Unreal Engine ARPG (347k+ Closed Beta Sign-ups, 4K DAU IMX PlayHub). • ForeGamer Emotive AI-Powered Gameplay – Immersive NPCs & UGC. 🤝 Backers Immutable, Arbitrum, Tezos, Skale, Beam, Helika, ThirdWeb, Google Cloud, Nvidia DGX, Smart Path EU 🤝 Partners MEXC Global, Gate.io, Camelot, QuickSwap, Rarible, Harbour, Aethir, Stiqy, W3GG, GameFi, HyperPlay, Carv, Helix, GR1D Network, ZBD, Ultra ⭐️ Team • Pearl Nagy - CEO: Ex-Telltale Games (UK) • Matthew Nagy - COO: Designer Alien/Die Hard Trilogy • Michal Stasiak - Dev Lead: ForegamerAI • Ryan Simpson - CSO: DGG DAO Lead","links":"https://www.triumphgames.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/triumph/logo.png","detail_platform":{"immutable":{"decimal_place":18,"contract_address":"0xdbffb3bbc75528d1bda5564dc8ba6461946599c4","geckoterminal_url":"https://www.geckoterminal.com/immutable-zkevm/tokens/0xdbffb3bbc75528d1bda5564dc8ba6461946599c4"}},"is_native":false}