{"name":"Maverick Protocol","id":"maverick-protocol","symbol":"mav","description":"What is the project about? Maverick Protocol is a next-generation DeFi infrastructure focused on increasing industry efficiency, powered by Maverick AMM. What makes your project unique? Maverick AMM eliminates this complexity by letting users select a movement mode that will move their liquidity for them. Some other innovative features of Maverick AMM are: - Customized Liquidity Distributions - Fee Auto-compounding - Liquidity Shaping Using Boosted Positions - Native LST Support with Price Following function and Protocol Support. History of your project. - Maverick raised 3 rounds of funding with a total $18 million raised. Investors including Founders Fund, Pantera Capital, Coinbase Ventures, Binance Labs, Circle Ventures, Gemini, etc. - Maverick launched Maverick AMM to Ethereum Mainnet in March 2023, zkSync Era in April 2023, and BNB Chain in June 2023. - Maverick supported over 2.5 B trading volume and hit top 5 DEXs by volume on all chains according to DefiLlama. - Surpassed Uniswap and Curve to become #1 for wstETH (Liquid Staking Token) trading volume What’s next for your project? Q3 2023: - Launch Voting Escrow and Governance contracts Q4 2023 (subject to DAO votes): - Launch Boosted Pool Voting - Launch AMM on more chains H1 2024 (subject to DAO votes): - MAV LayerZero support on more chains What can your token be used for? MAV is the native utility token of the Maverick ecosystem. It is designed for governance of Maverick. Maverick governance will take place through a Voting Escrow (ve) contract, where users can stake MAV to receive veMAV. veMAV’s governance is designed to put more voting power in the hands of users who are committed to the ecosystem and provides protection against mercenary governance. The longer a user chooses to stake their MAV for, the more veMAV they will receive in return and the more voting power they will have.","links":"https://www.mav.xyz/","market_cap":101122575,"market_cap_rank":569,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/maverick-protocol/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7448c7456a97769f6cd04f1e83a4a23ccdc46abd"},"base":{"decimal_place":18,"contract_address":"0x64b88c73a5dfa78d1713fe1b4c69a22d7e0faaa7"},"zksync":{"decimal_place":18,"contract_address":"0x787c09494ec8bcb24dcaf8659e7d5d69979ee508"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd691d9a68c887bdf34da8c36f63487333acfd103"}}}