{"name":"Reforestation Mahogany","id":"reforestation-mahogany","symbol":"rmog","description":"The RMOG is based on a public blockchain that increases its value when apps and new members connect to our ecosystem to solve real sustainability, traceability and environmental governance (ESG) issues. The objective of Mahogany Reforestation is to revolutionize traditional economic processes and promote the development of digital entrepreneurship in isolated and degraded areas. WHAT WE DO ? african mahogany African Mahogany (khaya grandifoliola) is among the most cultivated noble woods in Brazil due to the high financial return and profitability of the wood. Each hectare of African mahogany presents an average annual increase of 21.89 cubic meters of round wood. Due to its easy adaptation to the Brazilian climate, which is similar to that of its continent of origin, African mahogany is one of the noble species with a fast growing time when compared to other species. Its maturation age is between 13 and 15 years, that is, it is at this age that the central part of the tree - also known as grain - forms. International market African mahogany wood is widely traded on the international market, mainly on the European market. Its commercial planting is considered a long-term investment for anyone wishing to expand their wealth or retire. However, before planting this species for the production of hardwood, some precautions are suggested to carry out quality management and thus obtain greater financial return. Is African mahogany a good investment for 2021? Today, African mahogany is considered a good long-term investment for those looking to diversify their investments. African mahogany (khaya grandifoliola) produces a noble wood that is highly appreciated in the European and North American market. This plant has conquered more and more Brazilian rural landscapes due to the high added value of its final product and the high productivity when the forest is well managed. Advantages of African Mahogany The biological characteristic of African mahogany is one of the main advantages. The straighter trunk (shaft) helps to make better use of the conversion of wood into logs for sawn wood, reducing the rate of wood loss. This plant still has a low incidence of branches and branches, which reduces the number of knots, that is, the wood produced is more homogeneous and resistant. Introduction of African Mahogany in Brazil African mahogany arrived on Brazilian soil in the 70s, but it was only disseminated in the 80s and 90s with experimental plantations promoted by Embrapa in various regions of Brazil. The largest plantations are concentrated in the state of Minas Gerais, and the Pompéu forestry pole is also located in the central region of the state, where RMOG manages large plantation areas. African mahogany financial return To get an idea of ​​the financial return of African mahogany, the internal rate of return (IRR) can reach 15 to 25% per year, considering all the costs and revenues generated by the forestry business. The implementation cost varies according to soil conditions, relief, climate, proximity to suppliers and consumer markets, among other factors. For more details on planting cost and financial return.","links":"https://www.reforestationmahogany.com/index","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/reforestation-mahogany/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xee33114ef9afb0779f0505c38afbb1644f4073cc"}}}