{"name":"Syndicate","id":"syndicate-3_base","symbol":"synd","description":"The Syndicate Network enables developers to build and operate smart rollups—application-specific blockchains (appchains) with programmable, onchain smart sequencers. Anticipated to launch on September 17, 2025, Syndicate moves sequencing logic from centralized, offchain services into transparent smart contracts on Syndicate Network, allowing applications to customize their transaction ordering, fee structures, and governance models. The SYND token, with a fixed supply of 1 billion tokens, serves as both the native gas token for Syndicate Network and Commons Chain (Syndicate's L3 that settles on Base) and the governance token for the entire network. Originally deployed on Ethereum Mainnet with bridging to Base, SYND launches with 92% of supply minted at genesis and 8% distributed through programmatic emissions over four years. SYND functions as essential infrastructure for network operations and governance. As the gas token, appchain operators use SYND to pay for sequencing transactions, deploying sequencer contracts, and writing blocks to Syndicate Network. As the governance token, SYND holders control the network's direction through a Wyoming Decentralized Unincorporated Nonprofit Association (DUNA), which holds the 258.7 million token treasury. Token holders vote on treasury deployments, network upgrades, and strategic partnerships, ensuring the community maintains control over the ecosystem's evolution. Starting with emissions anticipated October 1, 2025, holders also stake SYND on Commons Chain to earn from an 80 million token pool distributed over 48 thirty-day epochs across three pools: the Base Pool (30%) provides returns proportional to stake amount and duration, the Performance Pool (30%) rewards stakers based on the success of appchains they back, and the Appchain Pool (40%) directly funds appchains based on fees generated and stake attracted. Token holders interact with SYND through standard web3 infrastructure for both staking and governance. After bridging tokens from Ethereum or Base to Commons Chain, holders deposit SYND into the staking contract and allocate their stake across appchains for 30-day epochs. Beginning October 31, 2025, stakers must allocate 100% of their stake to specific appchains, creating direct alignment between token holders and ecosystem growth. Staking rewards are calculated based on both the amount staked and the performance of backed appchains—holders who identify successful appchains early earn outsized returns from the Performance Pool. Beyond staking, token holders participate in governance decisions that shape the network's future, from treasury allocations to protocol upgrades, ensuring the community retains sovereignty over the infrastructure they use. The smart sequencer architecture enables appchains to evolve through smart contract upgrades rather than infrastructure changes—modifying everything from transaction ordering to fee distribution through simple module updates. As the network matures, SYND's role expands to securing Syndicate Network itself through proof-of-stake validation, with the economic model shifting from emission-driven to fee-driven as usage grows. The governance structure ensures that major decisions—from emission schedule adjustments to treasury disbursements for ecosystem development—remain under token holder control through the DUNA framework. This design aligns incentives across all participants: developers capture value through customized appchains, token holders earn returns by backing successful projects while governing the network's direction, and the broader ecosystem benefits from purpose-built chains with programmable economics and atomic cross-chain composability.","links":"https://syndicate.io/","market_cap":28679075,"market_cap_rank":908,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/syndicate-3/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x11dc28d01984079b7efe7763b533e6ed9e3722b9","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x11dc28d01984079b7efe7763b533e6ed9e3722b9"}},"is_native":false}