{"name":"GAM3S.GG","id":"gam3s-gg","symbol":"g3","description":"What is GAM3S.GG? GAM3S.GG is a web3 gaming superapp that curates and creates content to spotlight the top games and showcases reviews, guides, news, quests, annual award shows, and more. For the past three years, the team has built a robust and industry-recognized platform driven by their top-tier game partnerships and commanding one of the largest communities across web3 gaming. With over 500,000 registered users, the platform continues to evolve with one clear goal: to improve the web3 gaming experience & onboard more gamers. This mission has driven new features, made possible by an agile and passionate team of experienced gamers that have helped hundreds of thousands seamlessly navigate the web3 gaming space, interact with games in unprecedented ways, and become the ultimate bookmark on every gamer's device. Welcome to the home of web3 gaming. What is the roadmap for $G3? GAM3S.GG is continuously evolving to enhance your web3 gaming experience. Here's a glimpse of the exciting features we have in store for the future: Seasonal Battlepass: The GAM3S.GG Battlepass will offer various rewards across its tiers, including exclusive web3 gaming NFTs, with partner NFTs available for both free and premium holders (with higher availability for premium). Gamer Identity (G3 ID): Your G3 ID will act as your passport across the entire web3 gaming space, allowing you to use it freely to track your progress and watch as it dynamically changes and evolves as you play more games and collect more achievements. Tournaments: Gamers can effortlessly jump straight into any live or upcoming tournaments for their favorite games, signing up using their platform identity through both free-to-join and paid-entry tournaments using $G3. Gaming Marketplace: Our marketplace ensure you make informed purchases and find the best deals across all active listings within seconds to explore and collect unique gaming collectables with confidence and ease.","links":"https://gam3s.gg","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gam3s-gg/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xc24a365a870821eb83fd216c9596edd89479d8d7"},"ethereum":{"decimal_place":18,"contract_address":"0xcf67815cce72e682eb4429eca46843bed81ca739"}}}