{"name":"Film.io","id":"fan-token","symbol":"fan","description":"Film.io is a decentralized filmmaking ecosystem, placing Hollywood decision-making into the hands of creators and fans. Film.io leverages blockchain technology and fan collaboration to provide filmmakers with an end-to-end solution for creating, funding and distributing their projects. Film.io liberates film and TV creators and replaces centralized power with collaboration and inclusivity. Film.io’s platform allows creators to submit projects as proposals, build audiences and receive market validation, expanding access to funding and licensing. It empowers fans to vote on film and TV projects by staking Film.io’s native FAN Token to projects they support and allows film investors, studios and streamers to scout market-validated projects with pre-developed audiences and analytics. FAN Tokens are the governance and platform token, used to join and participate in the DAO as well as other platform activities. Film.io is owned by the Global Creativity Foundation and was originally created by Ingredient X, a film and software development studio specializing in blockchain, DeFi and NFT technologies. Ingredient X leverages the power of the fully decentralized Film.io ecosystem to produce original Film, TV and NFT projects, including the critically acclaimed Star Wars autobiographical coming-of-age comedy, “5-25-77”, the film “Crypto” starring Alexis Bledel, Luke Hemsworth, and Kurt Russell, Blood Window Award NFT digital collectibles of 15 original pieces created by famed artist Flavio Greco Paglia — recognized worldwide for his mind-bending illustrations within the science fiction and horror genre, and “Landmarks Live In Concert”, a hybrid travelog and music documentary series hosted by Red Hot Chili Peppers drummer Chad Smith, featuring renowned musicians such as K.D. Lang, Alicia Keys and Foo Fighters.","links":"https://film.io","market_cap":15623783,"market_cap_rank":986,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fan-token/logo.png","detail_platform":{"polygon-pos":{"decimal_place":8,"contract_address":"0x3b9e9100db1389c518d47c635d80a90ad4c4f41b"}}}