{"name":"Payment Swap Utility Board","id":"payment-swap-utility-board","symbol":"psub","description":"What is the project about? The PsuB project will introduce a Pay System that can be safely used at a fixed price in the real economy based on multiple blockchains and build an integrated PsuB Metaform¹ that performs utility functions of platforms with high growth potential such as NFT marketplaces. The goal of the project is to form a complex ecosystem in which the PsuB token acts as a key medium and combines financial technology and the consumer market. PsuB will introduce a fixed-price SuBPay² system to compensate for the problem of inability to perform payment functions due to the floating disadvantages of existing tokens. Token users can switch to SuB Point, a fixed price, at any time. In addition, from the seller's point of view, it is possible to increase utilization in the real economy by reducing losses incurred when converting to cash. What makes your project unique? PsuB Metaform plans to expand the use of PsuB Token to investment, consumption, and financial technology by partnering with various business sectors such as real estate, membership services, mobile games, e-commerce, and distribution. History of your project. NEW IN THE MARKET TO CREATE. HISTORY What’s next for your project? WE ARE EXPANDING OUR PROJECT WITH LISTING ON MAJOR EXCHANGES ,PsuB increased its functional usefulness by allowing it to be used as a payment method in NFT marketplaces. In addition, Tokenomics will be implemented by continuously issuing NFTs linked to the pay system according to PsuB team's ecosystem composition strategy. We will build a multi-blockchain-based platform HUB, issue NFTs (digital art, real estate, game items, PFP³, etc.) through marketplaces, increase trust in virtual assets through PsuB tokens, and create a stable virtuous cycle operation system by ensuring the safety and security of transactions. What can your token be used for? PsuB Token can be exchanged for SuB Point through PsuB Wallet⁶, a private wallet service on PsuB's network, and can be utilized in the real economy through the SuBPay platform within the PsuB Hub. PsuB will expand its service and business area by developing its own wallet service and building the PsuB Hub platform through the advancement and stabilization stages of the marketplace.","links":"http://www.psub.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/payment-swap-utility-board/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0x19c0d5ddcf06f282e7a547d25ab09fe5a7984aae"}}}