{"name":"ShibKing","id":"shibking","symbol":"shibking","description":"What is the project about? SHIBKING, the leader of the Shiba Kingdom introduces a fun and rewarding Web3 ecosystem, completely integrated into the Shibarium Network. SHIBKING amplifies your DeFi experience by further immersing yourself in the Shibarium Network through engaging and self-sustaining Web3 dApps. Custom NFT Minting, Buyback and Reward Systems, Token and NFT Staking and Play to Earn Games all operate together within the SHIBKING ecosystem, offering users of variety of interests a reason to grow within the Kingdom! What makes your project unique? - The first NFTs on Shibarium providing automatic buyback rewards, supporting the chart of the token and increasing the value of the rewards of NFT holders. - NFTs with a fantasy theme that will be usable to play a P2E game, in which you explore dungeons and fight enemies to get ShibKing rewards. Rarer NFTs start with better stats! - A staking rewards ecosystem which will also provide rewards in the form of tokens from different projects, as well as providing added benefits for NFT holders. History of your project. Launched 24th August on the new Shiba Inu chain, Shibarium. We are one of the first to launch and starting building community. As pioneers of the chain, we plan to be the token that everyone talk about. What’s next for your project? To keep building the community and have a succesful journey on this brand new chain. What can your token be used for? The SHIBKING token leads the development of a rewarding and amusing ecosystem completely built on the Shibarium Network. Being the first to deliver a fun, engaging and efficient ecosystem of utilities to Shibarium users, SHIBKING's self-sustaining ecosystem aims capitalize on it's early stages and to grow continuously through the life of the Blockchain.","links":"https://shibking.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shibking/logo.png","detail_platform":{"shibarium":{"decimal_place":9,"contract_address":"0x236dcf3ee880796bf58d0978d53772a4d5dc6db6"}}}