{"name":"IOI","id":"ioi-token","symbol":"ioi","description":"What Is IOI Token (IOI)? The IOI Token is a supportive token that incentivize users to join and contribute to the QORPO Game Studio ecosystem. As a supportive token, it is designed to help expand the ecosystem by encouraging user participation and engagement. One of the ways the IOI Token incentivizes users is through airdrops for activity within the ecosystem. For example, users who trade NFTs and Collectibles on the QORPO Market or participate in the DAO Questions in QORPO ID may receive airdrops of IOI Tokens as a reward for their engagement. QORPO Game Studio is an innovative game studio and international blockchain company founded in 2018. The company’s headquarters is located in Bratislava, Slovakia, with over 90 employees with experience in AAA titles such as Overwatch, Stray, Arma or Mafia II. The ecosystem of games is supported by custom-developed products like SDK multichain wallet QORPO ID or QORPO NFT Marketplace. QORPO is building the next generation of games with a mission to bring AAA quality ecosystem in Web3 gaming, forging a competitive esports scene for every player. Who Are the Founders of QORPO? The core of the team is 10 representatives from Slovak Republic. The whole team consists of more than 90 people, who, in addition to enthusiasm for the gaming sector, are connected by diligence, perseverance, and rich experience in their fields. Rastislav Bakala is the CEO of the project. Before launching the project, he gained many years of experience in the banking and finance sector at the corporate level. He has been working in the cryptocurrency world for more than 5 years and during that time he has gained experience with all spheres of the industry. An international company with roots, head of an operation, and a team of specialists in Slovakia has been operating in the field of blockchain and gaming for the fifth year in a row. What Makes IOI Unique? IOI Token will represent the rewards in the form of prize pools for tournaments and special events which significantly increase the awareness of the token and thus bring the new potential buyers. This not only encourages user participation but also creates a sense of competition and excitement within the ecosystem. Another way the IOI Token incentivizes users is through staking with interesting % APY. By staking IOI Tokens, users can earn a return on their investment, which can help to further incentivize them to participate in the QORPO Game Studio ecosystem, open them more possibilities of earning as well as brings more potential traders to the QORPO Market.","links":"https://qorpo.co/traderacemanager2/home","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ioi-token/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x8b3870df408ff4d7c3a26df852d41034eda11d81"},"polygon-pos":{"decimal_place":6,"contract_address":"0xaf24765f631c8830b5528b57002241ee7eef1c14"},"binance-smart-chain":{"decimal_place":6,"contract_address":"0x959229d94c9060552daea25ac17193bca65d7884"}}}