{"name":"FOREVER SHIBA","id":"forever-shiba","symbol":"4shiba","description":"A Decentralised Meme Token that provides the worlds first dog treats powered by cryptocurrency. It is the latest in the Shiba inspired collection of meme tokens, with a unique ecosystem and broad vision. We plan to become a recognised brand and benefit not only our investors in the process but homeless dogs world wide through the sale of our products. Our Vision With a dedicated team that is driven with the intention of making sure its investors are at the heart of 4SHIBA and all decisions are made in a transparent and productive way. With a vision of building not only a unique use case that will bring new investment into Forever Shiba but also keep it thriving for many years to come. Forever Treats Forever Treats is our flagship utility with a whole ecosystem surrounding it that implement's a buyback and also a charity aspect, our goal is to not only provide quality dog treats to our consumers but also benefit our holders by buying back Forever Shiba with 25% of all profits and sending those tokens to burn. Another 25% of all profits go to dog shelters worldwide voted for by our community, the remaining 50% of all profits is then put back into Forever Treats in order to expand and improve our range of products over time. Why Forever Shiba ? Well the answer is quite simple, in the current crypto space there is thousands of new projects but only one that will last forever and that’s Forever Shiba. With a honest, hardworking and focused team there is only one way the future can go, whilst also holding the Shiba name we plan on not only benefiting our brand but also spreading awareness of both tokens and being the next SHIBA to leave a mark. Our Goals 1. To become an established name in the Shiba meme token space by bringing an energetic and dedicated team that can overcome any obstacle that comes into play. 2. To bring a unique use case that holds value and not only keep our investors engaged and rewarded but to also reward those who have stayed loyal.","links":"https://forevershiba.shop/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/forever-shiba/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb04bf60e468743418e87291d7c9301a5299d984d"}}}