{"name":"Wrestling Shiba","id":"wrestling-shiba","symbol":"wwe","description":"What are our goals and what drives us to achieve them? The Wrestling Shiba team looks towards creating the next blockbuster fighting game with esports competition in mind. Our aspirations towards building an AAA-level game are what first sets us apart from others in the NFT gaming industry. Such an undertaking used to be impossible for independent studios, but today with the fundraising capabilities of the crypto and NFTs this is a realistic and achievable goal. Paying homage to the old-school fighting games we all grew up with, Wrestling Shiba looks to take that inspiration and apply it to the industry-defining innovation possible with blockchain technology. Wrestling Shiba is focused on building a free-to-play competitive fighting game with PVP & eSports at the forefront of development and design decisions. Fight Legends is fight gaming, simply improved through blockchain technology as opposed to being the center of attention at the behest of gameplay that’s dynamic and fun. Social : Website Twitter Telegram Reddit Tiktok Facebook Publicity media 0 Items Publicity media Upload publicity media Update Coin Infomation 0 Items Log 🚀VOTE Coins can be upvoted once every 24h COMMENTS Generic placeholder image 0 comments Show More Publicity media Upload more WRESTLING SHIBAWRESTLING SHIBA Publicity media Play Video $DORD is AI Driven, inspired by the famous Chappie, & built to define the true meaning of DeFi. 2 0 628 views 2 Weeks ago Play Video 500 MEMBERS on BNB network. 1 0 509 views 2 Weeks ago I am a Binance smart chain token. I joined the BSC family because the blockchain has low transactions. And still has a lot of upside potential. The Mondero Token has set out to become a Crypto payment system. With a Wallet with payment function to pay Securely with Crypto debit card. To pay securely all over the world wherever you are.","links":"https://www.wrestlingshiba.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrestling-shiba/logo.png"}