{"name":"HeadStarter","id":"headstarter","symbol":"hst","description":"HeadStarter is a decentralized IDO Launchpad platform built on top of Hedera with the goal of connecting the ideas of tomorrow with the crypto community at large. The HeadStarter dApp is a key infrastructural piece towards Hedera’s path for mainstream adoption as the Hedera Hashgraph ecosystem begins to receive influxes of main-net applications through Foundation incentives, Hackathon participation and overall development openness for EVM familiar developers. At HeadStarter we are providing a medium for the Hedera community to support their curated, solid projects by engaging with the teams and having the opportunity to participate in their public crowdfunding rounds. By taking part in an IDO, the participants will receive the project's native Hedera token in exchange for funding in HBAR and USDC in the future. We strive to enable the development and launch of legitimate, problem-solving, and innovative projects, which is why we deliver a thorough scrutinisation process for each project, allowing only the most transformative and disruptive ones to be admitted to the public IDO stage. The Hedera ecosystem will be built from scratch and we are here to see it through. With a community-focused approach in helping grow ecosystem projects inside our acceleration program, we fully engage with projects from ideation to listing. Our advisors and partners will help startups with expertise in strategy, tokenomics, gamification, legal, best in market practices and more. We have instituted an in-house development team that has launched a Hedera Native dev tool for enabling developers write Hedera Hashgraph compatible code - Strato.js. As a launchpad dedicated to the Hedera ecosystem, we are committed to delivering and implementing industry-standard practices, which is why KYC and regulatory compliance are an integral part of the platform. This guarantees eligibility of potential investors to participate in public sales and solidifies HeadStarter as a transparent laun","links":"https://headstarter.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/headstarter/logo.png"}