{"name":"Geist Finance","id":"geist-finance","symbol":"geist","description":"What is Geist Finance? Geist Finance is a decentralized, non-custodial liquidity market operating on the Fantom Opera blockchain. The core protocol is based on AAVE, the largest DeFi lending protocol by TVL. The staking and fee distribution system is based on Ellipsis Finance. How Geist Works? The core Geist protocol is a lending market that functions near-identically to Aave. Users may borrow and lend different assets with variable interest rates. These interest rates are determined algorithmically according to the utilization of the lending pool. Asset pricing is determined using Chainlink and Band oracles. When a lender falls below the required collateral ratio, a financial incentive is provided for the liquidator who repays the under collateralized loan. GEIST liquidity mining employs a mechanism first introduced by Ellipsis Finance. All rewards are vested for 3 months. During this vesting period, users are already earning a share of the revenue generated by the protocol. If a user wishes to withdraw their GEIST at any time during the 3 month vesting period, they may do so by paying a 50% penalty. The GEIST taken as a penalty is then distributed to users who choose to lock GEIST for 3 months. This mechanism ensures steady rewards for those who actively commit to the protocol by locking their tokens. What is GEIST token? GEIST is the native token within the Geist protocol. GEIST is a revenue sharing token, not a governance token. The protocol has no concept of governance or ownership, and also no treasury. Instead, 50% of all revenue generated through lending is distributed directly to users who stake GEIST. GEIST tokens can be obtained by buying them from exchanges such as SpookySwap. It can also be obtained as a reward for providing liquidity on Geist.Finance. Assets Supported - Geist is supporting the following assets: FTM, WETH, WBTC, FUSDT, USDC, DAI, CRV What are the fees to use Geist Finance? There is no platform fee to be paid when you borrow besides the advertised Borrow APY on the Markets page. https://geist.finance/markets PODL introduction - The Protocol Owned DEX Liquidity (PODL) is a module that buys LP tokens using 50% of Geist’s FTM treasury rewards. All purchased GEISTFTM LP tokens are locked forever to ensure healthy ongoing liquidity and effectively making less GEIST Tokens available over a long enough timeframe. Audit and Multisigs - A preliminary audit has been performed and can be found here: https://solidity.finance/audits/GeistProtocol/ Additionally, Geist Finance has recently completed an audit with PeckShield with no critical findings. Full report can be found here: https://github.com/peckshield/publications/blob/master/audit_reports/PeckShield-Audit-Report-Geist-v1.0.pdf As Geist is based on Aave, many of the core contracts are upgradeable by the owner. The team understands that anonymous devs with the power to upgrade contracts may rightfully make some users feel uncomfortable. To mitigate these concerns, ownership of all Geist smart contracts will be placed behind a Timelock contract with a two day delay for any action. Meanwhile, the Geist multisig is a 3/5 safe with non custodial admin rights over the Geist protocol. The five people on the multisig are: ▪️Michael Chen (Fantom Foundation) ▪️Eerie (SpookySwap co-founder) ▪️0xngmi (co-founder DefiLlama) ▪️Aveen Hujiari (co-founder Geist) ▪️Charlie (Curve Finance)","links":"https://geist.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/geist-finance/logo.png"}