{"name":"JAIL KWON","id":"jail-kwon","symbol":"jkwon","description":"Introducing The Worlds First #EduMeme. Educate2Earn dAPP (E2E). Our Mission Is To Educate And Innovate the crypto space. JKWON's mission is to combine Web3 with Web2 and deliver something unseen in Crypto before now. Leveraging the power of social media marketing along with the use of our Educate-toEarn protocol to drive awareness of the token. Educate to Earn is a revolutionary marketing programme where users will be rewarded for their contribution. Marketers would use social media to promote Educate2Earn in exchange for allocations of $JKWON, which will further amplify marketing reach. Marketers would receive allocations based on the performance of their social media platforms ( TikTok; likes, views, followers. Instagram Reels; likes, views. Twitter; likes, retweets. • The Educate to Earn revolutionary programme will work by enabling creators and holders who promote the Educate2Earn daPP in their content to be able to link their social media accounts and crypto wallet to the dApp to be rewarded tokens. The app will track engagement, thus calculating rewards. The app user is friendly and straightforward to use. The scale and statistics of their education directly impact the allocation of JKWON to incentivise further exposure to the Educate2Earn program and general crypto community. Everyone has the opportunity to make income from educating the crypto community while promoting the Educate2Earn program simultaneous, which will have a positive effect on their JKWON investment. As we progress through our roadmap, there will be opportunities to increase rewards, expand on different strategies, and also provide access to exclusive Jailkwon group Using revenue generated from fees, Educate To Earn will rapidly scale in terms of learning resources, UI and developing many additional features to be built upon our platform along with the JKWON, we are creating the Educate To Earn community! This is a Post-to-Earn protocol which allows anyone to be paid to make content w","links":"https://jailkwon.xyz","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jail-kwon/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4c267653e851876dede1c90d494c2fc3f7f01178"}}}