{"name":"JumpToken","id":"jumptoken","symbol":"jmpt","description":"What is JumpToken (JMPT)? JumpToken (JMPT) is a crypto token created to fuel JumpTask – a gig economy-based marketplace that allows companies and organizations to make the most out of the collective skills possessed by a globally dispersed workforce. Using smart contract templates and crypto payments, JumpTask will revolutionize the industry of remote freelancing by decentralizing it and boosting its accessibility to everyone, including the unbanked. JumpToken (JMPT) is a utility token based on the Binance Smart Chain (BSC) technology which includes an open-source, blockchain-based distributed computing platform with cryptographically secure smart contracts stored in the BSC blockchain and fully capable of enforcing performance. Using JumpToken (JMPT) to fuel the transactions on the JumpTask platform will enable people worldwide to not just earn money on a remote basis with minimal transaction costs but also explore the cryptoworld without having to risk their fiat savings. In two years’ time, JumpTask is expected to attract up to 50 million new users and become the largest crypto project in the world in terms of its user base. When will JumpToken (JMPT) be launched? JumpToken (JMPT) will be launched in January 2022. A fixed supply of 100,000,000 JMPT will be issued during the token creation, and the team is not planning to mine or burn tokens in its initial stage of development. Moreover, there are currently no plans to release any number of tokens in the future. Instead of leveraging means of artificial appreciation, the team of JumpTask offers a complete business model-driven blockchain product that is trustworthy, reliable, and authoritative. The planned allocation of the JMPT supply will go as follows: 50% – Product and Partnerships: financing the necessary integration developments, incentivizing partners to join the JumpTask ecosystem, and encouraging a more inclined onboarding process 12% – Marketing: spreading brand awareness, encouraging the users to adopt the new application suite, and maintaining online users communities 16% – Research and Development: exploring the ever-growing needs of their users and adapting the project accordingly. 20% – Team: ensuring the teams' long-term motivation (locked at first and only released after a certain period of time) 2% – Liquidity pool: locked in a smart contract and used to provide liquidity for decentralized trades. Who is launching JumpToken (JMPT)? JumpToken is being launched in Estonia by the JumpTask decentralized work platform. The company’s CEO is Juozapas M. Preiksa, who is also a co-founder. Related pages JumpTask’s official website: https://www.jumptask.io/ JumpTask’s whitepaper: https://gitbook.jumptask.io/","links":"https://www.jumptask.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jumptoken/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x88d7e9b65dc24cf54f5edef929225fc3e1580c25"},"ethereum":{"decimal_place":18,"contract_address":"0x420a24c9c65bd44c48bfb1cc8d6cd1ea8b1ac840"}}}