{"name":"NXT","id":"nxt","symbol":"nxt","description":"Nxt uses the blockchain to create an entire ecosystem of decentralized features, all of which require the Nxt currency. Instead of modifying the original Bitcoin source code, as many altcoins have done, Nxt developers wrote their own code in Java from scratch. While Nxt is a public blockchain, licenses for private blockchains based on its software are also available for purchase. The developers refer to Nxt as Blockchain 2.0, providing numerous applications beyond simply keeping a public ledger of transactions. Jelurida BV took over the originally anonymously developed Nxt and now own the IP rights. Kristina Kalcheva, co-founder and legal expert of Jelurida, focuses on how to “explore the different open source licensing models and their enforceability in practice.” Currently, the main developer is an anonymous Star Trek fan, going by the name Jean-Luc Picard. While there is still the active development of Nxt, the parent company Jelurida is also working on a Nxt 2.0, known as Ardor, designed specifically to deal with scalability. Ardor will use the same blockchain technology as Nxt, combined with the idea of ‘child chains.’ According to Travin Keith, Nxt foundation Web and Marketing manager, Ardor allows for a “manageable blockchain size, which solves the problem of scalability by separating transactions and data that do not affect security from those that do, and moving all of those that don’t affect security onto child chains.” The core infrastructure of Nxt is complex. This adds risks as compared to the more lean bitcoin, but makes it easier for external services to be built on top of the blockchain. A peer-peer exchange allowing decentralized trading of shares, crypto assets. Since the blockchain is an unalterable public ledger of transactions, the Asset Exchange provides a trading record for items other than Nxt. To do this, Nxt allows the designation or \"\"coloring\"\" of a particular coin, which builds a bridge from the virtual crypto-currency world to the physical world. The \"\"colored coin\"\" can represent property, stocks/bonds, commodities, or even concepts. Arbitrary Messages enable the sending of encrypted or plain text, which can also function to send and store up to 1000 bytes of data permanently, or 42 kilobytes of data for a limited amount of time. As a result, it can be used to build file-sharing services, decentralized applications, and higher-level Nxt services. Nxt had no mining phase, all initial units were released to 73 people through a one-time fundraiser via bitcoins, after the announcement of the NXT project in the bitcointalk-forums by BCnext. Combine this with a PoS approach, and you have a situation where the big guys run the table. At one point, the Nxt community had a very public spat with Bitcoin developer Jeff Garzik. Garzik took issue with the Nxt marketing approach, its anonymous developers, and their responses to constructive criticism. Nxt responded to some of these claims, of course, but it remains one of the more controversial moments in its history. Another key problem the Nxt network ran into (like so many others) was blockchain bloat. Nodes get weighed down by the onerous task of having to store every transaction on the Nxt blockchain. This was one reason (among others) why Ardor/Ignis came into existence.\"","links":"https://www.jelurida.com/nxt","market_cap":369441,"market_cap_rank":4916,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nxt/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}