{"name":"CashZone","id":"cashzone","symbol":"cashz","description":"Cashzone creates a virtual space that produces value in conjunction with real life and real space. Metaverse in Cashzone do not contain complex virtual spaces, but puts on a layer of Cashzone on top of the actual space. Cashzone is in the middle of an electronic billboard and a flyer. Electronic billboards have the advantage of being visible to a large floating population, but their prices are high-priced to install and maintain. They are also limited in size and location. On the contrary, paper flyers do not include a variety of media instead of being able to promote guerrilla activities in the area they want at a lower price. Cashzone combines the advantages of these two ways of advertising with +@. Cashzone's FLOW is as follows: 1. Within the ecosystem, there are three categories: land owners, advertisers, and general users. 2. Land owners may acquire land through sale or sale of land. 3. Advertisers send ads to the Land area through the Land owner. At this time, the cashzone token is used for advertising. 4. Users in the land watch ads and receive tokens as rewards. 5. Land owners share advertising costs with the platform. Advertisers feel free to set the time, target, and location they want to send ads to, and distribute more efficient flyers because they are not affected by the weather. Users can earn money by collecting tokens just by watching advertisements. Land owners can continue to earn income just by owning a land, and if the value of the land rises, they can enjoy a double investment. The number of users exceeded 10,000 in February when the first land sale began, and 30,000 in March when the second land sale began. The number of members is expected to exceed 50,000 after the upcoming third land sale.","links":"https://cashzone.co.kr/en","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cashzone/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0x19914f539b1424b1675270002bd9e4ce8e91fc21"}}}