{"name":"Argo","id":"argo-3","symbol":"argo","description":"Origin Argo is previouly called AI3 Labs,focusing on the revolutionizing the intersection of artificial intelligence and Web3, breaking barriers to unlock unprecedented possibilities. As a world-class team of innovators, we excel in developing modular, scalable, and highly interoperable AI systems designed to tackle complex, real-world challenges. With unparalleled expertise in modern AI development and Web3 AI infrastructure, Argo Labs integrates cutting-edge technologies to deliver next-generation solutions that set new standards for AI workflows. --- At Argo, we are proud to be at the forefront of technological innovation, contributing to the foundational frameworks that power modern AI systems. As the creators of DeepFaceLab, one of the top 2 open-source AI projects of 2020, we revolutionized the field of face manipulation and established new standards for open-source AI development. Our contributions to the development of PyTorch and TensorFlow, the backbones of today’s AI research and applications, have directly shaped the way industries, researchers, and developers build intelligent systems globally. These platforms are instrumental in powering everything from computer vision to large-scale natural language models. Beyond our contributions to core AI infrastructure, we also played a key role in shaping the foundational vision of web3 AI agent frameworks. As the principal authors of the Eliza framework white paper, we provided in-depth technical insights and architectural designs that guided its development. Our work established a strong theoretical and practical foundation for decentralized AI agent systems, showcasing our ability to drive innovation at the forefront of AI research and implementation. Building on this legacy, Argo is our next-generation multi-agent framework, purpose-built to bridge the gap between decentralized AI systems and real-world applications. Argo is designed to be universally adaptable, offering seamless integration and usability across traditional and decentralized ecosystems. By prioritizing transparency, security, and user empowerment, it serves as a versatile tool for creators and organizations looking to harness the power of AI in any environment. With its intuitive, low-code interface, Argo empowers users to easily construct scalable workflows tailored to their unique needs—whether optimizing operations in conventional industries, enhancing digital ecosystems, or innovating within decentralized networks. By integrating state-of-the-art technologies, Argo ensures complete control over data integrity and execution processes, making it the ultimate solution for those seeking to navigate the intersection of AI and Web3 with confidence. Introducing Argo Framework Argo is the next-gen composable AI workflow infrastructure that offers enhanced modularity, scalability, and transparency compared to highly flexible web3 AI Agent frameworks, e.g. Eliza & Swarm. It enables both web2& web3 users to effortlessly construct workflow systems tailored to their specific requirements without the need of knowing how to code. Through Argo, creators can easily transform their ideas into reality using Link-Link's (connecting building blocks) intuitive GUI and high-school level configuration. By publishing their workflows, creators can share both ownership and benefits. We envision this catalyzing a new paradigm of open AI development - shifting from complex, uncontrollable autonomous agents to transparent, community-driven AI workflows. Workflow vs Autonomous Agent According to Anthropic's seminal paper \"Building Effective Agents\"(December, 2024), AI systems can be categorized into two primary architectures: workflows and agents. Workflows orchestrate LLMs and tools through predefined code paths, while agents enable LLMs to dynamically direct their own processes and tool usage, maintaining autonomous control over task execution. In the web3 ecosystem, security and privacy concerns are paramount, with the protection of mnemonic phrases and private keys being critical requirements. Furthermore, fully autonomous agents - particularly those relying heavily on LLM-based intent recognition - become increasingly opaque as functionality and data sources expand exponentially, making their execution paths and reasoning chains virtually impossible to audit. As the leading author of the technical report of Eliza (AI16Z), we've concluded that well-orchestrated workflow systems are better suited to current requirements than autonomous agents. This aligns with Ilya Sutskever's observation (former OpenAI Chief Scientist and co-creator of AlexNet, Seq2Seq, and GPT) that LLM scaling has reached certain limits, suggesting we should focus on maximizing the potential of existing LLM capabilities. For many applications, optimizing individual LLM calls with retrieval and in-context examples proves sufficient. Workflows offer predictability, transparency, and consistency for well-defined tasks, enabling web3 users to understand their agents' actions through detailed steps and diagrams while ensuring asset security remains tamper-proof. Protocol Argo Labs provides infrastructure and crypto-economic incentives for decentralized AI systems. It rewards proposal contributors, node operators, and workflow creators while enabling collective governance of these intellectual assets and their generated value: Decentralized Resource Marketplace - Rich pool of distributed nodes supporting large-scale deployment - Extensive library of reusable workflow templates - Active community discussion forums - Lower barriers to AI workflow construction Collectively Governed AI Workflow Ecosystem - Innovation Rewards: Compensate designers of original AI solutions - Deployment Rewards: Incentivize operators who integrate nodes into the system - Community Participation Rewards: Recognize active governance participants - Value Distribution: Merit-based allocation mechanism based on contributions Key Highlights - Comprehensive incentive mechanisms ensure sustainable ecosystem growth - Decentralized governance guarantees fairness and transparency - Transparent value distribution promotes healthy competition - Community-driven model catalyzes innovation Our Master Plan Nodes Drive Everything - Integration of mainstream on-chain&off-chain APIs into standardized nodes - Aggregation of diverse functional node pool - Users can freely combine nodes to build powerful workflows - Standardized interfaces ensure seamless node interoperability 1. Distributed Multi-Node Framework (In Development) - Open-source framework architecture - Support for global heterogeneous hardware integration - Ensures system scalability - Implements efficient resource orchestration mechanisms 2. Continuous Integration of Cutting-Edge Capabilities - Seamless integration of latest AI service nodes - HuggingFace ecosystem - High-performance inference services like Fal.ai - Integration of critical Web3 functional nodes - DeFi operation nodes - Cex Api nodes - NFT interaction nodes - On-chain data analysis nodes - Careful curation of high-quality nodes - Continuous expansion of node capabilities Zen of Argo Simple workflows are better than complex agents. Explicit is better than implicit. Composable is better than monolithic. Predictable is better than flexible. Security is a must, not a choice. Transparency beats black-box behavior. Nodes should do one thing and do it well. Reusability matters more than reinvention. Community-driven beats centrally planned. Value shared is value multiplied. In the face of ambiguity, refuse the temptation to guess. Now is better than never, but tested is better than untested. If a workflow is hard to explain, it might be a bad design. If a workflow is easy to explain, it might be a good design. Decentralized doesn't mean disorganized. Privacy and control go hand in hand. Let users own their workflows, literally.","links":"https://argoai.io/","market_cap":6914.54,"market_cap_rank":11240,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/argo-3/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"Argoo945JjG9oyt5hgsrdtwbG3S4ATXQy4tTdYMzsV1m","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/Argoo945JjG9oyt5hgsrdtwbG3S4ATXQy4tTdYMzsV1m"}}}