{"name":"LONG (ETH)","id":"long-eth","symbol":"long","description":"Loong is a decentralized Dragon Coin cultural exchange token issued among the global community of Dragon Coin culture believers and enthusiasts with \"Loong Coin Culture\" as its IP. Loong is based on the new generation of public chain technology and uses NFT Dragon Coin games and offline cultural creation scenes as ecological support to create a new Dragon Culture WEB3.0 world, aiming to stimulate online and offline Dragon Coin cultural exchange activities globally and promote Dragon Coin deeds. The cultural essence of Helong coins promotes the inheritance and development of China's excellent traditional culture and strengthens Chinese cultural confidence.Loong's core goal is to establish a global Dragon Coin cultural ecosystem and create a diversified application scenario and community related to Dragon Coin. The ecosystem will be launched in the form of NFT Dragon Coin games, Dragon Coin maps, Dragon Coin malls, etc., providing users with a full range of Dragon Coin cultural experience and participation opportunities. By participating in games and activities, users can earn Loong rewards and enjoy interaction and communication with other Dragon Coin enthusiasts.The Loong project adopts the decentralized Dragon Coin DAO organization and voting mechanism to ensure the democratic governance and community participation of the project. Users holding Loong will have the opportunity to participate in decision-making and voting, and vote and influence the development direction and major operational decisions of the project. LOONG is a digital encrypted virtual currency based on blockchain and smart contract technology and developed for the LOONG social network incentive mechanism and consumption behavior. As a token, Long provides an operating medium for smart contracts and transactions on the platform, and is used for exchange, payment and rewards.","links":"http://longcoin.vip","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/long-eth/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0080428794a79a40ae03cf6e6c1d56bd5467a4a2"}}}