{"name":"TENET","id":"tenet-1b000f7b-59cb-4e06-89ce-d62b32d362b9","symbol":"tenet","description":"TENET is a DeFi-focused EVM Layer-1 bringing liquidity and yield opportunities to LSDs. TENET allows LSDs to re-stake to its network and be used in TENET's DeFi Ecosystem by utilizing a new consensus mechanism called Diversified PoS. This allows LSDs like stEth to participate in validation, making it the most secure blockchain ever created. After an LSD is staked to TENET, users get back an LLSD, which can be used throughout TENET’s ecosystem. LSDC (Liquid Staking Dollar Coin) is TENET’s overcollateralized stablecoin minted from LSDs, and it the first-ever interest bearing stablecoin backed by a basket of liquid assets. What makes TENET unique? It is the only active EVM layer-1 operating on Cosmos. This delivers maximum composability of money, while making development exceptionally easy. All Cosmos assets can natively move to TENET. The vast code libraries of EVM networks like Ethereum can likewise be used on TENET. The blockchain’s consensus model is an industry-first: Validate through major token’s liquid staking derivatives. This makes TENET welcoming to other blockchains rather than an aggressive competitor. Validation through major network’s tokens makes TENET the hardest network to attack, as it has the combined security of Ethereum, Polygon, BNB Chain, and other networks. The ability to mint LSDC (Liquid Staking Dollar Coin) from the LSDs that validate TENET give major liquidity advantages. Network validators have an added layer of liquidity on TENET, while they earn the yields of the LSDs. This makes DeFi instantly more liquid on the TENET blockchain. TENET is also the first blockchain to be run on native gauges. Similar to Curve Finance, the TENET token can be staked for veTenet and vote on how rewards will be distributed throughout the LSDs and apps on its entire native ecosystem. TENET is the first blockchain to ever do this at the base level, allowing a new era of what's possible from a Layer-1 token.","links":"https://tenet.org","market_cap":18461317,"market_cap_rank":1141,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tenet-1b000f7b-59cb-4e06-89ce-d62b32d362b9/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x788d86e00ab31db859c3d6b80d5a9375801d7f2a"}}}