{"name":"Baby Doge CEO","id":"baby-doge-ceo","symbol":"babyceo","description":"What is the project about? Babydogeceo, TwitterWallet is our main utility. Where you can send and receive crypto using Twitter. After signing up and depositing crypto into your account. BabyDogeCEO x ELONMUSK develops twitter payment ($TwitterWallet) to replace Apple Pay - PAYPAL leads the Crypto trend in the world. You can able to send the money using the twitter @id like \"@WalletCEO @ElonMusk\" and it will transfer your crypto currency from your account to the recipient's account (in this case #ElonMusk). you can tweet something like \"@WalletCEO send 1 BNB to @ElonMusk\" and it will transfer 1 BNB from your account to the recipient's account (in this case #ElonMusk). We are currently focused on BSC because of its high speed and low fees. The average wait time for a transaction is 4 seconds. We build it in EVM chain, So you can able to use this wallet anywhere like trust wallet and metamask by inserting your seed phrase . Holders can emphasize to 7% reward Holders there's no need to staking and all . they will get their rewards automatically from every buy and sell. What makes your project unique? - KYC-AUDIT - Renounced OwnerShip, New technology transmitted from ELONMUSK, CEX PRE-LISTED VINDAX, 7% tax reward holder TwitterWallet, Mintnfts, Staking, swap...Supported by social media influencers & 500+ KOLS, No Token & No Unlock Development Team, Big Marketing Wallet, Renounced ownership, DIDBTOK, AMABinance, Super Burn token. Renounced ownership: https://bscscan.com/tx/0x43df751b7b89aafb07c53e5bc2052d1022a3b25e9363d115e306db06b409094f History of your project. What’s next for your project? Used 30000$ for pre-launch marketing (CEX PRE-LISTED VINDAX - BTOK - Binance...) - After launch #BaByDogeCEO will continue the chain of stronger marketing activities: CG China & CMC China. Trending dextools, avex after 4-10 days of launching, complete the social What can your token be used for? TwitterWallet, Mintnfts, Staking, Swap","links":"https://babydogeceo.co/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/baby-doge-ceo/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xed1a89fa419e3d1042d4ea2e938fb62a216594c6"}}}