{"name":"Max Revive","id":"max-revive","symbol":"maxr","description":"$MAXR, a medicine for all fainted tokens Buying meme coins comes with risks. The occurrence of investors being misled into buying meme tokens and after wards getting ͵scammed by way of rug pull or a dev going rogue, is an event that happens too often... Sadly enough, in this space, a lot of the developers cannot be trusted. This results in the downfall of innovative and original ideas for projects. This happens because of an ego driven manifestation of the sin: Greed. The ability to remain completely anonymous online, thus leaving all sense of responsibility. This results in investments turning to nihility. A huge portion of investors are obligated to sell with huge losses or are left holding a bag worthy of nearly nonexistence. Buying memecoins comes with risks. The occurrence of investors being misled into buying meme tokens and afterwards getting scammed by way of rug pull or a developer going rogue, is an event that happens too often. This is where Max Revive fulfills its purpose. By striving to maintain full disclosure towards the users, the team ensures keeping everyone up to date with all the progress. Complete transparency is found to be a great necessity for maximizing the community’s satisfaction. All promises made by the team will be manifested and provided to the community. Max Revive has the ambition to realize a secure, long-term investment that will grow with its community. The launch will be stealth and fair, without a presale. The previous rug of $miniSAITAMA has initiated a relaunch and afterwards a rebrand. With a new team and providing utility. The team will provide the liquidity and it will be locked. We are building a platform where you can revive your rugged ERC-20 tokens. Tracking down etherscan enables us to check your eligibility for a pay-out. Creating an opportunity to help those that are left with nothing is one of the key factors that are essential and how the entirety of the journey started for Max Revive.","links":"https://www.maxrevive.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/max-revive/logo.png"}