{"name":"Emocoin","id":"emocoin","symbol":"emo","description":"What is Emocoin? Emocoin (EMO) is the true democratization of digital currency, which will empower individuals to participate in a Decentralized Economy enabling people and businesses to conduct trustless, anonymous and secure transactions globally build on the cutting edge blockchain, cryptography and peer-to-peer technology. Emocoin ecosystem will allow users to have access to countless products and services that an individual requires for daily livings including Crypto Wallets, Currency Swap, Web Browser, Exchange, Staking, Loans, Payment Gateways, Retails, Entertainments for vending machines, shops and webshops. EMO serves as the currency for the entire ecosystem and ensures minimising the transaction fees. EMO Staking program allows users to earn a passive income and helps new supplies to be released into the market. Who are the Founders of Emocoin? Rick Jordan is the driving force behind Emocoin. He is a seasoned Entrepreneur with Masters in Finance Management and over 23 years experience in the areas of Hospitality & Service Industry, Vendor Management, Brand Building, Marketing, Public Relations and Strategic Planning. Martin Thompson is Co-founder and Chief Technical Officer. He is having 12 years experience and is actively working for creating the entire Emocoin Ecosystem and development of Blockchain. Annie Smith and Harry is Co-founder and Chief Marketing Officer. With past experience of over 20 years in the areas of Marketing and Advertising. Their Love affair with ‘Blockchain’ technology and ‘Cryptocurrencies’ began in 2015. After spearheading many projects, where they constantly helped the Companies realise its mission and monitor the company direction as articulated through the policies and corporate objectives. What is the Purpose of Emocoin? We believe that bringing 100% utilization of the currency that powers the purchasing of all the products and services will bring credibility, accountability, agility and freedom to our users. Emocoin will empower our community to participate in decentralized economies and will strengthen our relationship with our community. All transactions carried out in the near future in all our portfolios will be through Emocoin directly or indirectly. We will work for continuous innovation and development to strengthen this link, and it will help us connect with our users and growth of the ecosystem, keeping the following parameters in mind: Growth Speed of Progress Consistent Like-Minded Community Scope Seamlessly Growing World How is the Emocoin Network Secured? Currently, Emocoin is a TRC20 token using the IRON Blockchain. TRON uses a consensus mechanism that is known as delegated proof of stakes. According to TRON, this approach helps its blockchain to achieve higher levels of throughput. EMO is going to introduce its blockchain in 2023 secured by Tendermint Byzantine Fault tolerant (BFT) Consensus Mechanism. How many Emocoin are in the Circulation? EMO has a total supply and circulating supply of 21 billion tokens. Out of 21 billion tokens, 210 million tokens are currently with holders in the market. New Supply is released as the interest through Emocoin Staking Program.","links":"https://www.emo.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/emocoin/logo.png"}