{"name":"MBC","id":"mbc_binance-smart-chain","symbol":"mbc","description":"**Miners.Club Project Description** Miners.Club, founded in August 2024, is a decentralized mining platform dedicated to democratizing access to global computing power. By leveraging hashrate tokenization, Miners.Club offers computing power products and services to both individual miners and institutional investors, removing the technical barriers typically associated with traditional mining. The platform enables seamless participation in mining activities through a decentralized marketplace, providing users with a fair, transparent, and efficient mining environment. At the core of Miners.Club’s mission is the principle of “computing power equality.” The platform aims to ensure that all participants, regardless of scale or background, can share in the value generated by computing power. By fostering an inclusive and collaborative mining ecosystem, Miners.Club promotes trust and transparency while maximizing the utility of tokenized computing resources. A key component of Miners.Club is *MinerBase*, Europe’s largest self-operated Bitcoin mining facility. Established in 2013, MinerBase has secured over $300 million in investments and operates more than 40,000 advanced Bitcoin mining machines. The facility employs cutting-edge computing power routing and optimization technologies to maintain stable and efficient mining operations. This infrastructure ensures consistent returns for miners while upholding high standards of transparency and operational efficiency. Miners.Club envisions a future where computing power is as critical as traditional energy resources. The platform advocates for the financialization and decentralization of the mining industry, making mining accessible to a broader audience. This vision is facilitated through the integration of decentralized computing power tokens and the platform’s governance token, **$MBC**. Miners.Club continues to evolve its offerings, with ongoing product development and platform updates designed to enhance user experience and expand the accessibility of mining to a global audience.","links":"https://miners.club/","market_cap":32136,"market_cap_rank":8902,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mbc_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7d28276933d6aa0ef1513f8b5e18dc492befefea","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x7d28276933d6aa0ef1513f8b5e18dc492befefea"}},"is_native":false}