{"name":"BlockAI","id":"blockai","symbol":"bai","description":"The BlockAI project aims to democratize access to advanced AI tools and services by leveraging blockchain technology. It provides a decentralized platform that integrates various AI functionalities, including natural language processing, image generation, video summarization, and collaborative tools, accessible to a broad range of users. AI Tools and Services: Text & Chat: Access to models like OpenAI's ChatGPT, Orca, and Google Gemini. Image Generation: Use of models such as Dall-E and Stable Diffusion. Video Summarizer: Summarizes YouTube videos. Brainstorming & MindMap: Facilitates brainstorming sessions and visual mapping of ideas. Discussions: AI-driven discussions to explore specific topics. Blockchain Integration: $BAI Token: A utility token used for accessing services on the platform. Smart Contracts: Allows AI tasks to be initiated and results returned through blockchain-based contracts. Multichain Support: Compatibility with multiple blockchain networks like Waves, Base, and BNB Chain, ensuring broader accessibility and decentralized operations. Community-Driven Development: DAO Participation: Users can participate in decision-making through the BAI DAO, where voting power is based on platform usage rather than token holdings. Feedback and Surveys: Continuous user feedback and surveys guide the development and evolution of the platform. The long-term vision of BlockAI is to create a versatile, inclusive, and innovative digital ecosystem where both individuals and automated smart contracts can leverage AI to enhance various aspects of personal and professional life.","links":"https://blockai.dev","market_cap":276575,"market_cap_rank":5173,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockai/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x10da043d0b46e43b53b74a88ac60ccc28e2afdf8"},"waves":{"decimal_place":8,"contract_address":"2fdzyHvXGCqaz1XA8m9fodemmP9giVBcpe4Jq9F63oFL"},"base":{"decimal_place":18,"contract_address":"0x6a27cd26a373530835b9fe7ac472b3e080070f64"}}}