{"name":"Creo Engine","id":"creo-engine","symbol":"creo","description":"What is Creo Engine (CREO)? The word \"Creo\" from Creo Engine is taken from the Latin word creo, which means 'create.' It also means 'believe' in Spanish. In essence, Creo Engine aims to create the best crypto gaming platform by providing users worldwide with high-quality video games with rich visuals and sound, an essential play-to-earn system, and a safe and secure marketplace for users to buy and sell digital assets utilizing a blockchain platform. Primarily, Creo Engine is a gaming platform where developers can launch their games to Creo Engine user base. It means Creo Engine supports developers in monetizing their games in versatile ways, creating interesting earning possibilities by providing high-quality for the Creo Engine ecosystem community. The Creo Engine team funded and established an in-house game studio to kickstart the gaming platform they initiated. They then assembled a group consisting of visual artists, sound artists, programmers, and other experts to develop games. The first four games of the project are Evermore Knights, Slime Haven, Merchant Marvels, and Peony Ranch. Who Are the Founders of Creo Engine? Creo Engine was created in mid-2021 by Javier Tan and co-founder, Darrel Wijaya. The two are avid gamer and share the same interests in blockchain technology. Their long-term vision is to provide fun, exciting, and player-oriented blockchain video games while creating better welfare for every level of users utilizing the platform, all under one ecosystem. Javier, the CEO, and co-founder of the platform, has been a fan of RPG games and a faithful follower of blockchain technology since its initiation. The CTO, Darrel, has been a passionate gamer since a very young age. In 2016, he set up his team and became a game developer. After making several indie games that circulated in social media forums, his studio released 'The Revenant Prince' on Steam in 2021. What Makes Creo Engine Unique? Creo Engine's NFT interchangeability in-between games are the platform's most prominent and distinctive aspect. Creo Engine team believes that adding more utilities to the NFTs will gradually enhance its value. The Creo Engine ecosystem is a unified platform governing multiple games under one token called 'CREO.' The interconnection concept in-between games supporting Creo Engine's ecosystem is also one of the features that separate Creo Engine ecosystem from others. In short, Creo Engine is making its own \"mini-Metaverse\" where items and NFTs can be intertwined with any game that they choose to bring in. Essentially, when players play on the platform, they can find the values of their items with other communities beneath one ecosystem.","links":"https://www.creoengine.com/","market_cap":2285568,"market_cap_rank":3175,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/creo-engine/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9521728bf66a867bc65a93ece4a543d817871eb7","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9521728bf66a867bc65a93ece4a543d817871eb7"},"solana":{"decimal_place":9,"contract_address":"Fg4TqUxx6E9L7Pya6fMUGzTD4s2jwSMzjrWeeBHvu7ZC","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/Fg4TqUxx6E9L7Pya6fMUGzTD4s2jwSMzjrWeeBHvu7ZC"},"ethereum":{"decimal_place":18,"contract_address":"0xe636f94a71ec52cc61ef21787ae351ad832347b7","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe636f94a71ec52cc61ef21787ae351ad832347b7"}}}