{"name":"NEXO","id":"nexo","symbol":"nexo","description":"What is Nexo? Nexo (https:/nexo.com) is a premier digital assets wealth platform empowering clients to grow, manage, and preserve their crypto holdings. Our mission is to drive the next generation of wealth by prioritizing customer prosperity and delivering tailored solutions for building long-term value, supported by 24/7 client care. Since 2018, Nexo has been delivering unmatched opportunities to forward-thinking clients across more than 200 jurisdictions. Our all-in-one platform combines cutting-edge technology with a client-centric approach, offering high yields on flexible and fixed-term savings, crypto-backed loans, advanced trading tools, and liquidity solutions through the first debit/credit crypto card. Backed by deep industry expertise, a sustainable business model, robust infrastructure, security, and global licensing, Nexo champions innovation and long-lasting prosperity. What is the NEXO Token? The NEXO Token, is Nexo’s native cryptocurrency, offering a wide range of benefits on the platform. NEXO Token holders can earn up to 12% annual interest on tokens held within both the Savings and Credit Line Wallets in their Nexo accounts. Additionally, owning NEXO Tokens grants entry into the Nexo Loyalty Program (https://nexo.com/loyalty), providing valuable benefits such as higher yields on digital assets, up to 0.5% crypto cashback on purchases or swaps made via the Nexo Exchange, borrowing rates starting from 2.9% annual interest, and up to 2% crypto cashback when using the Nexo crypto credit/debit card. Where can you buy NEXO? NEXO tokens can be traded on well-established centralized crypto exchanges. The most popular exchange to buy and trade NEXO is Binance, where the most active trading pair NEXO/USDT has a trading volume of $1,398,440 in the last 24 hours. Other popular options are Bitget, Bybit, Bitstamp, Bitfinex, Gate.io, and many others.","links":"https://nexo.com/","market_cap":1189181859,"market_cap_rank":82,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nexo/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb62132e35a6c13ee1ee0f84dc5d40bad8d815206"},"energi":{"decimal_place":18,"contract_address":"0x04640dc771edd73cbeb934fb5461674830baea11"},"sora":{"decimal_place":18,"contract_address":"0x003005b2417b5046455e73f7fc39779a013f1a33b4518bcd83a790900dca49ff"},"fantom":{"decimal_place":18,"contract_address":"0x7c598c96d02398d89fbcb9d41eab3df0c16f227d"},"polygon-pos":{"decimal_place":18,"contract_address":"0x41b3966b4ff7b427969ddf5da3627d6aeae9a48e"}}}