{"name":"Octokn","id":"octo-gaming_solana","symbol":"otk","description":"Octo Gaming is the number 1 mobile gaming platform on Solana with 4M downloads, available on the App Store, Play Store and Solana dApp. The platform is fueled by mini games using a mix between Octo's IPs and the most powerful web2 and web3 IPs enabling users to monetize their time spent playing video games. By playing on the Octo app, users can compete in games and earn rewards, effectively monetizing their time spent gaming on mobile. 17 games are already available on the app with over 100 million matches played. Octo has built games on its app and created engagement and visibility for world-renowned sports clubs (Paris Saint Germain and Paris Musketeers), tokens exceeding the billion dollar valuation (BONK, PONKE, Samoyed, etc.) and NFT collections with millions of NFT sold (DeGods & y00ts, Solana Monkey Business, Claynosaurz, Degenerate Ape Academy, Chimpers, and more). Octo Gaming's mission is to become the first platform to drive millions of gamers from Web 2.0 to Web 3.0 through their gaming app. Octo Gaming est la plateforme de jeux mobiles numéro 1 sur Solana avec 4 millions de téléchargements, disponible sur l'App Store, le Play Store et Solana dApp. La plateforme est alimentée par des mini jeux utilisant un mélange entre les IP d'Octo et les IP web2 et web3 les plus puissantes permettant aux utilisateurs de monétiser leur temps passé à jouer à des jeux vidéo. En jouant sur l'application Octo, les utilisateurs peuvent s'affronter dans des jeux et gagner des récompenses, ce qui permet de monétiser le temps passé à jouer sur mobile. 17 jeux sont déjà disponibles sur l'application, avec plus de 100 millions de matchs joués. Octo a développé des jeux sur son application pour créer de l'engagement et de la visibilité pour des clubs sportifs de renommée mondiale (Paris Saint Germain et Paris Musketeers), des tokens dépassant le milliard de dollars d'évaluation (BONK, PONKE, Samoyed, etc...) et des collections de NFT avec des millions de NFT vendus (DeGods & y00ts, Solana Monkey Business, Claynosaurz, Degenerate Ape Academy, Chimpers, et plus encore). La mission d'Octo Gaming est de devenir la première plateforme à propulser les millions de joueurs du Web 2.0 au Web 3.0 grâce à son application de jeu.","links":"https://octo-gaming.com/","market_cap":426159,"market_cap_rank":4814,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/octo-gaming_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"octo82drBEdm8CSDaEKBymVn86TBtgmPnDdmE64PTqJ","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/octo82drBEdm8CSDaEKBymVn86TBtgmPnDdmE64PTqJ"}},"is_native":false}