{"name":"Achain","id":"achain","symbol":"act","description":"Achain is a public blockchain platform that enables developers of all levels to issue tokens and create smart contracts, decentralized applications, and blockchain systems. Achain is committed to building a global blockchain network for information exchange and value transactions. Unlike <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> or <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a>, Achain utilizes a modified version of <a href=\"https://www.coingecko.com/en?hashing_algorithm=Delegated+Proof-of-Stake&view=market\">DPoS</a> — RDPoS (Result-delegated Proof of Stake) to establish node consensus. Shortly, DPoS suggests that all coin holders vote for the validator nodes that will produce the next blocks. On the project website, only info about CEO Tony Cui is listed. Cui has a few significant accomplishments, including winning the Future Star award from the Zhongguancun Alliance and being listed in the 30 under 30 on CYZONE, a famous venture capital magazine. On LinkedIn, 51 people are listed as employees at Achain. Most of the team is based in Beijing. Achain also has a few key industry partners. It has even co-organized a “Blockchain Technology Open Course” with Tsinghua University, which is widely recognized as one of the world’s top universities. The roadmap for Achain development is fairly detailed. However, most goals listed are development-oriented rather than marketing or design. Still, it’s important to note that focusing on making the protocol interoperable and building a technology that is more accessible to mainstream adoption could also be considered a marketing-oriented part of this project. There are three major phases with projected completion dates listed. These include Singularity (completed Q1), Galaxy (ongoing), and Cosmos (complete at the end of Q4). One thing to note is that dates for these phases are not consistent between the homepage and the whitepaper. This could be simply due to a scenario in which phase names remain the same while new goals and timeline dates within those phases continue to change. In January 2019, the project will update the website to reflect roadmap goals for the new year. Looking at the current landscape of blockchain projects, Achain certainly offers the possibility of much-needed technical innovations. The ability to easily create an Achain fork, as well as, the protocol’s unique RDPoS consensus algorithm make this a promising project. It will be interesting to see how Achain builds upon its accomplishments, and how the project team continues to develop a long-term strategy for improving the protocol’s technical capabilities and increasing participation in its ecosystem.","links":"https://www.achain.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/achain/logo.png"}