{"name":"ISLAMICOIN","id":"islamicoin","symbol":"islami","description":"\"What Is ISLAMICOIN ISLAMICOIN is a cryptocurrency creating a solution to financial independence for the future of the Global Muslim community aiming to assert its presence in the top financial markets. Built on Blockchain technology, ISLAMICOIN token is a leading independent coin in the evolving world of cryptocurrency, where the efforts of the Muslim communities will be gathered and united to achieve strong Islamic economy. Furthermore, ISLAMICOIN will eventually be built and housed exclusively on an Islami Blockchain that will grow and prove its competency and presence in the worldwide financial trading platforms along with creating an online marketplace that will empower future e-commerce businesses and transactions with trust, transparency, and minimal fees. This development of a unique platform allows for a broad extensive tokenization for individuals, organizations, corporations as well as decentralized finances (DeFi). ISLAMICOIN will be in compliance with the values and ethics of the Islamic religion through integrating the success of ISLAMICOIN with the main pillars of Islam, this means an investment in ISLAMICOIN is also an investment in humanitarian and charitable causes around the globe. ISLAMICOIN will be a reliable blockchain encompassing the organizations, businesses and companies working under Islamic finance, promoting Halal products, noble causes and services. ISLAMICOIN will offer an environment where online transactions using your digital wallet are easily made, using computers or mobile devices. Our services will help sellers meet consumer expectations, along with powerful product search and display. Who We Are ISLAMICOIN is run by a network of professionals spread around the world, including team leaders and successful businessmen and entrepreneurs in the fields of finance, cryptocurrency, media and trade. In comparison to other blockchain based projects, the greatest advantage of ISLAMICOIN is being supported by brilliant and trusted names and brands in the world of Muslim finance, organizations, companies, businesses and charities around the world. This worldwide involvement of the Muslim world will prompt the establishment of a network for tokenization that can be easily used by individuals, as well as professionals and corporations. The ISLAMICOIN project is the first program aimed to the crypto investors community but also to every Muslim individual and family, allowing them to trade, invest, and learn about crypto assets. Built and devised based on the latest blockchain technology developed by Polygon chain, ISLAMICOIN is a cryptocurrency created to establish and launch a secure and reliable Islamic International currency uniting and gathering the Islamic world in its trade and commerce exchanges, financial transactions, production industry and culminating in the first ever online marketplace for e-commerce where buyers and sellers can directly connect and have an optimized online shopping experience. ISLAMICOIN was founded upon this principle: Empower the global Muslim community with a strong asset that allows fast, secure transactions and creates decentrelized financial independence. ISLAMICOIN will be a leading project in the Muslim world and will open a wide, secure and promising future for all the investors, businesses and individuals involved. An increase of 35% is expected in the global Muslim population by 2030, rising to 2.2 billion, and if the current trends continue, Muslims will make up 26.4% of the world’s population in 2030 according to reports and statistics. It is also well known that the proportion of the population up to 19 years of age is the highest among Muslims. Adding to that, surveys reveal that 94% of all cryptocurrency buyers are between 18-40 years old, and data shows that there’s a clear correlation between age and the possibility to buy cryptocurrency, proving that cryptocurrency ‘s major audience and market is a young one. ISLAMICOIN in all the projects and the future steps is relying on trusted market research and studies as well as a futuristic vision and trust in being a key partner for the Muslim communities and generations all over the world. ISLAMICOIN Contract ISLAMICOIN contract is deployed on “Polygon Technology” to provide the cheapest gas fees & high transaction speed for our investors. At the same time benefiting from all the security of Etheruem Block Chain. POLYGON is a protocol and a framework for building and connecting Ethereum-compatible blockchain networks. Aggregating scalable solutions on Ethereum supporting a multi-chain Ethereum ecosystem. ISLAMICOIN contract is built on solidity version 0.8.4 (latest stable version), the contract code will be available on github https://github/islamiblockchain & Polygon Scan. https://polygonscan.com/token/0x9c891326fd8b1a713974f73bb604677e1e63396d All code is visible and can be reviewed by anyone. ISLAMICOIN contract is the first contract that introduce Charity percentage (2.5%) for every transaction, which is paid by the contract itself not the investor because interest considered Haram in Islam. Charity percentage is paid from ISLAMICOIN contract to a new contract called Bayt Al-Mal which tokens will be locked for 1 year before distribution for charities after ISLAMICOIN community votes on eligible ones.\"","links":"https://islamicoin.finance","market_cap":262320,"market_cap_rank":5344,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/islamicoin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":7,"contract_address":"0x9c891326fd8b1a713974f73bb604677e1e63396d","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x9c891326fd8b1a713974f73bb604677e1e63396d"}}}