{"name":"Tezos","id":"tezos","symbol":"xtz","description":"Tezos is a coin created by a former Morgan Stanley analyst, Arthur Breitman. It is a smart contract platform which is does not involve in mining Tezos coins. It is a coin that promotes themselves on major ideas of self-amendment and on-chain governance. It is an <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a>-like blockchain that hosts smart contracts. It allows the community to vote and improve its flaws. Any token holder may delegate their voting rights to others in the network. The coin uses a generic network shell which allow different transaction and consensus protocols that a blockchain needs to be compatible. The source code is implemented on OCaml which is a fast, flexible and functional programming language which should suit an ambitious project and its technical requirements. Tezos’ proof-of-stake consensus algorithm is different from the <a href=\"https://www.coingecko.com/en?hashing_algorithm=Delegated+Proof-of-Stake&view=market\">delegated proof-of-stake (dPOS)</a> where they go by the name liquid proof-of-stake. This liquid proof-of-stake that Tezos uses focus in filling the gap between both security and decentralization but still being able to take advantage of the benefits that delegated proof-of-stake offers. The staking process in Tezos is called “baking”. In this blockchain, bakers who make deposits will be rewarded for signing up and publishing blocks. However, if a baker commits any bad behavior the deposits will be forfeited. Baking & Endorsing Baking is what Tezos refers to as the action of signing and publishing a new block in the chain. Bakers need at least 8,000 XTZ to qualify as a delegate, and having additional delegated stake increases their chances of being selected as a Baker or Endorser. At the beginning of each cycle (4096 blocks), the Bakers for each block are randomly selected and published. Bakers earn a block reward of 40 XTZ for baking a block. In addition to the Baker, 32 Endorsers are randomly selected to verify the last block that was baked. Endorsers receive 1.25 XTZ for each block they endorse. Block Rewards & Inflation Block rewards are funded by protocol defined inflation. Rewards are calibrated so that the number of XTZ tokens grows at roughly 5.5% per year. If 100% of Tezos tokens are delegated, the annualized yield will be 5.5%. As of May 2021, approximately 78.8% of Tezos tokens have been delegated, including the 10% owned by the Tezos Foundation, so the annualized yield is roughly 5.8%. To ensure Bakers and Endorsers act honestly, they are required to post a security deposit for each block they Bake or Endorse. They forfeit this deposit in the event of malicious activity, such as double baking or double endorsing a block. In 2018, Tezos successfully launched their main network after delaying the launch due to corporate governance disputes. The Tezos foundation planned to transition the network to a mainnet, or a more complete version. The foundation has also raised $232 million in July 2017 to build the network and issue a new type of cryptocurrency to its backers in one of the largest- ever initial coin offerings. The founders have also made it clear in their blog that the network is using a new blockchain technology hence unexpected issues may still occur affecting the network. Check out <a href=\"https://www.coinbureau.com/review/tezos-xtz/\">CoinBureau</a> for the complete review of Tezos.","links":"https://www.tezos.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tezos/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}