{"name":"Stoopid Cats","id":"stoopid-cats","symbol":"stocat","description":"Stoopid Cats is a character IP and game-driven Web3 project focused on bridging traditional (Web2) entertainment and blockchain (Web3) utility through a unified ecosystem. Launched in April 2024 by a team of game developers, artists, and strategists, the project is preparing for its token launch on centralized exchanges in May 2025. At the heart of Stoopid Cats is a cultural and emotional message: “Be Stoopid: see the little joy in life.” This motto encourages a shift in perspective, reminding people to embrace simple, positive moments rather than overthinking and stress. It serves as both a branding foundation and a guiding philosophy for the project’s content and community. The Stoopid Cats ecosystem includes ongoing development of play-to-earn (P2E) and hyper-casual mobile games, built to engage both traditional and Web3-native gamers. These titles integrate optional blockchain features without compromising accessibility, allowing the brand to reach wider audiences while offering deeper utility to NFT and token holders. In addition to gaming, the project is building a character-driven IP business supported by real-world revenue sources such as merchandise and licensing partnerships. Physical products are designed to extend the brand beyond digital spaces, reinforcing long-term value and recognition. The project features three NFT collections, each contributing more than just access or rewards. These NFTs serve as keys to an evolving ecosystem - offering DAO-based voting rights, participation in exclusive campaigns, and future utilities within the broader platform. $STOCAT is the native token of the ecosystem. It will be used across staking, in-game purchases, and future merchant integrations. A dedicated staking protocol is under development, enabling NFT holders to receive quarterly token rewards tied to net income generated from games, merchandise, and partnerships. Additionally, Stoopid Cats is developing a unique NFT-based lending platform, which will tie into a planned $STOCAT-powered online casino - combining gamification, utility, and financial features under a single cohesive environment. Rather than approaching the project as a short-term Web3 launch, Stoopid Cats is structured for synergetic, sustainable growth. The team is focused on long-term execution across gaming, character IP, merchandise, and blockchain integrations, while embedding the \"Be Stoopid\" philosophy as a relatable lifestyle message for a global audience. With an expanding roadmap, community-centered tokenomics, and scalable IP potential, Stoopid Cats presents a multi-layered ecosystem blending the Be Stoopid movement, interactive products, and practical utility - designed for both cultural relevance and long-term value creation.","links":"https://stoopidcats.com/","market_cap":525632,"market_cap_rank":4454,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stoopid-cats/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"9Da97ub4u2jEoDH6htMqkPdifah4odmQreJcfZza2mHJ","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/9Da97ub4u2jEoDH6htMqkPdifah4odmQreJcfZza2mHJ"}}}