{"name":"Alien","id":"alien","symbol":"alien","description":"ALIEN stands as a groundbreaking 100% decentralized protocol that fortifies the pTGC ecosystem through an innovative buy-and-burn mechanism involving pTGC, LIQUID, BURN, and 808 with every transaction. Holders are consistently rewarded with a steady influx of pTGC and its amplifiers, excluding Energy. Notably, 1% of each transaction contributes to the acquisition and subsequent burning of ALIEN tokens. The remaining tax is allocated to the purchase and burning of pTGC, along with the amplifiers mentioned, creating a deflationary dynamic for ALIEN. All initial liquidity pools have been entirely burned, and an impressive 23% of the total supply has been eliminated. ALIEN's initial valuation at $30,808 showcases its commitment to sustainability and value appreciation within the pTGC ecosystem. In comparison to its counterparts, ALIEN mirrors the relationship between TEDDY and the pDAI & ATROPA ecosystems, but with a heightened level of generosity and rewards. As the pioneering meme token paying homage to the pTGC ecosystem and its holders, ALIEN was crafted by the people, for the people. Stakers of pTGC, holding all the amplifiers, have been bestowed with a remarkable 1:1 airdrop of ALIEN, initially valued over $37k. The rallying cry of \"THE FIRMAMENT AWAITS US\" welcomes users to an ecosystem where the firmament is not just a destination but a shared vision. ALIEN embraces a comprehensive tokenomics structure, with a nuanced buy-and-burn mechanism and a spectrum of rewards, making it a distinctive player in the crypto landscape. Join the journey and experience the rewards that await in the firmament. ALIEN stands as a groundbreaking 100% decentralized protocol that fortifies the pTGC ecosystem through an innovative buy-and-burn mechanism involving pTGC, LIQUID, BURN, and 808 with every transaction. Holders are consistently rewarded with a steady influx of pTGC and its amplifiers, excluding Energy. Notably, 1% of each transaction contributes to the acquisition and","links":"https://www.alienpls.tech/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alien/logo.png","detail_platform":{"pulsechain":{"decimal_place":18,"contract_address":"0x1b7b541bea3af39292fce08649e4c4e1bee408a1"}}}