{"name":"Vault Hill City","id":"vault-hill-city","symbol":"vhc","description":"\"Vault Hill aims to create a metaverse called Vault Hill City (VHC) – a collection of virtual shared space including the sum of all virtual worlds and the Internet. In VHC, users can interact with computer-generated imagery (CGI) and other users. We believe eXtended reality (XR), a mix of virtual reality, augmented reality, and mixed reality is at the forefront of enhancing human experiences whilst leveraging the power of blockchain, artificial intelligence and cloud computing technologies. This supports the innovation of Web 3.0. VHC proposes to build the first extended reality metaverse focusing on themes of the basic human instincts, such as curiosity, vision, community, idealism, vitality, romance, and imagination. In building this, we are starting with the infrastructure of the metaverse, which is virtual real estate and a product – Virtual land ($VLAND), a non- fungible token (NFT). The virtual real estate will be designed using urban planning to give developers and users a sustainable and dynamic experience. Market Conditions: As more decentralised metaverses are created, standardising the use throughout the Blockchain is imperative. In the current state of play, real estate prices fluctuate, land parcels frequently remain undeveloped, and v-commerce adoption is limited. Furthermore, the XR hardware is not cost-effective, adding to other market factors that challenge the virtual real estate space and widespread adoption. Problem Assessment: The key challenges are the lack of intuitive and rich user experience for users, substandard in-built metaverse developer applications for content developers. This is mainly due to poor development as most metaverses leverage open-source applications with poor CGIs and output; coupled with poor mesh optimisation. Ramifications and Repercussions: Poor CGIs negatively impact the fully immersed and interactive user experience coupled with several factors that have slowed VR/AR technology adoption rates. Notwithstanding, significant upsides remain for VR/AR technology and the industry as a whole. According to Goldman Sachs, the VR/AR industry had a value of $40.4 billion ($24.1 billion – software and $16.3 billion – hardware) as of 2020 with a predicted value of $80 billion ($35 billion – software and $45 billion – hardware) by 2025. The promise of a Better Solution: Vault Hill aims to build an extended reality metaverse that makes us feel a bit more human every time we visit. A limitless world with a guiding principle to enhance the human experience.\"","links":"https://vaulthill.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vault-hill-city/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x51b5619f5180e333d18b6310c8d540aea43a0371"}}}