{"name":"ZKX","id":"zkx","symbol":"$zkx","description":"The $ZKX token serves as the governance token for the ZKX platform, an omnichain exchange on Ethereum and Starknet. ZKX is the first Perpetual Trading DEX where SocialFi meets DeFi. Users can enjoy the OG Trade gamified terminal with 30 min PVP trading battles, leaderboards, and ZKX Clans. With Pro Trade, they get advanced trading tools, diverse market order types, efficient cross margin, 24h daily competitions, and rewards. The $ZKX token will power the appchain and all the upcoming social trading features. Holders of the $ZKX tokens can stake their tokens in order to unlock governance power, earn a share of the protocol's revenue in USDC, and gain long-term benefits for the community. <b>How can you earn and use $ZKX?<b> You can earn $ZKX through trading and staking activities. For trading, ZKX hosts ongoing trading competitions that are open to everyone, allowing participants to trade and earn $ZKX tokens. The dual token rewards system offers a high API and presents a tangible opportunity for active traders. For staking, users can participate in a time-locked staking pool. The time and amount of $ZKX tokens staked determine the voting power within the ZKX DAO. To ensure healthy tokenomics, ZKX introduces a staking mechanism that shares protocol revenue with ZKX stakers, incentivizing token holders to lock supply out of the market. The longer they stake the tokens for, the more % of the revenue they can capture. Where can you buy ZKX? $ZKX tokens are currently unavailable to trade on exchanges listed on CoinGecko. Information will be updated when the token is available on centralized/decentralized exchanges. When can we expect ZKX ($ZKX) tokens to launch? $ZKX token is set to launch on June 19th. On this date, $ZKX will be listed on major cryptocurrency exchanges, including Gate.io and Kucoin. Stay updated on further announcements and $ZKX's price movements by adding $ZKX to your watchlist.","links":"https://zkx.fi/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zkx/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb91d822dfef943165f368d92c16bac9bd5ec6842"},"starknet":{"decimal_place":18,"contract_address":"0x0256c74b33f5734c68402cd9433dfa77856f62c6940f54591874527cf898a924"}}}