{"name":"AstraZion","id":"astrazion","symbol":"aznt","description":"The AZNT Token is the first cryptocurrency token designed to adapt to changing market conditions and rules, and its users have ultimate control over it. It is a platform that values human life, as indicated by its tagline, \"Being Human is Given, but Maintaining Our Humanity is a Choice.\" \"By keeping our word, we hope to meet the basic human needs of people who don't have a place to live, no one to turn to for help, and no resources with which to meet their basic human needs.\" The AZNT Token is a TRC-20 token, which is the token standard used by Tron. We've noticed that investors are looking for new fair launch tokens that will allow them to maximize their profits in a short period. We chose Tron, however, to indicate to our users that they are our primary emphasis. As a result, our cryptocurrency will be more stable and likely to survive than existing centralized and distributed cryptographic forms of money. Mission Our client base and expansion objectives are vigorously sought by empowering newcomers and developing a strong community commitment to foster trust and address any problems that may emerge between the focal and members of our natural environment. Keeping the price of our token as a motivator for our representative holders. We must achieve our goal of providing a safe environment for our customers. We have no reservations about reaching an agreement on improvements to our understanding that will help our community, particularly homeless people in critical need of support. We do not want to see the market manipulated in any way. We are constantly looking for innovative methods to improve the lives of homeless people because we think that More Is Possible. In a variety of locations, we aim to provide a haven, permanent housing, and supportive services to persons experiencing chronic homelessness.","links":"https://www.aznt.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astrazion/logo.png","detail_platform":{"tron":{"decimal_place":6,"contract_address":"TD74cpU4JfMKhuWVs6uKYXKUy8nvC6EQ95","geckoterminal_url":"https://www.geckoterminal.com/tron/tokens/TD74cpU4JfMKhuWVs6uKYXKUy8nvC6EQ95"}}}