{"name":"SAKURA UNITED PLATFORM","id":"sakura-united-platform","symbol":"sup","description":"SAKURA UNITED PLATFORM is a guild platform that aims to achieve “inequality reduction” and “equal opportunities” using Web3 technologies, including blockchain and cryptocurrencies, with the concept of “Blooming Smiles to People Around the World”. It was launched as Sakura Guild Games in November 2021 and changed its name to SAKURA UNITED PLATFORM in November 2022. Guilds (professional unions) in the context of Web3 started with GameFi Guilds (professional unions) in 2021 and underwent rapid market expansion in a short period of time. The guild (professional union) concept of the SAKURA UNITED PLATFORM aims to utilize Web 3 technologies to address challenges in existing markets. Starting with the gaming industry, we will expand our scope to industries such as the travel industry, influencer industry, food and beverage industry, environmental industry, etc, with the focus to promote \"market expansion\" and \"employment growth\" within these industries. Based in Singapore, the company was launched in November 2021 with the vision of “making people’s smiles bloom around the world,” aiming to build a “community platform” to support the “new community” and “new economic zone (X-Fi Economic Zone)” pioneered by web3. Also aiming to solve poverty and employment problems in Southeast Asia, the company started the operation of SAKURA GUILD GAMES, a Blockchain Game guild that supports the Game-Fi community. SAKURA UNITED PLATFORM has achieved rapid growth in its approximately 1.5 years of establishment. Leveraging our expertise in decentralized finance within the blockchain industry, we will actively execute a strategic M&A strategy to capitalize on a leading position in the rapidly growing Web3 sector. SUP token holders have the ability to purchase NFTs with various utilities on the SUP Guild Community Platform. Our roadmap includes expanding the range of utilities in the coming future.","links":"https://sakura-sup.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sakura-united-platform/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf5ec1a08902ae0ae5323466c35ea49a37409e4ca"}}}