{"name":"StarLink","id":"starlink","symbol":"starl","description":"Launch into the new frontier of virtual space with the STARL Metaverse. Adventure through the cosmos alone or with others and discover space stations where you can meet people, trade items and NFTs, access various gaming experiences and entertainment, modify your spaceship, learn, craft, and create. The $STARL token will be your key to everything in the metaverse. It is the currency for the first truly decentralized metaverse project: 100% unlocked, renounced, and community-driven. The STARL Metaverse Project is the first crypto project to onboard a AAA game design and development team with over two decades of experience, including work for PlayStation, Disney, Lionsgate Entertainment, Lucasfilm, Pixar, and the LEGO group. STARL will be the bridge between the professional gaming industry and cryptocurrency. The STARL Metaverse will act as a gaming launchpad, with the first game Warp Nexus being adapted and developed by Wyrmbite Studios. Warp Nexus is a vast space exploration and play-to-earn space MMO. Use the $STARL token to build and modify ships, hire other pilots to help guide or battle through missions, trade useful or cosmetic items and upgrades, and much more. The STARL Marketplace is the interconnection between the metaverse, games, and blockchain. Use it to find, create, and trade NFT items for your adventures and virtual life in space. The Marketplace is where artists can list their creations, explorers can sell their found treasures, pilots can hunt for ship upgrades, and users can shop for unique customizations for their avatars and virtual real estates. Anything is possible in the metaverse when it is in space, and this is just the beginning.","links":"https://www.starlproject.com/","market_cap":5407623,"market_cap_rank":2296,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/starlink/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8e6cd950ad6ba651f6dd608dc70e5886b1aa6b24","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x8e6cd950ad6ba651f6dd608dc70e5886b1aa6b24"}}}