{"name":"Galvan","id":"galvan","symbol":"ize","description":"What is Galvan? Galvan is a gamified Web3 health and wellness platform founded by healthcare and blockchain experts with the mission to “galvanize” humanity to invest in wellness. This mission is being accomplished through an ecosystem that rewards you for making healthy choices, informs you about ways to care for yourself and others, and empowers you to own and control your health data. By leveraging blockchain technology and a unique Proof of Action distribution algorithm, Galvan is turning self-care into a reward-generating activity and reintroducing personal accountability. What is IZE? Put Galvan and IZE together and you get galvanize: to shock or excite someone into taking action. IZE is the native utility token of the Galvan Blockchain and incentivizes all the right actions in the ecosystem, from running a node to going on a run. IZE is used for: - Fees for processing transactions - Staking for new voting proposals - Rewarding active Node Owners - Rewarding healthy decisions in the Galvan Wellness App (coming soon) - Purchasing health and wellness products in the Galvan Marketplace (coming soon) You can get a deeper dive of IZE in Galvan’s Litepaper: https://www.galvan.health/litepaper What is the Galvan Blockchain? The Galvan Blockchain is a layer-2 of Ethereum focused specifically on empowering wellness. It is unique for three reasons: 1. The “Proof of Action” distribution algorithm that follows Swiss utility token standards 2. Scalable blockchain-rewards system for healthy actions 3. Easy participation through Node Software The long-term vision of the Galvan Blockchain is to become the foundation for health and wellness data and transactions. Imagine a world where you can store and manage a decentralized health record, earn rewards and subsidize healthcare costs through healthy actions, and participate in peer-to-peer research studies—all powered by the Galvan Blockchain.","links":"https://www.galvan.health/","market_cap":1302236,"market_cap_rank":2590,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/galvan/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0xf7e945fce8f19302aacc7e1418b0a0bdef89327b"}}}