{"name":"OnPulse","id":"onpulse","symbol":"opls","description":"What is the project about? OnPulse is a sacrifice and IDO launchpad platform that allows startups building on the PulseChain blockchain to launch their own token through a decentralized fundraising process called a sacrifice that eventually results in an initial DEX offering (IDO) on PulseX. What makes your project unique? Our launchpad provides a variety of services to help startups prepare for launch, including creating custom sacrifice pages, marketing, development, legal, and technical support. Extensive due diligence is performed on projects seeking funding, and approved projects are given access to create sacrifice pools that are then presented to potential sacrificers. Sacrificers who believe in the team, mission, vision, and values can then donate tokens using a predefined list of cryptocurrencies, such as PulseChain, HEX, or PulseX, for the duration of the sacrifice period. History of your project. Starter Labs (https://starterlabs.xyz) is the company behind OnPulse, launching its first IDO and vesting products in February 2021 as a decentralized launchpad initially for Binance Smart Chain, followed by Polygon, Fantom, Avalanche, and Ethereum, eventually growing to 18 full-time staff and becoming the #1 launchpad in the blockchain industry by Q4'2021 based on ROI, according to a CryptoRank report. What’s next for your project? With a knack for identifying ecosystems with great potential, we look forward to combining our decades of technical and entrepreneurial experience with our extensive network to aid in the growth of the PulseChain ecosystem. What can your token be used for? In order to sacrifice your tokens for projects in OnPulse, you must stake OPLS to qualify for a certain tier. Your Voting Power for approving or denying Community projects is also based on the amount of OPLS you have staked.","links":"https://starterlabs.xyz/onpulse","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/onpulse/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}