{"name":"Ecoterra","id":"ecoterra_ethereum","symbol":"ecoterra","description":"Ecoterra is a blockchain ecosystem that was initiated on the 1st of April, in Bucharest, Romania, by a team experienced in recycling and business. It integrates several functionalities to engage individuals and businesses in actions that support climate change mitigation. One function, the 'Recycle2Earn' (R2E) application, allows users to earn Ecoterra tokens when they recycle various materials, associating a certain amount of Ecoterra with each recyclable item. This app is a part of the ecosystem's effort to promote waste management and environmentally-conscious habits. The ecosystem also includes a Carbon Offset Marketplace, a platform where users can use Ecoterra or other cryptocurrencies to counterbalance their carbon emissions by investing in carbon offset projects. This feature offers a direct connection between digital currencies and environmental impact mitigation. Further, Ecoterra provides a Recycled Materials Marketplace where businesses can purchase recycled materials such as plastic, glass, and aluminum using Ecoterra or other cryptocurrencies. The aim is to support the use of recycled materials and encourage responsible consumption. The fourth feature is the Impact Trackable Profile, a tool designed for individuals and businesses to record and display their environmentally friendly actions. This feature can help build an 'eco-portfolio', demonstrating a commitment to sustainability and potentially fostering customer loyalty. In essence, Ecoterra is a blockchain ecosystem combining several features - the R2E app, the Carbon Offset and Recycled Materials Marketplaces, and the Impact Trackable Profile. This project, originating from Bucharest, Romania, represents an approach to align economic incentives with climate change mitigation actions, encouraging waste management, responsible consumption, and the use of recycled materials.","links":"http://www.ecoterra.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ecoterra/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x982b50e55394641ca975a0eec630b120b671391a","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x982b50e55394641ca975a0eec630b120b671391a"}},"is_native":false}