{"name":"INFinitar Coin","id":"infinitar-coin","symbol":"inf","description":"In the current era, the gaming industry has witnessed the meteoric rise of Multiplayer Online Battle Arena (MOBA) games, captivating audiences across the globe. These highly competitive titles have not only generated billions in revenue but have also fostered thriving communities and professional esports scenes. Infinitar, as a MOBA game built on the principles of Web3, is poised to redefine the gaming experience and serve as a gateway to the emerging Metaverse. Game Modes: Infinitar supports multiple arena modes, including 421 levels of personal ranking, 3v3, and 5v5 battles, catering to diverse player preferences. Heroes and Costumes: The game offers a wide variety of hero characters and costumes, each with unique strengths, weapons, and skills, allowing players to customize their gameplay experience. Social System: Infinitar enhances the overall gaming experience by incorporating social interactions both inside and outside the game, fostering a strong community. NFT Marketplace: The game features an NFT marketplace that facilitates the buying and selling of various NFT items, promoting decentralized ownership and digital scarcity. Game Economic Model: Infinitar employs an economic model with extensive consumption and usage scenarios, ensuring a sustainable in-game economy. Token and Economy The game's token, INF, plays a central role in the Infinitar ecosystem. Players can use INF to acquire blind boxes, which unlock a variety of heroes and weapons, further enhancing their gaming experience. Additionally, the INF token serves as the medium of exchange in the NFT marketplace, where players can trade heroes and other items.","links":"https://www.infinitar.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/infinitar-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf77d81766e42f377159a5512858afc012809c7e6"}}}