{"name":"Cosmos Hub","id":"cosmos","symbol":"atom","description":"The Cosmos network consists of many independent, parallel blockchains, called zones, each powered by classical Byzantine fault-tolerant (BFT) consensus protocols like Tendermint (already used by platforms like ErisDB). Some zones act as hubs with respect to other zones, allowing many zones to interoperate through a shared hub. The architecture is a more general application of the Bitcoin sidechains concept, using classic BFT and Proof-of-Stake algorithms, instead of Proof-of-Work.Cosmos can interoperate with multiple other applications and cryptocurrencies, something other blockchains can’t do well. By creating a new zone, you can plug any blockchain system into the Cosmos hub and pass tokens back and forth between those zones, without the need for an intermediary. While the Cosmos Hub is a multi-asset distributed ledger, there is a special native token called the atom. Atoms have three use cases: as a spam-prevention mechanism, as staking tokens, and as a voting mechanism in governance. As a spam prevention mechanism, Atoms are used to pay fees. The fee may be proportional to the amount of computation required by the transaction, similar to Ethereum’s concept of “gas”. Fee distribution is done in-protocol and a protocol specification is described here. As staking tokens, Atoms can be “bonded” in order to earn block rewards. The economic security of the Cosmos Hub is a function of the amount of Atoms staked. The more Atoms that are collateralized, the more “skin” there is at stake and the higher the cost of attacking the network. Thus, the more Atoms there are bonded, the greater the economic security of the network. Atom holders may govern the Cosmos Hub by voting on proposals with their staked Atoms.","links":"http://cosmos.network/","market_cap":4000890699,"market_cap_rank":48,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cosmos/logo.png","detail_platform":{"cosmos":{"decimal_place":6,"contract_address":"uatom"},"evmos":{"decimal_place":6,"contract_address":"0xc5e00d3b04563950941f7137b5afa3a534f0d6d6"},"osmosis":{"decimal_place":6,"contract_address":"ibc/27394FB092D2ECCD56123C74F36E4C1F926001CEADA9CA97EA622B25F41E5EB2"},"canto":{"decimal_place":6,"contract_address":"0xeceeefcee421d8062ef8d6b4d814efe4dc898265"},"kava":{"decimal_place":6,"contract_address":"0x15932e26f5bd4923d46a2b205191c4b5d5f43fe3"},"archway":{"decimal_place":6,"contract_address":"ibc/27394fb092d2eccd56123c74f36e4c1f926001ceada9ca97ea622b25f41e5eb2"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0eb3a705fc54725037cc9e008bdede697f62f335"}}}