{"name":"StakeStone","id":"stakestone","symbol":"sto","description":"StakeStone is a decentralized liquidity infrastructure protocol designed to optimize yield generation and liquidity distribution across blockchain networks. It's solutions, including LiquidityPad and yield-bearing ETH/BTC assets, empower liquidity providers with efficient earning opportunities while meeting the specialized liquidity needs of ecosystems and protocols. **`StakeStone's Product Includes:`** `Yield-bearing and liquid ETH / BTC assets, including STONE, SBTC, and STONEBTC.` - `STONE: STONE is the stable, yield-bearing liquid ETH powered by an adaptive staking network that supports various risk-free consensus layers. By integrating adaptable underlying yield strategies through an on-chain proposal mechanism(\"OPAP\"), StakeStone ensures yield opportunities are optimized while omnichain liquidity is seamlessly redistributed across ecosystems and protocols.` - `SBTC and STONEBTC: SBTC is a liquid, index BTC designed to enhance the usability of wrapped custodial BTC derivatives by leveraging its inherent redemption liquidity to provide robust omnichain liquidity. STONEBTC is a yield-bearing BTC derivative designed to unlock the full earning potential of Bitcoin holdings while maintaining seamless liquidity across DeFi ecosystems. By integrating advanced BTC yield strategies across (DeFi, CeDeFi, and RWA), STONEBTC allows users to earn sustainable yields without sacrificing flexibility or utility.` - `LiquidityPad: StakeStone LiquidityPad is an omnichain liquidity platform designed to help blockchain ecosystems and protocols launch customized liquidity fundraising strategies. By leveraging StakeStone's yield-generating infrastructure and Ethereum's deep liquidity, LiquidityPad enables efficient liquidity acquisition tailored to the unique needs of each ecosystem. As an on-chain liquidity distribution hub, LiquidityPad seamlessly channels liquidity from Ethereum to specialized blockchains while optimizing capital deployment for ecosystem growth.`","links":"https://stakestone.io/","market_cap":16131059,"market_cap_rank":1252,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stakestone/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1d88713b483a8e45cff0e5cd7c2e15e5fab4534d"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xdaf1695c41327b61b9b9965ac6a5843a3198cf07"}}}