{"name":"BitValley","id":"bitvalley","symbol":"bitv","description":"What is Bitvalley? The Bitvalley idea is to be the biggest ecosystem in Crypto. What does that mean? It means that we will develop a lot of products but all the products will use the same token which is BitV. By investing in Bitvalley you invest in all of these projects. How will we start to build this ecosystem? Well, we already have. We have our first and second product already developed which are Bitdash and NFT Marketplace, also our third platform Bitvalley Mobile App (Which is our main product) is already in progress and it will have multiple products inside. Our products: Bitdash (Already developed) NFT Marketplace (Already Developed) Bitvalley Mobile App (Development in Progress) About Bitdash Bitvalley Dashboard is an all-in-one dashboard for our holders. All you need to do is connect your preferred wallet and voila everything pops up and at your disposal. One of major features is tracking your bitvalley tokens, rewards, upcoming rewards and allows you to claim your pending rewards with a click of a button or you can leave them to be distributed automatically once the threshold is reached, however you like you have the option but that’s not all we offer you directly on our dashboard to stake your tokens and earn up to 100% more BUSD rewards. All you have to do is stake your tokens on BitDash for a month and enjoy the rewards. Bitvalley dashboard allows you to track everything about bitvalley including: Statistics, Status, New proposals, Progress bar for every new task, Upcoming plans and Much More. Bitvalley NFTs The BitValley NFT Marketplace will be simple and easy to use, it will be the best place to mint our own Amazing NFTs our Marketplace will not be just for us, individuals or projects can mint their NFTs there as well, the price to mint is the most affordable price on the Market. The BitValley NFTs will be divided into categories. In total there will be 4 categories of our own native BitValley NFTs. Each of those categories will be unique both in design and look also on their benefits that come along with owning any of them. Yes, our native NFTs will all have benefits, that’s why we decided to divide them into categories, which means each category will have its own benefits. And the best part we have found a way to link each NFT category to benefit each other. Bitvalley App The BitValley app is our main product and will be our All-in-One Crypto Related Mobile App which will also have its Web based Platform. BitValley will have multiple products inside one Mobile App. 1. Tutorials and Courses (Subscription based) 2. News (Crypto Related Articles) 3. Listings (Listing crypto projects) 4. Secure payment options (Contract based, Bitvalley being the middleman) 5. Services (Freelance) 6. Upcoming Launches (Listing upcoming projects) 7. Trending Projects (Based on performance) 8. Secure Fund Storage and Swap 9. AMA’s 10. Giveaways 11. Categorized Open Chat","links":"https://bitvalley.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitvalley/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xdd8b490001d081ed065239644dae8d1a77b8a91f"}}}