{"name":"RC Celta de Vigo Fan Token","id":"rc-celta-de-vigo-fan-token","symbol":"cft","description":"The RC Celta de Vigo Fan Token is the BRC-20 smart contract designed to revolutionize fan experiences. With Token, RC Celta de Vigo provides fans with the opportunity to participate in exclusive surveys and events, create digital collections, purchase NFTs, enjoy gamification and mission features linked to fan rewards, missions and great experiences. CFT, RC Celta de Vigo Bitci Technology Fan Token can be used in the following functions. Survey and Events CFT Token holders can participate in Paid and Free Surveys or Events on the Bitci Fan Token Platform. Loyalty Subscription CFT Token holders will be able to use RC Celta de Vigo Tokens to receive fan rewards, digital collectibles, loyalty points and more. E-Commerce CFT Token can be included in RC Celta de Vigo's potential future e-commerce ecosystem, used as payment for shopping, products, tickets, memberships and more using BitciPay or FanApp. Advantages CFT Token holders can interact with RC Celta de Vigo on the Bitci Fan Token Platform, including signed products, to meet and greet one of the players or legends, one-on-one phone calls, entrance to the locker room, watching matches in VIP or similar areas, signed official products, limited edition collections. items etc. can take advantage of the benefits. Games and Quests CFT Token holders will have access to multiple missions and gamification features on the Bitci Fan Token Platform. Donation CFT Token holders will be able to donate directly to their favorite team and receive loyalty badges or nft in return. The CFT Token is issued on Bitcichain as a native BRC-20 token and provides RC Celta de Vigo fans with wider accessibility, greater functionality and low cost transactions. CFT Token Maximum Amount and Total Token Supply is 50,000,000. At the time of listing, its circulating supply is 30,000,000 units. (it will be 60% of the total token supply.).","links":"https://www.bitci.com/en/projects/CFT/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rc-celta-de-vigo-fan-token/logo.png"}