{"name":"YOM","id":"your-open-metaverse","symbol":"yom","description":"What is YOM? YOM is at the forefront of a paradigm shift in the gaming industry, spearheading the development of the first-of-its-kind DePIN (Distributed Physical Infrastructure Network). This innovative technology disrupts traditional cloud gaming by enabling the seamless streaming of high-quality games to any device with an internet connection. YOM's DePIN network eliminates the need for expensive gaming hardware typically associated with AAA gaming. By leveraging a distributed network of shared computing resources (nodes), YOM offers significant advantages: Global Low Latency: Stream games with minimal lag, regardless of location. Near-Zero Costs: Enjoy cost-effective cloud gaming experiences. Device Agnostic: Play on any device with an internet connection, from mobile phones to laptops. This innovative approach not only benefits gamers but also incentivizes node operators. Individuals can contribute their computing power to the network and earn passive income through the $YOM token. YOM's Evolution: Founded in 2020, YOM started as both a network and content provider. In 2024, they shifted their focus solely on DePIN infrastructure, leaving content creation to partners. This strategic move and the appointment of a seasoned leadership team attracted the attention of Outlier Ventures and Borderless Capital, propelling YOM's growth. The Future of YOM: YOM is actively expanding its DePIN network with the ambitious goal of accommodating millions of users on a single, fully distributed network. This unprecedented feat would significantly broaden the gaming market, making high-end titles accessible to anyone with an internet connection. To further solidify their position, YOM is actively: Onboarding Major Game Projects: Integrating established and upcoming titles into the network. Collaborating with Streaming Services: Providing interactive experiences through streaming platforms. Incentivizing Developers: Offering attractive programs to attract independent and established game creators. The $YOM Token: The $YOM token serves as the backbone of the YOM ecosystem. It functions as a reward mechanism for node operators, incentivizing network participation and growth. Additionally, a portion of each transaction is allocated towards burning tokens, ultimately benefiting all stakeholders by reducing the overall supply. YOM's DePIN technology presents a compelling vision for the future of cloud gaming. By offering unparalleled accessibility, cost-effectiveness, and developer empowerment, YOM is poised to reshape the gaming landscape and usher in a new era of immersive and universally accessible gaming experiences.","links":"https://yom.ooo/","market_cap":3882085,"market_cap_rank":2075,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/your-open-metaverse/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"yomFPUqz1wJwYSfD5tZJUtS3bNb8xs8mx9XzBv8RL39"}}}