{"name":"BHO Network","id":"bho-network","symbol":"bho","description":"What is BHO Network? BHO Network is built on BHO Chain (BHC-20) - a foundational and critical component of the BHO Network in enabling the development of a complete ecosystem based on blockchain technology. Our blockchain platform’s mission is to enable innovations from not only new projects with breakthrough ideas in this space but also support any companies who see blockchain as a solution to achieve intensive margin from current operations. Additionally, we aim to bring that support to all verticals including supply chain, media and entertainment, identity and credentials, healthcare, trade finance, financial services, government, digital assets, retail, and much more. Finally, the BHO network does not only include its own application but also all other applications developed on the BHO chain. What are Our Vision, Mission, and Core Values? Vision: BHO Network aims to become a global open blockchain ecosystem, beginning with the Southeast Asian market. BHO Network will be a flexible platform, to provide solutions for simple and practical blockchain applications. Mission: With a talented and enthusiastic young team, we provide user-friendly, safe, and risk-reduced blockchain products, making BHO Network an ecosystem rooted in real life. Core Values: C - Credibility: Our most important core value is credibility. We build our organization based on trust and deliver it to our customers through genuineness and transparency. A - Accessibility: BHO Network is made accessible to everyone to explore our products and ecosystem through ease of use and understanding. R - Result: We stay committed to our vision and mission to deliver the highest values to our investors & users. E - Empower: We empower our users and put the decision-making rights in our communities, staying true to the definition of decentralization. Who Are The Founders of BHO Network? Co-founder & CEO - Nhat Phan (Mr.). He is also the co-founder of VNbot - Capital Management System. Mr. Nhat Nhat himself has a solid background in CryptoCurrency, Social Media, Game Online MMORPG. Co-founder & CTO - Duong Le (Mr.). He is a Senior AI engineer, also the Co-founder of Guu and Polaris. What Does BHO Network Offer? With uniqueness in unparalleled transaction throughput and immunity to disruptions, yet at minimal costs, BHO Chain facilitates intelligent feature creation explicitly for the fulfillment of financial services by exploiting unique features of the blockchain. Moreover, we would like to introduce BHO, our native utility token, that is used for: * Transaction fees in BHO Chain and lending fees; * Rewarding for validator nodes on the network via staking BHO tokens, and in parachain crowd loan; * Exercising on-chain governance rights; * Participating in BHO Launchpad. What Makes BHO Network Unique? Utilizing the Substrate framework, BHO Network is dedicated to promote scalability through parachain and transaction’s efficiency, in response to the slow transaction times of other blockchains. Furthermore, the interoperability design and compatibility between chains allow different blockchains and applications to share information and functions. BHO Network blockchain is able to empower the NFT world whereas GameFi & Metaverse projects may utilize tokenization to convert their assets into NFTs and asset-based tokens as proof of creditworthiness for unlimited access to diverse financial services in the crypto space. The new-gen blockchain intends to extend support full tool kits for game developer to build and approach player throughout Multi-chain NFT marketplace, Interoperable DEX and Wallet; True to our roadmap, BHO Network has launched significant initiatives intended to popularize DeFi adoption. Our Staking Rewards Event attracted 140 million BHO value locked, which is equal to approximately 70% of its net circulating supply within the first 10 days of the event. Later, one of BHO Network’ key features - NFTs issuance - was fully developed on its Testnet platform, with the very first one being the project’s official logo. BHO Network has also launched the Testnet-version blockchain called Cygnus with key features of creation, destruction, and listing of users-own tokens and NFTs; adding or creating a wallet to send and receive BHO token and other related features. Under these circumstances, BHO Network’s Mainnet was set to launch by December, 2021. Recently, on March 31, BHO have successfully launched our Launchpad product named BHO Pad. It is a decentralized start-up launch platform based on the latest blockchain technologies with an extremely user-friendly interface. In addition, BHO Pad provides a “triple threat” solution to help solve specific difficulties for blockchain start-ups. BHO Pad not only supports capital raising for start-ups but also provides operational resources and consultations in strategic planning for projects How Do We “Over-Deliver” To Our Clients? High speed The transaction processing speed allows BHO network to handle thousands of transactions per second, making it compatible with thousands of validators without sacrificing performance. Low cost With higher block time and block size, the BHO network offers an incredibly low transaction fee. BHO uses a weight-based fee model as opposed to a gas-metering model. As such, fees are charged prior to transaction execution; once the fee is paid, nodes will execute the transaction. Eco-friendly BHO’s network novel consensus mechanism is flexible, efficient, and green making it sustainable and the platform of choice for many developers and innovators for the long-term. Scaling The nature of BHO Network Consensus can either be layered on top of existing networks creating pre-network finality or it can be layered on top of custom virtual machines creating independent networks that can be tailored for specific purposes. BHO network is fundamentally a new approach to achieving consensus with the aim of creating a flexible, scalable and usable blockchain system.","links":"https://bho.network/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bho-network/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x8717e80eff08f53a45b4a925009957e14860a8a8"}}}