{"name":"DIVA Protocol","id":"diva-protocol","symbol":"diva","description":"What is the project about? DIVA Protocol is a highly versatile smart contract-based system for creating and managing derivative financial contracts peer-to-peer. What makes your project unique? DIVA Protocol distinguishes itself from peers like Augur, Polymarket, and Opyn in several key ways: - High customization: DIVA Protocol offers unmatched customization, allowing users to select virtually any metric as the underlying and choose from a wide range of payoff profiles. - Compliance layer: DIVA Protocol is one of the first DeFi protocols that implements a compliance feature to enable traditional financial institutions to use DIVA Protocol while complying with existing KYC and AML regulations. - Gas optimized: DIVA Protocol implements an efficient off-chain matching mechanism with an on-chain settlement process leveraging the EIP712 signature standard, thereby optimizing gas usage by creating the derivative contract on-chain only when a counterparty is found. - Composable: DIVA Protocol harnesses the true power of decentralized finance by prioritizing composability. Developers can seamlessly combine DIVA Protocol with any oracle and trading infrastructure when building end-user applications. History of your project. The project was founded end of 2020 by two individuals that combine 15+ years of expertise in traditional finance, including derivatives trading and portfolio & risk management, and 6+ years of experience in smart contract development. DIVA Protocol was released on mainnet on 4/5th June 2023. What’s next for your project? - Grow developer community - Grow use cases & applications What can your token be used for? The DIVA Token is DIVA Protocol's governance token and empowers its holders to influence the direction of the protocol by delegating the management of the treasury funds and (limited) protocol governance rights to candidates of their choosing. For more infos, see: https://www.divaprotocol.io/posts/diva-tokenomics","links":"https://www.divaprotocol.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/diva-protocol/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x4b7ffcb2b92fb4890f22f62a52fb7a180eab818e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x4b7ffcb2b92fb4890f22f62a52fb7a180eab818e"}}}