{"name":"Sportzchain","id":"sportzchain","symbol":"spn","description":"SPORTZCHAIN – AN OVERVIEW SPORTZCHAIN is the world's first ENGAGE-TO-EARN (E2E) platform for sports fans powered by $SPN. We are building a ‘Digital World For Fans’ offering Sports Tokens (Fan Token 2.0), Watch-To-Earn, Fan Commerce, Gamefi and more. SPORTCHAIN is poised to capture the Asian sports fan market which holds more than 3.5 billion fans by rewarding them for their fan engagement. Sportzchain is a sports fan-centric platform where the aim is to provide a 360-degree fan engagement approach for sports fans to engage and earn, all powered by our native asset $SPN. We have built the engage-to-earn ecosystem which encompasses the following interlinked products --Sports Token – Back your favourite teams by buying their fan tokens, influence them directly and gain financial benefits when the team performs and engages with the fanbase through polls and other engagement avenues --Watch to earn – Watch live sports games across the world, and earn as a passive watcher or as an active participant --Fan commerce – Redeem $SPN on sports merchandize, match day tickets and OTT subscription --NFTs – buy NFTs of your favourite teams including one-of-a-kind phygital NFTs that give you money can’t buy privileges with expanded utility across the Sandbox Metaverse --Gamefi – Play to earn games where you can earn while participating in sports casual games for football, cricket etc. In other words, whatever users do on Sportzchain platform and interact & engage with like minded fans will be rewarded with our off-chain tokens (RWRD) that can be then redeemed for $SPN, fan tokens, discounted merchandise and more. So it is time to not just ENGAGE but **ENGAGE and EARN** OUR CURRENT PROGRESS --Exclusive sports token & NFT partnership with 5+ teams in Cricket and Kabaddi giving access to 800K fanbase --In discussion with 10+ sporting teams in Asia across cricket, Football, Rugby, e-Sports --LOI partnership with SANDBOX (through BRINC) -- Launched WebDapp with >5k users","links":"https://sportzchain.com/","market_cap":10347.49,"market_cap_rank":4678,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sportzchain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x32ea3dc70e2962334864a9665254d2433e4ddbfd"},"polygon-pos":{"decimal_place":18,"contract_address":"0xa3c53b53fe43083aa31c6f32ffe90c4d91b44391"}}}