{"name":"Thala","id":"thala","symbol":"thl","description":"Thala is a decentralized finance (DeFi) protocol native to the Aptos blockchain. The protocol revolves around two key products: Move Dollar and Thala Swap. Move Dollar, or MOD, is an Aptos-native stablecoin used to transact, facilitate, and interact with various other DeFi protocols in the ecosystem, while acting as a store of value, a medium of exchange, and a unit of account. MOD is an over-collateralized, yield-bearing stablecoin backed by a basket of on-chain assets. Its diverse collateral base of liquid staked derivatives, liquidity pool tokens, deposit receipt tokens, and RWAs ensures its decentralized, censorship-resistant nature without compromising capital efficiency. Thala Swap is an automated market maker that enables dynamic pool weightings. The protocol supports weighted pools, stable pools, and liquidity bootstrapping pools, among others. Thala Swap unlocks additional use cases for MOD, and the protocol's ownership of liquidity enables deep, long-term liquidity that can exist largely un-incentivized. Dynamic pool weightings, and more specifically, the liquidity bootstrapping pool (LBP), powers Thala's third product. Built on top of Thala Swap, Thala's launchpad provides a safe and equitable way of distributing tokens for both projects and market participants. $THL is the governance token of Thala, where token holders can vote on crucial decisions and enact protocol-wide changes. This includes but is not limited to: adjustments to protocol parameters such as swap fees, vault interest rates, mint fees, etc, contract upgrades that are executable only through governance to ensure the continued development of the protocol, treasury deployments, including treasury swaps with partner protocols, contributor compensation, audits, and more, additional product and cross-chain deployments to expand Thala’s product suite.","links":"https://www.thala.fi/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/thala/logo.png","detail_platform":{"aptos":{"decimal_place":8,"contract_address":"0x7fd500c11216f0fe3095d0c4b8aa4d64a4e2e04f83758462f2b127255643615::thl_coin::thl"}}}