{"name":"Aurory","id":"aurory","symbol":"aury","description":"What Is Aurory? Aurory is a tactical, turn-based, NFT-creature battler JRPG built on the Solana Blockchain. Players are invited to explore a rich and diverse universe where they will travel across the worlds of Antik and Tokané as they complete quests, discover lost relics, defeat enemies, and compete against other players using creatures called “Nefties”. These magical creatures can be hatched, evolved, traded, used to battle, and have been designed as non-fungible tokens (NFTs). They will accompany players as they embark on their adventure through a variety of immersive game modes in this compelling JRPG. The single-player mode (PvE), features an epic storyline with parallels to the crypto-universe, told through aesthetically colorful art and delivered with high quality production value. Players are taught all about crypto, blockchain, NFTs, and more through an engaging story about the adventures of our heroes, Sam and Helios. In the multiplayer (PvP) mode, players will learn how to best use their assets and rise to the top of the leaderboard, competing against other players. The project bridges the gap between traditional pfp projects and AAA gaming. In October, 2021, Aurory launched it’s own 10k pfp NFT project called “Aurorians”. The team then had 10,000 unique 3D models created and in May 2022, they launched their first playable NFT experience. This would allow Aurorian holders to play with their unique Aurorian as the protagonist in the game’s PvE story mode. Who Are The Founders of Aurory? The Aurory Project was co-founded in 2021 by Yann Penno, the project’s Creative Art Director, and Sym (Paul), the project’s Marketing and Operations Lead. Penno brings long-standing experience in the gaming industry with 14 years of work as a 2D/3D animator and art/creative director for indie games. His colorful visual style and cute characters are exemplary for the design of Aurory and are somewhat reminiscent of Dragonball-Z. Sym has been a full-time investor in cryptocurrencies since 2019. What Makes Aurory Unique? The Aurory team has been growing rapidly and as of May 2022, the project is composed of 60 talents, many of them former Ubisoft, EA, and Gameloft employees that collectively garner over 400 years of experience in building AAA video games. The project is also advised by Tristan Yver, the Head of Strategy at FTX.US, Darren Lau and Daryl Lau, of Not3Lau Capital, and Grégoire Le Jeune, General Partner at Geometry. Aurory utilizes the same play-and-earn game mechanics that have made other projects like Axie Infinity (AXS) wildly successful. One of the key differences with Aurory is that it is free-to-play, giving it a low barrier to entry that allows anyone, regardless of their crypto/gaming experience or financial situation, to start playing Aurory and owning their in-game assets, with zero up-front investment. The team is taking the approach of prioritizing creating a fun game, with a sustainable economic model to attract gamers who will stick around and reinvest, rather than farmers only looking to extract value. Some notable features that reinforce this idea consist of the following: • Seasonal releases of content every 6 months will allow for new regions to be explored, new characters and quests, and new revelations about the greater Aurory Universe. • Seasonal competitions and e-sports tournaments. • Deflationary mechanisms are engineered into the economy to balance the supply of inflationary assets like Eggs and Nefties. • Nefty creatures have randomly generated skills and attributes that make the probability of having two Nefties with the same stats, 1 in 15 million. • The game features an Aurory native, $AURY driven marketplace that allows the trading of all in-game assets. What Is $AURY? The multi-utility ecosystem token, $AURY, is at the heart of the economy and fuels all operations. It represents a financial stake in the game, permits access to PvP modes via staking, and will ultimately be used to access dungeons. It has a fixed supply of 100 million tokens and can be earned from both PvE and PvP game modes as well as through staking. The initial token circulation was 9.5% of total $AURY supply, with 7% coming from public sale (IDO), and another 2.5% that went to exchanges as liquidity. $AURY Use Cases: • The buying and selling of assets in the Aurory Marketplace. • Required as a fee for hatching eggs to obtain Nefties. • Used for sending Aurorian NFTs on Expeditions (NFT Staking), • Access to PvP by staking a minimum amount. • Liquidity mining. The $AURY token also has two of its own sub-currencies: OKA and TOKE. In their most basic form, these sub-currencies behave as an accounting mechanism that allows the distribution of revenues generated by players and can only be found in-game (not as SPL tokens). At the end of each week, both are exchanged for a corresponding amount of $AURY. OKA is the sub-currency used in the accounting mechanism for financially invested players. It will be used to reward players for victories in both PvE and PvP modes. Depending on difficulty levels, victorious players will receive varying amounts of OKA that will be converted to $AURY at the end of each week from the reward pool for financially vested players. TOKE is the sub-currency used as the accounting mechanism for Free-To-Play players. It will be used to reward player victories only in the PVE mode. Like with OKA, the amount of TOKE received by victorious players will be based on the difficulty level and will be converted to $AURY at the end of each week from a reward pool for F2P players. The $AURY token can be traded on both centralized and decentralized exchanges, as well as on Aurory’s own in-game marketplace. In the future, it will also act as Aurory’s governance token, allowing holders to vote on important game-development decisions. How Is the Aurory Network Secured? Aurory is powered by the Solana blockchain. The team selected Solana for its fast transaction times and minuscule transaction fees as well as the minimal environmental impact compared to other blockchains. Solana is a layer one blockchain with a proof-of-stake consensus mechanism with partial Byzantine Fault Tolerance. It has 200 nodes operating worldwide that can, at their peak, process up to 50,000 transactions per second. Solana performs a set of coordinated optimizations to achieve such impressive performance and processes transactions in a multi-threaded way, which sets it apart from slower blockchains. Where Can I Trade $AURY? You can trade AURY on FTX, Kucoin, Huobi, Raydium, and Orca.","links":"https://aurory.io/","market_cap":15211617,"market_cap_rank":1068,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aurory/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"AURYydfxJib1ZkTir1Jn1J9ECYUtjb6rKQVmtYaixWPP"},"arbitrum-one":{"decimal_place":9,"contract_address":"0x11bf4f05eb28b802ed3ab672594decb20ffe2313"}}}