{"name":"XYO Network","id":"xyo-network","symbol":"xyo","description":"XYO is the original and one of the largest Decentralized Physical Infrastructure Networks (DePIN), boasting over 10 million nodes and consistently leading DePIN in both scale and revenue generation. Launching its Mainnet ahead of any other DePIN, XYO specializes in collecting and validating real-world data, bridging it seamlessly to Web3 and Web2 companies across AI, geolocation, and other critical data sectors. At the core of XYO are Proof of Location and Proof of Origin technologies, enabling accurate validation of real-world data for innovative use cases such as Real-World Asset (RWA) tracking, DePIN applications, real-world gaming, and treasure hunts. Recently, XYO expanded its ecosystem by launching the XYO Layer One blockchain, purpose-built to support the intensive data demands of DePIN, RWA, AI, and similar data-driven industries. XYO employs a unique dual-token model: XYO Token: An externally traded token supporting the DePIN ecosystem, rewards, staking, and governance, enhancing overall ecosystem value and scarcity. XL1 Token: Internal to the XYO Layer One blockchain, facilitating transactions, gas fees, and other blockchain-specific use cases. The dual-token economics are strategically designed to increase scarcity and promote sustainable growth. The XYO token is available on major exchanges, including Coinbase. The XL1 token will launch publicly later in 2025. To accelerate network adoption and growth, XYO created the popular COIN app. Beyond the XYO Foundation, the team founded the U.S.-based, for-profit entity XY Labs Inc., notable as the first U.S. crypto company qualified by the SEC for a Regulation A offering, permitting share sales to both accredited and non-accredited investors. XY Labs further stands out as one of the pioneering U.S. companies to tokenize and publicly list its shares. These tokenized shares trade as $XYLB on the tZERO ATS, positioning XY Labs prominently in the growing wave of Real-World Asset (RWA) tokenization.","links":"https://xyo.network/","market_cap":127687796,"market_cap_rank":375,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xyo-network/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x55296f69f40ea6d20e478533c15a6b08b654e758"}}}