{"name":"Venom","id":"venom","symbol":"venom","description":"What Is Venom? Venom is a multi-blockchain network being a basis for scalable Web3 applications in the DeFi and Global Payments markets. Blockchain provides the best transactional scalability solution and economic scalability. Venom architecture is designed as a heterogeneous multi-blockchain platform with dynamic sharding. Venom masterchain is layer-0 blockchain, which is responsible for coordinating all the protocol entities such as workchains and shardchains. The masterchain state stores the network configuration, information about a set of validators, their stakes, and election rounds. Venom supports up to 2^32 workchains. Venom provides a virtual machine that executes smart contract code on the Venom blockchain. It is the Turing complete virtual machine. Smart contracts in Venom give new, more flexible, and controlled flow over the execution of application logic. In Venom there are election mechanics for validator slashing, using a group of different task validators from the global validators set producing blocks for Shardchain, and guaranteeing decent decentralization. Venom is designed as a distributed computing system with a scalability opportunity through infinity sharding. This means that Venom can share tasks between groups of validator nodes called \"a validator task group\" depending on the load, and one part of the tasks doesn't need to wait for other tasks to be completed. Venom by design has an asynchronous model of communication between smart contracts. This is because of the need to maintain calls between contracts located in different shards, processed by different validator task groups. In this way each smart contract has the only way to affect the state of some other account by sending a message, the result of its execution of it will be a transaction. The order of execution of the outbound messages queue is guaranteed.","links":"https://venom.foundation","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/venom/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}