{"name":"STARX","id":"starworks-global-ecosystem","symbol":"starx","description":"Starworks GLOBAL is a blockchain technology developer that is commercialising an integrated ecosystem of products & services aimed at streamlining and revolutionizing the global Tourism and Hospitality industry. Our proprietary blockchain allows for secure and real-time data ledger technology to facilitate transactional services targeting hotels/resorts, airlines, restaurants, tourism operators, and other retail businesses within our industry. A Singaporean Corporation, we have over 20 years industry experience within the Tourism and Hospitality sectors with our technology operations based in Indonesia and subsidiary operations based in the USA and Australia with plans for further global expansion. The driving force behind our operations is our Executive team that comprises passionate individuals with extensive knowledge and expertise across a diverse range of business, management, and technology disciplines. Our portfolio of products includes StarPOINTS - blockchain-based loyalty rewards program, StarTRAVELLER - exclusive membership travel club, StarHUB - crypto co-working café’s, StarFIN - DeFi products, and others which are complimented by our proprietary StarCHAIN blockchain and StarWALLET crypto wallet. Underpinning all of this is our StarX Token, the native currency of ecosystem which was listed on the 24th December 2021. Our mandate is to create innovative blockchain-based products and services that will benefit the global Tourism and Hospitality markets. Our technology solutions will help businesses to survive and thrive by streamlining processes, become more intuitive and competitive, offer better cost efficiencies, create new opportunities, be more sustainable and provide customers with more personalised offerings, greater value, and ultimately a more enhanced experience. A global B2B and B2C business model offering huge benefits and opportunities to our customers, merchants, and investors alike.","links":"https://www.starworksglobal.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/starworks-global-ecosystem/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xc4e8a9d47000ab8e59c7031e311762c68215e467"}}}