{"name":"EUROe Stablecoin","id":"euroe-stablecoin","symbol":"euroe","description":"## What is EUROe? EUROe is a fully fiat-backed EU-regulated Euro stablecoin issued by Membrane Finance. Secured by at least 102% of euro-denominated assets, one EUROe is always redeemable for one fiat Euro by clients of Membrane Finance. EUROe is regulated as e-money, and Membrane Finance holds an EU-wide Electronic Money Institution licence issued by the Finnish Financial Supervisory Authority. ## How Many EUROe Are There in Circulation? EUROe supply changes over time as new EUROe is issued or existing EUROe is redeemed by Membrane Finance’s clients. Currently, there are no fees for issuing or redeeming EUROe. Companies, foundations, and other corporate entities can apply to become a Membrane Finance client to access the minting and burning of EUROe. ## Who Is the Founder of EUROe? The company behind EUROe, Membrane Finance, was founded by Juha Viitala in 2021. EUROe is incubated by Equilibrium, a core blockchain infrastructure builder, and funded by Maki.vc, a seed-stage venture capital company. ## Where Can I Buy EUROe? EUROe is available for trading on a growing number of decentralised exchanges and directly through Membrane Finance.","links":"https://euroe.com/","market_cap":1204124,"market_cap_rank":3754,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/euroe-stablecoin/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x820802fa8a99901f52e39acd21177b0be6ee2974"},"optimistic-ethereum":{"decimal_place":6,"contract_address":"0x820802fa8a99901f52e39acd21177b0be6ee2974"},"arbitrum-one":{"decimal_place":6,"contract_address":"0xcf985aba4647a432e60efceeb8054bbd64244305"},"polygon-pos":{"decimal_place":6,"contract_address":"0x820802fa8a99901f52e39acd21177b0be6ee2974"},"avalanche":{"decimal_place":6,"contract_address":"0x820802fa8a99901f52e39acd21177b0be6ee2974"},"solana":{"decimal_place":6,"contract_address":"2VhjJ9WxaGC3EZFwJG9BDUs9KxKCAjQY4vgd1qxgYWVg"}}}