{"name":"Mintlayer","id":"mintlayer_ethereum","symbol":"ml","description":"What is Mintlayer (ML)? Mintlayer is a layer 2 solution that allows users to build a decentralized finance ecosystem rooted in the established network of the Bitcoin blockchain opening Bitcoin to DeFi, smart contracts, atomic swaps, NFTs, and dapps. Mintlayer is a protocol focused on developing a decentralized finance (DeFi) ecosystem that leverages the Bitcoin and Lightning Network. The company's vision is to develop a platform to deploy smart contracts on the BTC blockchain, which will eventually give rise to a decentralized exchange (DEX). Mintlayer is opening up new ways for the DeFi sector to integrate with Bitcoin to enable real-world financial use cases on the Bitcoin blockchain. Mintlayer USP - Atomic Swaps While other projects are trying to enable DeFi on Bitcoin, Mintlayer is the only protocol that enables direct 1:1 swap of Native Bitcoin for other tokenized assets Minted directly on Mintlayer. With these atomic swaps on Mintlayer, there are no intermediaries, peg-in, wrapped, or federated tokens. No other project has approached asset swaps in this manner, and it enables users to use native Bitcoin for financial instruments without counterparty or intermediary risk. Additional Features: -Unlike Ethereum, users can choose any token to pay transaction fees. -With Turing incomplete smart contracts, Mintlayer reduces the risk of contract failure and increases outcome predictability. This feature also reduces on-chain congestion. -It has an access control list or Access control list (ACL) for improved compliance with security tokens such as whitelisting/blacklisting addresses and such functionalities. -With multi-token transfers in a single transaction, Mintlayer makes aggregated payments a reality. -By integrating the Lightning Network, Mintlayer users will enjoy high transactions per second to enable fast transactions. -This project also has programmable pools for efficient tokenomics and evading Unspent Transaction Output (UTXO) pollution.","links":"https://www.mintlayer.org","market_cap":2107311,"market_cap_rank":2919,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mintlayer_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x059956483753947536204e89bfad909e1a434cc6","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x059956483753947536204e89bfad909e1a434cc6"}},"is_native":false}