{"name":"Stylike Governance","id":"stylike-governance","symbol":"styl","description":"Stylike is a fashion app (backed by FashionTV) filled with challenges and tournaments. At Stylike you take pictures based on the themes you get on daily basis. With Stylike everyone will get paid and can earn better prizes based on their style.Our goal is to reward those who put time and effort in their daily look and appreciate fashion . The issue they insist on is to appreciate the value of fashion and fashionista. Nowadays, our media society on the Internet does not esteem the style of its users as it should. The main goal is crystal clear, to put a stop to this cycle. With the giant fashion organization_Fashion TV_ by their side, this objective is more reachable than any other time. The outcome of this concern is a fashion app called Stylike. It is developing a new concept which is called dress-to-earn. The issue we focused on is to be stylish, execute daily fashion related tasks and earn money. The Jury from Fashion TV will judge the whole process and based on their perception, the users get rewarded. Consider money aside, the only way a fashionista drew attention on fashion mode events for the last ten years, was to be a professional model! This has prevented a lot of talented people to achieve their dreams. Now, the only thing stands between you, as a fashionista, and your goal is dedication and participation. With the NFT and Cryptocurrency market getting a lot of attention these days, Stylike has also decided to take part in enhancing this up and coming trend. It has been always an issue, for Fashion to be more appreciated between different parts of the society. So, as mentioned before, the idea of Stylike was born; a Web 3.0 based app in which people with any kind of style can participate in tournaments and be valued. Because style is a new currency now!","links":"https://stylike.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stylike-governance/logo.png"}