{"name":"Toadie Meme Coin","id":"toadie-meme-coin","symbol":"toad","description":"What is the project about? Toadie Meme Coin (TOAD) is a cryptocurrency launched on the Solana blockchain. TOAD has a current supply of 100,000,000 tokens, with 80% in circulation, while 10% of the supply is allocated for gaming, and 10% for platform operation + CEX listing. It is trading on Raydium with a $550k+ trade volume over the last 24 hours. What makes your project unique? Toadie Meme Coin ($TOAD) has an active and strong community of over 5500 holders! It has a presale on Raydium and was incubated by Gotbit hedge fund and Playbux. It is an NFT and community-driven gaming platform with 100% transparent Tokenomics, 0% Buy/Sell taxes, LP burnt, Contract revoked, SAFU verified Smart Contract. History of your project. $TOAD is a unique frog meme coin that combines the concepts of Frog, gaming, and NFT to create a powerful and exciting new token, placing community power and control at its core. $TOAD is a community-driven project built on the Solana blockchain. What’s next for your project? TOAD Token's roadmap has achieved significant milestones, including NFT launch, community building, Playbux incubation, and Gotbit hedge funds, launch of quests and the first game.. Additionally, the next step is to introduce strategic partnerships, more advanced games, and establish Adoption. What can your token be used for? TOAD Token serves as a genuine meme token, providing utility through NFT integration and gaming reward earning. Soon, more features will be added. These features promote organic and sustainable value growth within our community.","links":"https://toadie.co/","market_cap":57052,"market_cap_rank":8309,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/toadie-meme-coin/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"CxRppbsvfhrZJdnqSo5VDkrAYQMucN8Gbj5J1F5qkrNs","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/CxRppbsvfhrZJdnqSo5VDkrAYQMucN8Gbj5J1F5qkrNs"}}}