{"name":"ViceWRLD DAO","id":"vicewrld","symbol":"vicedao","description":"VICEWRLD DAO will be governed by the $VICEDAO token holders and will progressively become more decentralized over time where control over the treasury and the core decision making will be handed over to the DAO council who will be elected by the token holders. VICEWRLD DAO will also be partnering with adult charity organizations to help with mental health and sex worker rights. Donations will be made via the DAO treasury. Pornography is a $35 Billion a year global industry with some of the world’s most visited websites being adult sites. The industry is constantly evolving with new types of platforms such as OnlyFans, tube and cam sites alongside the constant innovations in visual technologies such as 2D/3D porn, VR porn and animation porn. There is a common adage that “sex sells” and this has never been more true within the industry itself. The Adult industry will always have a consistent and steady stream of consumers, regardless of economic conditions. There will always be porn consumers who seek and desire new, creative and exciting content. VICEWRLD DAO is the world’s first combined Web3 and Adult organization that will be providing three key services for it’s token holder community. VICEWRLD Productions in partnership with VICEWRLD DAO will be producing custom adult content with input from the $VICE token holder community where they will be able to use their tokens to vote on scene creatives. VICEWRLD NFT launchpad service will be the first ‘white glove’ offering for Adult industry creators who want to launch their own tokens and NFT collections for their fans. VICEWRLD Adult Metaverse where consenting adults will be able to share in fun VR sexual experiences together, shop and watch VR porn. The VICEWRLD DAO team comprises of some major Adult industry creators, producers and advisors. It is a community owned and operated organization united by it’s vision to achieve the above, deliver on it’s roadmap and constantly offer value to the $VICED token holders.","links":"https://vicewrld.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vicewrld/logo.png"}