{"name":"Love Earn Enjoy","id":"love-earn-enjoy","symbol":"lee","description":"What Is LEE? LEE is a utility token of the GameFi short video platform Cheelee. These tokens are earned by watching the feed in the Cheelee app. All internal calculations on the platform are carried out in LEE. Its issue is strictly limited; the total supply is 7,000,000,000. The rate of LEE's accrual algorithmically depends on the number of tokens mined: the more they are mined, the more difficult it is to get new LEE tokens. The complexity of LEE's mining is constantly growing: by 7% per month and 84% per year. This stimulates the token prices to rise, which, in turn, encourages users to use the hodl strategy more often. Since LEE is the utility token and is utilized for all app accruals, its demand is fueled by the growth of the Cheelee platform. Here are the ways Cheelee participants can use LEE: Upgrade NFT glasses Charge NFT glasses Mint NFT glasses Promote content on the platform Make donations What Makes LEE Unique? - LEE token's potential audience is 4.6 billion social media users, which is more than half of all people living on our planet today. Consider also that the social networking market does not stand still and is constantly growing! The Cheelee platform's utility asset can grow in price for decades thanks to this enormous potential audience. - LEE is the GameFi world's new bitcoin. We can state this with confidence since, like the first cryptocurrency, LEE has a limited supply and an algorithmically increasing mining complexity. Combined with the factor of a huge potential audience, this makes LEE an asset that will become increasingly rare and expensive over time. Just like bitcoin! - When all the LEEs are mined, which, according to our calculations, will happen in about 5 years, they will not run out but will become an increasingly rare resource. Following that, Cheelee intends to repurchase LEEs from the market and use them to pay for viewings.","links":"https://cheelee.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/love-earn-enjoy/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe37dbf20a4fff3b88233e456355dc49b76b6fe19","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xe37dbf20a4fff3b88233e456355dc49b76b6fe19"}}}