{"name":"iCOMEX","id":"icomex","symbol":"icmx","description":"\"The iCOMEX-token is the native unit of account of the iCOMEX commonwealth (ICMX) and functions as means of payment, ownership, and store of value on their e-commerce platform and other related ventures. The iCOMEX-token is a token 1on the Tron platform, which is described as: “an advanced blockchain platform that is built to decentralize and democratize the content distribution industry through an arsenal of permissionless tools, platforms and protocols.” The iCOMEX-token will be used as the iCOMEX native digital currency for payment, product- and service pricing (unit of account) and for saving value. In addition, the ICMX payment system and its native token can -dependent of its success and adoption in the industry- in principle, grow out to become a ‘branch-standard’ – either for shopping in certain area’s (regional leader) or in certain industries or distribution channels. Online shopping is one of the most popular online activities worldwide and our global e-commerce platform has been created to give entrepreneurs and merchants a space where they can focus on doing what they know best and where they can do so in the smartest way possible. They can leave the technical aspects of online trade to our IT-department and platform support staff and attend their customers and sales. It is our belief that if the entrepreneurs focus on what they know how to do best, they’ll have more time to specialise and become too good to ignore. This can result in more scaling and success for these small businesses and assist them to raise the chance to survive the highly competitive e-commerce world. At iCOMEX, we are offering our business partners an opportunity to participate in a vehicle that allows seed capital redemption even after the ICO. This reduces the hurdle of long-term escrow periods found in traditional IPO’s. Objectives • The prime objective is to create an e-commerce platform that will offer the partaking members a robust web-shop with modern functionality that will enable them to achieve reasonable sustainable returns on their efforts. • Long term time horizons: think in generational increments. Building step by step; Starting with the platform, offering an extensive product assortment and service package and develop a global payment system. • It is encouraged that the members be shareholders via direct equity ownership (iCOMEX-token) and revenue sharing models. • It is our strong believe, that any entrepreneur must be the chief beneficiary of his own commercial initiatives and actions. • To create a foundation guarding the iCOMEX global payment systems iCOMEX-token and the token-ecology\"","links":"https://icomex.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/icomex/logo.png","detail_platform":{"tron":{"decimal_place":6,"contract_address":"TJt35gDSudMAdU6GFghwY8UbMdG85vYg3L"}}}