{"name":"BNB Bank","id":"bnb-bank_binance-smart-chain","symbol":"bbk","description":"\"BNB Bank- decentralized block chain currency providing USDT rewards to all holders for each transaction. BNB Bank is a new, public cryptocurrency that has been designed to be a more efficient alternative to invest in. Our project has the concept of scalability, interoperability, and sustainability which will empower our main goal which is increasing the investment for each shareholder. The team understood the implications of the challenges to block chain networks and began developing BNB Bank to create a new concept of investment and made it free to everyone with a minimum limit of purchasing for at least 0.1 BNB. BBK took the investment concept to another level which will provide 10% of any transaction as USDT divided among the shareholders, that means the more transaction going on, the more USDT you get. In addition, you will never lose your capital since you will get at least the same amount in return within few hours or even less. BNB Bank token launched with 10,000,000 tokens. 65% of the supply was issued to the pre-sale phase, 34% of the supply is liquidity and only 1% of the main supply is team locked. 15% of transaction fees which will be devided as 10% reward, 4% marketing wallet, and 1% LP. BNB Bank aims to balance equity and utility with security in the form of regular attestations. From its launch onwards, our team has sought to underscore the importance of independent verification of the provenance. As such, BBK’s appeal is geared towards larger investors looking to reduce risk, in addition to smaller private traders. The team is big with people from all over the world including high-qualified team members in their fields such as: web developing, marketing, coders and high skilled management officers. The main purpose of BBK which is scalability, interoperability, and sustainability. This project became what is now as BNB Bank, and employs more than 40 staff from all over the world starting from Europe, Asia and Africa.\"","links":"https://www.bankbnb.net/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bnb-bank_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6249428345819cac8b8c7f1f68771073cb689ab1","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x6249428345819cac8b8c7f1f68771073cb689ab1"}},"is_native":false}