{"name":"ArbiPad","id":"arbipad","symbol":"arbi","description":"## What Is ArbiPad (ARBI)? ArbiPad — Next generation Arbitrum-zkSync based launchpad by Good Games Guild. ArbiPad is constructed as a bridge between the best crypto project and the global community, especially investors and community in the crypto sphere with transparency and a fair distribution system. ARBI is the native utility token that is used for: - To secure the IDO Allocation on ArbiPad, users have to stake their $ARBI. - Participating in ArbiPad Special Event — Free mint and Access to exclusive group. Unlock more benefits by holding $ARBI! - Incentive Rewards Program for Community ## How Many ARBI Tokens Are There in Circulation? There will 1,080,000,000 ARBI on the circulation of 10,000,000,000 ARBI of the total supply. ### Who Are the Founders of ARBIPAD? ArbiPad is built by Good Games Guild. Good Games Guild is a top guild project in the WEB3 space. As a top project, GGG has so many investors who were carefully selected based on their experience, knowledge, and understanding of the industry. Each of GGG's investors has a range of experience, including infrastructure, gaming, NFTs, DeFi, and some of the most respected global venture firms, such as Animoca, Chromia, OKEx NGC Ventures, Basics Capital, and many more. ### Where Can I Buy ARBIPAD (ARBI)? ARBI will be available on MEXC and Gate.io for upcoming token listing. And also ARBI will list on DEX, such as: Uniswap","links":"https://www.arbipad.com/","market_cap":60598,"market_cap_rank":8232,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arbipad/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x07dd5beaffb65b8ff2e575d500bdf324a05295dc","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x07dd5beaffb65b8ff2e575d500bdf324a05295dc"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa7bd657c5838472ddf85ff0797a2e6fce8fd4833","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa7bd657c5838472ddf85ff0797a2e6fce8fd4833"}}}