{"name":"Mirage","id":"mirage-2","symbol":"mirage","description":"Mirage is a groundbreaking Web3 Visa debit card designed to seamlessly bridge the worlds of cryptocurrencies and traditional financial systems. Launched on December 11th, Mirage empowers users to effortlessly leverage their digital assets for global spending, functioning much like a conventional Visa card at any Visa-accepting merchant. The primary purpose of Mirage is to provide a user-friendly and secure platform for individuals and enterprises to transact with cryptocurrencies. It facilitates effortless spending worldwide, allowing users to treat their digital assets similar to traditional currencies. Mirage prioritizes user privacy and security, implementing state-of-the-art encryption protocols to fortify each transaction and uphold anonymity. With a commitment to global accessibility, Mirage eliminates geographical limitations, enabling users to access their funds and conduct transactions anywhere in the world. The platform aims to foster inclusivity and connectivity in the digital economy. In its Beta phase, Mirage introduces a KYC-free virtual card compatible with popular platforms like Apple Pay and Google Pay, emphasizing a user-centric approach and offering a glimpse into a future of frictionless transactions. Mirage envisions evolving into a Virtual Bank powered by crypto, addressing key challenges in the decentralized finance (DeFi) landscape. This includes enhancing the mobile experience in crypto, restoring privacy to crypto transactions, and simplifying daily crypto spending. Through these efforts, Mirage aspires to become a gateway to secure, global, and transformative financial interactions, shaping the future of digital finance.","links":"https://mirage.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mirage-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb16186fc9214811fc9e5009dc915a6ce6edc8472"}}}