{"name":"LuckyToad","id":"luckytoad","symbol":"toad","description":"Initially launched on Sep 5, 2022 by a team based in USA and Australia. LuckyToad is an MEV-integrated utility token, focused on the development of DeFi tools and services. With very unique tokenomics in the form of Jackpot Reflection. Every time someone sells you are entered into a raffle to win 8% of the sale, regardless of what you have won in the past. The contract draws a holder's wallet ID randomly based on the number of coins you own. Therefore, the more coins you own, the higher the probability of you winning that 8%. As well, LuckyToad is the first in the space to figure out how to liquidate buy taxes on the buy transaction, which has always been a complicated issue, by utilizing two different liquidity pools. Giveaway.LuckyToad.dev can turn any giveaway into a trustless transaction. Any project, dev, influencer, or community; can trustlessly pick and distribute rewards on the blockchain. Utilizing Lucky Toad's rng MEV Code, you can simply and legitimately run your Buy Comps, Raffles, Lotteries, and any other type of giveaways. Staking.LuckyToad.dev is a built-in-house staking dApp that allows users to lock their tokens, and in turn receive higher jackpot odds, based on the number of weeks those tokens are locked for. This was done in a way to preserve the liquidity pool, with a focus on long-term sustainability. ToadSwap is a flash bots run swapping platform that provides users with advanced money-saving and risk-mitigating features. It is a gas-loaning swap, allowing you to swap approved tokens without having to front gas. Allowing greater flexibility with each and every trade. There are no failed transaction fees on Toad Swap ever, as we will stop your transaction from taking place before it fails. Swaps done on Toad Swap do not interact with the mempool, and with true auto slippage, users are at no risk of being front-run. Users will also be provided with anti-rug features, that will auto-liquidate most positions if the project were to rug.","links":"https://www.luckytoad.dev/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/luckytoad/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xbfb2b6870501a6ff17121d676a0a45a38c9eed1e"}}}