{"name":"TOKHIT","id":"tokhit","symbol":"hitt","description":"TOKHIT is a blockchain-powered social app that allows content creators, influencers, and Crypto & NFT enthusiasts to monetize their social activity. Unlike traditional social media platforms, TOKHIT is completely ad-free and rewards users for their time and content contributions. The app features two content feeds where users can post content, two play-to-earn games, and the option to promote NFTs minted on other platforms. The project’s cryptocurrency, the HITT token, will be used to reward content creators, provide revenue streams, and fund the project. The token will have multiple utilities in the future, including NFT trading and providing access to various digital assets and collectibles, subscription programs, membership programs, AirHugs, staking rewards, governance rights, in-app payments, in-app rewards, and monetization opportunities. TOKHIT aims to create a robust ecosystem of interconnected digital products that share a common token-based economy. The project was launched in Q3 2021, and the HITT token was introduced at the same time. The project has a roadmap that included launching the App Store and reaching $100 million in capitalization in Q2 2022. Future plans include building the Android and Web versions of the app. What makes TOKHIT unique is its blend of decentralized social media with the perks of Blockchain and NFT technology. This provides more creative freedom to users and allows them to earn instant rewards through their content contributions. TOKHIT’s ultimate goal is to enhance a user’s experience in the app and strengthen the utility of their tokens. Currently, the HITT tokens can be used to join the VIP staking program available exclusively in the Welthee App. The team is also working on listing the token on the exchanges, with a timeline to be discussed. Additionally, the team is working on launching their staking program, which is currently under certification.","links":"https://tokhit.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tokhit/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x00a0d4f2fe50e023aec0648271ce1a6616c702e2"}}}