{"name":"Vultisig","id":"vultisig","symbol":"vult","description":"Vultisig is a self-custodial multi-chain wallet that uses Threshold Signature Scheme (TSS) and Multi-Party Computation (MPC) technology to provide institutional-grade security without specialized hardware. The platform supports all major blockchains including Bitcoin, Ethereum, Solana and THORChain. The open source wallet eliminates seedphrases in favor of distributed \"vault shares\" across devices, eliminating single points of failure while maintaining easy-to-use interfaces. Available on iOS, Android, Windows, Linux, and the web, Vultisig offers flexible security configurations from single-device Fast Vaults to multi-device setups (2-of-2, 2-of-3, 3-of-4). Vultisig was created by the founder behind THORChain, bringing their expertise in cross-chain technology to create a more secure and accessible wallet solution. The native $VULT token allows holders to participate in the value creation of the ecosystem, capturing 100% of swap/bridge fees and 30% of marketplace revenue to reward stakers. The Vultisig marketplace serves as a hub where developers create and monetize plug-ins and AI agents, while users discover tools to improve their asset management. This ecosystem fosters innovation through an open source community where developers receive direct revenue for their contributions. A standout feature is Vultisig's SDK, which enables AI agents to securely interact with blockchain assets across multiple chains. Developers can build autonomous agents that operate independently, or create assistants that enhance existing vault setups with user approval mechanisms, bridging the gap between AI capabilities and secure asset management. The SDK opens two powerful avenues for AI agent developers: fully autonomous agents that operate independently on multiple chains, or intelligent assistants that enhance existing vault setups - requiring user approval for actions or autonomously executing approved operations. This combination of AI capabilities with institutional-grade security infrastructure represents a significant advancement in blockchain technology Vultisig is used by individuals seeking enhanced security for their digital assets, while teams leverage its multi-signature capabilities for treasury management. The built-in DeFi functionality allows users to exchange, bridge and manage assets across chains without compromising security. Users earn VULTIES points daily by storing assets in vaults, with additional multipliers available through referrals and active participation. The seasonal airdrop structure ensures continuous engagement while providing consistent rewards for active users. The VULT token is the foundation of the ecosystem, designed as a value accumulation mechanism that rewards token stakers directly. The staking VULT token is the foundation of the ecosystem, designed as a value accrual mechanism that directly rewards token stakers. Staking VULT not only ensures participation in value distribution, but also unlocks premium features, including free access to select AI agents and plugins from the marketplace and future governance. With its multi-chain support, enhanced security features and innovative AI integration, Vultisig represents a significant evolution in digital asset management, empowering users to take full control of their assets without sacrificing security or convenience. Visit our website to learn more.","links":"https://vultisig.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vultisig/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}