{"name":"NEXT","id":"next","symbol":"nex","description":"Project Description – NEXT (NEX) NEXT (NEX) is a community-driven cryptocurrency built on the TON blockchain, designed to combine simplicity, accessibility, and long-term growth. The project’s mission is to create a sustainable ecosystem where community engagement and decentralized ownership drive value. Unlike typical short-term meme coins, NEX aims to bridge the gap between community tokens and real blockchain adoption, ensuring continuous innovation and strong utility. Core Vision and Mission The vision of NEXT is to establish a token that reflects fairness, transparency, and community power. NEX does not simply follow the hype of temporary projects but introduces a clear roadmap with strategic steps including presale, structured airdrops, CEX listings, and NFT integration. By combining strong community incentives with sustainable tokenomics, NEXT is designed to attract both retail participants and long-term investors. Tokenomics The total supply of NEX is capped at 100,000,000 tokens, after the permanent burn of 250,000,000 tokens, ensuring scarcity and value preservation. Presale Allocation: 10,000,000 NEX (at the fixed price of 100 NEX = 1 TON) Community Airdrops & Rewards: A significant portion reserved for participants who support and engage through tasks, campaigns, and social growth. Liquidity & Exchange Listings: A portion dedicated to maintaining liquidity pools and enabling smooth trading experiences. Development & Future Growth: Funds set aside for ongoing ecosystem expansion, including NFT projects, staking mechanisms, and platform integrations. Roadmap July 2025: Official launch August–September 2025: Presale phase October 2025: Start of global airdrop campaign January 2026: Distribution of tokens & CEX listing March 2026: NFT ecosystem introduction and expansion of use cases Why NEXT is Different NEXT stands out by focusing on long-term growth rather than quick speculation. The project’s strategy emphasizes community building, reward-based engagement, and expanding into NFTs and staking utilities. Unlike many short-lived projects, NEXT offers transparency, deflationary mechanisms through burns, and a dedicated roadmap that sets a clear direction for the future. With its strong community foundation, fair distribution, and strategic growth model, NEXT (NEX) is not just another token—it is a movement towards sustainable decentralized adoption on the TON blockchain.","links":"https://nexpresale.netlify.app/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/next/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}