{"name":"Pig 2.0","id":"pig-2-0","symbol":"pig2.0","description":"What is the project about? Introducing the one and only Piggylicious Meme Project! Dive headfirst into a whirlwind of hilarity and oink-tastic adventures as our adorable and mischievous piggy takes the crypto world by storm. With each meme, this plump porker brings a snort-inducing dose of laughter, delivering pure joy to your screen. From trotting through blockchain trends to wiggling its curly tail in the face of seriousness, our pig meme project promises to keep you laughing ’til you’re rolling in the pigsty. Brace yourself for a wild ride filled with snorts, giggles, and a whole lot of bacon-flavored nonsense. Embrace the pig-mania and join our crypto meme revolution today! What makes your project unique? Introducing the one and only Piggylicious Meme Project! Dive headfirst into a whirlwind of hilarity and oink-tastic adventures as our adorable and mischievous piggy takes the crypto world by storm. With each meme, this plump porker brings a snort-inducing dose of laughter, delivering pure joy to your screen. From trotting through blockchain trends to wiggling its curly tail in the face of seriousness, our pig meme project promises to keep you laughing ’til you’re rolling in the pigsty. Brace yourself for a wild ride filled with snorts, giggles, and a whole lot of bacon-flavored nonsense. Embrace the pig-mania and join our crypto meme revolution today! History of your project. Introducing the one and only Piggylicious Meme Project! Dive headfirst into a whirlwind of hilarity and oink-tastic adventures as our adorable and mischievous piggy takes the crypto world by storm. With each meme, this plump porker brings a snort-inducing dose of laughter, delivering pure joy to your screen. From trotting through blockchain trends to wiggling its curly tail in the face of seriousness, our pig meme project promises to keep you laughing ’til you’re rolling in the pigsty. Brace yourself for a wild ride fille What’s next for your project? What can your token be used for?","links":"https://pig20.vip/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pig-2-0/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xb2114e5420927932666a5c5bd1ac4e14d9ede32b"}}}