{"name":"Sekuya","id":"sekuya","symbol":"skuy","description":"Sekuya has true purpose in connecting real world and digital world, hence why our project solely build from there: Sekuya NFT Marketplace: provides not only digital collectibles but also RWANFT featured by artists that are themselves part of the SEKUYA community. 1) Digital Assets (NFTs): Partners will be able to sell their arts/works through our NFT Marketplace and get better visibility/exposure using a subscription fee, where their works will be displayed in real life through our Smart Display Frame, partnering with restaurants and cafes throughout the continent. 2) Real World Asset NFTs (RWANFTs): Partners will be able to ‘digitize’ and ‘tokenize’ their physical arts/works with the help of our RWANFTs and users will receive the physical arts/works delivered to their doorsteps along with a certificate of authenticity. NFT Assets: We create 100 ultra rare NFTs (100 Legends of Sekuyas) and other NFTs collections where users can get reward, royalty and having passive income from it. The ultra rare NFTs will be used as landmark in our Multiverse. 3) Multiverse: we aim to build a Multiverse. The new earth multiverse is one of the adaptations of the real world into the digital world, in which a new world with multi-dimensions is formed. Taking the background setting of the multiverse concept in the genre of Epic Fantasy Adventure. Users and Partners will be able to buy lands, staking, develop game, participate in Play to earn game etc. 4) Meta-Fii: Sekuya Meta-Fi is a multi-protocol decentralized exchange (DEX) where users can swap, trade, and launch any BSC20 or ERC20 and any other token. - Users will be able to participate, and find good & safe projects within our launchpad. - Partners will be able to list their project and receive funding from crypto investors. - SEKUYA meta-fi is a multi-chain decentralized exchange that will let users trade their favorite crypto 5) Game Development: Building game development in our Multiverse. 6) AR-headset and Smart Display Devices: Building Smart Digital Frame for NFT display on public or at home, building VR headset, Multi Gloves for better experience in the Multiverse.","links":"https://sekuya.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sekuya/logo.png"}