{"name":"Kei Finance","id":"kei-finance","symbol":"kei","description":"### What is Kei Finance? Kei Finance is a DeFi protocol, built on the principles of decentralisation, transparency, and innovation. Its primary focus is to provide advanced technology and services to the DeFi ecosystem, ensuring a seamless user experience, and unlocking the full potential of decentralised finance. ### What makes your Kei Finance unique? Kei Finance has many unique features built inside the protocol. One such feature is the concept of a \"Minimum Total Supply,\" which ensures that the protocol only mints the exact amount of tokens required to launch. This approach allows the protocol to manage supply in a way that promotes stable growth over time. Additionally, Kei Finance boasts a treasury-backed floor price, which ensures that if the token price ever falls below a certain point, the treasury will automatically buy tokens back to maintain the price above a certain threshold. Kei Finance also offers a distinctive reward distribution mechanism that powers the growth of the protocol. This process sends rewards to different parts of the protocol, such as stakers, administrators and affiliates. It also uses these rewards for debt repayment, to increase liquidity and raise the floor price. Furthermore, Kei Finance has an inbuilt affiliate system, allowing anyone to earn rewards on the blockchain simply by bringing customers to the platform. In terms of staking, Kei Finance offers a range of unique features. The first is staking NFTs, which provide real-time statistics on stake progress and can be traded on opensea and transferred freely. The second is the ability to combine auto-compounding and reward multiplier mechanisms, providing users with an easy way to maximize their returns on their staked assets. ### History of Kei Finance. Kei Finance has been in development since the beginning of 2022, during which time the contracts have undergone a comprehensive testing and simulation process to ensure the protocol delivers on its promises. The team behind Kei Finance recognized the limitations of traditional DeFi applications and services, and created a platform that aims to lead the charge in smart contract and blockchain technology. They achieve this through the innovative architecture and design of the system itself, which addresses the pain points that users face when interacting with other DeFi protocols. By creating a new standard in DeFi, Kei Finance is setting itself up for success as a platform that prioritizes innovation, reliability, and user experience. ### What’s next for Kei Finance? Kei Finance has an exciting roadmap ahead, with plans to roll out a range of cutting-edge technologies that will seamlessly integrate into its existing protocol and reward distribution mechanisms. Among these plans are the creation of decentralized borrowing and lending services, as well as automated asset management systems that provide users with greater control and flexibility. In addition, Kei Finance is exploring secure payment transfer systems, which will further enhance the user experience and make it even easier to pay for services on the blockchain. ### What can KEI be used for? The KEI token serves as the backbone of the protocol and its various services. All distribution mechanisms within the protocol run on the power of the KEI token, and this will continue to be the case for future services. Additionally, the KEI token can be staked within the protocol to create sKEI tokens, which grant the ability to participate in governance proposals through voting. In short, the KEI token has a dual purpose, powering the protocol and enabling community participation in its development.","links":"https://kei.fi","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kei-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0xf75c7a59bcd9bd207c4ab1beb0b32eed3b6392f3"}}}