{"name":"Relay Chain","id":"relay-token","symbol":"relay","description":"RELAY is a multi cross-chain platform developed to bring BaaS (Bridging as a Service) to help the often fragmented DeFi liquidity space. What is really unique to our bridge is that when a new ecosystem is created, our bridge connects that asset and ecosystem to all the other ones we support. At launch we currently support bridging to Ethereum, BSC, Avalanche, Polygon (Matic), and Heco — with more coming soon. Relay's bridges were first to introduce the bridge gas token faucet to Defi where the bridge itself airdrops the native gas token to new users to reduce friction for people starting out on new chains. Our goal at Relay Chain is simple, \"\"Have the best and safest bridge\"\". We will provide value to our token holders by giving them native gas tokens for providing liquidity instead of our native project token (RELAY). By doing this we eliminate all sell pressure to Relay and we can give the highest APY's to Relay Liquidity Providers. This allows us to have a token that provides value, and it's deflationary (via buyback and burns) which is doing with a portion of the gas token profits from bridge transactional volume. The brings the positive feedback loops and true ecosystem synergy into the Relay Chain ecosystem where all partners provide utility to the end users of our platform.","links":"https://www.relaychain.com/","market_cap":172154,"market_cap_rank":3652,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/relay-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5d843fa9495d23de997c394296ac7b4d721e841c"},"avalanche":{"decimal_place":18,"contract_address":"0x78c42324016cd91d1827924711563fb66e33a83a"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x1426cf37caa89628c4da2864e40cf75e6d66ac6b"},"polygon-pos":{"decimal_place":18,"contract_address":"0x904371845bc56dcbbcf0225ef84a669b2fd6bd0d"},"moonriver":{"decimal_place":18,"contract_address":"0xad7f1844696652dda7959a49063bffccafafefe7"},"metis-andromeda":{"decimal_place":18,"contract_address":"0xfe282af5f9eb59c30a3f78789eeffa704188bdd4"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe338d4250a4d959f88ff8789eaae8c32700bd175"}}}