{"name":"Lanceria","id":"lanceria","symbol":"lanc","description":"What is the project about? Lanceria is revolutionizing the freelancing industry with its groundbreaking next-gen platform, offering freelancers a seamless and feeless experience like never before. With its innovative approach, Lanceria aims to unlock the future of freelancing by providing a platform that empowers freelancers and maximizes their potential. As the second branch of this ambitious venture, Lanceria is excited to introduce Lanceria Games. This new platform will feature a multitude of cutting-edge WEB3 games, each designed to captivate and entertain users while utilizing the native token LANC as the in-game currency. Developed in-house and in partnership with renowned studios, these games will offer a unique and immersive gaming experience for players. The introduction of LANC as an in-game currency brings numerous benefits to gamers. It provides a decentralized and secure method of conducting transactions within the gaming ecosystem, enhancing user experience and eliminating the need for traditional payment gateways. Players can seamlessly earn, trade, and utilize LANC tokens across various games, unlocking new opportunities and enabling a thriving in-game economy. Lanceria's dedication to the freelancing community extends to Lanceria Games as well. The platform will provide freelancers with opportunities to contribute their skills and expertise to game development projects, expanding their professional horizons and opening up new avenues for collaboration within the gaming industry. With Lanceria Games, players can look forward to a diverse range of WEB3 games, including action-packed adventures, strategy simulations, multiplayer experiences, and much more. The platform will continually evolve, introducing new games and features to keep players engaged and entertained.","links":"https://lanceria.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lanceria/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xdd848e0cbfd3771dc7845b10072d973c375271e2"}}}