{"name":"Roller","id":"roller","symbol":"roll","description":"RollerApp is a peer-to-peer (P2P) betting platform that aims to revolutionize the betting industry by providing a more transparent, fair, and efficient betting experience for users. The platform utilizes web3 and decentralized randomizer technology to ensure that bets are determined randomly and cannot be influenced by external factors. What sets RollerApp apart from traditional betting platforms is its use of smart contracts to automate the P2P betting process. These contracts are programmed to enforce the rules of the bet and distribute winnings automatically once the conditions of the contract are met. This approach reduces the risk of fraud and ensures a more trustworthy and transparent betting experience for users. RollerApp offers a variety of betting options, including live event betting, head-to-head bets, and pooled betting. Additionally, the platform provides users with the opportunity to participate in Blue Chip NFT pools and staking pools, with early adopters earning APY in Roll Token or ETH from platform revenue. RollerApp is a community-driven project, with stakeholders having a voice in shaping the platform's future and suggesting new betting contracts through RollerDAO. The platform's referral system also offers users the opportunity to earn commissions by referring new users to the platform. Looking ahead, RollerApp aims to expand its offerings and provide users with an even more diverse and exciting betting experience. The platform also plans to continue working with its community to shape the future of the project and ensure that users have a voice in its development. In terms of utility, the Roll Token can be used to pay for betting fees on the platform, and staking Roll Tokens allows users to earn rewards in Roll Token or ETH. Additionally, the RollerDAO NFT can be used to participate in decision-making processes and shape the future of the platform.","links":"https://rollerapp.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/roller/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x2ef61fbe7adc237611e847e9bee5ed1a401fd854"}}}