{"name":"Lumina Bot","id":"lumina-bot","symbol":"lbot","description":"Lumina trading bot offers a mobile trading platform via Telegram. It provides a professional trading terminal for seamless trades, customizable limit orders, and settings for market cap, tax, gas, and liquidity. Anti-MEV protection prevents sandwich attacks, and a referral program fuels community growth. With Ethereum, Arbitrum, BASE and OpBNB compatibility, users can trade on their preferred blockchain. The platform supports direct token transfers, multi-wallet use, autobuys and sells, and upcoming features like Launch sniper, copy trading, and advanced protections such as anti-rug and contract sniping. $LBOT is the native utility token that is used for: * Being eligible for Revenue Sharing which consists of 25% of ALL trading fees and 40% of tax generated * 20% of all tax generated will be burnt * 10% will be used for Treasury/ marketing purposes * Lumina Team will have 0 initial tokens LUMINA Bot tools include: * Custom referral scheme - Earn rewards through our referral program. Share your unique link to get 0.1% out of the 0.65% of lifetime fees from users who sign up using it. You'll earn a portion of fees for every transaction your referrals make * By using a discount link you enjoy discounted trading fees from .65% to .6% * Support for currently 4 chains and 10+ DEXes (constantly adding) * multi-wallets of up to 5 wallets connected at one time * Anti -MEV and private txns LUMINA Protocol launched Mon 21st with 22,000 tokens at launch. The supply is deflationary, due to the token burn. LUMINA Labs is formed by 6 members, each of whom have been in the crypto space for numerous years and have extensive experience in DeFi. They have backgrounds in Development, Finance, Engineering, Accounting and Professional Mining. Individually and collectively they have been involved in Managing and advising multiple successful Protocols.","links":"https://www.luminabot.app","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lumina-bot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0ceccd54323b953a5464fddefc47171c397043f7"}}}