{"name":"ICTech","id":"ictech","symbol":"ict","description":"What is the project about? ICTECH is building the infrastructure that will redefine what Web3 is capable of. Our mission is to provide the resources that complex applications such as metaverses and games need to stand head-to-head with their Web2 counterparts and place them in a rich and ever-expanding ecosystem. What makes your project unique? The world's first Layer-1 dedicated to high-end applications, providing a detailed SDK interface that will allow any developer to quickly build applications on the ICTECH network. Additionally, ICTECH offers a wider range of protocols for NFTs that include minting, trading, burning, lending, borrowing, auctioning, combining, time-based synthesis, and more. This is, arguably, the most in-depth public blockchain network for its field. ICTECH utilizes BFT for its PoS consensus mechanism, allowing it to achieve very high TPS with a 6s finality. Atomic Broadcasts: This allows for multiple types of transactions and commands to be included in the same block, providing real-time consensus. Stay tuned for further developments and details! History of your project. Project launched ICTECH block browser released ICT wallet released Updated ICTECH website ICT wallet supports NFT minting and transfer ICT wallet supports on-chain NFT auctions ICTECH testnet virtual machine release ICT wallet supports nodes, delegation, and voting ICTECH mainnet released ICTECH source released on GitHub Distributed Storage mainnet released Expanded KOL networks and established new ones Web3.0 SDK and API service interface mainnet released CEX listing and growth campaign ICTECH community sync program Implement the cross-chain communication protocol Cross-chain asset transfer verification and testing Cross-chain service is official launch and operation What’s next for your project? Launch ICTECH's dedicated browser extension wallet Support account sync with mobile wallet Support the management of cross-chain assets Support ecosystem mining services On-chain governance and proposal system Decentralized scheduling service for online data storage services Fractal AI model engine for private distributed data training What can your token be used for? The currency of the infrastructure supporting the high-end applications that can properly satisfy Web3 users. ICT is ICTECH's native token and is used to power all its features.","links":"https://explorer1.ictech.plus","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ictech/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}