{"name":"zkSwap","id":"zkswap-92fc4897-ea4c-4692-afc9-a9840a85b4f2","symbol":"zksp","description":"*What is the project about? zkSwap is an Automated Market Maker (AMM) that provides traders with greater control over the price ranges they provide liquidity to, enabling a more efficient trading experience. *What makes your project unique? zkSwap provides the infrastructure for creating and managing concentrated liquidity pools, which increases the capital efficiency for trading and liquidity provisioning compared to classical AMMs that utilize constant product formula. It leverages concentrated liquidity to improve capital efficiency and offers flexible fee structures, auto-compounding fees, and farming rewards. *History of your project. zkSwap is a relatively new project. It started out on zkSync Era Testnet and launched a testnet feedback campaign for the users. Upon receiving overwhelmingly positive feedback, zkSwap launched and sold $ZKSP tokens in a private and a public sale. After successful sale and testnet phase, zkSwap have deployed liquidity to a partner DEX for users to be able to trade right away. Next step is to launch zkSwap on zkSync Era mainnet. *What’s next for your project? Firstly, zkSwap will be audited and deployed on mainnet. Although the source code is already profesionally audited, zkSwap team is still insistent on another round of audit before mainnet launch to ensure the safety of their users. Alongside with mainnet launch, zkSwap will be looking for new partnerships to cement its position in zkSync Era ecosystem and increase its TVL. zkSwap will offer liquidity mining rewards and will look into adding more features. *What can your token be used for? Initially token will be user for: -Bootstrapping initial liquidity and promote the usage of the protocol -Governance token within the zkSwap Protocol to decide about important protocol parameters zkSwap team is considering to add more utility to the token in future","links":"https://zk-swap.xyz","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zkswap-92fc4897-ea4c-4692-afc9-a9840a85b4f2/logo.png","detail_platform":{"zksync":{"decimal_place":18,"contract_address":"0x7ecf006f7c45149b457e9116392279cc8a630f14"}}}