{"name":"ZetaChain","id":"zetachain_ethereum","symbol":"zeta","description":"1. What Is ZetaChain (ZETA)? ZetaChain is the first Universal Blockchain with native access to Bitcoin, Ethereum, Solana, and more, offering seamless UX and unified liquidity to the next billions of users. With its Universal EVM, ZetaChain empowers developers to build Universal Apps that operate natively across any blockchain, creating a fluid crypto ecosystem from a single platform. Audit Report: https://github.com/zeta-chain/audit-reports 2. Who Are the Founders of ZetaChain? ZetaChain’s founder was an early Coinbase employee and one of the creators of Basic Attention Token (BAT). Investors include all major market makers, top exchanges, early Coinbase and Binance employees including Dan Romero, Sam Rosenblum, and John Yi, as well as major contributors to some of the industry’s most widely adopted protocols and well known funds, including Polygon’s JD Kanani. Advisors to the project include Coinbase’s first Head of People Nathalie McGrath who scaled the industry leading exchange from 10 employees to over 800, and Juan Suarez, who served as in-house counsel at Coinbase from 2013 to 2022. 3. What Makes ZetaChain Unique? ZetaChain is the first ever L1 blockchain to enable universal native connection across all blockchain ecosystems. ZetaChain's revolutionary architecture brings programmability to any chains including Bitcoin and Dogecoin, opening up unprecedented possibilities for developers to create truly interoperable applications without sacrificing security or user experience. Applications deployed on ZetaChain can be accessed from any chain and orchestrate data and assets across all connected chains through a single, future-proof Universal Smart Contract.","links":"https://www.zetachain.com/","market_cap":85869721,"market_cap_rank":458,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zetachain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf091867ec603a6628ed83d274e835539d82e9cc8","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf091867ec603a6628ed83d274e835539d82e9cc8"}},"is_native":false}