{"name":"Sommelier","id":"sommelier_ethereum","symbol":"somm","description":"Sommelier is a non-custodial, cross-chain platform for executing actively-managed DeFi investment strategies. Community members can create Cellars that execute on an investment strategy through smart contracts. Cellars are powered by Strategy Providers (SPs) who develop trading strategies and send the recommended actions to the Sommelier Validators to be executed on the Cellar with the intention of gaining yield. Cellars can be strategies like: A portfolio of BTC and ETH that is rebalanced based on price trends that machine learning algorithms identify An NFT trading strategy that leverages Twitter sentiment around particular collections A strategy that hedges liquidity provision on DEXes Sommelier employs a unique architecture consisting of the Sommelier Cosmos SDK blockchain, an off-chain execution environment that keeps strategies private while allowing them to leverage a wide variety of off-chain data modeling techniques, and one of the best performing ETH bridges. Strategy instructions are passed across this bridge to reposition assets in Cellars. This bridge is also being expanded to allow access to other chains (like Polygon, Avalanche, etc) so strategies are not tied to just high gas ETH markets. Sommelier aggregates and batches transactions, thereby reducing gas fees, providing an attractive alternative to Ethereum’s high transaction costs. As for security, Sommelier uses a decentralized governance mechanism run by validators, ensuring state-of-the-art safety of user funds. Validators pass strategy instructions across the bridge, but users’ assets are never moved across it, instead being deployed directly into Cellars. Further, Cellars are non-custodial, meaning that users can withdraw their assets at any time, while strategy providers never have ownership of those assets.","links":"https://sommelier.finance/","market_cap":285758,"market_cap_rank":5388,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sommelier_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0xa670d7237398238de01267472c6f13e5b8010fd1","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xa670d7237398238de01267472c6f13e5b8010fd1"}},"is_native":false}