{"name":"MultiBTC","id":"multibtc","symbol":"multibtc","description":"What is the project about? MultiBTC launched by Multichain,multiBTC is another such wrapped token that brings the best of the two most used blockchain ecosystems together. The main aspect that sets multiBTC apart from others, is that multiBTC can still be redeemed even in the worst case of the cross-chain bridge suspension, meaning we will still offer support until nothing is left. What makes your project unique? * Ease of use — The process of minting and burning mulitBTC is done on the Multichain router with hassle-free steps, requiring minimal effort from users. In contrast, using other wrapping protocols like WBTC requires several steps and technical know-how to execute. * Low fees — multiBTC holders bridge BTC to Ethereum with 0 fees; bridge back to the Bitcoin network with 0.1 % fee, (min. Fee 0.001 multiBTC, max. Fee 0.01 multiBTC). This is lower than many bridge protocols, like RenBTC, which charges 0.2% * Increased liquidity — multiBTC improves the liquidity of wrapped Bitcoin on the Ethereum blockchain and makes it easier to trade it on different platforms and markets. History of your project. MultiBTC was launch by Multichain on December 17th 2022 ,multiBTC holders bridge BTC to Ethereum with 0 fees. Multichain was born as Anyswap on the 20th July 2020 to service the clear needs of different and diverse blockchains to communicate with each other. Each blockchain has its own unique services that it provides, its own community and its own development ecosystem. What’s next for your project? Our goal is to make Make MultiBTC mainstream wrapped BTC, we will provide more options for BTC users to participate in Ethereum. What can your token be used for? The Bitcoin network is a primitive blockchain that records account balances and lacks smart contracts functionality, which means it doesn’t support defi applications directly. Therefore, we cannot bring defi to Bitcoin; however, we can bring Bitcoin to defi by representing BTC as an ERC-20 token.","links":"https://multichain.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/multibtc/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x66eff5221ca926636224650fd3b9c497ff828f7d"},"canto":{"decimal_place":5,"contract_address":"0x80a16016cc4a2e6a2caca8a4a498b1699ff0f844"},"polygon-pos":{"decimal_place":6,"contract_address":"0xf5b9b4a0534cf508ab9953c64c5310dfa0b303a1"},"binance-smart-chain":{"decimal_place":8,"contract_address":"0xd9907fcda91ac644f70477b8fc1607ad15b2d7a8"}}}