{"name":"FxBox.io","id":"fxbox-io","symbol":"fxb","description":"FxBox is the GameFi on BSC. Synergy of Crypto GameFi, Mining NFTs & Forex Trading. We are determined to make the BSC GameFi space entertaining and profitable whilst facilitating profit to ALL our players. Investing, Trading, Lottery, Market Predictions. Advantages of Fxbox: - Investing to Mining NFTs Buy NFTs and stake in mining pool. More Mining Power (MP) will bring more revenue. Not only can you trade or stake but you can also mine with passive FXB flowing into your wallet every second with NO WORK required. This mining income is in the form of the FXB token. - Forex Trading from $1 Foreign exchange market USD/EUR, GBP/USD and etc. is a global decentralized or OTC market for trading currencies with a leverage of 1:100 up to 1:1000. Currency trading involves buying one currency and simultaneously selling the other. To facilitate such operations, currencies are traded in pairs. For example, EUR/USD, Euro vs. US Dollar pair. When buying 1 lot of EURUSD at 1.0591, you are paying 105,910 USD to buy 100,000 EUR. To benefit from the trade, you need the price of the pair (1.0591) to rise. To trade on the currency market online, there is no need for you to make a large initial investment. To reduce the cost of the transaction, you can use a smaller lot (a minimum lot on FxBox is 0.01), or leverage. The latter expands your trading capacities but also increases the risks. - Oracle GameFi Betting FxBox Oracle is fun and simple decentralized prediction market betting. Predict whether EUR/USD, GBP/USD, JPY/USD, BTC/USD, ETH/USD, BNB/USD price will rise or fall – guess correctly to win FXB or BNB/USDT/USDC. - Decentralized Lottery (BSC) Playing the Lottery gives you a chance to win FXB or USDT or BNB. It's easy, fair, and you can enter as often as you like as long as you have the FXB or USDT or BNB to buy a ticket","links":"https://fxbox.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fxbox-io/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0dbcec4214d7e9c316e0eb53991a43f42f432e15"}}}