{"name":"Snipe Finance","id":"snipe-finance","symbol":"snipe","description":"SNIPE is a multi-reward token available on the CIC & BSC platforms. By simply holding SNIPE, users can generate wealth and gain access to a range of useful, easy-to-use, and secure DeFi tools. In addition to these benefits, SNIPE holders also have the privilege of voting for various services, such as third-party audit services and custom SaaS development. The team behind SNIPE aims to create and provide tools that are specifically tailored to the needs of SNIPE holders. Through the SNIPE Voting Dapp, holders can decide which tools should be developed and made available. The SNIPE token empowers all SNIPE Services, granting holders access to extra features, discounts, or even free tools. The token is designed for growth, with constructive fees that primarily benefit holders who hold a minimum of 100 SNIPE tokens. The team holds 20% of the tokens and receives rewards as an incentive to continue developing the project. These rewards are dependent on the volume, so the team is motivated to create utilities and products that encourage the recurring use of SNIPE. Furthermore, SNIPE offers the unique opportunity to choose your own reward token, which will be automatically received every hour if there is sufficient volume and transactions. The token is also deflationary, with 1% burned with each transaction, permanently reducing the circulating supply. Long-term holders can enjoy higher liquidity thanks to the liquidity fees. Overall, SNIPE provides a comprehensive ecosystem for token holders, offering wealth generation, access to valuable tools, and the ability to shape the development of the platform through voting. With its growth-oriented design and attractive features, SNIPE is poised to become a leading player in the DeFi space.","links":"https://snipers.snipefinance.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/snipe-finance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf1baa6f40267a14f66af9ec0b467fb7f22b09518"}}}