{"name":"Kin","id":"kin","symbol":"kin","description":"Kin is a decentralized cryptocurrency that enables global permissionless transactions without the need for intermediaries. The Kin cryptocurrency is noninflationary, with a fully distributed supply that can't be increased. Kin was created in 2017 by Ted Livingston's Kik Inc. and initially launched on the Ethereum blockchain. In 2020, Kin became the first cryptocurrency to migrate to the Solana blockchain. The Solana blockchain enables Kin to efficiently scale for mainstream global adoption with near instant transactions and fees of just fractions of a penny. Additionally, Solana’s blockchain technology has 0% net carbon impact, providing a sustainable platform for the global Kin economy. Kin is used as money in a growing economy across independent websites, apps, games, and services including Code Inc.'s global payments platform, which empowers content creators and developers to monetize with micropayments. With Code’s permissionless payment platform, creators can charge as little as $0.05 for content they create online, unlocking new revenue streams not possible with traditional payment models due to fee structures. In 2024, Code Inc. received seed round funding from top VC firms USV and M13, as well as blockchain industry leaders Anatoly Yakovenko, Raj Gokal, Balaji Srinivasan, and others. In 2020, Kik Inc. agreed to a mutual settlement with the United States SEC, in which Kin was not required to be registered as a security, making Kin one of the few cryptocurrencies with regulatory clarity. Kin is fully decentralized. There is no centralized entity or foundation that manages the development of the Kin economy or speaks on its behalf. Rather, Kin is supported by an autonomous independent global community of stakeholders who are economically aligned and mutually incentivized to expand Kin's utility and collectively benefit from the value created as adoption grows. We are all Kin.","links":"https://kin.org","market_cap":46749201,"market_cap_rank":615,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kin/logo.png","detail_platform":{"solana":{"decimal_place":5,"contract_address":"kinXdEcpDQeHPEuQnqmUgtYykqKGVFq6CeVX5iAHJq6"}}}