{"name":"Gençlerbirliği Fan Token","id":"genclerbirligi-fan-token","symbol":"gbsk","description":"GBSK Token is a crypto asset developed by Bitci Teknoloji Anonim Şirketi on Bitcichain pursuant to the GBSK Token Production and Cooperation Agreement signed with Gençlerbirliği F.C (together the \"Parties\"). Crypto assets are intangible assets that are created using distributed ledger technology or similar technology and distributed over digital networks, but are not characterised as fiat money, dematerialised money, electronic money, payment instruments, securities or other capital market instruments. This white paper aims to provide potential participants with some information about the Gençlerbirliği Fan Token (\"GBSK\") created by Bitci Teknoloji A.Ş. on the Bitcichain network. GBSK is the official token of the Gençlerbirliği F.C Team. With the development of technology, crypto assets have become more and more popular day by day. Crypto assets, which can be used in many areas, have also shaped different sectors by expanding their usage areas. Changing and transforming end-user behaviour has prioritised the need for a sharing and experience ecosystem in an increasingly digitalised world. Interactions now take place outside of the match day, whenever the \"participant community\" wants, in any medium they want, and are becoming increasingly personalised. It is predicted that companies, teams, etc. that successfully realise this digital transformation process will be able to get more contribution by using the power of fans. Therefore, the experience and social interaction, which is even more meaningful for the fans, can turn into an economic and social activity that will contribute to the team in these periods. The interest in football is increasing day by day worldwide. In a world governed by the commodification of time, fan-based projects aim to achieve success together by taking into account the views of the fans. It is aimed to increase fan interaction by using blockchain technology in the process of uniting football teams and fans.","links":"https://www.bitci.com/en/projects/GBSK","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/genclerbirligi-fan-token/logo.png"}