{"name":"Rootstock RSK","id":"rootstock","symbol":"rbtc","description":"RSK is the first open-source smart contract platform with a 2-way peg to Bitcoin that also rewards the Bitcoin miners via merge-mining, allowing them to actively participate in the Smart Contract revolution. RSK goal is to add value and functionality to the Bitcoin ecosystem by enabling smart-contracts, near instant payments and higher-scalability. The project has been conceived with the following principles in mind: Bitcoin Friendly We believe in Bitcoin. We support the Bitcoin community and we want to continue the legacy of Bitcoin´s pioneers. The lack of turing-complete smart-contracts capabilities may become an obstacle to Bitcoin´s growth to it´s full potential. RSK provides the missing technical needs, as a blockchain with a 2way peg to Bitcoin. As RSK does not mint, nor has pre-mined coins, then it has no speculative value and does not compete with Bitcoin. Security The security of RSK is our main priority. RSK´s blockchain is secured by merge-mining, which means that we can achieve the same security as Bitcoin in terms of double-spend prevention and settlement finality. The 2way peg security will first rely in a federation holding custody of bitcoins, and later switch to an automatic peg, when the community accepts the security trade-offs of the automatic peg. Scalability RSK can scale far beyond Bitcoin in its current state. RSK scales to 100 transaction per second (same level as Paypal) without sacrificing decentralization and reducing storage and bandwidth usage using probabilistic verification and fraud proofs, as well as blockchain sharding techniques. Instant Payments Since the creation of Bitcoin there has been a race for faster transaction confirmations. Instant payments allow new use cases, such as retail store payments, and transactions in online games. RSK carefully chosen parameters and new theoretical protocols (such as DECOR+GHOST) allow creating blocks at 10 seconds average interval, with low stale block rate, and no additional centralization incentives.","links":"https://www.rsk.co/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rootstock/logo.png","detail_platform":{"rootstock":{"decimal_place":18,"contract_address":"0x542fda317318ebf1d3deaf76e0b632741a7e677d"}}}