{"name":"1inch","id":"1inch","symbol":"1inch","description":"\"What is 1inch Network? 1inch Network is a decentralized exchange (DEX) aggregator to help users discover the best trade prices for tokens. Instead of swapping tokens from a single liquidity pool of a DEX, 1inch will aggregate across different pools and suggest the most efficient way to trade tokens. Why use 1inch? If you are a trader trading large amount of tokens, you may not be aware of all the availability liquidity across different DEXes in order to get the best price quote. Price quote offered by DEX fluctuates according to the liquidity pool at any given time. Also, when you are trading large size, every percentage of savings can be magnified with an optimal trading path. 1inch aims to solve all that in a single user friendly interface. What is Pathfinder? Pathfinder is the discovery and routing algorithm developed by the 1inch team. It is the algorithm the powers the backend to finding the most efficient route to swap a token. For example, if a user wants to sell ETH for WBTC, Pathfinder will explore all DEXes such as Uniswap, Curve, Balancer, DODO, Sushiswap, and more. The result is a recommended route that optimizes fees and liquidity in order to give users the best rate. Users no longer need to check each individual services in order to find the best price. Who are the creators of 1inch? 1inch was founded by Sergej Kunz and Anton Bukov. The idea for 1inch was developed at a hackathon in just over 60 hours at New York City. Fast forward today, it is one of the fastest growing DeFi product.\"","links":"https://1inch.io/","market_cap":441709720,"market_cap_rank":177,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/1inch/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x111111111117dc0aa78b770fa6a738034120c302"},"avalanche":{"decimal_place":18,"contract_address":"0xd501281565bf7789224523144fe5d98e8b28f267"},"harmony-shard-0":{"decimal_place":18,"contract_address":"0x58f1b044d8308812881a1433d9bbeff99975e70c"},"near-protocol":{"decimal_place":18,"contract_address":"111111111117dc0aa78b770fa6a738034120c302.factory.bridge.near"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x111111111117dc0aa78b770fa6a738034120c302"},"polygon-pos":{"decimal_place":18,"contract_address":"0x9c2c5fd7b07e95ee044ddeba0e97a665f142394f"},"energi":{"decimal_place":18,"contract_address":"0xdda6205dc3f47e5280eb726613b27374eee9d130"}}}