{"name":"Games for a Living","id":"games-for-a-living","symbol":"gfal","description":"What is Games for a living? Games for a living is a Web3 gaming platform that aims to revolutionize the gaming industry by releasing the first sustainable blockchain game with its first title, Elemental Raiders. The platform plans to add subsequent first-party titles, such as Diamond Dreams. In addition, the platform offers a frictionless login, wallet integration, and payments, the GFAL ID & Portal, as well as a Marketplace and analytics tools to provide a unique gaming experience. What is GFAL? GFAL is the native currency and utility token of all the games on the platform. The token is designed to be a bridging asset in operations of all kinds within the ecosystem. One of the primary uses of $GFAL is in-game and on the marketplace. Users need $GFAL to mint game assets into NFTs, purchase exclusive assets, and trade them. The VIP system also gives active users of $GFAL discounted transactions, priority access, and governance rights. Additionally, developers can access the developer portal, game analytics, and live events by holding $GFAL. Who are the founders of Games for a living? Games for a living was founded in 2021 by Manel Sort (CEO), the former FVP and GM of King Barcelona Studio, Trip Hawkins (CSO), founder and former CEO of both Electronic Arts and Digital Chocolate, Javier León (Art Director), an Emmy Award Nominee, Christian Gascons (COO), Marc Tormo (CCO) both ex-Blizzard Entertainment, Carlos Blanco and Ernest Sánchez, both entrepreneurial leaders in the field of new technologies, with numerous achievements backing their expertise. The management team alone has a combined experience of 140 years in building and growing video game startups.","links":"https://gfal.com","market_cap":17961088,"market_cap_rank":1147,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/games-for-a-living/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x47c454ca6be2f6def6f32b638c80f91c9c3c5949"}}}