{"name":"IdenDEFI","id":"idendefi","symbol":"id","description":"Simplifying trading for all levels Unless you are scanning contracts 24/7, have mastered etherscan, or are lucky enough to be an “insidoor,” the chances you buy into honeypots or rugs are fairly high. Sadly, there are bad people in the world, with no integrity or respect for others. That being said, the potential to invest in tokens and projects that provide significant, life-altering returns still remains. But how can you quickly and easily identify good coins? By merging our experience as investors in ERC-20 tokens, along with our background in software and data analytics, our team has developed a suite of tools to simplify and enhance your trading techniques, so that you identify the safe “mooners” early and avoid the “skems.” IdenDEFI is a multi-purpose protocol offering users a fresh and clean solution for token launch research. Our tool extracts various forms of data- deployer transaction details, honeypot warnings, key deployer timestamps, etc., in order to identify launches with red flags. How it works → As Michael Scott famously coined, “keep it simple, stupid.” The art of simplifying any product can be a challenge in and of itself. Our mission is to reduce the number of open tabs on your browser, save time jumping through every telegram channel, and cut down your key strokes before executing each trade. Our user interface allows you to paste a specific token contract into our website to return , or command “/ID [insert token address] using our Telegram bot, in order to access key data points to influence a buy or not buy decision. IdenDEFI Key Features → Identifying key attributes in each token launch and tokens using similar smart contract. These features include: -Number of tokens launched with similar contract -Number of rugs (liquidity removals less than 7 days) for similar tokens/contracts -Rug rate % -Average Market Cap for similar tokens/contracts -Number of transactions for similar tokens/contracts -Honeypot warning — returns risk of honeypot","links":"https://idendefi.app/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/idendefi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x453660ec2b63f0453d42f72c808350c1e2c70153"}}}