{"name":"Alpha Fi","id":"alpha-fi","symbol":"alpha","description":"AlphaFi - Premier Yield Optimizer on the Sui Blockchain AlphaFi is the number one yield optimizer on the Sui blockchain by TVL. By leveraging top protocols, AlphaFi not only generates superior yields but also compounds them automatically, providing users with seamless wealth growth. The ALPHA token fuels the AlphaFi ecosystem, ensuring long-term sustainability and benefits for both users and the platform. Key Features: 1. Smart Strategies: AlphaFi integrates with multiple top-tier protocols to maximize yield generation and enable auto-compounding. 2. Auto-rebalancing and Auto-compounding Pools: Efficient management of concentrated liquidity pools ensures optimal returns. 3. User-Friendly Experience: Invest with ease, witness your wealth grow, and profit without the complexities. 4. Robust Security: User safety is paramount. The code is audited by MoveBit, and security is monitored by zeroShadow (ex-Chainalysis). ALPHA Tokenomics: 1. Scarce Supply: Limited token availability enhances value. 2. Automatic Buy Pressure: Protocol growth naturally increases token demand. 3. Continuous Rewards: Regular airdrops for token stakers promote long-term engagement. Boosting SUI’s DeFi Ecosystem: AlphaFi is committed to enhancing SUI’s DeFi landscape by increasing TVL and fostering ecosystem growth. By aggregating multiple protocols within the SUI network, AlphaFi ensures high yield generation while channeling significant TVL from the BNB Smart Chain. Existing Pools: 1. Auto-compounding Auto-Rebalancing Pools: Includes pairs like USDC-USDT, USDC-SUI, USDY-USDC, and WETH-USDC from Cetus. Users deposit in AlphaFi, and our smart contracts efficiently manage these assets within Cetus. 2. Alpha Auto-compounding Vault: A specialized vault designed for optimized returns. 3. Alpha-SUI Pool: Listed on Cetus with approximately $1 million in liquidity, ensuring robust trading activity and liquidity. Growth Projections: Currently, AlphaFi leads as the top yield optimizer on the SUI blockchain with $12 million in TVL. Our target is to achieve $20 million TVL within the first month post-launch.","links":"https://www.alphafi.xyz/","market_cap":27600399,"market_cap_rank":1187,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alpha-fi/logo.png","detail_platform":{"sui":{"decimal_place":9,"contract_address":"0xfe3afec26c59e874f3c1d60b8203cb3852d2bb2aa415df9548b8d688e6683f93::alpha::ALPHA"}}}