{"name":"BullBar","id":"bullbar","symbol":"bull","description":"What is the project about? At BullBar, We thrive on promoting and amplifying the Hedera ecosystem, uniting the community as one. Through the launch of $bull, we aspire to enhance interest, fun, and utility. Growing our community day by day. What makes your project unique? Our project is gaining significant traction in the hedera ecosystem currently. The recent launch of our Bull VIP Pass is just one example, where holders of our NFT receive biweekly airdrops of $bull and also are entered into raffles for other projects on hedera. We have grown an amazing community and garnered support from some of the leading projects on HBAR, to include Kabila labs - who we used for our NFT launchpad. working alongside other projects has really been a great way to unite everyone. History of your project. We have just recently got default listing (Full listing) on Saucerswap, which is a huge leap for us. We also released our Bull VIP Pass collection last week - which sold out in 18 minutes!. This NFT is token gated which includes unparalleled utilities amongst other projects on Hbar. We have set up & established 2 more liquidity pools with other projects on Hedera, thus significantly increasing our overall TVL What’s next for your project? Growing our community first and foremost. We have just applied for a farm on Saucerswap, which will be amazing for $BULL holders whilst simultaneously increasing TVL. Our 2024 Full NFT project is in the planning stage and will be released early Q1. We are also working closely with the Kabila labs launchpad on the art work. Our current Bull VIP pass will act as a Whitelist spot for the 2024 collection alongside out $BULL token. We will look to go cross chain with partners who we have made liquidity pools with on Saucerswap. What can your token be used for? Trading on Saucersawp, WL spots for events, raffles & airdrops associated to our Bull VIP pass NFT, and the 2024 Full NFT collection. Also Future farms where people can earn LP rewards.","links":"https://bullbarcoin.xyz/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bullbar/logo.png","detail_platform":{"hedera-hashgraph":{"decimal_place":6,"contract_address":"0.0.3155326","geckoterminal_url":"https://www.geckoterminal.com/hedera-hashgraph/tokens/0.0.3155326"}}}