{"name":"Utility Cjournal","id":"cjournal","symbol":"ucjl","description":"What is the project about? CJournal, as a Read to Earn project, aims to create transparent and credible on-chainnewsand reviews for the crypto industry. In return for reading and reviewing articles users earnrewards. CJournal provides first-hand blockchain news to help you understand thelatestcryptocurrency trends. $UCJL is Cjournal's reward token, totaling $1billion. Users earn $UCJL when readingandcommenting on article. $UCJL can be converted into $CJL at a fixed rate. The $UCJL can be sold, used to enter future community events, or paid to viewpaywalledarticles. What makes your project unique? Blockchain technology's smart contracts enable journalism to return to a value-drivenapproach to journalism. Decentralized blockchain technology can be used to managemanyaspects of the media that previously could only be handled by organisations. Every user onthe blockchain can access all platform information. As a result the distribution of advertising, copyright protection and payment of authors is more open, accurate and direct. Inthis newmodel, the value of the journalism becomes the most important factor for mediaorganizations or individuals to consider in order to make profits. At the same time, CJournal will aggregate news and articles from more than 300 well-knownwebsites, new sources will be added regularly. All articles published are manually screenedby editors and sorted by CJournal's algorithm to help you prioritize topics, events andtrendsof interest. What can your token be used for? $UCJL is Cjournal's reward token, totaling $1billion. Users earn $UCJL when readingandcommenting on article. $UCJL can be converted into $CJL at a fixed rate. The $UCJL can be sold, used to enter future community events, or paid to viewpaywalledarticles.","links":"https://cjournal.xyz/index","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cjournal/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf5355ddc7ffbf7ca119bf3222cb0ecac2fbb4502","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xf5355ddc7ffbf7ca119bf3222cb0ecac2fbb4502"}}}