{"name":"HNC Coin","id":"helleniccoin","symbol":"hnc","description":"What is HNC Coin? • HNC Coin was established in 2015. First block was generated on Feb 8th, 2015. The initial blockchain was fork of Litecoin and after the last hard fork on July 2021 it became fork of Dash Coin, focusing on maximizing safety and speed of transactions. Who are the founders of HNC Coin? • HNC Coin was founded by a team of Greek highly experienced blockchain developers. In 2020 new developers have joined the team and it is scheduled for more entries for the next couple of years to develop HNC’s Coin Ecosystem. What makes HNC Coin unique? • Unlike most digital currencies, the HNC is designed to be a dual-purpose currency. That is, to exist as a means of payment on the one hand but also to be treated as an innovative investment solution on the other. Also provide a complete payment ecosystem and integration its use into it. • After hard fork on 17th July 2021, HNC Coin became fork of Dash Coin, X11 algo and supports instant send option for up to 1,000 HNC Coins within 1,3’’ and private send as well. Where can you buy HNC Coin? • Currently HNC Coin is traded at: - P2PB2B (https://p2pb2b.io) - GokuMarket (https://gokumarket.com/) - HNC Revolution (https://hnc-revolution.com/) - Finexbox (https://www.finexbox.com/) - Xeggex (www.xeggex.com) • More exchanges will be added in the future How many HNC Coins are there in Circulation? • Coin structure is as follows: - Total supply is: 100M - Circulating supply: 93M - Locked in life to Master Nodes: 10M (1m/Master Node) - Tradeable coins: 83M - Coins available for mining: 7M How is the HNC Coin network secured? - HNC’s Coin network consists of 10 Master nodes (each master node requires 1M coins). Coins of all ten (10) Master nodes are locked in life from HNC’s team to protect the network. More Master nodes are about to be added soon. - A master node has a full copy of the HNC blockchain and performs tasks such as block validation, Private Send, and Instant Send, (Private Send is a function that enhances user’s privacy by obscuring the origin of funds and with Instant Send the user can instantly send to another wallet up to 1.000 HNC Coins). The master nodes will receive payments for the above-mentioned services.","links":"https://hnc-coin.com/","market_cap":452199,"market_cap_rank":4712,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/helleniccoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}