{"name":"ElseVerse World","id":"elseverse-world","symbol":"ells","description":"1. What is the project about? ElseVerse is an interconnected network of parallel universes where users can immerse themselves in an array of fascinating experiences. Once you enter the ElseVerse metaverse you will discover a place built for you to live, dream, socialize, shop and play in amazing adventures. 2. What makes your project unique? - Variety of revenue-generating mechanisms - Well-thought-out earnings mechanics to create real-life value - Character customization and animation - More opportunities for creating your own objects - Recording and streaming of in-game experiences - Exciting gameplay with competitive elements - Massive multiplayer technology - User-friendly earning and trading mechanics - Low entry threshold for character creation (free-to-play/earn) - Intuitive interface and easy onboarding - Opinion leaders and brands onboarded 3. History of your project. ElseVerse is the incubation project of GamesPad.io 4. What’s next for your project? ElseVerse is going to do the IDO in April and get listed on multiple top exchanges. 5. What can your token be used for? #1 Encouraging participation Users can stake tokens, earn revenue, and use synthetic tokens (S-ELS) for in-game transactions like NFTs, dragons, and other virtual goods. Lock-up periods help maintain token price stability. #2 Circulating economic model Players can enter paid competitions against other players and win prizes. Thus, they can contribute to the game's economy by circulating the token. #3 Gradual vesting Our vesting schedule for team members, advisors, and early investors ensures controlled token release and avoids potential price crashes. #4 Long-term sustainability Allocate tokens for liquidity, treasury, partnerships, rewards, and marketing, supporting growth and rewarding early adopters. #5 Scalability and adaptability We prepared for future changes, including token burns and buybacks, ensuring long-lasting sustainability.","links":"https://elseverse.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/elseverse-world/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}