{"name":"SwiftSwap","id":"swiftswap","symbol":"sws","description":"- What is the project about? SwiftSwap is Leverage DEX allows traders to increase their buying power by using leverage. This means you can amplify your gains (or losses) by borrowing funds from the platform to make bigger trades - What makes your project unique? SwiftSwap is confident that it can compete with both developing and developed DeFi projects in the market because it offers high liquidity, fast transactions, and convenient connectivity that make for an excellent user experience. However, unlike past and present DeFi exchanges, SwiftSwap acknowledges the limitations of these platforms, such as the lack of leverage trading, margin trading, the inability to track fluctuations of the coins being traded, and low security. Therefore, SwiftSwap's development team has combined the quintessential features of both DEX and CEX to create an all-in-one platform that empowers users with analytical insights and a suite of utilities to facilitate swift, seamless, profitable, and secured trades at low costs with up to 200x leverage. This unique combination makes trading easier than ever before. - History of your project: The project has been developed since the end of 2021 with 3 key members - What’s next for your project? Q2 2023: Launch SwiftSwap IDO & DEX, implement yield farming. Q3 2023: Launch Swiftpad, develop portfolio tracker. Q4 2023: Implement limit orders, launch yield farming V2, update UI, launch lending/borrowing. Q1 2024: Launch advanced trading features, implement governance system, list on centralized exchanges, launch NFT marketplace. 2024-2026: Develop mobile app, improve existing features, launch new features based on user demand, expand team/community, develop partnerships. - What can your token be used for? SwiftSwap is a decentralized leveraged trading platform built on the Ethereum blockchain. The platform's native token is called SWS, and it serves several purposes within the SwiftSwap ecosystem. First and foremost, SWS can be used to pay","links":"https://swiftswap.exchange/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/swiftswap/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x716de634227c1831f78d1989c92c6495e279a084"}}}