{"name":"Swiss NFT Fund","id":"swiss-nft-fund","symbol":"swissnftfund","description":"Dear Investor - Grüezi from Switzerland! Switzerland, rich profound history in the financial world and a pioneer in the Crypto space! After months of hard work and ups and downs we are excited to announce the establishment our own fund. Having acquired all the expertise and skills, we are taking NFT investments to the next level. Three swiss entrepreneurs and NFT/Crypto enthusiasts, with 10 years of combined experience decided to bundle all their know-how to create an investment fund, which gives the investor security in the form of stability, transparency and most importantly return. This fund is named “Swiss NFT Fund”. As the name already portraits, the fund is based and managed in and out of Switzerland. Swissness is our pride and passion, which is reflected in the NFT investments of the fund. We are planning to launch new collections with established artists from Switzerland and most importantly: We will lead Swiss investor groups and private investors into the CRYPTOSpace. We are in the process of forming an NFT fund in the form of an ERC20 token. With each investment 8% of the volume flows into the NFT fund “Swiss NFT Fund”. Our team of highly skilled investment specialists, invests only in blue chips and potential blue chips. Asset protection is a key priority for us. Each investment is looked at carefully and due diligence is carried out thoroughly. Our analysts only invest in projects, where it is ensured that there is no fraud and questionable fine print. This is where our years of experience come into place and what our investors are looking for. The NFTs purchased by the fund will be held for a minimum period of 1 year. The investment profits are then used to buy and burn our own token. To our loyal token holders - we got you covered! Our loyal token holders will receive 2% of the trading Volume in the form of Swiss NFT Fund tokens. This distribution will occur automatically to your wallet with every transaction. Have we raised your interest? You","links":"https://www.swissnftfund.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/swiss-nft-fund/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x64c1c9a38038ae73c3699b8dc347fefda2221e93"}}}