{"name":"Obsidium","id":"obsidium","symbol":"obs","description":"What is Obsidium? Obsidium is an ecosystem, serverless, cross-chain, layer-2 solution that fuel the crypto space with DeFi, AMM & NFTs. It’s benefits include infinite scalability, high throughput sub-second confirmation time, and fees at a tenth of a cent. OBSIDIUM MISSION Facilitate education, research, and continued development of the OBS Ecosystem to increase understanding of the public benefit of an incentive driven metaverse ecosystem. About $OBS into Ecosystem Obsidium token will power the Obsidium Ecosystem and will give governance power to those who own’s it. $OBS will be used for fees, rewards, utilities, staking and providing a total supply for new born tokens into Obsidium Ecosystem. Focus & Development Areas Simplifying Real assets registry It’s still manipulated and not 100% transparent. Obsidium is proposing to build an 4D scanning app to empower anyone to register an real assets/good into the blockchain technology. AI recognition of lands, property’s, cars, etc… Layer Two Solution Building the first cross-chain layer-2 ecosystem to simplify real and virtual assets registry plus tokenization. We propose the sub-second identification of any duplicate item, asset, token or smart contract on any blockchain available. Integrating AI identity protection and deduplication. Decentralized Applications Building the first cross-chain layer-2 dApp (Decentralized Application) into the Obsidium ecosystem that will provide fundamentally core functionality under the new under development technology of one click setup using no-code interface. ( e.g. Identity, Yielding, Farming, Minting. ) NFTs Marketplace Building the first cross-chain layer-2 NFTs Marketplace that will open the metaverse, omniverse and any virtual world for content creators and digital art lovers to interact and transact with all NFTs available in any other Marketplace of any other blockchains. ( e.g. Avatars, Skins, Virtual Lands, Characters, Virtual Properties, Virtual Adds. ) Exchange Developing the first Exchange to interact and transact from any blockchain at a tenth of a cent transaction costs. Exchange Token for Token, NFT for NFT, Token for NFT or any virtual assets available. Launchpad Developing the first cross-chain layer-2 Launchpad with the new under development technology of one click setup using no-code interface where new born project can be launched into our Ecosystem. Liquidity Developing the first cross-chain layer-2 Liquidity Provider and Liquidity Locker with the new under development technology of one click setup using no-code interface. Tokenomics & How it works The main mechanisms of Obsidium contract include a 6% sell fee. Only applicable for 6 months (0% thereafter) Anti-Dump Max Sell no more than 1.05% of supply over 24 hours – only applicable for 6 months (0% thereafter)","links":"https://obsidium.info/","market_cap":16035.26,"market_cap_rank":4292,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/obsidium/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc6f509274fcc1f485644167cb911fd0c61545e6c"}}}