{"name":"BetGosu","id":"betgosu","symbol":"gosu","description":"Electronic sports betting is a type of wagering for players of well-known video games available right now, such as DOTA2, LOL, CS:GO, PUBG, and others. Thanks to the success of these quality gaming communities, the e-sports betting industry was born. Similar to conventional sports that were played hundreds of years ago, e-sports nowadays are continually evolving and feature competitions and teams from many countries and regions. Every successful e-sport has its own \"environment\" with a sizable player and viewing base. The competitions have a huge following and are run in a very professional manner. As a result, this is also referred to as a billion-dollar industry operated by large corporations. To indulge their enthusiasm and cheer for their preferred team, those who enjoy watching the fast-paced clashes of e-sports but are not professional players would choose this type of betting. You can trust that the current e-sports betting odds will always be adjusted and updated to provide gamers additional choices. What could be more wonderful when we combine Blockchain and e-sports betting? Players feel the great feeling of staking on the blockchain, continuous app operation, transparent finance, fast withdrawals, and deposits without any restrictions. And from that idea, BetGosu was developed by us. BetGosu is the first e-sports betting project built on Blockchain technology and operated on the Binance Smart Chain network. Our team upholds a high standard for the quality of a product. From concept to execution, BetGosu is committed to delivering a product that optimizes security, simplicity, and user experience to indulge our players with comfort and the feeling of security while playing on our platform. Our contracts will be audited by known bodies and thoroughly stress tested.","links":"https://betgosu.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/betgosu/logo.png"}