{"name":"ENO","id":"eno","symbol":"eno","description":"ENO is the 1st decentralized wine project that makes the authentic wine culture popular, thanks to new blockchain technologies bringing innovative solutions in payment, liquidity staking, asset value storage to all wine industry players worldwide. ENO works to unify the whole wine ecosystem in a decentralized community by getting together farmers, vineyards, exporters, importers, consumers, hotels, sommeliers, and crypto users from around the world. ENO is the first wine token that helps secure the tradition of wine crafting with the new digital wine revolution through blockchain, keeping the history of the wine culture across the new data technologies. ENO is a token specifically created for the wine environment that will allow it to be used for goods and services, produced by the environment itself as: * Payment token within our network of partners and collaborators, giving access to exclusive products and experiences. * Liquidity Stacking providing the ability to deposit ENO within a Smart contract, receive benefits in the form of pre-sales, returns or discounts * Value Storage: ENO Token is directly connected and related to the wine industry, so the growth of the industry and the appreciation of ENO are completely bound. The creation of an international market for crypto assets in the wine industry that will benefit producers and consumers. ENO Bottle NFT´s Exclusivos: Users will be able to purchase exclusive and prestigious bottles, which can be obtained with ENO within our platform (App and Dex). NFT format to be used to certificate users as holders of the unique and exclusive pieces, ONE Bottles NFT’s Externos: Producers and collaborators will be able to create their own crop specific NFT’s, ENO Academy: Knowledge base provided with most of the prestigious Sommeliers. Moreover ENO holders benefit in exchanging ENO to exclusive edition bottles, wine tasting exclusives, hotel partners experiences, exclusive adventures.","links":"https://enotoken.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/eno/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1c3d163219bb74f430411b95d66b72056f366ec1"}}}