{"name":"ENO","id":"eno","symbol":"eno","description":"RWA, DEFI ENO is a Web3 platform fostering decentralized social clubs by offering tools like tokens and NFTs, aimed at enhancing community creation and engagement. What is the ENO token?: ENO introduces a novel ecosystem of vibrant, decentralized social clubs that unite individuals around shared passions and interests. Utilizing blockchain technology, ENO transcends traditional social club constraints, offering an inclusive, transparent, and empowering platform for community building and engagement. Innovative Ecosystem Components: ENO Token: The backbone of the ecosystem, serving as a utility token that facilitates transactions, rewards participation, and grants access to premium features within ENO Social Clubs, ENO Swap, ENOVERSE, and more. Decentralized Social Clubs (ESC): These clubs form the core of the ENO ecosystem, providing a dynamic space for members to connect, collaborate, and engage in curated experiences based on common interests. ENO Wine Social Club (EWSC): A flagship component showcasing a premium, exclusive focus on the fine wine experience, integrating Wine Digital Assets (WDA) that represent unique wine-related privileges and experiences. ENO Labs: The innovation hub supporting the decentralized social club ecosystem with services including design, marketing, programming, and strategic guidance. ENO Swap: A decentralized exchange platform within ENO, facilitating secure token exchanges and enhancing liquidity within the ecosystem. ENOVERSE: A virtual and augmented reality platform that elevates social interaction and collaboration, offering an immersive environment for community members. ENO Academy: The educational branch providing extensive resources, workshops, and courses on blockchain technology and social club management.","links":"https://eno.network/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/eno/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1c3d163219bb74f430411b95d66b72056f366ec1","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x1c3d163219bb74f430411b95d66b72056f366ec1"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x2b41806cbf1ffb3d9e31a9ece6b738bf9d6f645f","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x2b41806cbf1ffb3d9e31a9ece6b738bf9d6f645f"}}}