{"name":"Jade Currency","id":"jade-currency","symbol":"jade","description":"Jade Currency is a BEP-20 token to be fast transaction over Binance Smart Chain stakeable in all platforms to provide high APR returns. The project committed to changing the world by creating the first ever NFT (non-fungible token) marketplace and metaverse shop for precious gems such as jade where buyers can purchase in cryptocurrency. It is believed the future holds a strong demand for the use of cryptocurrencies and there is somewhat of a barrier to entry for the current industry which Crypto Jade can solve. The holders of Jade Currency (JADE) token have majority ownership of the company. Jade Currency NFT marketplace and metaverse shop will be the preferred destination for buyers and seller of precious gems. Blockchain cost, specifically Binance Smart Chain, lowers transaction fees on both small and larger purchases when compared to other forms of payment. Jade Currency is the only cryptocurrency that is focused within this multi-billion dollar industry. The security of the blockchain, wallets, and Jade Currency are impossible to compromise. Not to mention BSC has one of the fastest transactions speeds of any blockchain currently offered. The pilars of Jade Project are: - The demand The price of jade and other stones has continued to rise for the last couple of centuries due to the preferences of the Chinese culture and inflation of the global money supply. Also, the average price of top cryptocurrencies has risen 500% this last year alone. The metaverse has seen LAND values increase by just as much. - The utility Our Jade Currency NFT marketplace and virtual shop in the metaverse will be both easy to use and exciting to explore. Sellers will be able to customize their shops with the products they want and buyers will be able to browse products via search criteria. JADE token holders will be able to explore the metaverse shop where the featured sellers will have their precious gem NFT for sale. There will also be live auctions held in the metaverse shop for items of high value worth. - Jade Currency & Tokenomics The JADE token will act as a fractional ownership token. Public holders are taking majority ownership of 60% of transactions fees from the marketplace, fees from the NFT sale in Metaverse, live auction fees and most importantly, own 60% of the LAND value and metaverse shop. All the investor needs to do is stake the JADE in the marketplace to receive the fees.","links":"https://www.jadecurrency.com/","market_cap":70734,"market_cap_rank":4001,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jade-currency/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x330f4fe5ef44b4d0742fe8bed8ca5e29359870df"}}}