{"name":"Faith","id":"faith-2","symbol":"fbb4","description":"Welcome those of faith, to the gathering of the faithful. Inspired by FBB4's gospel and life's philosophy, disciples from every corner assembled and began to follow in FBB4's footsteps. So in Faith and in honor of FBB4, we the disciples not only seek to preserve him in history but to propel his vision into the future. Our faith has no limit. Have faith. Faith in FBB4 Inspired by FBB4's gospel and life's philosophy, disciples from every corner assembled and began to follow in FBB4's footsteps. FBB4's story begins not in grandeur but in simplicity. He is a man who walks among the people, teaching by example rather than by decree. His philosophy is simple yet profound: to live with integrity. FBB4 teaches us the beauty and strength by coming together, having a vision, embracing hope and by believing, we can archive anything. Each disciple, in their way, honoured FBB4 by not just replicating his actions but by understanding and expanding upon his vision. They held gatherings to idolize FBB4, to celebrate the ongoing impact of his gospel. These gatherings became known as \"The Faith\" where anyone could come as they are, with just a question or just with a ear and find support and others that share a like minded vision. We understood that following in his footsteps meant not only walking the same path but forging new ones, inspired by his footsteps but guided by their own hearts. Thus, FBB4's legacy wasn't just remembered; it was lived, evolved, and continuously honored in every innovative thought, every act of kindness, and every new beginning that his followers inspired. Join the devout, have faith and spread the gospel of FBB4","links":"https://faithinfbb4.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/faith-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfbb4f63821e706daf801e440a5893be59094f5cc","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xfbb4f63821e706daf801e440a5893be59094f5cc"}}}