{"name":"SwapDEX","id":"swapdex","symbol":"sdxb","description":"SwapDEX consists of a leading network called SmartDEX-Network and a research chain called Kusari-Network, forming the initial seed of an open, decentralized, and independent DeFi platform. This platform aims to become the industry-wide standard for decentralized finance. The SmartDEX-Network is maintained by validators selected through a Nominated Proof-of-Stake (NPoS) consensus design. The validators are responsible for block production and chain finality. Rewards are given out when validators behave correctly, and any misbehavior is punished via a slashing mechanism. Furthermore, SwapDEX has a decentralized, community-run governance scheme that can change any SwapDEX design or parameter decision through formal consensus. Governance council members are required to be elected by holders of the relevant coin (SDX for SwapDEX, KSI for Kusari) with proposals requiring majority approval from council members to be implemented. Unlike other projects, SwapDEX keeps validator selection completely independent from governance and the user’s right to participate in governance is never delegated. NPoS is a Proof-of-Stake (PoS) variant that substitutes Nakamoto's consensus protocol's highly inefficient Proof-of-Work (PoW) design with a Proof-of-Stake (PoS) architecture. SwapDEX utilizes NPoS to advance chain security, enable a fair representation and satisfaction of users, and boost efficiency. Networks following a similar path include Polkadot, Kusama, Chainlink, Moonbeam, to name a few. While similar in spirit, the approaches in these networks vary in design choices, such as the incentive structure, the number of validators elected, and the election rule used to select them. In the SwapDEX ecosystem, we focus on fully decentralized finance. Therefore, every SDX holder is free to become a validator candidate or a nominator to maintain the blockchain. Validators participate in the consensus mechanism by producing blocks and validating blocks constructed by other validators. Nominators vote for validator candidates they trust and back them with their coins. Once per era (a certain period), a committee of validators gets elected according to the current nominator's preference. In SwapDEX, the number of validators elected is in the order of hundreds and potentially thousands. Both validators and nominators lock their coins as collateral and receive staking rewards on a pro-rata basis, but may also be slashed and lose their collateral in case backed validators show malicious or negligent behavior. Nominators thus participate indirectly in the consensus protocol with an economic incentive to pay close attention to the evolving set of validator candidates and make sure that only the most capable and trustworthy among them get elected.","links":"https://www.swapdex.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/swapdex/logo.png"}