{"name":"VNX Swiss Franc","id":"vnx-swiss-franc","symbol":"vchf","description":"What is the project about? VNX Swiss Franc (VCHF) is a token referencing Swiss Franc from a token generator licensed under the Blockchain act in Liechtenstein. What makes your project unique? Being referenced to traditional currency, VNX Swiss Franc offers a traditional asset in the digital form. VCHF token generation and all services in respect of the tokens are carried out by VNX Commodities, a company registered with the Liechtenstein Financial Market Authority (FMA) under the Tokens and TT Services Providers Law (TVTG) (https://fmaregister.fma-li.li/search?searchText=&number=310339&category=) History of your project. VNX, a Liechtenstein-based company registered by the Liechtenstein Financial Market Authority (FMA). In April 2022 VNX launched its European platform for investment into tokenized traditional assets and issues the first European multichain token fully backed by physical gold and represents individual ownership of the gold - VNX Gold (VNXAU). In December 2022, VNX added VNX Euro (VEUR) and VNX Swiss Franc (VCHF), expanding investor capabilities in the crypto space by offering digital assets tied to traditional currencies. VNX Euro (VEUR) and VNX Swiss Franc (VCHF) are tokens referencing respective fiat currencies. VNX stablecoins provide the ability for crypto users to trade in native currencies as well as manage their portfolio more effectively: to hedge, trade, and profit with more options. What’s next for your project? VNX aims to make VNX Swiss Franc (VCHF) available to users by expanding the list of cryptocurrency exchanges where it is traded. There are also plans to release the token on various blockchains, making it multichain. What can your token be used for? Hedge. Hold VCHF to hedge against crypto volatility and avoid losses during a market decline; Trade. Buy and sell digital assets in a matter of minutes on CEXs and DEXs; Earn. Lend, provide liquidity, stake and use other investment opportunities in CeFi/DeFi.","links":"https://vnx.li/vchf/","market_cap":10547840,"market_cap_rank":1771,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vnx-swiss-franc/logo.png","detail_platform":{"xrp":{"decimal_place":6,"contract_address":"VCHF-rLPtwF4FZi8bNVmbQ8JgoDUooozhwMNXr3"},"tezos":{"decimal_place":18,"contract_address":"KT1LssxZqfQtRFv1CRkzX9E9gzap9iFrtWmq"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x02cea97794d2cfb5f560e1ff4e9c59d1bec75969"},"stellar":{"decimal_place":null,"contract_address":"VCHF-GDXLSLCOPPHTWOQXLLKSVN4VN3G67WD2ENU7UMVAROEYVJLSPSEWXIZN"},"fraxtal":{"decimal_place":18,"contract_address":"0x418126bb59457afdba1ecf376f97400b4157425d"},"polygon-pos":{"decimal_place":18,"contract_address":"0xcdb3867935247049e87c38ea270edd305d84c9ae"},"avalanche":{"decimal_place":18,"contract_address":"0x228a48df6819ccc2eca01e2192ebafffdad56c19"},"solana":{"decimal_place":9,"contract_address":"AhhdRu5YZdjVkKR3wbnUDaymVQL2ucjMQ63sZ3LFHsch"}}}