{"name":"Everlyn","id":"everlyn_binance-smart-chain","symbol":"lyn","description":"Lyn is the first open-source foundational video model and super-agential multimodal ecosystem that was designed to deliver an open dream machine to the world. Lyn’s flagship open-source model, Everlyn-1, is reshaping the capabilities of video artificial intelligence in terms of output duration, interact-ability, generation latency, and hyper-realistic visual quality. Lyn's video creation engine and platform, Everworld, is revolutionizing how human beings engage with photorealistic virtual representations of themselves through personalized and interactive video agents capable of performing any task. Together, Everlyn-1 and Everworld will profoundly alter what humans can achieve online, taking over tasks and activities that individuals alone either prefer not to do or are unable to do. Lyn was founded by a team of leading experts in generative AI, including professors from Cornell University, Oxford University, Stanford University, University of Central Florida (UCF), Hong Kong University of Science and Technology (HKUST), Mohamed bin Zayed University of Artificial Intelligence (MBZUAI), and Peking University (PKU), as well as former leaders from Meta, Deepmind, Microsoft, Google, and Tencent, and current PhD students in generative AI. The Lyn team consists of prominent figures in AI research who have played a pivotal role in some of the industry’s most significant innovations, including Google's foundational video model, Video Poet, Facebook’s foundational video model, Make-a-Video, Tencent's foundational video model, Meta Movie Gen's most cited benchmark model, Seeing and Hearing, the industry's top open-source video model 'Open-Sora-Plan', and OpenAI’s first real-time end-to-end humanoid agent video model, Body of Her.","links":"https://www.everlyn.ai/","market_cap":17382942,"market_cap_rank":1194,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/everlyn/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x302dfaf2cdbe51a18d97186a7384e87cf599877d","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x302dfaf2cdbe51a18d97186a7384e87cf599877d"}},"is_native":false}