{"name":"Bitget Token","id":"bitget-token_ethereum","symbol":"bgb","description":"What is BGB token? BGB is a decentralised token that is the primary token of Morph's blockchain, serving as the gas, governance, and payment token across the layer. Who Are the Founders of Bitget Token? Launched in 2021, Bitget Token (BGB) was initially positioned as the platform token for the Bitget exchange and Bitget Wallet. Behind Bitget is a team of visionary early adopters dedicated to a blockchain-powered future. The leadership team is comprised of seasoned professionals with experience at global giants like Goldman Sachs, Facebook, and Binance, including CEO Gracy Chen, COO Vugar Usi Zade, and CLO Hon Ng. In September 2025, Bitget agreed to a strategic partnership with the Morph chain. The Morph Foundation, a non-profit decentralized organization, is now solely responsible for the future development of BGB. What Makes Bitget Token (BGB) Unique? BGB is the gas and governance token of the Morph chain. At the same time, BGB will also get support from its partners, such as exchanges and wallets, serving as a key medium for Launchpool's new token mining, fee discounts, and more. How Many Bitget Token (BGB) Coins Are There in Circulation? The initial supply of Bitget Token (BGB) is fixed at 2 billion tokens. As of September 2025, the circulating supply of BGB is 699,992,035. The Morph Foundation will update the BGB burn mechanism, linking it to Morph network activity, until the total BGB supply is reduced to 100 million. How Is the Bitget Token Network Secured? Bitget Token (BGB) initially operates on Ethereum's blockchain using the ERC-20 standard and Proof-of-Stake (PoS) consensus, making it compatible with any Ethereum wallet. Following the strategic partnership between Bitget and Morph, a growing number of BGB will be migrated to the Morph chain, as the gas and governance token. Where Can You Buy Bitget Token (BGB)? Bitget Token (BGB) can be purchased directly on the Bitget exchange. BGB is also available for trading on MECX, Bitfinex, Uniswap, and BulbaSwap.","links":"https://partner.bitget.com/bg/2LAE9K","market_cap":2425233997,"market_cap_rank":50,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitget-token_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x54d2252757e1672eead234d27b1270728ff90581","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x54d2252757e1672eead234d27b1270728ff90581"}},"is_native":false}