{"name":"XRP Healthcare","id":"xrp-healthcare","symbol":"xrph","description":"XRP Healthcare (XRPH) is a Web3 scalable solutions provider, focused on the Pharma and Healthcare industry. XRPH intends to do this by simplifying and creating fast payments/transactions between market participants, and by bringing transparency by way of tracking pharmaceuticals from “inception to the consumer” combating the multi-billion dollar counterfeit medicine industry, with an interface for interactive engagement between consumers and healthcare service providers via our mobile and web app. What makes XRP Healthcare unique? • The first Pharma and Healthcare platform to be built on the XRP Ledger • Decentralized marketplace for the Pharma and Healthcare services • Interactive engagement between consumers and Healthcare providers • Track pharmaceuticals from \"inception to consumer History of XRP Healthcare: The XRP Healthcare project was conceived on September 13, 2022, by founder and director Kain Roomes with the purpose of making healthcare products and services affordable to all, and to help support the failing pharmaceutical and healthcare system as we know it. What’s next for XRP Healthcare? Our mobile and web app, decentralized marketplace, phase two will be the development of a Metaverse Clinic that will offer a range of professional services focused on mental health and well-being, delivered by trained professionals where clients upon entering the Clinic can choose an avatar and remain anonymous while being treated, because of the stigma attached to mental health. What can XRP Healthcare (XRPH) be used for? XRPH token will be used to purchase pharma and healthcare products and services around the globe via our Decentralized marketplace. XRPH will also be a way of sending money and setting up the distribution of the medication to friends and family in pharmerging countries.","links":"https://xrphealthcare.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xrp-healthcare/logo.png","detail_platform":{"xrp":{"decimal_place":null,"contract_address":"rM8hNqA3jRJ5Zgp3Xf3xzdZcx2G37guiZk"}}}