{"name":"Nether","id":"nether","symbol":"ntr","description":"Nether is a new generation of non-fungible tokens (NFT), which focuses on an entirely new yet immensely important asset that is; PERSONALITY! Nether NFT marketplace will be the world’s first and largest exchange for personality where anyone from celebrities, influencers, to world leaders etc. can create an NFT for their personality, peg tokens to that NFT and allow their fans to buy, sell or exchange those tokens, in order to determine the true value of their personality. The though process behind the creation of Nether NFT was that every day we come across assets that are born, their value soars and then eventually they die. No matter how strong the fundamentals behind an asset are, it is still subjected to ups and downs in the market, and mostly this volatility is fueled by news and rumors generated by people; often famous or influential people. So one might ask the question, if the utility or fundamentals of an asset no longer matter, what is it that matters? The answer is simple; all assets, in whatever market they may be found, are based on a single supreme asset that is human personality. So Nether NFT takes all other variables out of the equation and focuses solely on human personality and its value. Nether has gathered a large community around itself including various famous personalities, their fans and just simply Nether devotees. We are listed on multiple exchanges and are on track as per our roadmap to roll out the mainnet of your project by the end of year. Moreover, we are leveraging various result-oriented marketing tools to expand our community. By January 2023, we aim to have created a community of more than 10 million users who would be buying, selling, owning or exchanging the bits of tokenized personalities every day. We will be creating only 26 million Nether (NTR) tokens.","links":"https://nethernft.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nether/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x8182ac1c5512eb67756a89c40fadb2311757bd32"}}}