{"name":"OpiPets","id":"opipets","symbol":"opip","description":"Powered by Opis Group, OpiPets is a free, play-and-earn game built on BSC which aims to reshape player-owned economies by prioritising gameplay through storytelling and redefining ownership via customisation. Completely hand-drawn, OpiPets is set to launch with 60 unique, customisable OpiPets and thousands of battle & cosmetic assets that can be used to customise each OpiPet. Built to redefine ownership, each customised OpiPet can be turned into an NFT. Set in the Opiverse, players will be allowed to create, battle, collect or sell their unique NFT OpiPet in this economy-focused RPG. Through OpiPets’ unique in-game economy, players will be able to build their own wealth by exploring the various avenues e.g. player-owned shops to earn the in-game token (OPI). In order to safeguard the community as best as possible, OpiPets have segregated their utility and governance tokens. This reiterates the project’s commitment to gameplay & players of the game, protecting the community from the exposure to risk that conventional P2E models hold. OpiPets is built by a fully-doxxed team who are committed to staying on-track with their roadmap. Experts in their respective fields, the team attend multiple events including Zebu Live, NFTLondon and the European Blockchain Convention to advocate their mission, be accessible to the community and show their commitment to the long-term success of OpiPets. Currently, OpiPets has over 80k community members across the world with a strong presence in specific regions i.e. Southeast Asia & West Africa. The OpiPets game has been in development for around the last 12 months, in which our development team is highly driven to provide a unique playing experience focusing primarily on the gameplay, storytelling, customisation and in-game economy of Opis I , giving all types of gamers whether your a entrepreneur, PVP champion or a dungeon crawler all players have a reason to try out our project.","links":"https://opipets.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/opipets/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4c906b99a2f45a47c8570b7a41ffe940f71676af"}}}