{"name":"Exverse","id":"exverse","symbol":"exvg","description":"Exverse is a new AI-powered free-to-play shooter that provides players with an unmatched and immersive gaming experience. With its intricate world customization, lore, and novel gameplay systems, all built on Unreal Engine 5. The Exverse universe encompasses three distinct planets, each with a unique set of offerings for players to explore. Players will be able to own, trade, sell & rent their in-game assets through our in-game marketplace. The Future Exverse is designed with the community at its core and self-governance as its goal. The Exverse team will be responsible for developing and distributing initial world assets but eventually, the community will dictate and create new worlds in which users will be able to participate with their self-created assets in the ecosystem. To build the world & community of Exverse, we have created the $EXVG token. Community members & supporters who hold the tokens will have more access and will be able to shape the future of Exverse. $EXVG token utilities $EXVG is the ecosystem token of Exverse and can be earned by performing well in Exverse. Players can use the $EXVG token to enter matches, purchase premium items & more. Earning $EXVG 1.Chest reward 2.Tournaments 3.Watch & Earn 4.Selling NFTs 5.Match staking 6.High-end PVE content Spending $EXVG 1.Buying NFTs 2.Merging functions 3.High-End Clan Operations 4.P2P Marketplace Transactions 5.Access Exclusive Content 6.Season Pass Staking and governance(DAO Voting) $EXVG Genre: Free-to-play shooter Economy: F2P and Play-and-Earn crypto economy with NFT in-game assets Platform: PC Engine: Unreal 5 Rating: 16+","links":"https://exverse.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/exverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbb7d61d2511fd2e63f02178ca9b663458af9fc63","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xbb7d61d2511fd2e63f02178ca9b663458af9fc63"}}}