{"name":"Nesten","id":"nesten","symbol":"nit","description":"Nesten builds end-to-end decentralized community-based communications infrastructures, with network operation and management based entirely on its private proprietary blockchain platform. Everything from node installation and operation to end-device use cases and data consumers is performed by and within the network’s fully self-sustaining ecosystem. As of December 2021, Nesten has deployed more than 700 of its wireless network nodes across major markets in both the U.S. and South Korea, as well as in 10 other countries. Nesten was launched in 2018 in Tustin, California, to redefine the wireless landscape. It has since integrated tokenization as a means of supporting microservices for large-scale, complex IoT use cases; as a currency medium for data transactions generated within the ecosystem; and as a way to provide meaningful financial incentives for maintaining network performance. The network’s financial architecture is built on its own cryptocurrency, the New IoT Token (NIT), which is based on Ethereum blockchain. One billion NIT were created at genesis with 65% of the total quantity reserved for ecosystem functions—including network buildout, coverage verification, and proof reward allocation—and 35% reserved for company operations. NIT is currently trading on the European exchange, linked to the real economy, and completely convertible to other forms of currency. Unlike other cryptocurrencies, the NIT operates semi-independently of public blockchains and processes transactions nearly instantaneously at a fraction of standard fees. Nesten’s blockchain utilizes Proof of Authority (PoA) consensus—a reputation-based consensus algorithm in which transactions and blocks are validated by industrial-grade servers owned and managed by rigorously-vetted stakeholders—to facilitate high transaction throughput and scalability. The network’s multi-layer blockchain also supports decentralized identification (DID), ensuring a high degree of individual data privacy through cryptographic data encryption and key parity generation at the point of data creation. The extensibility and reliability of Nesten’s network lends itself to a range of verticals, including the company’s patent-pending shared parking and advertising solutions, already implemented using the network’s own crypto wallet and modular payment system to easily integrate NIT payments with application software. The team has partnered with major industry leaders in wireless communication and cryptocurrency, as well as leading developers of smart display assets, precision sensors, and enterprise computing equipment, and it is pursuing opportunities in remote medical care and 5G expansion.","links":"https://www.nesten.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nesten/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}