{"name":"Uka Doge Coin","id":"uka-doge-coin","symbol":"udoge","description":"Memecoin is a trend that makes many people become billionaires overnight because most meme tokens skyrocket in price and explode monumentally for months. The increase in price is not based on any prin ciple, even when it comes to chart analysis techniques. Our journey was the answer to a simple question. What would happen if a meme project was 100% de veloped to GameFi and Metaverse? While none of us could have imagined it at the present, this was a concept that would start a revolution. Project startwith memecoin and aim to built onthe foundation of GameFi& Metaversearetheuntamed wilderness of our future. Uka Doge is creating a Memecoin with a Metaverse Game Fi platform. The idea of Uka Doge was to create a meme token that would have exponential growth in value. As you hold onto the token longer, your assets grow faster and stronger with time due to its built-in hyper defla tionary mechanism. Even more, by using UDOGE tokens to participate in the Uka GameFi \"\"Play to earn\"\", players have more incentive to hold as long as possible in order to receive huge profits in the end! The developers' vision is to combine both the advantages of ameme token and a compelling NFT game, making Uka Doge becomethe project that has the most current trendy features in Memecoin + GameFi + Metaverse. By creating an entirely new and attractive trend in the crypto space, we will build an ul tra-engaged community where everyone can make significant profits from holding UDOGE and playing the Uka game. The Uka Doge Ecosystem is our way of recognizing the importance of tearing down meme long-estab lished paradigm. By studying those drawn to our project, we realized that true strength doesn't come from one of us alone, it comes from \"\" community support at launch\"\". With that thought bright in our minds, we began developing the Uka Doge ecosystem in earnest.","links":"https://ukadoge.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/uka-doge-coin/logo.png"}