{"name":"Uranus DEX","id":"uranus-dex","symbol":"ura","description":"Uranus DEX is an innovative decentralized exchange (DEX) built on the Solana blockchain, designed as a permissionless, player-versus-player (PvP) prediction market platform. Unlike traditional DEXs that rely on automated market makers (AMMs) or liquidity pools, Uranus DEX offers a unique model where users can make long or short predictions on the price movements of any Solana-based token, including real-world assets (RWAs). This community-driven platform enables traders to engage directly from their crypto wallets, creating a transparent and accessible trading experience. Built on Solana’s high-throughput, low-cost blockchain, Uranus DEX delivers fast transactions with minimal fees, appealing to both novice and seasoned traders. Its permissionless design allows users to speculate on any listed Solana token without restrictions, fostering a competitive PvP environment for price predictions. This flexibility empowers users to engage in dynamic trading battles, making it a standout in the decentralized finance (DeFi) space. The native token, $URA, is integral to the ecosystem, supporting staking, governance, and community rewards. Trading fees are used to buy and vault $URA tokens, which are then allocated to liquidity events, ensuring platform sustainability and incentivizing participation. Uranus DEX enhances user accessibility by integrating with social platforms like X, allowing seamless trading through intuitive interfaces, broadening its appeal and engagement. The platform has gained traction in the crypto community, notably through its participation in the Bonk Hackathon and milestones like reaching 1,000 followers on X. Positioned as a first mover in PvP prediction markets, Uranus DEX aims to democratize DeFi with a scalable, user-centric approach. Its smart contracts are verifiable on Solana’s blockchain explorer, ensuring transparency and security for users. As with any DeFi platform, users should exercise caution, verify contract addresses, and be aware of risks such as price slippage and market volatility. For more details, visit uranus.today to explore the platform’s features, tokenomics, and community initiatives. Uranus DEX redefines decentralized trading by combining Solana’s technical efficiency with a bold vision for accessible, community-driven prediction markets.","links":"https://uranus.ag/","market_cap":672570,"market_cap_rank":4723,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/uranus-dex/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"BwTu5zJqEyLYawwYoGTWT7UxC85eLYQWRcta1GiEbonk","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/BwTu5zJqEyLYawwYoGTWT7UxC85eLYQWRcta1GiEbonk"}}}