{"name":"Yieldly","id":"yieldly","symbol":"yldy","description":"Yieldly wants to help people re-conceptualize value and the way it is exchanged. Yieldly believes digital value should be exchanged swiftly, simply, and safely and are working to set the industry standards by which people will transact interact with blockchain technology. The Yieldly DeFi ecosystem is comprised of four foundational pillars built on the Algorand blockchain. First, Yieldly’s purpose-built smart contracts enable developers of ASA tokens (“Algorand Standard Assets” comparable to ERC20 on Ethereum) to easily create staking and rewards systems on top of Algorand. This opens up the Algorand ecosystem for many use cases that are currently booming on other blockchains such as yield farming, NFT distribution, and social rewards systems. Next, Yieldly has built the first no-loss lottery designed to harness Algorand’s rewards system, aggregate rewards, and distribute them to users. Akin to PankcakeSwap and PoolTogether on their respective ecosystems, Yieldly’s no-loss lottery will unlock deep liquidity on Algorand. Third, Yieldly wants to make it easy for anyone to access Algorand and experience the many benefits of DeFi. To that end, Yieldly will release a cross-chain token bridge in June that will allow swapping of ASA YLDY for ERC-20 YLDY. Finally, Yieldly will build out further bridges to expand the pathways for any ASA native token holder. This will drive new users and more liquidity to Algorand. After the smart contracts enable users to build staking and rewards systems and open pathways for more liquidity to flow into the Algorand Network, Yieldly will unite the ecosystem via an automatic market maker (otherwise known as a Decentralized Exchange or DEX). This component has the potential to elevate Algorand to achieve mass adoption as a leading DeFi protocol.","links":"https://yieldly.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/yieldly/logo.png","detail_platform":{"algorand":{"decimal_place":6,"contract_address":"226701642"},"harmony-shard-0":{"decimal_place":18,"contract_address":"0xf498a433819a5db3dfcc110100527cf4bfcafe47"}}}