{"name":"Open Campus","id":"edu-coin","symbol":"edu","description":"What is the project about? The Open Campus Protocol is a decentralized solution for educators, content creators, parents, students, and co-publishers designed to address the major challenges in education today. Despite the critical role of educators in shaping the future generation, they are often undervalued and underpaid. Additionally, parents frequently lack control over their children's educational content. What makes your project unique? We are the first education protocol that empowers teacher ecosystem to create, own, share and sell their educational content. We will create a EDU foundation that enables content creator to utilize NFT technology to monetize their creation with the financial support from co-publishers. History of your project. Open Campus started in 2023, with the support from various launch partners like Animoca Brands, The Sandbox, TinyTap, etc. The protocol's main NFT publication - Publisher NFT was adopted by TinyTap and produced an auction last year with a sale of 243 ETH. What’s next for your project? We will continue to build out the marketplace for content creator to create and sell assets, and enable foundation features such as Smart Donation and Scholarship Grants. What can your token be used for? It will power all educational activities within the EDU Foundation, that includes a peer review system, Smart donation, purchase and selling of Publisher NFTs and Scholarship granting.","links":"https://www.opencampus.xyz/","market_cap":139958920,"market_cap_rank":372,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/edu-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbdeae1ca48894a1759a8374d63925f21f2ee2639"},"ethereum":{"decimal_place":18,"contract_address":"0x26aad156ba8efa501b32b42ffcdc8413f90e9c99"},"polygon-pos":{"decimal_place":18,"contract_address":"0xb03e3b00baf9954bf1604d09a4dbd5cf88e1f695"}}}