{"name":"Cybria","id":"cybria","symbol":"cyba","description":"What is the project about? Cybria is a new Layer 2 Blockchain project. Cybria built on top of the Ethereum network. It aims to enhance scalability, transaction speed, and security within the Ethereum ecosystem while leveraging Cybersecurity and Artificial Intelligence (AI) technologies to ensure network safety and improve performance. CYBRIA is designed to address the limitations of the Ethereum network by providing a scalable, secure, and efficient Layer 2 solution. By utilizing Layer 2 scaling techniques, CYBRIA aims to reduce transaction costs and increase the throughput of the Ethereum network. What makes your project unique? Cybria is the first Layer 2 Blockchain Integrated with AI. AI plays a crucial role in enhancing various aspects of CYBRIA. AI technologies are used for threat detection, analyzing suspicious transaction behavior, and providing intelligent monitoring and network management. History of your project. Cybria just launched 1 month ago. Launched on 8th August 2023. Our liquidity is locked for 1 year. We have done KYC and Audit at Solidproof. We are just getting started, we are building steadily and have high hopes for the bullrun to come. What’s next for your project? For now, Cybria have Have several utilities that are live: - Cybria Swap - Cybria Staking - Cybria Testnet We have applied to CMC. For now, we are completing Cybria Mainnet and Bridge. After that, people can launch projects on Cybria Chain. Next plan for the project is listing on serveral Cex dan expand Partnership. What can your token be used for? Blockchain : Cybria Chain are designed to address some of the scalability and efficiency challenges faced by Layer 1. Cybria Chain can improve the performance and capabilities of blockchain networks while still benefiting from the security and decentralization of the underlying Layer 1 blockchain. Also Cybria can reduced the transaction fees and faster transaction confirmation. Token : - Transaction fees : Cybria often used to pay for transaction fees within the Layer 2 network. These fees can be significantly lower than those on the Layer 1 blockchain, making it more cost-effective for users to interact with decentralized applications (DApps) and perform transactions. - Security : to ensure the security of the network. For example, tokens may be staked or used as collateral to participate in the consensus mechanism or to challenge incorrect or fraudulent transactions. - Governance : can be used for governance purposes within the Layer 2 network. Token holders may have voting rights to decide on network upgrades, parameter changes, and other governance-related decisions. - Interoperability : Cybria designed to be interoperable with tokens on other Layer 1 and Layer 2 blockchains. This allows for seamless asset transfer and cross-chain interactions.","links":"https://www.cybria.io/","market_cap":1728461,"market_cap_rank":3408,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cybria/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x1063181dc986f76f7ea2dd109e16fc596d0f522a"}}}