{"name":"ZERA","id":"zera_solana","symbol":"zera","description":"What Is ZERA? ZERA is a zero-knowledge (ZK) privacy protocol on Solana that enables shielded balances, private transfers, and offline-capable peer-to-peer exchange for existing crypto assets (e.g., USDC, USDT, SOL + more). The project is developed by Zera Labs with the goal of providing cash-like privacy while remaining non-custodial and compatible with existing stablecoin rails. At the protocol level, users deposit supported assets directly into the protocol and receive “cryptographic notes.” These notes can be transferred privately without the need for an internet connection and later withdrawn back to the same underlying asset. The direct-deposit architecture creates an unified, asset-agnostic anonymity set with clean composability for wallets, relayers, and dApps - without wrapped assets or AMM routing How Does It Work? ZERA’s core privacy layer is built on well-studied primitives: - Commitments & Nullifiers: Values are committed using Pedersen commitments; unique nullifiers prevent double-spends while keeping linkability hidden. - Zero-Knowledge Proofs: Transactions are proven with succinct zk-SNARKs (e.g., Groth16) so validators verify correctness without learning senders, receivers, or amounts. - Unified Pool: All notes share a common anonymity set. Optional relayers can submit withdrawals for users, helping further break the link between their network activity and identity. The protocol is non-custodial; users retain control of their keys and notes. Because deposits/withdrawals map to the same underlying assets, accounting remains transparent at the reserve level while individual transfers stay private. What Is the ZERA Token Used For? ZERA is a value-accrual token tied to protocol activity. Its design centers on usage-driven, programmatic burns (i.e., a fraction of protocol volume triggers token burns executed by the program). This mechanism ties token supply reduction directly to adoption, while avoiding direct fees on private transactions. This approach is intended to align stakeholders with protocol growth while minimizing regulatory complexity associated with fee collection or custody. Founder & Origin Led & founded by Hayden “Dax” Porter, a former MetaMask engineer with past roles at USAA and Twitter. The initiative began as a critical response to the state of the industry and a push toward “true digital cash” - prioritizing private, permissionless payments over speculation. Initially charted as a multi-year PhD-by-publication from concept to product, the effort matured into Zera Labs in 2025, expanding the scope to a privacy-preserving cash layer and an extensible ZK ecosystem. Privacy & Extensibility - Privacy + Compliance Posture: The protocol is non-custodial, does not require intermediate pegs, and avoids direct protocol fees. Reserves always remain fully backed by deposits, and optional relayers further reduce network-level linkability - Extensibility: The architecture is designed to add more collateral types and, over time, support cross-chain sources through adapter modules while preserving unified anonymity sets and burn accounting. ZERA provides private, cash-like transfers for mainstream assets on Solana, couples usage to transparent token burns, and focuses on practical deployability: direct deposits, efficient ZK verification, and a developer-ready stack. Welcome to the new Zero-knowledge Era.","links":"https://zeralabs.org/","market_cap":14154376,"market_cap_rank":1311,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zera/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"8avjtjHAHFqp4g2RR9ALAGBpSTqKPZR8nRbzSTwZERA","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/8avjtjHAHFqp4g2RR9ALAGBpSTqKPZR8nRbzSTwZERA"}},"is_native":false}