{"name":"DAO Invest","id":"dao-invest","symbol":"vest","description":"DAO Investis a Decentralized Crypto Portfolios Management Ecosystem, trusted by thousands of members to create community wealth. DAO Invest provides a collaborative approach to manage the LPs for VEST tokens and increase the value of the governance token by utilizing collective wisdom. DAO Invest is a part of inSure DeFi Ecosystem that creates a community-controlled crypto portfolio that allows staking by contributing to the community-voted liquidity pools. VEST token is a native utility token of DAO Invest Ecosystem which enables rights to vote on the future roadmap items and potential partnerships or support of other projects. Additional information about crypto mutual fund can be found on the inSure DeFi's Whitepaper: https://insuretoken.net/files/inSureWhitepaper.pdf DAO Invest is a long-term project that has the ability to pivot based on the decision of the community. All the transactions and community LP holdings are verifiable on Ethereum, BSC, and Polygon chains. DAO Vest is a community-based project, where the Liquidity Pools of VEST token with other tokens are managed by collective wisdom. All the changes to the roadmap are done by community voting. Any $VEST holder automatically becomes a community member and can start contributing by sharing their knowledge. DAO Invest is a decentralized experiment project based solely on the efforts of community members. The goal is to use collective wisdom and voting on the roadmap items to increase the value of utility and governance token $VEST.","links":"https://daoinvest.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dao-invest/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1f19f83fc9a25f3c861260143e36c17706257986"},"polygon-pos":{"decimal_place":18,"contract_address":"0x381caf412b45dac0f62fbeec89de306d3eabe384"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x873801ae2ff12d816db9a7b082f5796bec64c82c"}}}