{"name":"Mad Monkey Guild","id":"mmg-token","symbol":"mmg","description":"What Is MMG? Launched in 2021, MMG | Mad Monkey Guild is a blockchain-based gaming community that aims to create a new revolution for NFT games. We help every player earn money just by playing games. MMG is currently one of the most expanded guilds in Vietnam. By staying in touch with the newest and most popular NFT games on behalf of its scholars, MMG has positioned itself as an industry leader and is ready for future success. Who Are the Founders of MMG? Mad Monkey Guild was created by Metub Network and CoinCu Labs. Metub Network is known as an inter-platform entertainment network, connecting individuals, creators of video content (Creator) with Youtube monetization program. As a project under media company Netlink, whose mission is to promote the development of the innovator, Metub is also an officially recognized partner of YouTube in Vietnam. Currently, Metub is leading with more than 300 gaming creator, streamer with more than 6 billion views per month on countless platforms such as YouTube, Nimo, FaceBook, Twitch. In addition, CoinCu Labs is a venture capital fund derived from CoinCu Ventures - specializing in investing in private projects and predicting quality hidden gems. In addition, MMG is supported by some famous names, backers such as Kyber Ventures, Shima Capital, RADA Network. Although MMG has only recently announced its presence, MMG has more than 2,000 scholarship enrollments, more than 500 students, and owns $1 million in NFT assets from the prominent Axie Infinity game as a bridge so that players who don't need to quit can still participate in millions of projects. MMG is strategically partnering with some of the top gaming platforms in the market such as Sipher, Blockchain Monster Hunt, DEFI Horse,...","links":"https://www.madmonkeyguild.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mmg-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf018aea0a08a5d88674f0837bdac27ab89824dee"}}}