{"name":"Grumpy","id":"grumpy","symbol":"grum","description":"1. What is the project about? Grumpy is a unique memecoin launched on the Bitcoin network, incorporating the novel BRC-20 token standard and leveraging the power of ordinal inscriptions. The project employs the charm and humor of its mascot, Grumpy, to present a lighter, more enjoyable, and engaging way of interacting with the crypto ecosystem. 2. What makes your project unique? Grumpy differentiates itself through its innovative use of the Bitcoin network's potential beyond digital gold. It deploys a BRC-20 token standard, fostering semi-fungibility using ordinal inscriptions on Bitcoin. This allows it to overcome the network's inherent programmability limitations. Besides its technological distinction, Grumpy embraces a lighthearted approach to crypto trading, often presented in humorous, relatable content featuring its disgruntled feline character. 3. History of your project. Grumpy was conceived as a response to the proliferation of copycat memecoins appearing on various platforms. Inspired by the popularity of these tokens and seeing an opportunity to create something unique within the space, the creators of Grumpy decided to leverage the security and stability of the Bitcoin network to create a new memecoin. Launching on 16th of may and sold out 100% in 48 hours, which broke BRC20 records, Grumpy is now a top 25 most holded token on BRC20. a 4. What’s next for your project? Grumpy's future will continue to uphold its pledge of fair launches and community involvement. The project plans to introduce unique rewards and incentives for early and active token holders, a first for BRC-20 tokens, further promoting user engagement and fostering a robust community. It's also looking at strategic collaborations and integration with infrastructure providers, like wallets and marketplaces, for broader token accessibility and enhanced user experience. 5. What can your token be used for? The Grumpy token, $GRUM, acts as a means of participation within the Grumpy e","links":"https://grumpy.site/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/grumpy/logo.png","detail_platform":{"ordinals":{"decimal_place":18,"contract_address":"6af77cb7e586b6df2c0353b6b40dad398cc217d156752419131df6b8a584495ai0"}}}