{"name":"Blackhole","id":"blackhole_avalanche","symbol":"black","description":"Blackhole is a next-generation ve3,3 decentralized exchange (DEX) built on the Avalanche C-Chain, optimized for deep liquidity, sustainable emissions, and long-term incentive alignment. At its core, Blackhole leverages an enhanced ve(3,3) tokenomics model, combining dynamic governance, emissions-based rewards, and advanced automated market maker (AMM) infrastructure to deliver capital-efficient liquidity solutions. The native token of the protocol, $BLACK, is used for: Emission rewards to liquidity providers Locking into veNFTs to gain governance rights and rewards Staking to earn protocol revenue and bribes Perma-locking to mint special Supermassive veNFTs with non-decaying power Blackhole’s unique two-tier governance system revolves around veBLACK vote-escrowed NFTs minted by locking $BLACK tokens. Users can choose between two types: Singularity veNFT: Users lock $BLACK for up to 4 years to earn veBLACK, gaining proportional voting power and protocol revenue. Supermassive veNFT: Created by permanently burning $BLACK tokens. These NFTs receive enhanced rewards, non-decaying voting power, and a 10% rebase bonus. All team tokens are burned into Supermassive veNFTs, eliminating future sell pressure. How Does Blackhole Work? Blackhole’s incentive engine operates in epochs. Each week, veNFT holders vote on “gauges” that determine which liquidity pools receive $BLACK emissions. In return, voters earn: A share of trading fees from voted pools 100% of bribes and partner incentives from those pools Rebase rewards based on emission dynamics The protocol features variable AMMs for volatile assets, stable AMMs for correlated pairs like stablecoins, and concentrated liquidity pools for precision market-making. LPs can earn higher fees by focusing capital around price ranges and staking to access emissions. New projects can launch liquidity via Genesis Pools, a capital-efficient bootstrapping system with fixed price contributions and auto-staking. Genesis participants earn LP tokens and start receiving emissions in the next epoch.","links":"https://blackhole.xyz/","market_cap":13006387,"market_cap_rank":1370,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blackhole/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xcd94a87696fac69edae3a70fe5725307ae1c43f6","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0xcd94a87696fac69edae3a70fe5725307ae1c43f6"}},"is_native":false}