{"name":"Crypto Legions V3","id":"crypto-legions-v3","symbol":"blv3","description":"Crypto Legions is a cutting edge Play-To-Earn NFT game on the BSC network, with a genius Omni-Balanced Oracle™️ system for a sustainable game economy. By just playing a few minutes each day, you can earn Bloodstone tokens (BLST), which can be converted into any currency you want. Bloodstone is the native utility token that's used for: Minting in-game NFTs. Receiving game rewards. Purchasing hunting supplies in order to complete missions. Buying NFTs off other users from the in-game marketplace. Who is the team behind Crypto Legions? Crypto Legions is run by a well-rounded team with many years experience in both Crypto and Business. One of the founders, Danny is the crypto-currency expert of the team, with vast experience and knowledge of P2E game mechanics and the Binance Smart Chain ecosystem. His Co-Founder Shark has over 20 years experience in business, entrepreneurship, IT sales & marketing, and IT recruitment. He built several thriving businesses, and created multiple communication training programs. He’s also an award-winning film producer/director, breaking records in fundraising, and developing movies for the top streaming platforms. They are backed up by a highly skilled development team with over 100 years of combined Blockchain, Development and IT experience. Their ambition is to create the longest lasting play-to-earn NFT game on the BSC network with a lucrative ROI for players. What makes Crypto Legions unique? 1. Play Forever Earn Forever™ 2. Transparent Economy Status 3. Smart Claim System™ 4. In-game Referral System 5. We Prove We Care 6. The Reserve Pool™ 7. Reincarnation™ 8. A Record Breaking Game","links":"https://cryptolegions.app/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-legions-v3/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x63441e5c9f55b5a9141f3d834a28426ca1c5c5cc"}}}