{"name":"World Mobile Token","id":"world-mobile-token","symbol":"wmt","description":"World Mobile is going the extra mile to open a new world. With nearly 4 billion people left offline, digital exclusion is a significant problem. Unlike traditional mobile networks, World Mobile is based on the sharing economy, selling affordable network nodes to local business owners, and so they have the power to connect themselves and others while sharing the rewards. The World Mobile Token (WMT) is a digital token that is issued with the purpose of allowing the participants to provide a service on the network and be rewarded accordingly for it. The primary role of WMT is to incentivise both token holders that want to support the operation of the network by way of delegating their WMT stake to a node operator (stakers) as well as node operators that operate their own node. WMT is the utility token at the heart of World Mobile Chain, a solution developed in partnership between Input Output Global and World Mobile to democratize access to digital, financial and social services in Africa, the first of its kind to go the extra mile and connect the unconnected. The sharing economy enabled by WMT provides the foundation for affordable network nodes, based on the Cardano blockchain infrastructure. These network nodes act as local relays for internet connectivity. Subscribers to these networks will be able to access Input Output’s digital identity solution, Atala PRISM, which will allow them to use services such as digital banking, healthcare and education.","links":"https://worldmobiletoken.com/","market_cap":182796398,"market_cap_rank":308,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/world-mobile-token/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"1d7f33bd23d85e1a25d87d86fac4f199c3197a2f7afeb662a0f34e1e776f726c646d6f62696c65746f6b656e"},"ethereum":{"decimal_place":6,"contract_address":"0x263b6b028f3e4ed8c4329eb2b5f409ee38d97296"},"binance-smart-chain":{"decimal_place":6,"contract_address":"0x637c2173f6e678ac3c9b43b6665c760dc6021c13"}}}