{"name":"LFi","id":"lfi","symbol":"lfi","description":"What is LFi? LFi is a decentralized network focused on shaping the future of value creation and economic innovation. It operates on its own blockchain, guided by a DAO-driven ecosystem The LFi Ecosystem offers decentralized solutions that are tightly integrated with its primary blockchain. This integration ensures a smooth and user-friendly experience, emphasizing the benefits of open-source, decentralized platforms. What is vision and mission of LFi? Vision: A decentralized, sustainable, and fair global economy where everyone has the chance to achieve financial independence and participate in wealth creation. Mission: To empower individuals to take control of their wealth by providing accessible financial opportunities through a decentralized, transparent, and secure platform driven by a DAO community. What is value proposition of LFi? Security: At LFi, project team prioritizes the safety of their users' assets and strive to ensure the highest level of security through cutting-edge technology and practices. User Experience: LFi team understands that ease of use is crucial for the widespread adoption of crypto, and thus, team is dedicated to delivering seamless and intuitive experiences for all types of users. Completeness: LFi platform serves as a one-stop solution for all your asset management needs, eliminating the need to switch between multiple DeFi projects. What is LFI token and what are his use cases? LFi is the native token of the LFi ecosystem and provides access to the network's resources. Users use an LFi native token to pay for network services like sending its cryptocurrency, minting a token, or calling a smart contract and access the benefit of ecosystem through LFi vesting token vLFi.","links":"https://lfi.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lfi/logo.png","detail_platform":{"polygon-pos":{"decimal_place":8,"contract_address":"0x9b760d11f63cb80bffbcf69421cd46511e429f83"},"ethereum":{"decimal_place":8,"contract_address":"0x4190818ffeb4c7349fa59eeb08eb6e7ab70d9aa7"}}}