{"name":"SOJUDAO","id":"sojudao","symbol":"soju","description":"What is the project about? MemeCoin Soju is a decentralized digital asset that takes inspiration from the popular Korean alcoholic beverage, Soju. Built on the Ethereum blockchain, this token aims to serve as a fun, engaging, and possibly lucrative entry point for people interested in cryptocurrencies, as well as a tribute to the beloved drink. What makes your project unique? While there are thousands of tokens out there, MemeCoin Soju stands out for its unique cultural reference, targeting not just the crypto-enthusiasts but also lovers of Korean culture. Leveraging smart contract capabilities, we also introduce a \"Party Mode\" transaction that allows users to automatically distribute tokens among friends during social events, mimicking the shared enjoyment of a bottle of Soju. History of your project MemeCoin Soju was started as a passion project in 2022 by a group of developers and Soju enthusiasts. With the initial airdrop completed in June 2022, the project quickly gained momentum on social media and various online communities. As a nod to our inspiration, we've also held several virtual \"Soju Parties\" where participants were awarded with MemeCoin Soju tokens. What's next for your project? The next phase of MemeCoin Soju involves collaborations with actual Soju manufacturers and distributors for mutual promotional activities. We're also in the process of introducing a staking mechanism where users can earn \"Soju Shots,\" which can be used to claim special benefits like exclusive merchandise or limited editions of real Soju bottles. What can your token be used for? MemeCoin Soju tokens can be used for a variety of purposes: Social Transactions: Use our \"Party Mode\" to easily split bills or share tokens among friends. Online Communities: Tokens can be used to gain premium access to exclusive content, events, and discussions related to Soju and Korean culture. E-commerce: We are partnering with several online stores where you can use MemeCoin Soju tokens for purchasing Soju or related merchandise. Staking Rewards: Stake your tokens to earn \"Soju Shots,\" which can be redeemed for exclusive benefits.","links":"https://sojudao.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sojudao/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5ebffc53c3b8a71120789a211f9b91c79c78d1e0"}}}