{"name":"Hillstone Finance","id":"hillstone","symbol":"hsf","description":"Hillstone Finance is a smart contract-based asset liquidity project operated by Hillstone Partners, the first M&A specialist in Korea, which aims to provide liquidity to various on-chain financial products or physical assets and to provide a rich, diverse and convenient investment and financing channel for the public. The original intention of the project is to become a decentralized financial service provider in the metaverse world. Based on the multiple scenarios and diversified value system of the metaverse, Hillstone will simultaneously launch traditional financial products, assets lending, mortgaging and replacement, as well as the circulation and trading functions of financial derivatives on various blockchains to serve the huge financial system of the metaverse. HSF token Hillstone Finance Token (HSF), a utility token that powers the entire Hillstone Finance investment and financing ecosystem. The total supply of HSF is 100 million, of which 5% will be used for development funding under the control of multi-signature wallets. The current circulation of HSF is 38,060, of which 31,060 are ERC20 HSFs and 7,000 are third-party wallet HSFs. It is expected to reach full liquidity in December 2023. Hillstone Finance Ecosystem Roles User: Users of the Investor pledge platform, who act as pure roles of users in the ecosystem, can exchange products for HSF tokens through pledging. Admin: A role that can participate in the management of the Investor product, who is responsible for setting the benchmark price for trading pledged products or cryptocurrencies, plays a key role in the ecosystem in determining the primary status of the Investor contract. DAO-based Autonomous Council Hillstone General Council (HGC) is an open and decentralized autonomous council for ecological governance, giving every user the opportunity to participate in the governance of the platform and reducing the sense of boundaries between users and the platform.","links":"https://hillstone.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hillstone/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xba6b0dbb2ba8daa8f5d6817946393aef8d3a4487"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xda8929a6338f408cc78c1845fb4f71bffd2cfcfb"}}}