{"name":"Athena DexFi","id":"athena-dexfi","symbol":"athx","description":"Athena DexFi emerges as an investment platform dedicated to less experienced investors in the world of cryptocurrencies and investments. Its distinctive feature lies in the opportunity to participate in investments, presales, or trading contracts managed entirely by third parties. Designed for investment funds or traders who securely manage their clients' funds, the platform ensures that managers do not have complete control, preventing movements outside the platform and unspecified purchases. Users can participate using USDT BEP20, avoiding the need to create wallets on other chains or personally sell tokens, and they will receive returns already converted into USDT BEP20 without further action required. On Athena DexFi, fees are solely based on user earnings, with no charges for participation or in case of no profit, with a percentage of profits allocated to the manager and the platform. This system promotes the advancement of only the best managers, incentivizing them to continuously improve. Fees increase based on the level achieved, which can be enhanced by locking ATH, the platform's native token. In addition to presales, users can access decentralized trading contracts that allow them to follow their favorite traders, similar to copytrading. Among the advanced features of these contracts are limit orders, stop loss, stop market, and lending. Every user has the opportunity to open their own contract, and every manager has a trackable history on the blockchain. On Athena, one cannot claim to be skilled unless they truly are.","links":"http://athenadexfi.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/athena-dexfi/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe52a85f67d5a55a77d35193d963b7e1d94d1f2eb","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xe52a85f67d5a55a77d35193d963b7e1d94d1f2eb"}}}