{"name":"Wrapped POKT","id":"wrapped-pokt_ethereum","symbol":"wpokt","description":"What is the project about? Pocket Network is an open protocol that offers developers Reliable, Performant, and Cost-effective RPC access to the open internet. RPC is how every user interacts with - reads or writes to - any blockchain, so it is the most fundamental access point for all of the crypto industry. Pocket Network decentralizes how this process works to deliver more value to all users than would be possible without using blockchain, and to ultimately fulfil Pocket Network's vision of enabling \"a future where the world's most important digital infrastructure is owned and governed by its users.\" What makes your project unique? A DAO governs Pocket Network comprised of participating stakeholders using a unique \"proof-of-participation\" governance model that avoids plutocracy and focuses more on ensuring widespread representation of the most active and impactful members of Pocket's community. History of your project. The idea for Pocket was forged in 2017, but Pocket's main net launch was on 28 July 2020. Pocket was the first ever decentralized RPC service, and one of the very first DePINs. See here for an overview - https://twitter.com/POKTnetwork/status/1681316399401287680?s=20 What’s next for your project? Pocket is launching a new version of the protocol in the Q1 2024 that is redesigned from the ground up to provide users with the very best RPC service possible and to break the \"RPC trilemma\" so everyone can benefit from RPC that is as reliable, cost-effective and performant as possible. In the meantime, Pocket is scaling through its community, with more and more gateways built on top of the protocol to grow Pocket's demand with end users, and over 7 different community teams now contributing to the development of the protocol itself. What can your token be used for? Pocket's native cryptocurrency, POKT, facilitates access to a wide network of providers supporting more than 42 chains. POKT incentivizes full nodes to exist, pessimistically validate state transitions, replicate data, and make it accessible to developers. It's analogous to a universal API token, granting access to diverse RPC services from multiple providers for whichever open data source the community decides that the protocol should support. Wrapped POKT (wPOKT) is a tokenized version of POKT that runs on the Ethereum (ETH) blockchain. wPOKT is compliant with ERC-20 — the basic compatibility standard of the Ethereum blockchain — allowing it to be fully integrated and interoperable with Ethereum's ecosystem of DeFi and DAO tooling and infrastructure. wPOKT is backed by POKT at a 1:1 ratio via a network of validators, allowing users to transfer liquidity between the POKT and the ETH networks in a decentralized and autonomous manner. Holders of wPOKT can bridge it over to the Pocket Network blockchain to stake as a node runner, validator or directly as an application/gateway (after the upcoming upgrade) to access the relay throughput that Pocket Network provides.","links":"https://www.pokt.network/","market_cap":1177896,"market_cap_rank":3558,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-pokt_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x67f4c72a50f8df6487720261e188f2abe83f57d7","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x67f4c72a50f8df6487720261e188f2abe83f57d7"}},"is_native":false}