{"name":"Ajna Protocol","id":"ajna-protocol_base","symbol":"ajna","description":"The Ajna protocol facilitates peer-to-pool secured loans without governance and without external price feeds. Current lending and borrowing protocols which utilize smart contracts require active governance (e.g. to set rates and to update contracts) and/or rely on external price feeds (such as oracles like Chainlink). Because the pricing of collateral and parameterization of loans are left to subjective decision making through governance rather than market forces, these protocols carry both solvency and liquidity risk. Governance and maintenance overhead create barriers to entry in the market for lending and borrowing of on-chain assets. Ajna solves these problems with its unique design, which is defined by the following features: Permissionless pool creation: Much like the popular DeFi primitive, the “automated market maker,” AMM, Ajna pools exist in unique pairs: quote token, provided by lenders and collateral token, provided by borrowers. Pools allow lenders to assess borrower demand for their quote token and for borrowers to assess lender demand for loans backed by their collateral. Pools are created permissionlessly, meaning anyone can create a pool to borrow arbitrary fungible tokens using arbitrary fungible or non-fungible tokens as collateral. Therefore, no governance process is needed to whitelist approved tokens. Price specified lending: Ajna replaces external price feeds (oracles) by allowing lenders to input the price at which they’re willing to lend. This price is the amount of quote token (i.e. the token they are lending) they are willing to lend per unit of collateral pledged by the borrower. For example, if a lender deposits at price 100, they are willing to lend 100 units of quote token per one unit of collateral. Ajna pools separate prices into predefined buckets to reduce the complexity of the protocol, prices are therefore hereon referred to as “buckets”. Borrowers are then able to borrow from the aggregated liquidity of these various buckets.","links":"https://www.ajna.finance/","market_cap":3359301,"market_cap_rank":2428,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ajna-protocol/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x7f05a7a9af2f5a07d1e64877c8dc37a64a22508e","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x7f05a7a9af2f5a07d1e64877c8dc37a64a22508e"}},"is_native":false}