{"name":"Koubek","id":"koubek","symbol":"kbk","description":"Koubek Project is a decentralized solution for educators, content creators, parents, students, and co-publishers designed to address the major challenges in education today. Despite the critical role of educators in shaping the future generation, they are often undervalued and underpaid. Additionally, parents frequently lack control over their children's educational content. At its core, the Koubek Project is a community-driven initiative that harnesses the power of blockchain technology to create a fairer education system. By decentralizing the creation and distribution of educational content, the Koubek Project empowers students to access more diverse educational content while providing educators with new opportunities to earn revenue and gain recognition for their contributions. The ultimate goal of the Koubek Project is to revolutionize the US$5 trillion Education industry by returning control to educators and learners. The Koubek Project employs the $KBK token, a fungible token that powers the Koubek Project. The $KBK token facilitates novel forms of collaboration, incentivizes high-quality content creation, and promotes the long-term growth of the protocol. Designed with educators and learners at the forefront, the Koubek Project aims to foster a thriving, inclusive ecosystem through the $KBK token. Koubek Project is a decentralized solution for educators, content creators, parents, students, and co-publishers designed to address the major challenges in education today. Despite the critical role of educators in shaping the future generation, they are often undervalued and underpaid. Additionally, parents frequently lack control over their children's educational content. At its core, the Koubek Project is a community-driven initiative that harnesses the power of blockchain technology to create a fairer education system with $KBK as its native token.","links":"https://koubektoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/koubek/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":15,"contract_address":"0x6e9a1428798ff011e2cf369b129630f686232784"}}}