{"name":"CUBIX","id":"cubix","symbol":"cubix","description":"Cubix, a blockchain-based NFT sports gaming platform, is preparing to debut its token on Bitmart. The Cubix platform is going to bridge the gap between fantasy sports and NFTS with the beauty of transparency the blockchain network provides and allow players from all over the globe to make their dream teams to play engrossing mini-games and fantasy games across sports like cricket, soccer, and basketball and earn while doing it. The players on the platform will enjoy proof of ownership and actual ownership of in-game assets with actual, tangible market value. Cubix is all set to launch its in-game token for trading on BitMart which is a premier global digital asset trading platform with over 9 million users. The $CUBIX token is the engine that drives the Cubix ecosystem. At present the token use-cases will involve fantasy sports gameplay mini-games and the NFT marketplace. But $CUBIX isn’t limited to being just a token for buying and selling in-game NFT assets. When it comes to utility, it offers much more than the typical token issued in play-to-earn games. $Cubix will provide its holders with additional income opportunities through staking which will be launching soon. It will also act as a governance token, which will enable its holders to vote for the changes they wish to see on the platform. Additionally, token holders will also be eligible for limited-edition NFT drops and free token airdrops. Besides, players will be able to participate in special fantasy pools with greater rewards and free perks if they hold the $Cubix token. The Cubix ecosystem looks promising, and its token utilities reflect the values of the founders. “ We want to build a sports gaming ecosystem which is fair and sustainable whilst giving the users an engaging experience.” — Pratik Patel ( Founder). The token is set to launch in mid-November before the FIFA World Cup.","links":"https://cubixpro.io/#","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cubix/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xa0e5c8b2b2e345c72f452880b2c164b944012907"}}}