{"name":"queenETH","id":"queeneth","symbol":"qeth","description":"What is the project about? Tranchess is a yield-enhancing asset tracker protocol with varied risk-return solutions. What makes your project unique? Unlike Lido’s stETH, the balances of qETH does not get rebased on daily basis; what’s getting recalculated regularly is the net asset value of qETH. The staking rewards will be reflected on the increase in the net asset value (qETH/ETH). Therefore, qETH is naturally compatible with existing DeFi infrastructures. Fund would distribute fee rebates to node operators and veCHESS holders in qETH, which could be directly traded in the qETH/ETH pool from Balancer directly. qETH holders could swap qETH with ETH, provide liquidity for the qETH-ETH stable swap, or split into BISHOP and ROOK for more risk options. Furthermore, Tranchess Fund will stake the ETH into the ETH2 Deposit contract. Every 32 Ethers deposited would activate a new validator created by one of the node operators and earn stable ETH2 staking rewards. Note that since the rewards for a functional validator node are always positive and will constantly grow, the net asset value of qETH/ETH will almost always increase. History of your project. The concept of Tranchess was first incepted in early 2020 and was developed quickly into its current state. Inspired by tranche funds’ ability to satisfy users’ varying risk appetites, Tranchess aims to provide a different risk/return matrix out of a single main fund that tracks a specific underlying asset (e.g. BTC, ETH, BNB) or a basket of crypto assets What’s next for your project? Tranchess plans to carry its LSD+Tranched fund model to all major POS chains, to provide yield segmentation to users with different risk appetite. What can your token be used for? qETH is the liquid token of Tranchess liquid staking. After users stake their ETH with Tranchess, they receive qETH as the liquid token. The amount of qETH is constant unless users stake/unstake more ETH. The staking rewards will be accumulated as fair value of","links":"https://tranchess.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/queeneth/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x93ef1ea305d11a9b2a3ebb9bb4fcc34695292e7d"}}}