{"name":"DogeBonk","id":"dogebonk-eth_ethereum","symbol":"dobo","description":"What is the project about? The \"Doggy-Bonk\" memecoin project token operates on the Ethereum blockchain, embracing a lighthearted and humorous approach. This token aims to offer a playful and unique experience within the cryptocurrency space. What makes your project unique? The project's distinctiveness lies in its creative and entertaining narrative, which involves a fictional character engaging in humorous activities such as \"bonking\" and interacting with other imaginary personas. This whimsical concept sets it apart from more conventional projects in the blockchain ecosystem. History of your project. Originating from a playful idea, the history of the project can be traced back to its inception as a memecoin with a focus on community engagement and lighthearted content. It gradually gained attention within online communities, thanks to its humorous and relatable storytelling. What’s next for your project? Looking ahead, the project aims to continue fostering a sense of community and amusement within the blockchain space. It seeks to explore ways to integrate its playful theme into activities that engage users and bring a touch of humor to the crypto landscape. What can your token be used for? The token itself serves as a means of participation and interaction within the \"Doggy-Bonk\" community. While not designed for complex utility or financial transactions, it offers a way for community members to engage in the project's storytelling and contribute to its growth.","links":"https://www.dogebonk.io/","market_cap":230790,"market_cap_rank":5686,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dogebonk-eth/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x73c6a7491d0db90bdb0060308cde0f49dfd1d0b0","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x73c6a7491d0db90bdb0060308cde0f49dfd1d0b0"}},"is_native":false}