{"name":"Sauce Inu","id":"sauce-inu","symbol":"sauceinu","description":"What is the project about? SauceInu is a community-based \"INU-Themed cartoon\" of the Sauce token. The project was primarily created to promote SaucerSwap and uplift users of the Hedera ecosystem. What makes your project unique? Our primary mission on Hedera is to promote the best DEX on Hedera -SaucerSwap-. Additional goals are to bring in new members from other communities by displaying the power of Hedera, and SaucerSwap in cartoon fashion, and to continually spread love and cheer to the Hedera community through positivity and sustained engagement. SauceInu is in no way officially affiliated with SaucerSwap Labs, Sauce, or xSauce. History of your project. SauceInu was distributed to reward users who stake \"xSauce\" as there was an initial tiered disbursement to all xSauce holders who held greater than 100 xSauce tokens. What’s next for your project? “The main goal of SauceInu is to foster a fun and interactive community in support of SaucerSwap, the leading DEX on Hedera Hashgraph.” We plan to spread these messages through cute cartoons of SauceInu with several different NFTs and other media of her and her adventures in the future. What can your token be used for? The tokens can be used for NFT, Emissions from NFT taxes will go to buybacks and then “Burned” in a unique manner by going into a 99-year Locked Liquidity pool. This decreases the circulating supply of SauceInu, and also adds value back into liquidity pools via buybacks and lastly can be played games with it's own merchandise shop in shopify.","links":"https://sauceinu.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sauce-inu/logo.png","detail_platform":{"hedera-hashgraph":{"decimal_place":8,"contract_address":"0x00000000000000000000000000000000002d3bd3","geckoterminal_url":"https://www.geckoterminal.com/hedera-hashgraph/tokens/0x00000000000000000000000000000000002d3bd3"}}}