{"name":"MarblePrix","id":"marbleprix","symbol":"marblex7","description":"Marbleprix is a innovative Web3 gaming ecosystem, which allows users to meet up with live races with meta applications. Yes, its a first of its kind ecosystem and project to allow multi dimension races for example like pure blockchain based races, also live races on innovative race tracks operated based on UNIX clock timing and relayer contract amalgamation. Hope this summary helps all the $MARBLEX investors and supports. We want you all to participate, bet, fun and win is our ecosystems Motto. So far the team have built up two Tracks in the name of Satoshi and Vitalik to honour the legends in crypto space, few more on the construction. The aim and objective of the ecosystem utility is to allow users to participate in Marbleprix race tracks based on live race streams on the v1, then on the v2 Meta races and v3 simulation races. The fundamental of the v1 live racing game is that the users will be able to participate in the betting ecosystem which operate 4 races per day at the start with low to high stake racing slots. There will be 7 Marbles of same size and different colour participate in each races. Users should posses min of certain $MARBLEX coins to access the app and participate in the race and to claim the wining too. Each Round lasts for 2 hours. 1 hour for betting participation open round, next 1 hour is for 10 laps to run, last 1 hour for race finalization and price settlements. The Race track is constructed using high profile 3d printing materials, the finish line will be captured with sports high speed sensor cameras, the race will be live streamed with unix clock streamed in a big Television from the race studio. This is a new kind of gaming platform, where the live race gonna integrate with blockchain. We have our own inhouse MarblePrix team Marbles in NFT's, staking, DAO all will be introduced once the racing version 1 dapp kicks off.","links":"https://www.marbleprix.io/#","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/marbleprix/logo.png"}