{"name":"Era Swap","id":"era-swap-token","symbol":"es","description":"\"Era Swap Token (ES) (a decentralized utility token) currently based on Ethereum blockchain (ERC20) will be used on multiple platforms for exchange of services (P2P), avail discounts, get rewards and many more utility. Era Swap (ES) is an ER20 token which is supported by Era Swap Ecosystem. ES can be used within this ecosystem for discounts and rewards to users. Era Swap Ecosystem (ESE) consists of multiple utility platforms for day to day life such as P2P Social Marketplace, Education, Charity, Prediction, Multi Exchange Solution, P2P Lend & Borrow, Decentralized Wallet, Affiliate Program, Token Vesting, Merchants & Shoppers etc. Please refer white paper for detailed road map https://eraswaptoken.io/pdf/eraswap_whitepaper.pdf The utility of ES comes because of ease of access and smart contract driven reward distribution for transparency. Further these rewards can be redeemed back by the users within the ecosystem. Era Swap Ecosystem includes multiple interlinked platforms as below:  TimeAlly DApp – Set of smart contract driven token vesting platform which rewards the community for vesting. TimeAlly also acts as the foundation for reward distribution to the community members based on their contribution within the ecosystem.  BetDeEx DApp – BetDeEx is a decentralized Prediction Platform where users can predict and win. BetDeEx leverages blockchain to make the overall prediction process Decentralized, Transparent, and Trustless.  Era Swap Academy– a self-paced eLearning app to learn blockchain technology at an affordable cost with the scope to add next-gen frontline technologies like IOT, AI, ML, AR and VR.  Time Swappers –A p2p social marketplace where users will be rewarded for sharing original contents as well ascan exchange services.  Era Swap Wallet – A decentralized and secured wallet with HD wallet.  BuzCafe– is a retail network where community can transact in P2P mode by meeting up and exchanging product or services.  Swappers Wall – a social platform integrated with marketplace to make users more comfortable by exchanging services with their community members in P2P mode, powered by Power Token and Contribution features.  Day Swappers – All these platforms are connected together for users by SSO (Single Sign-On) through a unique affiliate program Day Swappers who will further add more users to multiple platforms by referring their community and get rewarded based on their contribution. Problem Statement: The internet phenomenon made it extremely convenient to match the asset owner and asset seeker however internet itself cannot power the transaction in a decentralized way. There have been multiple platforms for buyers and sellers across the globe however there are few elementary problems with traditional centralized platforms: • Lack affordable learning platforms exclusively for high end technologies • Lack of Self paced learning applications where millineal from remote area can learn technology, anytime anywhere through mobile or web • Lack of awareness among coming generation about the dynamic nature of technology and its insurgence in daily life • Lack of aggregators model which connects teachers/subject matter expert with knowledge seeker/ students worldwide without any barrier • Lack of social platforms which rewards users as well as their circle for their contribution in peer to peer mode for exchange of services • Freelance platforms charge about 10-30% fees per transaction as middlemen. • Global payment gateways charge between 30% to 40% for processing payment transaction • Traditional Banking charges are between 2- 3% • For doing the transaction, need several trusted parties and there is a cost to each trusted party. • Users have no control over their data which can be further misused by these middlemen. • No profit is shared with the users by these existing traditional platforms. Solution approach The team is working on the solution to solve this problem for buyers & sellers. The team designed the concept to create ecosystem altogether multiple interlinked platforms which make the ecosystem self sustainable and not dependent on any third party. Here users communicate in transparent P2P mode to exchange their requirements on day to day basis. Team is focused on simplifying the offerings with user friendly solutions which can be used easily by any common man and doesn’t requires much tech savvy knowledge to operate. Apart from this we have a team of 30 plus software developers day in & day out working to make better solutions for community\"","links":"https://eraswaptoken.io/","market_cap":5923098,"market_cap_rank":1484,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/era-swap-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x72108a8cc3254813c6be2f1b77be53e185abfdd9"}}}