{"name":"Broccoli","id":"broccoli-6_binance-smart-chain","symbol":"broc","description":"Broccoli Coin ($BROC) is a meme cryptocurrency token inspired by Broccoli, the dog of Binance founder Changpeng Zhao (CZ). Designed primarily as a meme-oriented token on the Binance Smart Chain (BSC), $BROC integrates advanced AI functionalities aimed at enhancing marketing, content creation, and community engagement. The token was founded by Nikolay Zharichev, a serial entrepreneur based in Dubai, originally from the CIS region. Zharichev is recognized as a memecoin expert and an innovator in artificial intelligence, leveraging his extensive experience to create a distinctive and engaging crypto project. The token launched within a well-established community known for successfully developing meme tokens, some achieving over $70M market caps and significant liquidity pools exceeding $3M. Broccoli Coin's ecosystem uniquely combines meme appeal with practical AI-driven tools accessible through its dedicated AI platform. These include: Chatbot: Multilingual AI chatbot (English, French, Spanish, German, Italian) offering conversation-based support, file uploads, advice, and idea generation. Marketing Mode: AI-driven marketing analysis, strategy formulation, and brand positioning assistance. AI Web Search: Generates detailed answers leveraging real-time web resources powered by artificial intelligence. Custom Visuals: Creates personalized images and graphics based on selected styles. Ad Wizard: Generates optimized ad creatives designed for improved audience engagement and conversions. Logo Lab: Quickly produces professional-quality logos from simple descriptions. Background Removal Tool: Easily removes image backgrounds with high accuracy. Image Analysis (Beta): Provides valuable insights extracted from visual data to assist in market research. Broccoli Coin was inspired by Changpeng Zhao (CZ), CEO of Binance, and his dog named Broccoli. The token aims to attract Binance’s attention and achieve listing on prominent cryptocurrency exchanges. It seeks qualification for BNB Foundation's token grant program, increasing its potential visibility within the crypto ecosystem.","links":"https://broc.wtf","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/broccoli-6/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x554b5daea72b2e2185147374954cb4721e20f4e1","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x554b5daea72b2e2185147374954cb4721e20f4e1"}},"is_native":false}