{"name":"Revoland","id":"revoland","symbol":"revo","description":"The native fungible token of Revoland (ticker symbol $REVO) is a transferable representation of attributed governance and utility functions specified in the protocol/code of Revoland, and which is designed to be used solely as an interoperable utility token on the games ecosystem. $REVO is a functional utility token which will be used as the medium of exchange between participants on Revoland in a decentralized manner. The goal of introducing $REVO is to provide a convenient and secure mode of payment and settlement between participants who interact within the ecosystem on Revoland, and it is not, and not intended to be, a medium of exchange accepted by the public (or a section of the public) as payment for goods or services or for the discharge of a debt; nor is it designed or intended to be used by any person as payment for any goods or services whatsoever that are not exclusively provided by the issuer. $REVO also provides the economic incentives which will be distributed to encourage users to contribute to and participate in the ecosystem on Revoland, thereby creating a mutually beneficial system where every participant is fairly compensated for its efforts. $REVO is an integral and indispensable part of Revoland, because without $REVO, there would be no incentive for users to expend resources to participate in activities or provide services for the benefit of the entire ecosystem on Revoland. Given that an additional $REVO will be awarded to a user based only on its actual usage, activity, and contribution on Revoland and/or proportionate to the frequency and volume of transactions, users of Revoland and/or holders of $REVO which did not actively participate will not receive any $REVO incentives.","links":"https://www.revoland.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/revoland/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xfc279e6ff1fb1c7f5848d31561cab27d34a2856b"}}}