{"name":"Strike Protocol","id":"strike-protocol_ethereum","symbol":"stpr","description":"Strike Protocol, developed by GLOBAL DODO ENTERTAINMENT, is a groundbreaking multiplayer adventure that mixes base-building in an open sandbox with the excitement of raiding champion bases. In this thrilling game, you'll step into the roles of either a skilled Infiltrator or a strategic Commander. Whether you're crafting challenging bases or launching daring raids on other players' creations, you're in for an epic gaming experience. The game's main currency is the STPR token. PURPOSE: Seed Sale (50E) and Launchpad Pre-sale (100E) Investors: STPR has been allocated to early investors in the Seed and Pre-sale rounds. In-game Currency: STPR is the primary currency, used alongside fiat for player transactions, covering both crypto and traditional player entry. Conversion: STPR will enable an easy transition from free or fiat-based gameplay to crypto, unlocking NFTs for players. Rewards: STPR will be awarded in daily and weekly missions as part of player rewards. Governance and Voting: STPR grants holders rights within the ecosystem and voting power over the game's future direction. Reserve & Ecosystem: STPR will be held in reserve on DEX/CEX platforms to support scaling, using a combination of ETH and liquidity. UTILITY: Innovative P2E Approach: Instead of the traditional play-to-earn model, Strike Protocol integrates crypto as an optional add-on, enhancing gameplay. Revenue Sharing: The game offers a unique financial model, providing revenue sharing instead of traditional staking locks. Cross-Platform Gaming: Strike Protocol supports cross-platform play across PC, Mac, Android, and iOS, all within one cohesive ecosystem.","links":"https://strike-protocol.com/","market_cap":38240,"market_cap_rank":8626,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/strike-protocol_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1c74d8c8fe37b0fa47debc82e0ab6925a3dc4a2f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x1c74d8c8fe37b0fa47debc82e0ab6925a3dc4a2f"}},"is_native":false}