{"name":"FLAP","id":"flap","symbol":"flap","description":"Flap, powered by Blast, is a bundle market not constrained by liquidity. Users can seize opportunities to mint prestigious blue-chip NFTs at low prices, with Blast native yields, and sell L1 blue-chips instantly above floor price on Blast L2. First, we introduced NFTs to Bundle marketplace, leveraging the value and community of NFTs (both on layer1s and layer2s) to the randomness factor which is powered by Pyth network's entropy solution. Second, our protocol is completely decentralised, as liquidity is provided by traders and flippers in an order book model. Third, we drive L1 NFT traders to trade NFTs on Blast L2. Most importantly, we used Blast-native yield to reward participation, where users who participated but didn't win in the uncertainty game can be compensated with higher yields, incentivising them to stay. This further distinguishes us from other marketplaces projects on other networks. The genesis of Flap traces back to an ETH Global hackathon, where it was recognised as the best cross-chain hack for its concept. Discover the Flap Showcase at ETH Global https://ethglobal.com/showcase/flap-sh-nypdu. Flap is now incubated by Startup Lisboa https://www.startuplisboa.com/ as one of the leading startups born out of Lisbon. Project Description We are trying to solve the following two problems faced by today's NFT market: Low liquidity: The NFT market needs more buyers and sellers. Our protocol creates more \"buy orders\" in the market. No incentives to bridge NFT to Layer2s: The gas cost on Layer2s is much lower than Ethereum. However, most NFT tradings still happen on Ethereum because people have no incentives to bridge their high-priced NFTs to layer2s. Our protocol creates an incentive by creating \"buy orders\" that may have an offer price higher than the floor price on Layer 1.","links":"https://flap.sh/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flap/logo.png","detail_platform":{"blast":{"decimal_place":null,"contract_address":"","geckoterminal_url":"https://www.geckoterminal.com/blast/tokens/"}}}