{"name":"Graft Blockchain","id":"graft-blockchain","symbol":"grft","description":"GRAFT Blockchain aims to bring a lasting solution to most of the problems that cryptocurrencies face at the point of sale, including long wait times and high transaction costs. GRAFT Blockchain makes it easy for the merchant to start accepting cryptocurrency at the point of sale, without having to change processes or retrain people: - GRAFT Blockchain Mobile Point of Sale app accepts various cryptocurrencies, which eliminates the need to maintain multiple point of sale apps and wallets - Instant transaction confirmation, within hundreds of milliseconds to a few seconds, which enables normal in-store and online checkout process - Transaction are settled in real time and payouts can be received in local currency - Graft is integrating with leading terminal providers, what enables accepting cryptocurrency without changing POS system GRAFT Blockchain makes paying with cryptocurrency as straightforward as using a credit card or mobile wallet. - GRAFT Blockchain allows using your favorite cryptocurrency at point of sale - Quick exchanges enable transfer among currencies at the time of payment, enabling “pay with any currency” features - Transaction fees are small, proportional to the transaction amount, and always charged to the merchant (just like with traditional credit card payments, only much smaller). Micro purchases with cryptocurrency will be finally affordable GRAFT Blockchain also offers variety of options for the eco-system partners to be part of the network and earn income while providing services: - Supernode owners process transaction and earn fees - Independent software vendors create back-office and other types of applications on top of the network - Service Brokers provide merchant, pay-in/pay-out, arbitrage, and other services to the network Running on its own blockchain sets the GRAFT Blockchain project apart from its competitors that are based on the ERC20 tokens. As such, the Graft blockchain-based network will not be subject to the underlying blockchain conditions such as latency and fees, putting the company in a strong position to be able to offer optimum payment services.","links":"https://www.graft.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/graft-blockchain/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}