{"name":"Dosa the Demon","id":"dosa-the-demon","symbol":"dosa","description":"$DOSA is a culture-first memecoin launched on the Hedera network. It was born not from utility promises or roadmaps, but from a desire to build a symbol, one rooted in art, identity, chaos, and rebellion. In a world of AI-generated garbage, derivative clones, and soulless crypto projects, DOSA stands out by doing less and meaning more. The project draws its strength from three core pillars: handcrafted art, unpredictable lore, and community-driven chaos. Every visual element of DOSA is hand-drawn by a small, tight-knit collective of anonymous artists. The aesthetic leans into the demonic, the twisted, and the surreal reflecting not just the coin, but the emotional state of the degen world it lives in. This isn’t just branding, it’s ritual. DOSA intentionally avoids the typical Web3 playbook. There’s no roadmap. No Discord. No roadmap tweets promising the same overused utility ideas. Instead, DOSA plays with the idea of possession through memes, through story fragments, and through cult-like alignment with its holders. Owning DOSA is less about what it gives you, and more about what it says about you: you're in on the joke, and part of something bigger, even if that something is unhinged. The community surrounding DOSA doesn’t behave like a typical crypto fanbase. It acts more like a digital cult united by memes, chaos, and an unspoken understanding of the art. DOSA was never meant to be “just another token.” It was created to be felt. While many tokens attempt to shoehorn in utility or utility theater, DOSA leans fully into what makes memecoins powerful, culture, storytelling, and energy. It has quickly become one of the most recognizable and respected meme tokens on Hedera, known for its unmatched content, mysterious drops, and an unwavering commitment to doing things differently. At its core, DOSA is about showing that in Web3, vibes are utility. That strong narrative, distinct art, and cultural resonance can outperform half-baked products. DOSA is a signal. A manifestation. A demon you don’t just hold, you submit to.","links":"https://dosathedemon.com/","market_cap":1316666,"market_cap_rank":3795,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dosa-the-demon/logo.png","detail_platform":{"hedera-hashgraph":{"decimal_place":8,"contract_address":"0x000000000000000000000000000000000078748f","geckoterminal_url":"https://www.geckoterminal.com/hedera-hashgraph/tokens/0x000000000000000000000000000000000078748f"}}}