{"name":"iMe Lab","id":"ime-lab","symbol":"lime","description":"What is iMe Lab? iMe is an ecosystem with the Telegram-based messenger, Crypto Wallet, and DeFi tools and its native utility token LIME. The app allows sending crypto in a few clicks, making crypto transactions fast, secure and hassle-free. Any user can send cryptocurrencies they hold in their iMe wallet to any of their contacts via their Telegram handles, in a matter of seconds. With robust DeFi capabilities integrated into the messenger (Uniswap, BNB Chain, Ethereum, PancakeSwap, Polygon), iMe is on a mission to make DeFi more accessible to a wider population. iMe is the first one to add Binance functionality into the messaging ecosystem to swap cryptocurrency on Binance, make deposits to Binance accounts from iMe Wallet, send request payments and make zero-fees transactions, and many more. iMe facilitates mass adoption of crypto! LIME token by iMe Lab LIME token (ERC20, BEP20, Polygon) is a utility token of the iMe Lab project offering a wide range of utilities that are linked to monetization facilities and paid functionality operation in iMe: Creation of NFT-Avatars and NFT-Neurobots; NFT publication in the Marketplace; NFT promotion in the Marketplace; Publication of groups, channels, and chat-bots in the Catalog; Promotion in the Catalog; CryptoBoxes creation; Gas payment in blockchain networks in LIME tokens; DAO-Votings creation. LIME Donation feature in Telegram groups and channels. And other opportunities: Access to the functionalities of partner projects in iMe DAO principle utility. Lime token holders will have a say in the development of the ecosystem and the right to suggest or influence the decision-making process depending on their stake. Staking opportunities. This feature will allow users to stake LIME and earn a certain APR percentage according to their stake part and period. Earning rewards in LIME tokens for the execution of tasks on the iMe tester platform that will be implemented in the app. The range of LIME utilities will be expanding over time according to the new features and milestones realizations. All LIME tokens received from monetization will be frozen. These actions are aimed at reducing LIME circulation in order to gradually reduce the current circulation, thereby creating a shortage and demand for LIME. iMe Lab tools include: iMe offers all of Telegram’s features + new tools and settings: Crypto Wallet with DEXs (Uniswap, PancakeSwap), CEXs (Gate.io, AscendEX, more coming) possibility to buy crypto with a card (through partnership with Simplex) Multichain support: Ethereum, BNB Chain, Polygon. Avalanche, Cardano, Polkadot, Solana and others. Built-in Google translator in chats Functional cloud with albums Neurobots NFT Avatars and NFT Neurobots NFT marketplace Advanced folder functions Voice messages to text LIME Donation feature for Telegram groups and channels Binance functionality CryptoBoxes rewarding function for Telegram communities WalletConnect integration How Many LIME tokens Are There in Circulation? The iMe Lab was launched on April 16th, 2019. In total, 1 billion Lime is created, no additional issuance is expected. Current circulating supply of LIME is 16,04%. Who Are the Founders of iMe Lab? Alexander Borutskiy: 20 years in IT, in crypto since 2016. Has a Ph.D. in economics. Alex Barhat: In crypto, since 2014, started from mining, and then got deeper into development. Has a higher education in software engineering. The project was founded two years ago by an experienced team of developers working in the sphere for about 10 years. The team has decided to create a super app with messaging and DeFi features, integrated native crypto wallet, Binance functionality, NFT support, and even crypto features for Telegram chats (LIME Donation, CryptoBoxes). At the moment, there's a well-functioning iMe app developed on Telegram API available on Google Play and App Store. iMe has an international core team from Cyprus, Russia, Spain, Ukraine, Great Britain, Slovakia, India and other countries. The core team consists of 5 people.","links":"https://imem.app/","market_cap":13931157,"market_cap_rank":1284,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ime-lab/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"polygon-pos":{"decimal_place":18,"contract_address":"0x7f67639ffc8c93dd558d452b8920b28815638c44"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7bc75e291e656e8658d66be1cc8154a3769a35dd"}}}