{"name":"Entangle","id":"entangle","symbol":"ngl","description":"Entangle is the one-stop shop for any network, protocol, or asset seeking the core primitives and tools necessary to connect to the rest of the blockchain ecosystem. Whether it’s the tools to source data from Web2 sources as well as Web3, enabling the tokenization of assets, facilitating omnichain gaming interactions or integrations that allow the creation of new cross-chain DeFi and Liquidity products, Entangle is enabling the omnichain evolution of the crypto industry. This is accomplished in 4 parts: Photon Messaging: Highly customizable omnichain messaging for any EVM or non-EVM network. Universal Data Feeds: Low-latency, low-cost data infrastructure for any Web2 or Web3 data source. Both price-feed data and generalizable data are supported and delivered to smart contracts on any chain. e-VRF: Provides highly secure, verifiable, and unpredictable numbers, ideal for projects needing randomness. Supports on-chain applications such as gaming, NFTs, gambling, generative art, and beyond. Liquid Vaults: Composable derivative tokens for any Web3 asset, increasing capital efficiency while still earning yield on the underlying asset. Entangle has already established key partnerships with industry leaders, including Arbitrum, Mantle, Linea, Polygon, Avalanche, Velodrome, SushiSwap, and many others. These integrations alongside multi-capable tech, have significantly expanded Entangle’s capabilities and influence in not only blockchain but to a diverse range of use cases including AI, GameFi, Real World Assets, DePin and more.","links":"https://entangle.fi/","market_cap":95346197,"market_cap_rank":635,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/entangle/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x12652c6d93fdb6f4f37d48a8687783c782bb0d10"},"mantle":{"decimal_place":18,"contract_address":"0x8a3ed1f2d15b5015396f494cc1da977da38a6773"}}}