{"name":"Entangle","id":"entangle","symbol":"ntgl","description":"Entangle is the essential infrastructure needed to build the Infinite Web3. As the decentralized digital highway connecting blockchains, data, AI, and real-world applications, it empowers developers to build, scale, and automate the technologies shaping the future of Web3—including AI, robotics, Real World Assets (RWA), and beyond. Entangle provides the critical toolkit for those building the most advanced and transformative products in tomorrow’s decentralized, autonomous digital-world. This isn’t just a technology to adopt; it’s the infrastructure every builder will need to lead the next wave of progress. Key Features of Entangle Universal Interoperability Protocol (UIP): The first fully abstracted communication network bridging EVM and non-EVM blockchains, UIP ensures fast, seamless and decentralised communication. It powers universal applications, assets, data and autonomous agents, fully unifying the blockchain ecosystem. Universal Data Feeds (UDF): UDF provides secure, verifiable, and ultra-fast data streams for smart contracts with flexible delivery models, including push and pull methods. Supporting both Web2 and Web3 data powered by TEE technology, UDF delivers high-speed data essential for AI, DeFi, GameFi, and other data-driven applications. Universal Token Standard (UTS): UTS simplifies token creation and allows developers to launch or expand interoperable tokens with universal liquidity and programmable utility. Leveraging secure, reliable cross-chain communication, UTS ensures seamless integration and scalability across blockchain ecosystems. Universal Proof of Compute (UPC): An omnichain protocol for verifying complex off-chain programmes and computations on all blockchains. This framework is essential for all AI-driven systems such as truly autonomous agents, enables seamless Web3 user experiences and the bridging of real-world finance on-chain.","links":"https://entangle.fi/","market_cap":103745321,"market_cap_rank":510,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/entangle/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x12652c6d93fdb6f4f37d48a8687783c782bb0d10","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x12652c6d93fdb6f4f37d48a8687783c782bb0d10"},"mantle":{"decimal_place":18,"contract_address":"0x8a3ed1f2d15b5015396f494cc1da977da38a6773","geckoterminal_url":"https://www.geckoterminal.com/mantle/tokens/0x8a3ed1f2d15b5015396f494cc1da977da38a6773"}}}