{"name":"Blood Crystal","id":"blood-crystal_polygon-pos","symbol":"bc","description":"\"Eternal Crypt - Wizardry BC -\"\" is a blockchain game that utilises the Wizardry IP, also known as the origin of RPGs, and uses the utility token Blood Crystal (BC token). In this game, players explore a dungeon called \"\"\"\"Dadoel's Hole\"\"\"\" with up to 36 adventurers and aim for the abyss by devising party compositions and strategically training adventurers to defeat difficult enemies. By exploring, you can obtain BC tokens and treasure chests, and if you successfully open the treasure chests, you can obtain various items. This is a strategic game where you can enjoy both the easy-to-play game system that allows you to play in your spare time and the 'intelligence' that is unique to 'Wizardry'. In this game, players form a party of adventurers and conquer dungeons. Adventurers come in five rarities: Common, Rare, Epic, Legendary, and Genesis. Rarities above Rare can be taken out of the game or bought and sold in the marketplace as NFT. To earn BC tokens, you basically need to own this adventurer NFT, form a party and play the game. There are four races of adventurers - humans, elves, dwarves and felpers - and eight professions - warrior, monk, wizard, thief, priest, samurai, monarch and ninja - with different abilities based on race and profession, each with its own strengths and weaknesses. As a guild master, the player must form a party according to the situation and use their own strategy to progress through the dungeon, with the adventure rewards (BC tokens) varying according to how deep into the dungeon they can reach in one exploration. There are endless possibilities for party composition, and the adventure style varies depending on how you develop your skills and legacy items. Click here to continue. https://docs.google.com/document/d/16oP0OCO6Tcypixuvi3gMTZg0mqtpmV8JDLHkI6SJeEY/edit?usp=sharing","links":"https://wiz-eternalcrypt.com/","market_cap":2434300,"market_cap_rank":2772,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blood-crystal_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xfe049f59963545bf5469f968e04c9646d6e2c2c5","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xfe049f59963545bf5469f968e04c9646d6e2c2c5"}},"is_native":false}