{"name":"C+Charge","id":"c-charge","symbol":"cchg","description":"KYC Verification https://coinsniper.net/coin/42391/kyc Contract Audit https://github.com/solidproof/projects/tree/main/C-Charge C+Charge is fully verified and audited to insure 100% anti-rug and and project security. C-Charge Mission is to change the world with blockchain technology C+Charge aims to democratize the carbon credit industry by enabling EV drivers the ability to earn these rewards that have previously been reserved for large corporations and entities. C+Charge is a blockchain-powered network that is the first on-chain or off-chain platform that allows EV drivers to earn carbon credits simply by driving and charging their vehicles. on to become the universal payment solution for EV charging stations, harnessing the power of blockchain technology with decentralized finance bringing carbon credit sustainability to the masses. C+Charge believes that the rapid transition to electric mobility is essential to building a sustainable future. Our mission is to create a platform utilizing blockchain technology that will promote the movement of all people and goods on electricity. We endeavour to build the world’s leading EV charging crypto payment network by investing in, deploying, and partnering with world-class EV charging solutions worldwide. C+Charge users are allocated individual electronic wallets, which are accessed through the C+Charge app. C+Charge's payment system is powered by the C+Charge utility token that is utilized to pay for each charge. C+Charge token holders will also accumulate carbon credits. Token holders who are drivers will earn extra carbon credits through more charges. By providing an effortless charging experience and the ability to earn carbon credits for drivers, C+Charge is creating a new payment charging model that is good for the planet, good for society, and good for business. C+Charge - Crypto Fueled - Electric Charged. Team is DOXED & KYC verified, Project is fully audited.","links":"https://c-charge.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/c-charge/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":null,"contract_address":""}}}