{"name":"AgriDex","id":"agridex-governance-token_solana","symbol":"agri","description":"AgriDex is transforming the $3 trillion global food and agriculture sector by pioneering the integration of blockchain technology and DeFi. AgriDex creates a seamless, global RWA marketplace where farmers, suppliers, and buyers can trade agricultural goods with unmatched efficiency and transparency. AgriDex leverages AI-driven analytics, self-executing smart contracts, and high-throughput transaction mechanisms to minimize costs, optimize liquidity, and deliver seamless user experiences. It is backed by Circle. the Solana Foundation, and supported by venture giants such as Portal Ventures, Endeavour Ventures and FS Ventures. Its angels include Anna Yuan (Perena) Tobe Taiwo (Palantir) and the ex CTO's of both Goldman Sachs, and Citadel. Founded by Henry Duckworth—formerly the youngest trader at $300 billion dollar commodity powerhouse Trafigura—AgriDex benefits from deep domain expertise and leadership. AgriDex’s recognition as the winner of Coinbase's \"Best Use Case\" prize highlights its innovative approach to integrating blockchain into real-world industries, with Duckworth being invited to become one of the first blockchain leaders to present to UK Parliament. AgriDex’s entire ecosystem revolves around the $AGRI token, Key utilities of $AGRI include: - Staking for rewards, - Lending to enhance liquidity, - Voting for community governance, - Access to premium features, including data insights and trade optimization tools. AgriDex has established partnerships with dozens of leading global brands, including Dyson Farms- of inventor James Dyson. By combining blockchain transparency with DeFi innovation, AgriDex is not just a marketplace—it’s a movement to empower sustainable agriculture, improve market access, and deliver blockchain’s benefits to a traditionally underserved sector.","links":"https://agridex.com/","market_cap":609100,"market_cap_rank":4335,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/agridex-governance-token_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"AGRidUXLeDij9CJprkZx7WBXtTQC67jtfiwz293mVrJ","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/AGRidUXLeDij9CJprkZx7WBXtTQC67jtfiwz293mVrJ"}},"is_native":false}