{"name":"Finger Monkeys","id":"finger-monkeys_base","symbol":"fmt","description":"FingerMonkeys is a Web3 gaming ecosystem that bridges traditional mini-games with blockchain rewards. Built on the Base network, it introduces FM Nodes (NFTs) that enable passive income from token minting, game events, and trading fees. The FMT token powers the platform by enabling game entry, advertising, governance, and developer licensing. FingerMonkeys blends meme culture with utility-driven DeFi and GameFi features. Unlike many Web3 games, it allows users to participate in thousands of HTML5 mini-game events using FMT, unlock exclusive rewards, and earn through FM Nodes. The platform also opens monetization for external game studios and crypto projects via in-game events. The FingerMonkeys project began in late 2023 with the goal of creating a playful yet rewarding ecosystem for Web3 gamers. Initially launched as a meme brand, it evolved into a gaming platform with tokenomics, NFTs, and a developer-focused infrastructure. By 2025, the team launched FMGames.io and began onboarding games and early users through Telegram game bots. FingerMonkeys plans to launch FMT on DEX and CEX in May 2025. The roadmap includes onboarding third-party developers, launching daily/weekly game events, releasing a DAO governance structure for FM Node holders, and expanding reward mechanisms. FMGames.io will continue to scale, integrating new games and strategic partnerships with crypto projects. FMT is the utility and reward token for the FingerMonkeys ecosystem. It is used to join game events, access exclusive tournaments, receive airdrops, pay for ad space, and stake for future rewards. Game developers use FMT for licensing and prize pools. A portion of event revenue also flows back to Apex FM Node holders in the form of USDC.","links":"https://www.fingermonkeys.com/","market_cap":27366,"market_cap_rank":9178,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/finger-monkeys/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x5ba9e0ce610927c1915c9d9de4bdaf2b8a1dee7e","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x5ba9e0ce610927c1915c9d9de4bdaf2b8a1dee7e"}},"is_native":false}