{"name":"VINCI","id":"vinci-6f85acf0-d549-4759-983c-fc109c5bbd27","symbol":"vinci","description":"VINCI, a groundbreaking web3 platform rooted in the thriving dance scenes of Amsterdam, the Netherlands, and the broader European Union. Harnessing our team's 15 years of experience with leading names in the global electronic dance music scene, we aim to revolutionise the creative economy. Our mission is to foster a vibrant new community for artists and creatives, offering innovative tech solutions to the culture and entertainment industries. We are a platform of the people, for the people, creating value while staging an unforgettable show. Why VINCI Our unique selling points set us apart from other Music & Events web3 projects: - Team, advisors and investors with a proven track records accros various industries; web2, web3, culture, fintech, crypto, music and festivals. - Team is complety doxxed, consists of serial entrepreneurs, developers, creatives, web3 specialists. - Music NFTs offer higher replay value: music is a universal language - NFT+ combines digital, physical, and experiential elements - Organizing real life events in music, NFTs, tech, metaverse, and gaming - Raised funds through there network & community. - Music NFTs' mainstream potential for fair income and royalties - Partners across different industries: tech/crypto, music, museums, festivals. VINCI's goal is to bring all stakeholders within the culture economy closer together, to enable direct interaction and value exchange. This becomes possible via the $VINCI token. Its utility is designed for all stakeholders to engage with our products, connect with other ecosystem participants, and link them with the success of VINCI’s long-term vision.","links":"https://byvinci.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vinci-6f85acf0-d549-4759-983c-fc109c5bbd27/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x5275e602238c85b204413116c1057aff5c60b282"}}}