{"name":"NOVAWCHI","id":"novawchi_ethereum","symbol":"vachi","description":"NOVAWCHI is a decentralized crypto asset that aims to revolutionize the Metaverse, DeFi, and Web 3.0 ecosystems. The project was established in February 2023 and is being developed on the Ethereum and Matic blockchains. The $VACHI token comes with a limited supply of 9.66 million and a transaction fee of 10% on buying and transferring, with no fees on selling. The token allocation strategy includes 30% for centralized exchanges, 40% for decentralized exchanges, 15% for marketing, 10% for project development, and 5% for the team. The token mechanism offers a significant profit return to investors, with a 7.5% reward distribution among all holders, 1.5% going to the treasury wallet, and 1% to the team wallet. Novawchi also offers transparency by providing wallet addresses to everyone. The Novawchi ecosystem has a gaming and NFT collection that includes a warrior group of angels who fight against the JaviCho group of devils to save their planet NevoVerse. The first collection of NFTs is the leader and warrior NFTs of the angel's group. By using these NFTs, users can enter into the NevoVerse or become a part of the game to save their planet. Users can also join the JaviCho group of devils to become a part of their team in the dimensions of the NevoVerse. By adopting both methods, users can earn money in the Novawchi gaming ecosystem. The Novawchi NFT use cases consist of two types, both of which can earn Novawchi Tokens. Users can purchase Novawchi NFTs to exchange them for Clubchip Cards to play in story or battle mode, winning the gameplay rewards them with prize money in Novawchi tokens. Alternatively, Novawchi NFT holders can exchange their NFTs for Clubchip Cards and earn Novawchi tokens by renting them out to gamers. Novawchi is the product of a visionary blockchain developer “Novawchi” with a wealth of programming expertise aimed at revolutionizing the digital landscape. To purchase Novawchi NFTs, users can visit https://opensea.io/collection/novawchi.","links":"https://novawchi.com","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/novawchi_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x337af08bb6980ecb68389c5ed8876d08643abf8a","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x337af08bb6980ecb68389c5ed8876d08643abf8a"}},"is_native":false}