{"name":"The Crypto Prophecies","id":"the-crypto-prophecies","symbol":"tcp","description":"The Crypto Prophecies is the world’s cutest price-prediction game that is partially owned and operated by its players To learn more about the project, take a look at our website (https://www.thecryptoprophecies.com/) Inspired by Pokemon, trading games, price prediction games, and a passion for Technical Analysis and trading currency markets. Enter the Crypto World and put your proclaimed crypto prophecy to the test. The Crypto Prophecies has all the skills of quick action wager games pitted against real-time strategic decision making as you outwit your opponent with attack and defense choices. Can you foresee the candles before the time runs out? The game combines both PVP and PVE play modes. Challenge a player for unlimited stakes or enter the Battle arena against the powerful NPC called The Oracle Each Crypto Prophet is a non-fungible token (NFT) with different attributes and strengths and can be entered into 1vs1 PVP battles where the player with the most points wins and grabs the prize pool. The ecosystem runs by a Kingdom fee, a tax charged on every game played in the Battle Arena, and on purchases of NFTs in the store. The Kingdom fee is ten percent (10%) of the NFT cost or total wager in any arena battle mode. The Kingdom fee was created to benefit the community and the token economy. You can learn more about the Kingdom fee in our whitepaper Battle The Oracle The Oracle is a PVE and play-to-earn game mode with over 20 levels to test your skills at: Predicting candles faster, and; Real-time magic casting strategy Play 50x free games per day to earn MPOT tokens, our secondary yet essential in-game currency that can be traded for TCP tokens, used for summoning NFT items & Crypto Prophets, or used as magic booster. Win battles to unlock higher levels to earn higher MPOT wager winnings and mystery achievement rewards.","links":"https://www.thecryptoprophecies.com/","market_cap":67675,"market_cap_rank":6423,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-crypto-prophecies/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x06576eb3b212d605b797dc15523d9dc9f4f66db4"}}}