{"name":"Attarius","id":"attarius","symbol":"atrs","description":"Attarius Network is an innovative and time-saving platform for web2 developers, players and NFT creators to quickly and easily transition to the world of web3. Providing support for 11+ chains across EVM and non-EVM, Attarius Network works with builders and simple users. What we build: - Developers platform + API + SDK - a management platform and a high level api for blockchain integration. - Non-custodial Attarius Wallet. Key features: - Build 8X faster - save time, money and reduces the risk of errors on blockchain integration - Modular approach to our system allows us not only to add new chains at scale, but also always explore new use cases for our clients - Attarius Network support of different chains across EVM and non-EVM opens up to developers the ability to select the best blockchain for them. - Attarius Network provides a unified API that aggregates data across multiple networks, providing a single interface for managing NFTs and smart contracts over various blockchains. This means developers can deploy multi-chain applications without worrying about fragmenting their user base or managing multiple smart contracts across different networks. - Attarius Wallet provides seamless and secure crypto management experience from a single point and across multiple EVM and non-EVM chains. - Streamlining gas fees - ATRS token simplifies paying transaction costs through unified gas management. With ATRS, users can redeem commissions in different networks with one token, which greatly improves and simplifies user experience. - Efficient Asset Management through Attarius Wallet - creating wallets, managing diverse tokens and NFTs with ease through custom folders and tags, hiding specific NFTs to declutter the wallet interface. Attarius Wallet implements features that specifically target user experience, making it more efficient and convenient.","links":"https://attarius.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/attarius/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":"0x68d4f8821731057c1b8dd4e74cd2956f4761c58c"}}}