{"name":"Cartesi","id":"cartesi_ethereum","symbol":"ctsi","description":"About Cartesi (CTSI) Cartesi enables developers to build appchain rollups with any code, while benefiting from the security of Ethereum. It bridges the gap between traditional software and blockchain by bringing decades of mature operating systems, programming languages, libraries, and tools to decentralized applications. Cartesi aims to provide the technological foundation from which builders, entrepreneurs, and projects will develop decentralized applications. The Cartesi technology suite is currently comprised of: Cartesi Rollups: Cartesi Rollups is an app-specific execution environment that can be deployed as a L2, L3, or as sovereign rollups. The combination of an Optimistic Rollups framework and the Cartesi Machine Emulator enables the development of smart contracts and dApps using any package or library that is available for Linux. This allows developers to break free from the scalability limitations of the Ethereum Virtual Machine (EVM), and brings the rise of a new blockchain era to handle real-life and complex use cases. Cartesi Machine: A RISC-V-based virtual machine (altVM) running Linux OS, enabling complex computations and seamless dApp development by expanding the design space and leveraging 40 years of software programming advancements. CartesiScan: Cartesiscan is the explorer used for viewing blockchain transactions on Cartesi appchain rollups. Cartesi Explorer: The Cartesi Explorer is a product that allows CTSI users to interact with the governance system and stake CTSI. Fraud Proof System - DAVE (following PRT): Dave is a permissionless, interactive fraud-proof system. Cartesi’s algorithm further optimizes the fraud proof mechanism to achieve the best balance between security, decentralization, and activity. What Makes Cartesi Unique The infrastructure of the internet took 40 years, billions of hours of work, and trillions of dollars to build. With Cartesi, developers gain access to these decades of meticulously refined operating systems, programming languages, software libraries, and tools, paving the way for the next generation of blockchain applications. Cartesi empowers Ethereum rollups with real-world software and strong guarantees. Cartesi designed its own Optimistic Rollups framework embedding its own non-EVM virtual machine based on RISC-V. Leverage decades‑proven software ecosystems: The Cartesi Machine enables full Linux and RISC‑V stack execution in a composable, verifiable rollup environment. Cartesi’s architecture is optimized for app‑specific rollups, providing scalable and secure chains tailored to each dApp’s needs, backed by a state-of-the-art fraud proof system, properly categorized as Stage-2 according to L2BEAT. Token Utility Governance: CTSI holders can currently stake their tokens to earn rewards and participate in ecosystem governance. Validator Marketplace: Applications built on Cartesi need validators to monitor and ensure the trustworthiness of transactions. The Validator Marketplace is a decentralized matchmaking service that connects applications with validation service providers. The Validator Marketplace will leverage the CTSI token as a primary means of incentivization in three important ways: 1. Validators will be required to stake CTSI in order to participate, ensuring performance and honest behavior. 2. CTSI holders will be able to delegate their CTSI to experienced validators, allowing tokenholders to share in validation fees without running their own nodes. 3. Token holders can use their CTSI to “buy” a stake in a dApp’s future growth, signaling support for dApps they believe will succeed. The earlier a backer “gets in” on a dApp, the more they are rewarded as that dApp gains traction. The Validator Marketplace creates a direct link between Cartesi dApp usage and CTSI token demand, enabling token holders to share in the growth and success of the ecosystem.","links":"https://cartesi.io/","market_cap":29133500,"market_cap_rank":898,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cartesi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x491604c0fdf08347dd1fa4ee062a822a5dd06b5d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x491604c0fdf08347dd1fa4ee062a822a5dd06b5d"}},"is_native":false}