{"name":"Gus","id":"gus-2_solana","symbol":"gus","description":"GUS is a memecoin hosted on the Solana blockchain that draws its identity from a real cat named Gus, who was paralyzed following a dog attack. According to the project’s official website, guspfcat.fun, the coin’s creation was inspired by Gus’s ongoing recovery and aims to combine internet culture with charitable purpose. Unlike many meme-based cryptocurrencies that rely solely on humor or speculation, GUS positions itself around a tangible event and a specific cause. The website outlines a clear narrative: proceeds from the token are partially allocated to support Gus’s medical care, with a goal of raising $20,000. A donation tracker on the homepage shows real-time progress toward this target. This transparency gives the project a defined objective and connects its economic activity to a measurable outcome. In addition to its charitable focus, the GUS project integrates several interactive features that encourage community engagement. The “PFP Maker” tool allows users to personalize their profile pictures by adding an official GUS ring, reinforcing the visual brand and promoting user participation. The site’s design relies on accessible humor and digital aesthetics typical of meme culture, but it also maintains a consistent thematic link to the story of the cat that inspired it. From a technical perspective, GUS operates on Solana, a network chosen for its low transaction costs and high speed. The website provides step-by-step instructions for purchasing the token through the Phantom Wallet, including how to acquire SOL (Solana’s native currency) and swap it for GUS. This practical guidance indicates that the project targets users who already have a basic understanding of cryptocurrency operations, rather than complete beginners. While the project demonstrates a cohesive theme and a clear charitable intent, some aspects remain underdeveloped. The website does not include a detailed breakdown of tokenomics—such as total supply, allocation structure, or governance mechanisms—nor does it present a long-term development roadmap. The absence of these details limits the ability to evaluate the coin’s sustainability and the accountability of its fundraising efforts. Overall, GUS represents a fusion of narrative-driven marketing and social purpose within the memecoin space. Its foundation on a true story gives it emotional credibility, while its use of Solana technology enables broad accessibility. The project’s future legitimacy, however, will depend on how transparently it manages its funds and whether it continues to align its digital growth with tangible support for the real cat at the heart of its brand.","links":"https://www.guspfcat.fun/","market_cap":4029.47,"market_cap_rank":12645,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gus-2_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"42d245pXpJDhAkX5QKTcLxPB6QxET6KbbsDas71Tpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/42d245pXpJDhAkX5QKTcLxPB6QxET6KbbsDas71Tpump"}},"is_native":false}