{"name":"BiometricFinancial","id":"biometric-financial","symbol":"biofi","description":"\"The BioFi project is a Utility Token that addresses the concerns many people have about safeguarding their personal data while being safe from exploitation by fraudsters. With data breaches and hacks on the rise, consumers in the 21st century are losing faith in the ability of service providers to protect their identity and other sensitive information. BioFi helps solve this problem by bringing the speed, security, and anonymity of biometric identity to the blockchain and the DeFi space. The BioFi ecosystem contains several high profile products operating in global markets and is well positioned to deliver popular utility features to people in every community. Usage of the BioFi ecosystem only requires 1 $BioFi token. Partners of the BioFi ecosystem can integrate easily with the biometric API's, highlighting the unique utility advantage that the entire service can bring. The Biometric Financial website showcases the many products currently available or in development, while providing services to tens of thousands of users globally: BioFi is truly global in nature, not bound by a single language or territory, and designed to be user friendly with the added benefit of helping people feel more secure as access is tied to them individually. BioFi's use cases are practically limitless, from covering the basic elements of authentication for logins, password resets, and payments to updating sensitive information, and providing access to IoT device functions. BioFi will never sell your personal data or intrude upon anyone's privacy. There is unlimited potential for every company to join the BioFi ecosystem while leveraging the $BioFi token in their solutions. The BioFi three-pager and one-pager are available at the following links for more details. Three-pager: https://biometricfinancial.org/wp-content/uploads/2022/03/BioFi-Three-Pager.pdf One-pager: https://biometricfinancial.org/wp-content/uploads/2022/02/BioFi-One-Pager.pdf BioFi is an amazing Utility Token which has incredible value and the potential to greatly improve personal data security throughout the world.\"","links":"https://www.biometricfinancial.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/biometric-financial/logo.png"}