{"name":"Sharbi","id":"sharbi","symbol":"$sharbi","description":"What is the project about? We are a community-owned, multichain cryptocurrency built on Arbitrum, Ethereum and soon Shibarium. Sharbi is a token that rewards holders with USDC. A MEME 2.0 community token, we provide on-going USDC rewards to holders and the power of a decentralized WEB3 community forging our path forward. What makes your project unique? P2H (Pay to Hold) Concept: An innovative approach where holding the token itself becomes a source of income. Decentralization: The token champions the ideals of decentralization and inclusivity. Cross-chain Utility: Sharbi operates on three blockchains, establishing its own robust eco-system. Full Circulation Supply: All of Sharbi's supply is in circulation across all chains, ensuring full transparency and safety for traders. Reward Boost: The presence on multiple blockchains enhances the rewards paid out to holders. Sharbi University: Beyond just a traditional educational platform, Sharbi University encompasses a plethora of features including insightful articles and guides, comprehensive video reviews, meticulous token analyses, a curated hall of fame for standout tokens, a centralized hub for AMAs, and much more. With a unique tokenomics system that rewards holders directly from every transaction, Sharbi has already redistributed over $700,000 back to its community. The token's alignment with platforms like Shibarium University underscores its commitment to informed decision-making and community education. History of your project. Launched in January 2023, Sharbi surfaced as a community token with a mission of democratizing finance. Gaining swift momentum, not just as a meme token, Sharbi debuted an NFT collection with undisclosed future utilities and cemented an elite partnership with @fcfpay. The Sharbi rewards card, a notable milestone, was introduced, facilitating users to expend their rewards effortlessly in real-world contexts. What’s next for your project? CMC Verification: Sharbi is making strides towards having its supply verified on CoinMarketCap (CMC), a significant mark of transparency in the crypto world. Decentralized Governance: The DAO initiative for community-driven decisions. Educational Initiatives: Rebranding of Sharbi University to Shibarium University as an educational cornerstone. Shibarium Launch: Incorporating unique contract functionalities and a planned Shib burn. Branding: Filed trademarks for brand recognition and influence. What can your token be used for? Financial Rewards: Monetary benefits from every trade for holders. Rewards Card Usage: Utilizing the Sharbi rewards card to spend accumulated rewards in diverse outlets. Educational Resource: Shibarium University as a foundational element for community enlightenment. Partnerships: Collaboration with industry stalwarts like @fcfpay. Community Governance: The DAO empowers each token holder in crucial decision-making. Cross-chain Dynamics: Sharbi's tenure on Ethereum, Arbitrum, and the soon-to-be-launched Shibarium amplifies its dedication to multi-chain functionality.","links":"https://sharbi.net","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sharbi/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":9,"contract_address":"0xaa54e84a3e6e5a80288d2c2f8e36ea5ca3a3ca30"},"ethereum":{"decimal_place":9,"contract_address":"0xf3a3023e6dede84ad88a656a3269f2a36e83c9a9"}}}