{"name":"UNO","id":"nostra-uno","symbol":"uno","description":"UNO is the first StarkNet-native stablecoin. UNO aims to be the stablecoin of choice within the StarkNet ecosystem. Pegged to the US Dollar, UNO is fully backed by high-quality censorship-resistant crypto assets, with deep liquidity across many market pairs and a stable peg. Upon deposit of ETH into Nostra Money Market, it will be converted into iETH-c to be used as collateral to mint UNO, providing the benefit of compound interest while using the UNO stablecoin. The value of stablecoins has steadily grown since 2017. During this time, we have seen a few different stablecoin designs, from algorithmic to fractionally collateralized. Some problems we see today for stablecoins are decaying confidence in fiat-backed stablecoins, censorship risk, and loss of peg. UNO plans to solve these problems in the following ways: Increasing the use cases of UNO for borrowing and swapping should mitigate some of the upward peg risks. Deep stablecoin liquidity, over-collateralization, and a robust liquidation mechanism with responsible parameters will mitigate the risk of downward pegging (e.g. caps) We tackle the censorship risk by deploying an immutable contract, using uncensorable assets, and a non-US domiciled core contributor. UNO is part of Nostra. Nostra is your one-stop DeFi solution where you can lend, borrow and swap crypto. Integrating Nostra Money Market, UNO, and Nostra Swap creates the Nostra Liquidity Layer. We are enabling permissionless access to liquid crypto assets for users at any time for any purpose, with minimal impact on price. The core functions of the Liquidity Layer include lending, borrowing, minting, and swapping. Further information regarding the role of UNO in the Nostra Liquidity Layer will be released in the coming months. Further information regarding the role of UNO in the Nostra Liquidity Layer will be released in the coming months.","links":"https://nostra.finance/uno","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nostra-uno/logo.png"}