{"name":"Libertum","id":"libertum","symbol":"lbm","description":"What is Libertum? Libertum is an ecosystem that brings Real-World-Assets (RWA) on-chain. It is a multi-chain solution built with an architecture designed for scalability and interoperability via a combination of proprietary and open-source, consensus-free and decentralised platform technologies. The process of issuing blockchain-based digital tokens representing tangible physical assets is the core of the Libertum platform. The tokenisation protocol aims to offer two mechanisms for those that want to bring real estate online. The first where a transfer of ownership is facilitated and the second where no transfer of ownership is required but instead the real estate is collateralised. Libertum extends the utility of the tokenization of real estate by building independent but interconnected applications into a unified ecosystem with the LBM token at its centre. The Libertum ecosystem Libertum's ecosystem is designed to enhance the tokenization process and bridge the Web2 and Web3 worlds. Leveraging account abstraction and social logins are but two examples of how this is being achieved. The ecosystem itself has seven core functionalities: * Tokenise: Tokenization Engine that allows users to choose to transfer or maintain property ownership * Market: A gamified primary marketplace full of premium properties to choose from * Trade: A Secondary marketplace providing additional financial opportunities for investors * Borrow: Lending protocol with brick and mortar real estate as collateral * Earn: Token Analytics and Staking tool * Stay: On-chain Property Booking system - Web3’s answer to airbnb for the digital nomad * Choose: Governance protocol, have your say in things that matter to you * Get: Liquidity tool enabling cross-chain swapping of your tokens","links":"https://www.libertum.io/","market_cap":3908997,"market_cap_rank":2548,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/libertum/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x56a38e7216304108e841579041249feb236c887b"}}}