{"name":"Astro Babies","id":"astro-babies","symbol":"abb","description":"Astro Token $ABB marks a new chapter for Astro Babies NFT ecosystem. Coming up on the brands one year anniversary, Astro Babies have pioneered the path of utility for Solana NFTs and now are looking to diversify across many networks to expand the platforms accessibility as a blockchain agnostic ecosystem. Astro Token play’s a major role in each of the Astro Babies ventures which revolve around the recently launch Astro Gallery NFT marketplace and the Astro Casino Metaverse experience. In Astro Gallery, $ABB will be used to buy and sell NFTs at a rebate to users with many more integrations in the future. Astro Babies have become very well known in the NFT space for the current development of Astro Club Metaverse (built on Unreal Engine 5 platform Project Keplar). Astro Galleries integration into the metaverse will offer a first person VR experience where users can walk around the gallery, interact in exclusive promotional events and buy/sell there favorite NFT collections in real time. Astro Gallery aims to raise the bar for marketplaces with its Play 2 Earn integration in the Metaverse for listed NFT projects. These projects will have the ability to develop there own metaverse experiences with Astro Gallery while users can earn Astro Token. Astro Gallery is also pivoting from a centralized exchange to become the first ever cross-chain NFT Marketplace Dex which is why Astro Token $ABB is partnered with Debridge, connecting $ABB Astro Token on multiple blockchains. The highly anticipated Astro Casino is Astro Babies most valuable asset as they look to disrupt the entire gaming industry. Take part in a one of a kind virtual casino where users can enjoy slot machines, table games as well as high level poker tournaments all utilizing $ABB Astro Token as the in-house coin. The Astro Babies team are fully doxxed, verified SAFU and lead the first ever NFT project to be adopted in El Salvador, Bitcoin capital of the world. The final integration Astro Babies have","links":"https://www.astrobabies.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astro-babies/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x277ae79c42c859ca858d5a92c22222c8b65c6d94"}}}