{"name":"GALAXIS Token","id":"galaxis-token_ethereum","symbol":"galaxis","description":"Galaxis is a web3-based, distributed membership card-based community management system with a built-in economy. Galaxis is a web3 platform that provides a framework to build, grow, and govern decentralized communities. We seek to empower content creators, individuals, or anyone to create sustainable communities without any 3rd parties. The Galaxis Ecosystem consists of many independent, separate communities. Each community is an independent unit with its own economy that is controlled by the community creator(s) and the community members. Each community has its own membership card. Owning a membership card makes you part of the community. Membership cards of different communities can be very different. Their design and functionality reflect the aesthetics and values of the given community. Despite their differences, they also share a lot of similarities as well: • They are all hyper-utilized NFTs, benefiting from the Galaxis Framework. • They can hold Utility Traits: digital and physical redeemables, online meetings, autograph traits, badges, and more. • They can be used in community engagement: Governance, Gaming, and Staking. In order to enable all of the above, the membership cards are integrated with ERC-20 tokens, starting with Galaxis Token, which allows each community to operate its own economy. Throughout the platform utilities, benefits and features can be unlocked by holding Galaxis Token. • This will apply to both community creators and community members. • Galaxis will provide grants to eligible communities in Galaxis Token • Galaxis Token may also be used for community staking to unlock further benefits. • Galaxis Token will be used as part of a community voting mechanism as well.","links":"https://galaxis.xyz/","market_cap":666617,"market_cap_rank":4237,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/galaxis-token_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x423071774c43c0aaf4210b439e7cda8c797e2f26","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x423071774c43c0aaf4210b439e7cda8c797e2f26"}},"is_native":false}