{"name":"Voucher MOVR","id":"voucher-movr","symbol":"vmovr","description":"vMOVR (voucher MOVR) is a liquid staking derivative (LSD) of staked MOVR, with fully underlying MOVR reserve and yield-bearing feature of MOVR staking reward. Users can deposit MOVR into Bifrost SLP protocol and get vMOVR as return, vMOVR can be traded in the open market or be redeemed back to MOVR. Holding vMOVR equals to holding the MOVR staking position, staking rewards appriciate the exchange price of vMOVR. Why vMOVR? 1. Liquid Staking The product allows users to stake MOVR for liquid vToken, (vMOVR). vMOVR will keep receiving staking rewards and can continue to be used in Bifrost and Moonriver-based DeFi for additional rewards. 2. Automatically Staking rewards capturing without scenario limitations SLP will issue Staking rewards to vMOVR by adjusting the price of vMOVR / MOVR upwards. vMOVR Rate = SLP Staking MOVR (SUM) / vMOVR Total Issuance. 3. Floating redemption period, vMOVR redemption ≤ 28 days While Moonriver’s original chain Staking has a fixed 28-day redemption period, Bifrost SLP helps users to realize the possibility of early vMOVR redemption by matching the real-time vMOVR minting quantity with the redemption quantity at the protocol layer in the form of a queue. Theoretically, it can achieve second-level redemption. 4. Higher Staking Yield In the SLP protocol, the protocol screens more than 10 verified nodes through governance (subsequently increasing with the overall staking volume) and adds multiple filters such as the number of nominees, commission ratio, and history of blocks out to maximize the return of this verifier portfolio while ensuring that none of the nodes have experienced slashes. 5. Multi-environment Compatibility vMOVR is one of Substrate assets in Bifrost parachain, by using the HRMP channels between Bifrost and others, it can be easily utilized in EVM, WASM and Substarte competiable parachains.","links":"https://bifrost.app/vstaking/vMOVR","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/voucher-movr/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}