{"name":"Tribeland","id":"tribeland","symbol":"trbl","description":"Tribeland is a fascinating MMORPG game, which takes place in a land lost in time, where humankind and beasts walk the Earth together. Mages, barbarians, and primordial creatures will go through ongoing conflicts to conquer territories, resources, and mystic powers for the most important quest: turn resources into digital assets! Players will start off in one of the four beginner villages (based on the tribe of your Hero). The beginners’ In village is a safe zone, where players can get used to the game without incurring any penalties. However, rewards granted from the starting gameplay are pretty limited and insignificant compared to the main gameplay. To go beyond the beginners’ village to join the actual world of Tribeland, players must accomplish a main-quest to demonstrate a mastery of the game's basic fundamentals. After getting out of the Beginner village, players are free to enjoy the open world of Tribeland. Nevertheless, players should be well aware of the risk and pay attention closely to their level and strength to avoid overstepping into dangerous areas where enemies are much stronger than them, which might result in unwanted damages and losses. Tribeland has 4 separate quest systems corresponding to 4 main tribes. The player can discover the plot of the Tribleland world through the quest system. By completing the main quests, the player will be rewarded with valuable prizes and enhancements, which will come in handy for territory expansion and further adventures. The main quest, on the other hand, is not mandatory. If you are a libertarian, you can still explore the whole game without any limitation. There is no land or area restricted as “Quest Only”. Lands are wide open; it only depends on your ability to explore them. In addition to the main quest, the side quest system is also the pride of the Tribeland game development team. There are no instructions on how to obtain side quests; it is entirely up to the player to interact with the world and the NPCs. There are tens of thousands of side quests spread across the globe of Tribeland waiting for players to discover. That’s the general idea of how Tribeland works as an RPG. To further increase the players gaming experience, we also have other PvP game modes to enjoy After reaching a certain level, the players can create their own clan and invite other players to join. Clan war will be held every 2 months, with 5 strongest registered players from each clan to face off in a 5v5 combat against opposing clans. Another competition is The Tournament, which will start at the beginning of each month and last for 2 weeks. During the Tournament, players will fight against other players to achieve a higher position in the ranking system. Almost every asset in Tribeland is NFTs. Therefore, your every effort is rewarded accordingly. The ways to earn in Tribeland can be summaries as: Receive NFTs as gaming rewards. Upgrading your NFTs (Heroes, Beasts, Territories) to increase its value. Collect taxes from other players renting buildings on your territories. DeFi activities. Territory is a key feature for the future innovation of Tribeland. Territory is not a simple NFT, but rather a scalable asset that develops alongside the game. More and more unique features will be added for a territory, making it become a metaverse.","links":"https://tribeland.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tribeland/logo.png"}