{"name":"Artificial Liquid Intelligence","id":"alethea-artificial-liquid-intelligence-token_solana","symbol":"ali","description":"Alethea AI is building a decentralized protocol to create an Intelligent Metaverse inhabited by interactive and intelligent NFTs (iNFTs). As originators of the iNFT standard, Alethea AI is on the cutting edge of embedding AI animation, interaction and generative AI capabilities into NFTs. Developers can use the iNFT protocol to Create, Train and Earn from their iNFTs in the world’s first Intelligent Metaverse known as Noah’s Ark. Noah's Ark has a bold aim: To preserve and evolve the culture, stories and collective intelligence of the human species. The NFT ecosystem is witnessing a Cambrian explosion in innovation and creativity, with avatar-centric communities launching at a scale and speed we never thought possible. New intellectual property is being created from the bottom-up, without the involvement of major corporate studios or large budgets. Creators and communities will soon demand to do more with their NFTs, and the Alethea AI team sees the Noah’s Ark Intelligent Metaverse as the connective tissue for the numerous NFT projects and owners to bond and create rich, free-flowing, enjoyable interactive experiences on a crypto-native stack. As the population of iNFTs within the Noah’s Ark increases, so too will the possibilities of interactions and collaborations with and between these iNFTs - enabling the emergence of an \"\"Intelligent Hive Mind\"\", powering the Ark's AI Engine. This intelligence will enable us to not only explore what it means to be human and what constitutes a personality, but also to discover how an Intelligent Metaverse powered by such an Intelligence can help shape our stories, culture, and intelligence as we realize the true meaning behind being Homo Narrans.","links":"https://aiprotocol.info","market_cap":19395692,"market_cap_rank":1133,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alethea-artificial-liquid-intelligence-token/logo.png","detail_platform":{"solana":{"decimal_place":8,"contract_address":"9wvorGtBJ8gyLorFTmwXWcymPoGVUBn6MRzHwFpCdCeC","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/9wvorGtBJ8gyLorFTmwXWcymPoGVUBn6MRzHwFpCdCeC"}},"is_native":false}