{"name":"Heroes & Empires","id":"heroes-empires","symbol":"he","description":"What Is Heroes & Empires? Heroes & Empires is a Play-2-Earn strategy game that combines the distinctive elements of Idle RPG and the tactics of auto chess, connected with blockchain technology. The game is developed on the Unity engine with modern gameplay, blockchain integrated and high-end graphics, separating it from the rest. Heroes & Empires will be compatible on both PC and mobile to bring the best experience to players. HE is the native utility token that is used for: - Rewards for Play to earn - Ingame expenses. - Used for governance votes to determine game changes/updates. H&E features include: - PvE: Campagin, Madness Tower, Quest system. - PvP: Arena. - Hero upgrade: level up, ascension - NFT burn: fuse heroes in same type to rank up. - Marketplace: trade NFT - Future updates: Dungeon Trial, Bounty Hunter, Matrix of Deity, Tournament, Grand tournament, Clans War, NFT gears, etc. How Many HE tokens Are There in Circulation? Heroes & Empires will launch its IDO in early October, 2021 with 1 billion HE tokens created at genesis. 8% will be circulating while the remaining tokens are subjected to vesting schedule. Who Are the Founders of Heroes & Empires? On August 14, 2021, CryptoViet Labs, a leading blockchain company based in Vietnam, announced that it has partnered with Imba Games to develop and publish an NFT game project called “Heroes & Empires”, which is co-incubated by Megala Ventures. About Megala Ventures: Megala Ventures is one of the largest institutional investors of blockchain and distributed ledger technologies at Southeast Asia, and has been a key contributor to a number of leading blockchain projects. Website: https://megala.ventures/ About CryptoViet Labs CryptoViet was established in 2016, founded by a group of crypto enthusiasts with the goal of providing a useful information channel. CryptoViet Labs was founded in 2020 under the sponsorship of CryptoViet & Megala Ventures. The team consists of skilled and passionate developers with a strong belief in the future of Blockchain technology. CryptoViet Labs is the current owner of Casperstats.io. Website: https://cryptoviet.com/ About Imba Games Imba Games is the leading mobile game developer and publisher in Vietnam, established in 2015 in Ho Chi Minh City. Imba Games focuses on developing high-quality game products that attract millions of users, including I Am Hero (AFK Tactical Teamfight), Arche Hunter — Master of Arrow, Kawaii Mansion (Cute Hidden Object Game), etc. Website: http://imba.co","links":"https://heroesempires.com/","market_cap":394052,"market_cap_rank":3893,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/heroes-empires/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x20d39a5130f799b95b55a930e5b7ebc589ea9ed8"}}}