{"name":"Simple Asymmetry ETH","id":"simple-asymmetry-eth","symbol":"safeth","description":"What is the project about? Asymmetry Finance is a DeFi protocol designed to decentralize the Liquid Staked Ethereum market through the creation of index style tokens containing Liquid Staking Tokens (LST's). Asymmetry Finance offers users a diversified basket of assets with the goal is of diversifying and decentralizing the Liquid Staking Derivative/Token market and therefore the set of validators securing Ethereum. Asymmetry Finance focused on gas optimization and creating an easy to use UX with the aim of making DeFi less complex. Asymmetry finance launched first with safETH, comprised of Lido stETH, Rocketpool rETH, and Frax sfraxETH, with more LST's on the way. What makes your project unique? Asymmetry focuses on aligning incentives History of your project. Asymmetry started as an idea drawn up on the back of a yellow legal pad in early 2022. The team bootstrapped, then raised a seed round to expand development. The team then launched the first product, safETH on Monday, May 15th, 2023. What’s next for your project? In Q3/Q4 of 2023, Asymmetry Finance will add additional derivatives to the safETH index, continue to pursue partnerships with market leading LSDs/LSTs. Coming in Q3/Q4 is the flagship Asymmetry product that is composed of a different blend of assets with different yield and risk profiles. The continued utility of the Asymmetry products will be paramount as well, and Asymmetry will seek integrations and partnerships across the industry. What can your token be used for? The safETH token can be used to obtain exposure to multiple LSDs/LSTs in a few clicks, with minimal gas fees and market leading yield. The token can be bought and held as rewards accrue automatically, or it can be used to trade or borrow against.","links":"https://www.asymmetry.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/simple-asymmetry-eth/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6732efaf6f39926346bef8b821a04b6361c4f3e5"}}}