{"name":"Mettalex","id":"mettalex_ethereum","symbol":"mtlx","description":"Mettalex is an innovative decentralised exchange (DEX) that redefines the trading experience by leveraging peer-to-peer order books and advanced AI agent technology powered by Fetch.ai. This platform distinguishes itself by stepping away from traditional liquidity pools, offering traders frictionless and zero-slippage transactions. At Mettalex, traders have the flexibility to exchange a wide array of digital assets, including cryptocurrencies and commodities, at their preferred price points. The unique AI agents, deployable on users' machines, execute trades on behalf of traders at specified prices, ensuring seamless transactions without manual intervention. Mettalex stands out as a chain-agnostic DEX, facilitating asset trades across various blockchains, from Fetch chain to Ethereum or Binance Smart Chain to Avalanche, bridging the gap in the cross-chain trading landscape. With Mettalex, traders are empowered with a user-centric platform that not only provides control over trading conditions but also ensures the security and efficiency of every transaction through the power of Fetch.ai's autonomous agent network. FAQs Who Are the Founders of Mettalex? Humayun Sheikh is the CEO and founder of Mettalex and He is also founder of Fetch.ai, uVue and itzMe. What Makes Mettalex Unique? Mettalex stands out by peer-to-peer order books with advanced AI agents, enabling seamless, slippage-free trades across various assets and blockchains. This integration, powered by Fetch.ai technology, marks a significant innovation in decentralized finance, offering a more efficient and user-friendly trading experience. How Many Mettalex (MTLX) Coins Are There in Circulation? Mettalex (MTLX) has a maximum supply of 40,000,000 MTLX. Where Can You Buy Mettalex (MTLX)? MTLX is available on Uniswap","links":"https://mettalex.ai/","market_cap":2108953,"market_cap_rank":2917,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mettalex/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2e1e15c44ffe4df6a0cb7371cd00d5028e571d14","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2e1e15c44ffe4df6a0cb7371cd00d5028e571d14"}},"is_native":false}