{"name":"Vertex","id":"vertex-protocol_arbitrum-one","symbol":"vrtx","description":"Vertex’s VRTX token serves as the cornerstone of Vertex Edge's decentralized exchange (DEX) network, integrating spot trading, perpetuals, and money markets into a unified order book across multiple EVM-compatible chains. The tokenomics of VRTX are designed to promote sustainable growth, incentivize participation, and optimize the ecosystem's efficiency. Trading Rewards & Emissions To foster active engagement, Vertex regularly distributes VRTX tokens as trading rewards to users participating across the chains supported by Vertex Edge. The current phase, known as the Ongoing Incentives Phase, allocates 34% of the total VRTX supply—amounting to 340 million tokens—over more than 72 weekly epochs. Each epoch spans seven days, with a predetermined pool of VRTX tokens distributed to traders based on their proportional trading activity during that period. Staking Mechanism VRTX staking encourages long-term commitment and rewards participants effectively. Key features of the staking model include: - Sustainable Rewards Model: The staking rewards structure is diversified across three primary streams: 1. Base APY: A portion of the reduced VRTX emissions is allocated to provide an initial annualized yield of 15%, tapering to 1.5% over three years. 2. Fee APY: Trading fees are used to repurchase VRTX, which is then added to the staking pool. Initially, 50% of all protocol fees are dedicated to these buybacks, with a planned increase to 100% over time. 3. Loyalty APY: Revenues from early unstake penalties are redistributed as additional yield to long-term participants. - Auto-Compounding Rewards: Staking rewards are automatically compounded, increasing the user's staked balance without manual intervention. This process utilizes USDC from the protocol's trading fees to buy back VRTX, which is then distributed back into the staking pool. - Immediate Access to Maximum Rewards: VRTX stakers can earn the highest possible yield immediately upon staking, simplifying participation and enhancing accessibility. - Flexible Unstaking Options: Users can unstake their VRTX tokens at any time, subject to a 21-day cooldown period. For those preferring immediate access, an option to bypass the cooldown is available with a 10% early withdrawal penalty. Penalties collected from early withdrawals are redistributed to the subsequent week's yield pool, benefiting long-term stakers. Market Maker Incentives Recognizing the pivotal role of market makers in maintaining liquidity, Vertex maintains a tiered rebate system linked to the amount of VRTX staked: - 3 million VRTX or more = 0.75 basis points rebate - 1 million VRTX = 0.65 basis points rebate - 300,000 VRTX = 0.55 basis points rebate - 3,000 VRTX = 0.15 basis points rebate The tiered rebate structure incentivizes deeper liquidity provision by offering higher rebates to market makers with greater stakes, thereby aligning their interests with the protocol's long-term growth. The VRTX token is natively available on Ethereum L1, Arbitrum L2, Base L2, and Blast L2 networks. In summary, Vertex’s VRTX tokenomics are strategically designed to foster sustainable ecosystem growth, incentivize active participation from various stakeholders, and ensure the long-term alignment of interests within Vertex Edge's network of exchanges.","links":"https://vertexprotocol.com/","market_cap":54761,"market_cap_rank":8066,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vertex-protocol/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x95146881b86b3ee99e63705ec87afe29fcc044d9","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x95146881b86b3ee99e63705ec87afe29fcc044d9"}},"is_native":false}