{"name":"Autonolas","id":"autonolas","symbol":"olas","description":"Autonolas, also known as Olas, is a unified network of off-chain services such as automation, oracles, and co-owned AI. It offers a composable stack for building these services and a protocol for incentivizing their creation. Autonolas uniquely enables the operation of these services in a co-owned and decentralized manner. Autonolas services are ideal for combining crypto and AI, executing complex logic in a decentralized manner, and interacting with on- and off-chain data autonomously and continuously. A novel use case of this cutting-edge autonomous agent technology is Governatooorr, an AI-enabled governance delegate for DAOs. Autonolas DAO was established in the summer of 2022, and the public token launch took place via a liquidity bootstrapping pool in July 2023. Autonolas is on a healthy growth trajectory and is regularly adding support for additional chains. The project's goal is to be deployed on every major blockchain, powering their core off-chain services and realizing the vision of a unified network of off-chain services. The OLAS token provides access to the network's core functions. Users can stake OLAS to operate off-chain services and lock OLAS in veOLAS to gain governance rights, thereby contributing to the shaping of the network. Furthermore, OLAS powers a unique system of developer incentives aimed at expanding the number of services in the Olas ecosystem. Governance members can boost ETH donations to desirable services, made up of autonomous agents and their software components and referred to as 'useful code', with OLAS from the protocol. Existing token holders can bond LP shares involving OLAS into the protocol to increase protocol-owned liquidity, known as 'useful capital'. For more information, visit the DAO’s website at https://olas.network.","links":"https://olas.network","market_cap":35585757,"market_cap_rank":638,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/autonolas/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0001a500a6b18995b03f44bb040a5ffc28e45cb0"},"xdai":{"decimal_place":18,"contract_address":"0xce11e14225575945b8e6dc0d4f2dd4c570f79d9f"},"polygon-pos":{"decimal_place":18,"contract_address":"0xfef5d947472e72efbb2e388c730b7428406f2f95"},"solana":{"decimal_place":8,"contract_address":"Ez3nzG9ofodYCvEmw73XhQ87LWNYVRM2s7diB5tBZPyM"}}}