{"name":"IMPACTXPRIME","id":"impactxprime","symbol":"ixp","description":"Most utility uses for projects don’t seem to be as far reaching. What if it didn’t have to be that way? ImpactXP is an ERC-20 token bridging the gap between cryptocurrency and renewable energy. Through various projects, ImpactXP projects are wideranging from solar renewables to investor security platforms and play to earn gaming. ImpactorMC Combatting the cycle of rug-pulls and ‘honeypots’, Impactor Market Cap (ImpactorMC), will lead the way in first class investor security and guidance. IMC certification, Certik audit and legal bindings, all are key requirements for ImpactorMC trustworthiness and security. Streamlining projects from trustworthy to investor caution, ImpactorMC also offers various utility features such as wallet connection to view reflections on graphs. ImpactXP Galaxy It’s inevitable cryptocurrencies will become integrated within gaming. More and more, established titles are focused on crypto integration for in-game purchases. But, what benefit does that truly give to the investor? ImpactXP Galaxy, is our refined space shooter signifying our Phoenix logo as the main character. The goal is to reward the player, not the other way around. Based on your score, $IMPACTXP token is collected respectively, making it an enjoyable play to earn experience Renewable Energy Projects Not many cryptocurrencies address the real and growing environmental concerns. The fact that large proportions of humans still lack access to clean water and electricity today means we need to work collectively to change the world. By investing in ImpactXP, you are contributing to solar farming and other projects that are used to generate electricity by partnering with local governments and organisations. As a result of revenue generated, the profits acquired are used to consistently buy-back ImpactXP raising the value over time. As an investor, you have a real stake in renewable projects.","links":"https://impactxp.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/impactxprime/logo.png"}