{"name":"Pisscoin","id":"pisscoin","symbol":"piss","description":"Piss is an ERC-20 meme token. Dubbed the world's first pisscoin, $PISS utilizes a proprietary MEV protocol to ensure optimal liquidity and order execution for its users. This is accomplished by means of a weighted allocation of tokens to the excess reserve supply positionally oriented relative to total supply, alternatively referred to as W.A.T.E.R.S.P.O.R.T.S. Conceptualized as a response to the volatility and suboptimal order execution in the shitcoin market, pisscoins leverage MEV (Maximum Extracted Value) to ensure sufficient liquidity and allow for expedited order execution regardless of your order sizing. All piss transactions routed via the public mempool benefit from this utility thanks to our jeet-automated routing and execution division, or \"Jared\" - the MEV contract responsible for W.A.T.E.R.S.P.O.R.T.S Pisscoin is a meme-coin that parodies the “shit coin” aesthetic of other ERC-20 tokens. It is a free open source peer-to-peer electronic cash system that is completely decentralized, without the need for a central server or trusted parties. It is possible to get coins by receiving them from someone, or through the Uniswap defi protocol. The total circulation of Pisscoin is 50,000,000,000 coins, distributed via the Uniswap liquidity pool, with the amount halved every 100 years. Main properties: - Optimal liquidity and order execution via W.A.T.E.R.S.P.O.R.T.S mev protocol. - Anti-jeet countermeasures via Jared. - A more efficient alternative to the now-archaic shitcoin. The network works in parallel to generate pisscoins via the latent potential of its memetic properties. The proof-of-piss liquidity pool is the key to solving the Incontinence Problem of synchronising the Uniswap v2 pool and generating sufficient liquidity for the majority consensus without having to trust jeets.","links":"https://pisscoin.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pisscoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x9c0bd34bebc33a0e898554cfc91e8a84c728bf9f"}}}