{"name":"LORDS","id":"lords_base","symbol":"lords","description":"## What is Realms World? Realms World is a fully onchain, open-source gaming ecosystem built on Starknet, a high-performance Ethereum Layer 2. At its core lies Eternum, a decentralized 4X MMO strategy game, and a growing constellation of interoperable games developed by aligned studios and independent grantees. The entire ecosystem is governed by Bibliotheca DAO, powered by Realm NFTs and the native token $LORDS. Every in-game economy, governance mechanism, and funding initiative flows through this DAO-governed, permissionless ecosystem. ## The $LORDS Token $LORDS is the native utility and incentive token of Realms World. It powers the in-game economies, governance, and staking infrastructure that hold the ecosystem together. **Utility Overview** 1. Gateway – $LORDS is used to access games, mint passes, purchase subscriptions, and more. 2. Denomination – It acts as the native currency across all games, DEX pools, and marketplaces. 3. Yield – Players can stake $LORDS to earn veLORDS, which unlock ecosystem-wide rewards. ## What is veLORDS? veLORDS (vote-escrowed LORDS) is a staking derivative earned by locking up $LORDS over time. It transforms passive holders into aligned participants with deeper rewards. **Yield Mechanics** - veLORDS holders earn a share of protocol and in-game fees generated across the Realms ecosystem. - As more games launch and generate onchain activity (e.g. minting, trading, entry fees), the veLORDS yield pool grows, resulting in naturally compounding APY over time. - Stakers are rewarded not just for holding, but for believing in the growth of the entire gaming ecosystem. ## Realm NFTs Realms (for Adventurers) NFTs are core governance assets that unlock unique utility: - DAO voting rights in Bibliotheca DAO - Free Eternum Season Passes (1 per Realm, per season) - Exclusive access to playtests, tournaments, and game launches - Tradable across Ethereum and Starknet (Realms.World, OpenSea, Element Market)","links":"https://realms.world/","market_cap":3105966,"market_cap_rank":2510,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lords_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xd5b22dcfa9a919b28afe164fc7af10b832d4b022","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xd5b22dcfa9a919b28afe164fc7af10b832d4b022"}},"is_native":false}