{"name":"Trump45Coin","id":"trump45coin","symbol":"trump","description":"Welcome to the TrumpCoin community, where we unite under the principles of economic innovation and our admiration for the 45th President of the United States. The TrumpCoin ecosystem was established to provide an engaging experience for like-minded individuals who (primarily) share Donald Trump’s values, are excited about the future of America and have an interest in cryptocurrency. Built on the XRPL, Trump Coin pioneers a new era of MemeCoins with 2-3 second tx speed, $0.0001 tx cost and high scalability at 1,500 tx per second. Please note that Trump Coin has no current affiliation with Donald J Trump or the Republican Party (however, we have plans to try collaborate in the future). We developments include a new play-2-earn XRPL integrated game now in development called TrumpTowers! The game will integrate with your XRP wallet and NFT holdings. TrumpCoin is operated under a Decentralised Autonomous Organisation (DAO) structure. All major decisions are made by the holders of the DAO 1% Club NFTs (only 100 in circulation). Example DAO decisions include: Setting farming/faucet reward levels CEX listings Deciding expansion plans Choosing partnerships Decisions about the TrumpCoin Towers XRPL integrated game (P2E) which is currently in development Key achievements to date are as follows: -CEX Listing (Biconomy, ranked top 5 for liquidity with USA/Canadian licenses). -Trust Level 1 Status with token image in Xaman. ->4,000 holders and >11,000 X followers. -Investments have already been made to deliver AMM farming, faucet rewards and an XRPL telegram trading activity rewards bot, with an XRPL integrated game (P2E) now in development. -Experienced dev management team of 5 people. -TrumpCoin artwork is designed by an experienced in-house team / professionals in the industry. -Relationships with 10+ XRP influencers who assist with promotional activity. -Transparency to holders including through AMAs on X. -Partnerships with Helvet X (Swiss Tech), XDX MonkFinance, XRP cafe and more. -Strong business relationship with a reasonably priced Indian-based XRPL software agency.","links":"https://trump45coin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trump45coin/logo.png","detail_platform":{"xrp":{"decimal_place":9,"contract_address":"rLnErD8JXMxqBzGNaHaykssai1vpB6YRUX"}}}