{"name":"Hydraverse","id":"hydraverse","symbol":"hdv","description":"\"In Hydraland, the land of dragon trainers, peace is guarded by seven dragon balls on the top of Mount Versa. It is said that if you have these gems, your strength will be boundless and you will be immortal. This rumor spreads far beyond its land, and everyone desires to own these precious dragon balls. One day, evil was infiltrating Hydra trying to steal the gems, but fortunately, he was caught by the guardian. A fight broke out. The evil intentionally swallowed the gems. Hydraland's guardian had no other way but to knock out his enemy using the most powerful strength that eventually made the dragon balls break and scattered everywhere. Since then, Hydra has suffered from such natural disasters as floods, typhoons, drought... The whole tribe understands that to stop all these tragedies, they need to find the fragments as soon as possible. The broken pieces are cursed to be found only by the strongest, smartest, and most harmonized with the fastest dragons. After all, Vikings decided to hold dragon races to look for qualified people with the ultimate mission to unite the fragments and save the tribe. If you collect enough smashed ones, you will be able to join the annual Hydra Cup. The villagers are very excited about this race. All people participated in dragon training & went to find broken pieces of jade. Join Hydraverse NOW to become expert dragon racers and revive the land of Hydra by collecting dragon balls! Our Motivation behind Hydraverse Dragons are said to be legendary characters and people have always been tempted to once co-exist with them. In Hydra world, you can do more than that! Players are involved in a wide range of exciting activities initiated by the concept of the NFT game. This NFT Dragon racing game stands out from traditional racing games. Hydraverse combines NFT with AR/VR in hope of creating the best satisfaction for our players. Taking advantage of the state-of-the-art technologies: AR/ VR, Blockchain, Hydraverse's core team - people of high-qualified experts and well-known businesses in the game & technology field - have spammer Why would you love Hydraverse? Playing with joyfulness and earning a great amount of money is now easier than ever before. Not kidding! It's REAL. You can make it just by training your own dragons and letting them take part in the race, sending them to the exhibition, or trying your luck with the betting activity. Unique gaming activities: From owning only one Hydraverse dragon, you could join in countless gaming activities including breeding, training, racing, renting, betting. Then together with your unique tactics in training and a little bit of luck, you could also join Hydracup to win the biggest winning prize than ever. Hydraverse is an incredible experience with AR/VR that won't let you down: you will be engrossed in the Hydra world with multi-dimensional characters & vivid objects including numerous different breath-taking terrains of race tracks, uncountable talented dragons with a unique power.\"","links":"https://www.hydraverse.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hydraverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":5,"contract_address":"0x8cd0d76c0ad377378ab6ce878a7be686223497ee"}}}