{"name":"Hoge Finance","id":"hoge-finance_solana","symbol":"hoge","description":"What is HOGE? HOGE, formerly known as Hoge.Finance or Hogecoin, describes itself as a community-driven DeFi auto-staking ERC-20 token with a capped and deflationary supply. HOGE was fair-launched on February 7, 2021 with no tokens allocated to the team. Initial HOGE supply was 1,000,000,000,000 with half (500 billion) permanently burned at launch. Deflationary Cryptocurrency A 2% tax is levied on every HOGE transaction that takes place. 1% of that tax is sent to the burn wallet and permanently removed from the supply. The other 1% is redistributed to all wallets holding HOGE outside of exchanges. HOGE launched with the intention of simply being a deflationary “Doge but DeFi”. However, a team of HOGE founders with a larger vision stewarded the project toward a more philanthropic and utilitarian roadmap. HOGE is one of the first DeFi memecoins to successfully complete a Certik audit. No critical, major, or medium findings were found. As of this writing the skynet security score is 90. https://www.certik.org/projects/hogefinance HOGE has begun minting NFT's for holders as well as sponsoring eSports and Rally Racing Trucks. In May a Swiss verein non-profit DAO hybrid was created to enact community approved actions for the token also to sign contracts and business agreements going forward with Centralized Exchange’s. HOGE has implemented a non-profit partnership initiative including a Twitter campaign called #HogeSavesTheAnimals through which the community nominates charitable causes for HOGE to support. Under this and related initiatives HOGE has raised over $20,000 for animals. The HOGE team looks to it’s HogeGameLabs to explore dApp games development later in 2021. Articles about HOGE https://coinpedia.org/price-analysis/hoge-finance-and-meme-price-analysis/ https://www.prweb.com/releases/who_let_the_crypto_dogs_out_hoge_the_king_of_defi_made_easy/prweb17885931.htm https://jessejrogers.medium.com/can-hoge-become-heir-to-doge-496079b3c624 https://marketrealist.com/p/where-can-i-buy-hoge-crypto/","links":"https://www.hoge.gg","market_cap":3248334,"market_cap_rank":2463,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hoge-finance_solana/logo.png","detail_platform":{"solana":{"decimal_place":8,"contract_address":"74gUPK636nrieDT9kLSgF1peWg5BB7itNkjF2BkMDwZj","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/74gUPK636nrieDT9kLSgF1peWg5BB7itNkjF2BkMDwZj"}},"is_native":false}