{"name":"Bolt Token","id":"bolt-token-023ba86e-eb38-41a1-8d32-8b48ecfcb2c7","symbol":"$bolt","description":"What is the project about? BOLT is the first DAO governed and community owned meme coin in the zksync era ecosystem, which ensures lightning-fast transaction speeds and low fees. What makes your project unique? BOLT is a groundbreaking project that is set to take the crypto world by storm. As the first DAO governed and community-owned meme coin in the zkSync era ecosystem, BOLT is redefining what it means to be a truly community-driven cryptocurrency. With 0% tax fees, BOLT is designed to make crypto accessible to everyone. Our mission is to expand the nets of the zkSync era and introduce a vibrant community of meme lovers and degens into the ecosystem. History of your project. As a true community coin, BOLT is committed to empowering its users and creating value for all stakeholders. That's why over 80% of the tokens (public + DAO) are given back to the community, ensuring that everyone has a say in the future of the project. Q What’s next for your project? We believe that BOLT has the potential to be a meme coin legend in the zkSync era, serving as a reliable and trusted means of exchange for numerous projects. By leveraging the power of community ownership and DAO governance, we are on a mission to bring about a new era of decentralization and financial freedom for meme lovers and degens alike. What can your token be used for? Our mission is to expand the nets of the zkSync era and introduce a community of meme lovers and degens into the ecosystem. $BOLT aims to be the true community coin of the zkSync era used by many other projects. Over 80% of the tokens (public + DAO) are given to the community.","links":"https://bolt.cat/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bolt-token-023ba86e-eb38-41a1-8d32-8b48ecfcb2c7/logo.png","detail_platform":{"zksync":{"decimal_place":18,"contract_address":"0x61b41e0244133b9c9c47a57e51a5ef70be2c5dd4","geckoterminal_url":"https://www.geckoterminal.com/zksync/tokens/0x61b41e0244133b9c9c47a57e51a5ef70be2c5dd4"}}}