{"name":"QANplatform","id":"qanplatform_ethereum","symbol":"qanx","description":"What Is QANplatform (QANX)? QANplatform, the quantum-resistant hybrid blockchain platform enables developers and enterprises to rapidly build software applications like DApps or DeFi and run business processes on blockchain. A blockchain platform, like QANplatform is the basic infrastructure of all blockchain projects and applications. It is like the operating system on a computer. The whole ecosystem can only build and work on top of it. Connect it with real-world data, run automated smart contracts, build decentralized applications (DApps). According to HFS Research excerpt for IBM: Enterprise blockchain adoption is going through a “90-9-1” adoption challenge. 90% of companies are still trying to internalize the concept and its relevant impact. 9% of enterprises that identified relevant use cases are struggling to start with their PoCs and pilots. The 1% of enterprises that have successful pilots are challenged with scalability to a production-grade environment. To achieve blockchain mass adoption Qanplatform focused on these challenges. They built a lot of automation and integration to help freelance developers, blockchain development companies and enterprises start their blockchain PoCs (Proof-of-Concept) as fast as possible. It takes less than 5 minutes to deploy the QAN private blockchain to a preferred cloud platform and start building on it. Who Are the Founders of QANplatform ? Johann Polecsak, QAN's Chief Technology Officer is also an economist. He along with the Business Development team pursues the way to make QAN as appealing as possible. In the end all what matters is market share. His laser focus lights in the single direction of eliminating any obstacles which could come up as a reason not to implement Blockchain technology, making QAN the only sane choice to work with. Endre Abraham (Silur), QAN's Head of Cryptology contributed to several blockchain projects like Ethereum, Zcash, or Monero. Gaining such an extensive experience could only lead him in one direction: Building a blockchain which solves the pain points of the existing mainstream ones. What Makes QANplatform Unique? QANplatform solves the problems enterprises and developers face when using currently available blockchain by building a platform from scratch that does not require them to make compromises: - Hybrid blockchain platform - 80% faster implementation than other blockchains - Lowest hardware and energy requirements on the market - Predictable data transaction prices for public blockchains - Enterprise-ready transaction speed - Quantum-resistant security The experienced team behind QANplatform worked in companies and projects like IBM, Telekom, Uber, Bitcoin.com, Ethereum, Monero, Zcash...","links":"https://www.qanplatform.com/","market_cap":28198461,"market_cap_rank":910,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/qanplatform_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xaaa9214f675316182eaa21c85f0ca99160cc3aaa","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xaaa9214f675316182eaa21c85f0ca99160cc3aaa"}},"is_native":false}