{"name":"Ordmint","id":"ordmint","symbol":"ormm","description":"What is the project about? the first-ever community-driven #ordinals launchpad with the BERC-721 Mapping Proposal to connect #BTC & #ETH seamlessly What makes your project unique? Ordmint is an innovative project that aims to disrupt the traditional asset launch model and pave the way for a new era of project integration within the Ordinals & BRC20 ecosystem. Our mission is to be the community-led \"Coinlist”&“Premint” of Ordinals, democratizing access to asset launches and promoting community-driven decision-making. History of your project. The first brc20 launch on AlexLabBTC launchpad, finished public sale in 1mins, reached Alex amount target in 5 hours. The most smooth minting experience you'll ever have. What’s next for your project? We will launch the first project on Ordmint. Here is the launchpad roadmap https://ordmint.gitbook.io/whitepaper/roadmap What can your token be used for? ORMM tokens serve multiple functions within the Ordmint platform: Governance: $ORMM token holders can vote on proposed projects and rules for the allowlist. Each staked token is equivalent to one vote, ensuring a democratic decision-making process. Rewards: $ORMM tokens will be distributed as rewards to the community members for their participation and contribution to the platform. Fee Sharing: Token holders will share a percentage of the listing fees collected from the projects launched on the platform. This not only creates an additional incentive for token holders but also creates a symbiotic relationship between the success of the platform and the benefits to the token holders. Access to Exclusive Community Events: $ORMM holders will gain access to exclusive community events. These events may include early access to information about upcoming listings, direct interactions with project teams, educational webinars, and exclusive community discussions. This utility further strengthens the bond between the platform and its community, offering an additional incentive to ho","links":"https://ordmint.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ordmint/logo.png","detail_platform":{"ordinals":{"decimal_place":18,"contract_address":"3f6e02163b2c5ece955e515437245b61bb290f4b5ffde00ed03b769eaa4696f8i0"}}}