{"name":"Telefy","id":"telefy","symbol":"tele","description":"Telefy is worlds first credit score oriented multi chain Defi platform which has its own DEX that is TELE Swap, lending platform that is TELE Lend, IDO launch pad that is TELE Pad and NFT market place that is TELE NFT. Telefy protocol provides credit score for every user wallet to calculate the credit worthiness to calculate the APY. Telefy also going to provide free API to calculate the credit score for different lending platforms that is TELE score. Telefy features The following features make Telefy a unique platform for the services it is offering: Tele Swap It is a multi-chain protocol that will enable crypto users to add liquidity through Automated Market Maker. Users can use this protocol to swap their coins seamlessly. Users can use this protocol to move between chains freely. It will reduce the fee and users will swap between chains without any trouble. Tele Lend Telefy is introducing an automated lending protocol that users can use to borrow or lend tokens using their Tele Score. This multi-chain protocol will make the exchange between the lender and borrower pretty easy. It is going to be available on Ethereum, Matic, Binance, Polka Dot, Cardano, and other platforms. Tele NFT This multi-chain NFT marketplace is going to feature the latest NFT tokens. Platform users can use this marketplace to list new NFTs, sell them, and buy profitable non-fungible tokens. TELE token stakers will benefit from the growing popularity of this marketplace. They will gain tokens whenever a user pays the fee to use this new NFT marketplace. Tele Score The Tele Score program is designed to flawlessly assess the credit-worthiness of a user. It is a multi-chain programmable protocol. Tele Pad This platform is offering a sophisticated launchpad to run any Initial DEX Offerings. Being a multi-cross chain launch pad, the Tele Pad will allow TELE coin holders to participate in IDO. This platform will assess various parameters related to the IDO launch PAD projects.","links":"https://telefy.finance/#/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/telefy/logo.png"}