{"name":"Warrior","id":"warrior-token","symbol":"war","description":"WAR is the Warrior Token on the spartan.casino platform and it allows the holders access to a very unique revenue stream on the platform and it is only available on the Binance Smart Chain. How many Warrior Tokens are available? To further drive the value of the WAR token, only 100,000,000 tokens will be permitted, to experience the power of war all holders will stake the WAR token on their Metamask on the BSC Chain and trust wallet. And that is how the participants are instantly recognised on the platform. WAR token rewards will be distributed by playing certain games on the spartan.casino platform and by watching video ads before the live dealer games begin and during livestream sporting events. WHAT IS IN IT FOR ADVERTISERS? spartan.casino offers several options to advertisers, including a Cost per Milli or per banner/time basis pay per view for all ads shown. Advertisers gain exclusive access to a global community of players. All advertising revenue received will be displayed transparently and a good percentage will be redistributed to all WAR Token holders regularly. FOR INVESTORS AND PLAYERS. Users will be given the option to view short Video ads before they play the live Dealer games and during livestream sporting events. They will be rewarded with WAR Tokens for watching these ads. This is a model that benefits everyone involved and grows the ecosystem, giving users of the platform an additional loyalty bonus. The Paid per view model proposed will give viewers the chance to watch sports and receive unique immediate rewards on our platform and allows them to cash out those rewards with our partner exchanges as well as other decentralised platforms such as Uniswap and direct trading swaps turning their time into money any time they wish. This in turn will attract more gamers and sports enthusiasts over time thus building the brand and expanding the reach on a global level.\"","links":"https://spartan.casino/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/warrior-token/logo.png"}