{"name":"Governance xALGO","id":"governance-xalgo","symbol":"xalgo","description":"What is xALGO? xALGO is an interest-bearing asset that brings Algorand governance yield to other chains, allowing for a continuous governance commitment without periodic burning. Thanks to its interest-bearing nature, xALGO is the perfect fit for bridging Algorand Governance to other chains. What makes your project unique? - xALGO users get Algorand Governance rewards without needing to vote or periodically commit, as the voting power is delegated to Algo Liquid Governors, and the locked ALGOs are automatically recommitted by Folks Finance smart contracts. - xALGO value grows in value over time due to its interest-bearing structure. - Users can provide liquidity to DEXs’ liquidity pools and get trading fees. What is Folks Finance? Folks Finance is a non-custodial DeFi protocol providing financial tools for digital assets. Smart-contract technology empowers Folks Finance to offer advanced strategies while eliminating risks of centralized interference. Users can deposit assets to earn yield, as well as use their deposits as collateral for loans. Implementing the Folks Router aggregator enables native swaps on the protocol and composability with the other operations. Flash loans give developers the keys to deep liquidity. Algo Liquid Governance and Cross-chain Algo Liquid Governance provides the most efficient method of participating in Algorand Governance through gALGO and xALGO, whose use cases continue to expand rapidly. FAQ What does it mean for a wrapped token to \"depeg\" from its underlying asset? When a wrapped token \"de-pegs\" from its underlying asset, it means that the market value of the wrapped token has deviated from the value of the underlying asset. Ideally, a wrapped token is intended to be maintained at a predefined ratio with its underlying asset. However, external factors such as market fear, uncertainty, and doubt (FUD) can cause the wrapped token's value to fluctuate independently. What is the ratio of xALGO to Algo? The ratio depends on the amount of Algo deposited in the xALGO mint pool compared to the amount of xAlgo in circulation. For example, if there are 100 Algo and 100 xALGO at the beginning of governance, the ratio is 1:1. At the end of governance, assuming a reward rate of 15%, 15 ALGO will enter the pool. The new ratio will be 115/100 = 1.15 Is ALGO still held and maintained at this ratio with xALGO? The underlying Algo is still held and maintained at the above-mentioned ratio. The de-pegging is a market phenomenon and does not affect the collateralization or backing of the xALGO token by the underlying Algo. How does temporary market volatility affect xALGO’s peg? When there is heightened volatility in the market, i.e., excessive selling pressure, combined with a lack of liquidity, the price of xALGO can deviate from the underlying Algo. However, as volatility reduces and normal trading activity resumes, combined with arbitrageurs who spot the price mismatch and buy the underpriced xALGO to be redeemed subsequently, the peg is restored eventually. What factors will contribute to the resolution of the de-peg? At the end of the current governance period, xALGO can be burned for the committed Algo + the accrued rewards (through the mint and burn mechanism). Therefore, the burning mechanism would eventually provide the resolution for the de-peg.","links":"https://folks.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/governance-xalgo/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x0034719300501b06e10ebb1d07ea5967301f0941"},"avalanche":{"decimal_place":6,"contract_address":"0xc3fb03e75cf916973d430d63635f3f6154d01dc9"}}}