{"name":"wLITI","id":"wliti","symbol":"wliti","description":"What Is Liti Capital SA and its wLITI token? wLITI is an ERC-20 token that is the wrapped version of the Swiss equity token - the LITI token. Launched on June 29, 2021, the wLITI token is suitable for trading on decentralized exchanges such as Uniswap, whereas the LITI token is only available through liticapital.com and requires KYC. Liti Capital uses the blockchain to manage its share registry and developing its own case management tools on the blockchain is on its roadmap. Swiss based Liti Capital creates the wLITI at a LITI token buyers request through its app on its website, which converts the LITI to a wLITI. The buyer is then able to trade the wLITI freely. Liti Capital does not directly sell the wLITI. The wLITI is wrapped at a 5000:1 ratio, and the two tokens will always maintain this ratio. The LITI is a true digital share of Liti Capital that has voting rights, pays dividends and is protected under Swiss law. The LITI is purposely not designed to be on exchanges at this time. Both tokens represent Liti Capital, whose mantra is “private equity for all.” Liti Capital works exclusively in a single form of private equity – Litigation Finance, also called third party funding. This asset class has remained almost entirely exclusive to hedge funds and venture capitalists since its inception several decades ago. Litigation Finance is the practice of financing all or part of a legal case on behalf of a plaintiff for an agreed upon percentage of the court award. Once Liti Capital purchases a portion of ownership of a case, it provides capital that can be used in many ways: legal fees, case management and strategy, expert witnesses, intelligence work, and whatever is needed to give the plaintiff the best chance of winning the case and collecting the award. The portion owned by Liti Capital becomes a “litigation asset” that backs the LITI token. What Makes Liti Capital’s wLITI Unique? By wrapping its LITI Token, Liti Capital has given DEX retail traders a utility token that is a wrapped version of an asset backed equity token. At any time, a wLITI token holder can unwrap 5000 wLITI and exchange for 1 LITI token with KYC in place. wLITI token holders can participate in bounties and be part of class action suits against crypto cons, scams and rug pulls as spelled out in the Liti Capital Tokenomics. Liti Capital is offering a new way to get retail traders involved in this asset class, by tokenizing its equity, Liti Capital is lowering the barrier of entry for a much wider pool of potential investors. According the Laws and Business of Litigation Finance, Litigation finance funds post returns between 50-100% on average at the portfolio level. It’s also a strong counter weight to the litigation spending power of wealthy defendants, it’s helps ensure ethical justice. Who Are the Founders of Liti Capital? The original idea for Liti Capital was born from its three Co-Founders, Jonas Rey, Andy Christen and Jaime Delgado. Jonas owns Athena Intelligence, a renowned Swiss Intelligence agency with a global reach in identifying assets needed for successful litigation award recovery. Andy is a data scientist and innovation entrepreneur who co-founded several startups running on the blockchain. Jaime is a well-known blockchain expert and ETH developer as well as the CTO of other startup companies. The Founders brought David Kay as Chief Investment Officer. David previously built a billion-dollar fund exclusively for litigation finance and has won the largest litigation award at that time of over one billion dollars.","links":"https://liticapital.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wliti/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0b63128c40737b13647552e0c926bcfeccc35f93"}}}