{"name":"Froggie","id":"froggie_binance-smart-chain","symbol":"froggie","description":"Froggie ($FROGGIE) is a community-driven meme coin launched on the Binance Smart Chain (BSC), inspired by the viral \"Neural Frog\" (神经蛙) meme that originated within WeChat's massive ecosystem of over 1.3 billion users. The meme evolved from WeChat's unofficial \"Crazy Frog\" mascot, which has been a cultural staple since 2016, representing internet humor, creativity, and spontaneous community energy in Chinese digital culture.The project's name, \"Froggie,\" was officially decided through a public community vote initiated by WeChat's official X (formerly Twitter) account in mid-2025, where it secured 44.5% of the votes against alternatives like \"Nervous Frog.\" This grassroots naming process underscores its emphasis on decentralized participation and viral appeal, drawing parallels to iconic meme coins like Dogecoin and Pepe while targeting an untapped Asian market fueled by WeChat's sticker polls and humor-driven campaigns.Key aspects of the project include:Blockchain and Tokenomics: Built on BSC as a BEP-20 token (contract address: 0xa45f5eb48cecd034751651aeeda6271bd5df8888), with transparent, audited smart contracts to ensure trust and no hidden taxes. Community Focus: 100% driven by holders, with no confirmed founder involvement; growth relies on meme proliferation, social media buzz (especially on X), and global engagement rather than centralized marketing. Market Traction: Launched in July 2025, it quickly hit a $12 million market cap with a 54% price surge in 24 hours, later reaching $19 million amid the meme coin rally. It was listed on major exchanges like Bitget (trading started September 10, 2025) and MEXC, boosting liquidity and visibility. Cultural Resonance: Leverages WeChat's scale for organic virality, positioning Froggie as a \"digital totem\" of fun and financial freedom, though it has no official ties to WeChat—any boosts come from indirect cultural spillover.","links":"https://froggiebsc.xyz/","market_cap":3806504,"market_cap_rank":2315,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/froggie_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa45f5eb48cecd034751651aeeda6271bd5df8888","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa45f5eb48cecd034751651aeeda6271bd5df8888"}},"is_native":false}