{"name":"Forest Knight","id":"forest-knight_polygon-pos","symbol":"knight","description":"Forest Knight is a Play-to-Earn mobile game powered by Ethereum & Polygon Layer 2. This Free-to-Play Turn-Based Strategy game allows players to build their own team of brave heroes that have all traveled from different realms to join the battle against the Skeleton Master. Your goal is to level up your heroes and equip them with unique and powerful NFTs to aid them in this journey. During this long journey, you will challenge other knights of the kingdom in the PvP Arena for great rewards, join guilds with like-minded knights and fight in mass battles versus other guilds, train your own pets and gain $KNIGHT tokens every step of the way. If you haven’t tried our game yet, feel free to try the public Early Access of Forest Knight The $KNIGHT token is a native, utility token used for: Marketplace Trading Upgrading & Merging NFTs Staking in Buildings Guild Wars Bounties PVP Tournament Entries Blockchain Pet Evolution What makes Forest Knight Unique? By adopting a Free-to-Play model, in Forest Knight, you will be able to play the game and earn both NFTs and Tokens, without having to invest anything but time. No large initial deposits, no odd subscription models. The team is focused on enriching the player’s experience by adding many fun and unique features and not just rely on NFTs to make it look cool. You can always find something fun and productive to do in Forest Knight. Balancing the PVP and PVE features of the game, the developers are focused on creating a journey for all types of players - casuals and hardcore grinders. For players that love the PVE experience, we have Adventure Mode, a series of missions culminating in the fight against the Skeleton Master. And for the players that really just want to fight other players, we have the Arena and Guild Wars. The game features a deceptively simple presentation with eye-catching fantasy graphics that conceal deep strategic structure and tactical nuance underneath. As you progress through the game, you'll recruit new heroes to join you in the battle to protect the realms, each with their own strengths and weaknesses (plus weapons and accessories) that provide varying advantages and drawbacks against enemy teams. Ultimately, the team wants to create an enjoyable game whose experience is enhanced by NFT collectibles and not the other way around. Earning money from playing should just be a byproduct of enjoying yourself while playing the game, which is exactly what Chrono Games aims to do with Forest Knight.","links":"https://www.forestknight.io/","market_cap":93137,"market_cap_rank":7124,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/forest-knight_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x4455ef8b4b4a007a93daa12de63a47eeac700d9d","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x4455ef8b4b4a007a93daa12de63a47eeac700d9d"}},"is_native":false}