{"name":"Snail Race","id":"snail-race","symbol":"snails","description":"What is the project about? SNAILS RACE - BETTING PLATFORM WITH REAL SNAILS What makes your project unique? Snails are live History of your project. What’s next for your project? Coin Market Cup listing Influencers partnership Betting Dapp Kucoin Listing What can your token be used for? For betting on the snails race games on live stream at Twitch and earn rewards History of Ethereum The Ethereum project was initially conceived when Vitalik Buterin published the whitepaper in 2013. The yellowpaper, which consists of more technical details on how Ethereum would work, was later published by Gavin Wood in 2014. A fundraising sale was conducted in September 2014 and the network went live in July 2015. On 15 September 2022, Ethereum transitioned from Proof-of-Work to Proof-of-Stake consensus with the Merge. What’s Next for Ethereum Now that the Merge is over, the final stage of Ethereum 2.0 is sharding, where the database on the Ethereum blockchain is split into 64 shard chains. With sharding, each validator only needs to verify the respective shards they’re responsible for, instead of verifying the entire network. This will also lower the barrier to entry for anyone who wishes to run a node. Besides encouraging further decentralization, this will improve scalability and ideally reduce the gas fees on the Ethereum network. What can Ether (ETH) be Used For? Ether (ETH) is the native coin that powers the Ethereum network and is used to pay for transactions. ETH functions as a utility token and is used to pay for gas fees for transactions on the Ethereum blockchain, denominated in gwei. Stakers on the Ethereum network earn ETH as their reward for securing the network. ETH is also a cryptocurrency, similar to bitcoin, and can be traded on multiple centralized and decentralized exchanges, or even deposited as collateral to take out loans. To learn more about Ethereum, please check out the following articles:","links":"https://www.snailsrace.vip/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/snail-race/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xfa1b65448e7ec5f37e512cdce52ab79e541f4fb2"}}}