{"name":"Gora","id":"goracle-network","symbol":"gora","description":"What is the project about? Goracle is an advanced oracle solution designed to bridge the gap between blockchain technology and the real world. It enables developers and organizations to integrate reliable, off-chain data into their smart contracts and decentralized applications (dApps). Goracle aims to accelerate the adoption of blockchain technology by providing critical infrastructure and empowering the next generation of blockchain applications. What makes your project unique? Goracle stands out in the oracle space due to several unique features. Firstly, it is built on the Algorand network, leveraging its pure proof-of-stake consensus mechanism, scalability, and security. This integration provides compatibility, reliability, and enhanced functionality for Goracle. Secondly, Goracle offers a flexible and modular oracle architecture, allowing developers to customize data orchestration according to their specific requirements. It supports frequent upgrades, fast adoption of the latest technological advancements, and provides first-class support for new and emerging use cases. History of your project. Goracle's journey began in the autumn of 2021 when it secured the prestigious first-place position in Encode's Algorand Hackathon, demonstrating its innovative potential. What’s next for your project? Goracle aims to expand its presence by integrating with additional blockchain networks such as Cosmos and Polygon, Arbitrum, Optimism, and other EVM-compatible chains. This expansion will enable Goracle to offer its oracle services to a broader range of developers and projects, providing them with reliable off-chain data for their smart contracts. What can your token be used for? The $GORA token serves a crucial role within the Goracle ecosystem. It facilitates network participation, governance, and incentivization. Holders of $GORA tokens have the opportunity to actively participate in decision-making processes.","links":"https://www.gora.io/","market_cap":299991,"market_cap_rank":4127,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/goracle-network/logo.png","detail_platform":{"algorand":{"decimal_place":0,"contract_address":"1138500612"},"ethereum":{"decimal_place":18,"contract_address":"0x3b9b5ad79cbb7649143decd5afc749a75f8e6c7f"}}}