{"name":"ChitCAT","id":"chitcat","symbol":"chitcat","description":"ChitCAT is a decentralized messaging dApp that utilizes blockchain technology and the IBC protocol to offer secure communication solutions. As digital technology is now the primary means of real-time communication, people rely on messaging applications to connect with others. With ChitCAT, users can communicate with others in a secure and decentralized environment. ChitCAT offers a unique feature in the form of a special negative tax system. This system enables users to enjoy the benefits of the dApp and generate a good income from their investment in the native token. The system incentivizes holders to keep and purchase more tokens, as it rewards them and motivates others to invest. The Negative Tax system implemented at ChitCAT is a unique tax structure that rewards token holders and encourages new investors to purchase and hold tokens. Whenever a user acquires ChitCAT tokens, they automatically receive an additional 3% of tokens, which provides an attractive incentive for investment. When a holder decides to sell their tokens, a Sell Tax of 3% is applied to the transaction value. This Sell Tax is then divided equally into two parts – Buyback (1.5%) and Marketing (1.5%). This mechanism allows for a constant flow of tokens in the market, while also contributing to the overall growth of the ChitCAT ecosystem. Furthermore, the 3% bonus that users receive when purchasing ChitCAT tokens generates a positive dynamic for the token’s price. This bonus, combined with the Negative Tax system, makes investing in ChitCAT a compelling opportunity for investors seeking to benefit from a unique and innovative token economy.","links":"https://chitcat.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chitcat/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7cf551258d6871b72ee1bd1624588a6245bf48c4"},"ethereum":{"decimal_place":18,"contract_address":"0x7cf551258d6871b72ee1bd1624588a6245bf48c4"}}}