{"name":"BloodLoop","id":"bloodloop_avalanche","symbol":"$bls","description":"## What Is BloodLoop? BloodLoop is a 5v5 Hero Shooter that immerses players in heart-pounding battles within a dynamic third-person shooter experience. Set in a dystopian future where factions vie for control, BloodLoop unleashes a relentless combat system where teams of skilled heroes clash in epic showdowns. Each hero possesses unique abilities, allowing players to adopt various playstyles and strategic approaches. With unique TPS gameplay and original game modes, built and conceived by top-class industry experts (ex Crytek, CI Games, Activision, Ubisoft, etc.) the game offers an innovative yet familiar experience to easily onboard gamers and get them in the loop. Thanks to its proprietary SDK and in-game gas fee-free subnet, BloodLoop provides users with a seamless web3 integration that doesn’t disrupt the UX and is perfectly blended into the traditional gaming experience. Leveraging a $BLS and NFT as Skins economy, the game is pioneering an economic loop that is sustainable and rewarding. ## What Is $BLS? $BLS is the native token to the BloodLoop ecosystem and it’s used for: * In-game crafting and trading of assets * Character upgrades, Tournaments and Ticketing * Gas Token for the BloodLoop Subnet The $BLS represents the keystone of the entire economic ecosystem of the game, as well as being the reference currency for any future development around the IP related to the BloodLoop game universe. ### Who’s Behind BloodLoop? The team comprises a healthy mix of crypto-native figures and top-class industry leaders from the gaming world, to embrace both cultures and take the best of each fully. With over 40 full-time figures, the team has experience from production houses such as Ubisoft, Activision, CI Games, Crytek, Gameloft, and more, specifically focusing on talent and figures passionate about innovation and research.","links":"https://bloodloop.com","market_cap":17885.43,"market_cap_rank":9958,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bloodloop_avalanche/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x46b9144771cb3195d66e4eda643a7493fadcaf9d","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0x46b9144771cb3195d66e4eda643a7493fadcaf9d"}},"is_native":false}