{"name":"Sator","id":"sator_solana","symbol":"sao","description":"Sator is a decentralized application platform designed to scale and expand linear content (Television, Film, Music, Streamers) to a non-linear content engagement experience. Audiences are incentivized by social utility token rewards (SAO) and content-based NFTs in the Sator dApp marketplace. Content creators, producers, and content rights holders simultaneously grow audience and global reach. Sator Network (SAO) runs on Ethereum and Solana, utilizing Wormhole bridge for bidirectional transfers and cross-chain interoperability. Sator addresses the greatest pain points in television/streaming/content: viewership growth, viewer engagement, subscribership growth & retention. Plus, Sator is the first mechanism to align the interests of content viewers and distributors by rewarding them both for their respective contributions. Sator also pushes NFT innovation ahead by embedding show-specific NFTs with extremely unique utilities, new profile-display features and experiential relevance; at this time in history when NFTs are maturing as a category and demand is growing for ways to utilize, display and discover NFT potentiality. Demand to “earn crypto for watching tv” is evident from consumers’ perspective. Thus, Sator’s economy empowers consumers to directly participate in value they create by engaging as a viewer. At the same time, Sator’s value-proposition is compelling from a content provider’s perspective. Indeed, content providers gain turnkey, self-replenishing viewership growth campaigns, plus comprehensive NFT solutions spanning creation to monetization. The Sator decentralized application contains a thoughtfully constructed set of staking mechanisms whereby users staking certain levels of $SAO boost their earnings by unlocking rewards multipliers on all their activities. Easy re-staking and multiplier rates increasing at higher staked levels all serve to deeply incentivize loyalty, activity on the platform and long-term $SAO holding.","links":"https://sator.io","market_cap":7769,"market_cap_rank":11651,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sator/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"2HeykdKjzHKGm2LKHw8pDYwjKPiFEoXAz74dirhUgQvq","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/2HeykdKjzHKGm2LKHw8pDYwjKPiFEoXAz74dirhUgQvq"}},"is_native":false}