{"name":"Flux DAI","id":"flux-dai_ethereum","symbol":"fdai","description":"What is fDAI? Each asset supported by the Flux Finance Protocol is integrated through a fToken contract, which is a representation of balances supplied to the protocol. fTokens, such as fDAI, are a fork of Compound V2's cTokens, with additional functionality to support permissioned assets. What Makes fDAI Unique? fDAI is minted when users deposit DAI on Flux Finance. By doing so, the user's DAI will become available to borrowers, and the user will earn the DAI supply rate. fDAI increases in value relative to the underlying DAI, meaning users can redeem more assets over time as interest is earned. The interest rate earned by lenders fluctuates and depends on the market's utilization (i.e. the percentage of deposited assets that have been borrowed). History of fDAI In January 2023, Flux was announced as a decentralized lending protocol that can support permissionless cryptoassets alongside permissioned tokens. The protocol was initially developed by Ondo Finance, a software development firm in DeFi, before being sold to Flux Finance. Flux is governed by the Ondo DAO, in which ONDO holders vote to upgrade its code and alter its risk parameters. In February 2023, the protocol was initialized and its supported assets and parameters were selected in a genesis vote. fDAI was among the first assets to be selected, alongside fUSDC and fOUSG. Markets for these assets opened shortly after. What can fDAI be Used For? By minting fDAI, users earn interest and gain the ability to use fDAI as collateral. fDAI can be transferred to effect change in ownership. Transferring fDAI means transferring your balance of the underlying DAI inside the Flux Finance protocol. Transfers that would result in negative account liquidity for borrowers on Flux Finance will fail. What’s Next for fDAI? As a permissionless yielding asset, fDAI can in turn be used as collateral at other lending protocols, and offers an alternative settlement option between parties.","links":"https://fluxfinance.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flux-dai_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0xe2ba8693ce7474900a045757fe0efca900f6530b","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe2ba8693ce7474900a045757fe0efca900f6530b"}},"is_native":false}