{"name":"Koinos","id":"koinos","symbol":"koin","description":"<h2>What is Koinos (KOIN)?</h2> Koinos is a developer centric open source project that leverages blockchain technology to provide a robust smart contract platform where holders have ownership over the network. Originally conceived in 2020, Koinos was officially launched November 5th, 2022 by Koinos Group, a US company.<br/><br/> To learn more about this project, check out <a href=\"https://koinos.io/\">koinos.io</a>.<br/><br/> Unlike other blockchains, on Koinos holding $KOIN gives you the right to utilize a portion of the network without sacrificing your cryptocurrency to transaction fees. Rather than paying a transaction fee, your $KOIN is temporarily locked and gradually unlocked over time. This mechanism is referred to as mana because it mimics the user experience of a video game. You can learn more about <a href=\"https://docs.koinos.io/overview/mana/\">mana</a> on the official documentation.<br/><br/> The Koinos protocol is designed to facilitate decentralized app (DApp) creation and it aims to improve decentralization by introducing a Proof-of-Burn (PoB) consensus algorithm. Learn more about <a href=\"https://docs.koinos.io/overview/proof-of-burn/\">Proof-of-Burn</a> on the official documentation.<br/><br/> Because of its innovative resource management, Koinos enjoys interest from Web3 enthusiasts seeking the next generation of blockchain user experience (UX). A significant focus for the Koinos network is to bring a Web 2.0 experience to Web3.<br/><br/> <h2>What makes Koinos unique?</h2> The Koinos blockchain has several features that differentiate it from other smart contract platforms. These include forkless upgrades, the mana system, smart wallet support and the Proof-of-Burn consensus algorithm.<br/><br/> Because the core business logic of Koinos is implemented via smart contracts, core functionality can be upgraded without the use of hard forks. While hard forks may be necessary to fix critical bugs or improve performance, many enhancements can be achieved simply through replacing smart contracts and a vote in governance. This allows Koinos to evolve at a more rapid rate than other blockchains. You can learn more about forkless upgrades and the <a href=\"https://docs.koinos.io/overview/governance/\">governance</a> system on the official documentation overview.<br/><br/> Koinos handles resources differently than other blockchains. Holding $KOIN grants access to a portion of the network. While most other blockchains have transaction fees, Koinos allows the user to pay in time. The more $KOIN the user holds, the more network the user has access to and the faster their mana pool regenerates. Learn more about <a href=\"https://docs.koinos.io/overview/mana/\">mana</a> on the official documentation overview.<br/><br/> On Koinos there is no difference between an account and a smart contract. Every account can also have a smart contract associated with it. Because an account is no different than a smart contract, account abstraction is baked into the protocol. It is no longer necessary to work solely with a private/public key pairing. Instead, Koinos features a turing complete authority system which allows for unlimited possibilities of smart contract upgrades, transaction payment handling, and contract calls. Learn more about <a href=\"https://docs.koinos.io/developers/authority/\">authorities</a> on the official documentation for developers.<br/><br/> The Proof-of-Burn (PoB) consensus is not well known but offers a variety of advantages of the traditional Proof-of-Stake (PoS) and Proof-of-Work (PoW) algorithms. Miners are virtualized on-chain leveling the playing field no matter the electricity costs of your local jurisdiction. This promotes decentralization as mining operations do not need to consolidate around locales with economic electricity costs. In addition, Proof-of-Burn solves the issue of consolidating stake on Centralized Exchanges (CEX) because the cryptocurrency must be burned in order to produce blocks or affect governance. Learn more about the novel <a href=\"https://docs.koinos.io/overview/proof-of-burn/\">Proof-of-Burn</a> implementation on the official documentation overview.<br/><br/> <h2>How many $KOIN are in circulation?</h2> Koinos was completely fair-launched, just like Bitcoin. It was originally Proof-of-Work mined into existence on the Ethereum blockchain in order to bootstrap the initial supply. Over the course of a year, approximately 100 million $KOIN were mined and used to establish the initial balances of the blockchain upon launch.<br/><br/> After the mainnet launch on November 5th, 2022 the chain was in-band upgraded from federated to Proof-of-Burn and $KOIN was burnt in exchange for virtual hashpower to secure the network. Because $KOIN is constantly being burned in order to secure the network, the supply is dynamic so you should check popular block explorers like <a href=\"https://koiner.app\">Koiner</a> for precise numbers.<br/><br/> The supply can be most simply described as 100 million with 2% inflation annually and target burn of 50%. This is an oversimplification but you can learn more about the <a href=\"https://docs.koinos.io/overview/tokenomics/\">tokenomics</a> on the official documentation overview.<br/><br/> <h2>How is the Koinos network secured?</h2> The Koinos network is secured through the innovative Proof-of-Burn (PoB) consensus algorithm.<br/><br/> Block producers burn their $KOIN and receive Virtual Hash Power (VHP) in return. This can be thought of exactly like hash power on Proof-of-Work (PoW) chains. The more hash power you have, the more likely you are to produce a valid block. It’s as simple as that. The details of the implementation can be found by reading the <a href=\"https://docs.koinos.io/architecture/proof-of-burn/\">Proof-of-Burn</a> on the official documentation architecture section.<br/><br/>","links":"https://koinos.io","market_cap":18247375,"market_cap_rank":1401,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/koinos/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"ethereum":{"decimal_place":8,"contract_address":"0xed11c9bcf69fdd2eefd9fe751bfca32f171d53ae"}}}