{"name":"Sweat Economy","id":"sweatcoin","symbol":"sweat","description":"What is Sweat Economy? Sweat Economy is a Web3 ecosystem on a mission to promote healthier lifestyles by encouraging people to move more. It is powered by $SWEAT or Sweat Token, a tokenized physical activity (crypto asset and the unit of physical activity value minted by steps). The token is managed via the intuitive non-custodial Sweat Wallet dApp. The Sweat Wallet is a top 5 dApp globally, designed for the crypto-curious. What is $SWEAT $SWEAT is a tokenized physical activity. Or in other words is a crypto asset and the unit of physical activity value minted by your steps. $SWEAT is a top-10 Web3 asset globally by the number of holders and top-15 asset by the level of user activity. What is Sweat Wallet? Sweat Wallet is a non-custodial mobile wallet dApp. Sweat Wallet enables millions of crypto-curious users to manage their $SWEAT and other crypto holdings–exchange, stake, vote, NFT game-play and more. It is designed from first principles to be the most intuitive and easy-to-use wallet in Web3. Sweat Wallet is a top 5* dApp globally. *By number of unique active wallets (UAW) in 30d, as of July 2023 How is Sweat Wallet different from other mobile wallet dAPPs? Sweat Wallet is on a mission to be the most intuitive wallet in Web3. Here’s how it’s done: Launched as the biggest Web2-Web3 onboarding in history, with 13M wallets and counting Lets you earn $SWEAT just for walking–the more you move, the more you earn Enables crypto-curious users to manage their $SWEAT and other crypto holdings Sweat Wallet strives to be unique by being free to use. More specifically, there are no paywalls (as of time of writing) that prohibit users from joining. Instead of optimizing for profits, Sweat Wallet strives and prioritizes its mission of growth.","links":"https://sweateconomy.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sweatcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb4b9dc1c77bdbb135ea907fd5a08094d98883a35"},"near-protocol":{"decimal_place":18,"contract_address":"token.sweat"}}}