{"name":"PLURcoin","id":"plurcoin_ethereum","symbol":"plur","description":"PLURcoin is a community-driven cryptocurrency designed to power transactions within the music, entertainment, and festival ecosystems. Built on secure and efficient blockchain technology, PLURcoin enables fast, transparent, and decentralized payments while fostering a global culture of Peace, Love, Unity, and Respect (PLUR) — values that have long been the foundation of dance music and festival culture around the world. At its core, PLURcoin seeks to become the native digital currency of the entertainment industry, particularly within the electronic dance music (EDM) space. The project’s mission is to bring blockchain benefits to real-world communities that gather around music, art, and shared experiences. By offering an efficient and borderless means of payment, PLURcoin aims to make it easier for fans to buy event tickets, merchandise, and artist-related products, while reducing transaction fees and improving accessibility compared to traditional payment methods. PLURcoin goes beyond just being a payment method — it is designed to create an entire ecosystem where fans, artists, and event organizers can engage in new and meaningful ways. Through the PLUR Wallet, token holders will soon have access to exclusive digital drops from leading EDM artists, including collectibles, unreleased music, and premium content. These initiatives will provide fans with deeper connections to the artists and events they love, while giving creators a new, blockchain-enabled channel to reward their supporters directly. The project is actively pursuing partnerships with major EDM festivals around the world, seeking to integrate PLURcoin as a native payment solution at live events. This means fans may one day use PLURcoin not only for online purchases but also for on-site transactions, creating a seamless and modern festival experience. The PLURcoin roadmap also envisions community governance features, where token holders will be able to participate in decision-making processes, such as voting on future partnerships, event sponsorships, or charitable initiatives. PLURcoin’s commitment to transparency, decentralization, and community participation sets it apart from many other cryptocurrencies. A significant portion of the token supply has already been burned to increase scarcity and demonstrate the team’s dedication to long-term value, while a portion of tokens remains locked for charitable purposes aligned with PLUR principles. In summary, PLURcoin is about much more than cryptocurrency — it is about uniting a global community under a shared ethos of Peace, Love, Unity, and Respect, using blockchain technology to empower fans, artists, and organizers in the modern entertainment landscape.","links":"https://www.plurcoin.com/","market_cap":188747,"market_cap_rank":6007,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/plurcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfcfcb729e45f7037362ba61f6dfbcdaefacfd55e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xfcfcb729e45f7037362ba61f6dfbcdaefacfd55e"}},"is_native":false}