{"name":"Catboy","id":"catboy-3","symbol":"catboy","description":"Our mission is to provide high-quality products, to become a worldwide brand and bring new unique ways to make NFTs more valuable and bringing real life value for the token Catboy. Not only do we want that, our goal is also to advocate and protect animals in need. To inspire and to build a community where people value animals to strenghten the human-animal bond with connecting the Anime world into the crypto space. We strive to stay ahead of the curve when it comes to offering innovative and cutting-edge technology and products. Through team collaboration and dedication, we’re committed. Our commitment is plain: at all times, meet or exceed your expectations in quality, service, reliability and cost. We pledge to make every effort to strengthen community relationships by continually seeking new ways that respond meet today’s demands as well as anticipate tomorrow’s needs. Bene, the founder of Catboy. Back in 2021, got inspired by crypto and anime, he initiated Catboy, assembling a team of friends dedicated to the project. For the past two years, they have been working tirelessly. Together with CJ and Selina, with all the experience they've gained throughout the years, they handle the launch very organised. Each with their own expertise and experiences. Our backers are growing daily. Partnerships and collabs with big influencers in this space are helping us by expanding our network, they are all enthusiastic about providing support. Additionally, we've connected with a doxxed Chinese individual to explore opportunities in the Chinese market.","links":"https://www.catboy.io/","market_cap":4951847,"market_cap_rank":1897,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/catboy-3/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0dcee5f694e492f0dd842a7fbe5bed4c6e4665a6"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0dcee5f694e492f0dd842a7fbe5bed4c6e4665a6"}}}