{"name":"Standard Euro","id":"standard-euro","symbol":"seuro","description":"**What is The Standard Protocol?** The Standard Protocol is a fully collateralized stablecoin and lending protocol built on the EVM that enables anyone to lock up assets in a smart contract and mint new stablecoins as a loan against those assets at zero percent interest. Standard Euro (sEURO) is the first stablecoin that has been minted from the Standard Protocol. **How Many sEURO will be in Circulation?** The supply of Standard Euro (sEURO) is unlimited. **Who are the founders of The Standard Protocol?** The co-founders of TheStandard.io are Joshua Scigala (Protocol Lead), Philip Scigala (Product Lead), Ana Valdes (DAO Operations), and Simon Morley (Technical Lead). TheStandard.io was built by the team that built Vaultoro.com the first bitcoin / physical gold exchange built-in 2014. The team also invented the glass books exchange transparency protocol and built the first exchange implementation of the lightning network. **What makes The Standard Protocol unique?** The Standard Protocol focuses on releasing a stablecoin for every major fiat currency. The first stablecoin to be released is sEURO which will be released using an initial bonding curve (IBCO) mechanism. **What is the concept of The Standard Protocol?** The engineering focus after the IBCO is on private vaults that enable people to lock blue chip cryptocurrencies into smart contracts to borrow against that collateral without giving up the private keys. The other major emphasis has been on reducing liquidations for borrowers by enabling people the ability to convert locked collateral into a less volatile asset like tokenized gold. The second way they achieve this is to give people the option to sell the smart vault debt as an NFT if they can not repay it.","links":"https://www.thestandard.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/standard-euro/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb399511642fe1666c6a07f83483e6e4feaed9a00"}}}