{"name":"Xfinite Entertainment","id":"xfinite-entertainment-token","symbol":"xet","description":"What is Xfinite? Xfinite is a decentralized entertainment ecosystem built on Algorand blockchain. The first dApp in our ecosystem - Mzaalo incentivizes content consumers for watching content. It is a gamified video on demand platform with over 12,000 movies and Live Tv, 1500 music tracks and much more... The dApp is currently available on iOS, android and web. To learn more about Mzaalo visit: https://mzaalo.com/ How is Xfinite disrupting the entertainment ecosystem? Through their decentralized network, Xfinite aims to bring mass adoption of Blockchain as a technology across the globe (mainly through non-native crypto users). Xfinite’s watch to earn model will empower millions of users to have access to premium content at their disposal and earn crypto rewards. The blockchain enterprise already has partnered with 600+ loyalty partners across the globe to provide utility to its ecosystem participants. Xfinite is also on the anvil of launching their NFT marketplace that will facilitate XET holders to buy or sell NFTs. Who are Xfinite’s ecosystem enablers? Xfinite is powered by Algorand and backed by participants like Borderless Capital, Algorand, Shima Capital, Ceras Ventures, Black Mamba and FBG Capital. Xfinite also has established partnerships with esteemed organizations like Daimler, Josh, DailyHunt, and Eros Now. How is the XET token dispersed in the ecosystem? 25% of XET tokens This will open up avenues for potential investors to become representatives of the token itself. 28.75% of XET tokens - Rewards Utility A pool of 28.75% of XET tokens are segmented to incentivize XET ecosystem participants for contributing to the platform. 10% of XET reserves for the team For longer sustainability of the project and to keep the team consciously invested, 10% of XET will be reserved for the team members as an incentive for their contribution towards the project. 10% of XET for Strategic Partners Xfinite’s ecosystem has some ‘reach enablers’ who contribute to the development of the project. Partnerships play a pivotal role in the XET landscape. To reward them for their efforts, 10% of XET tokens are kept in reserves. 11.25% of XET for XSPO - Xfinite Staking Pool Offering We aim to launch our XET staking pool (XSPO) for XET token holders to earn yields by staking their tokens into the pool for a defined period. Where is XET listed? Xfinite Entertainment Token, $XET is listed on Bitmart and MEXC. Who are the people behind Xfinite Entertainment Token? The core team of Xfinite Entertainment Token boast of a cumulative experience of 25+ years. The team has been associated with Goldman Sachs, Viacom, Discovery, Sentinel and Autonomy. The blockchain team at Xfinite has a long- standing association with Algorand’s blockchain technology.","links":"https://www.xfinite.io","market_cap":531199,"market_cap_rank":3009,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xfinite-entertainment-token/logo.png","detail_platform":{"algorand":{"decimal_place":9,"contract_address":"283820866"}}}