{"name":"Falcon Finance","id":"falcon-finance-ff_binance-smart-chain","symbol":"ff","description":"Falcon Finance is pioneering the first universal collateralization infrastructure, designed to transform how liquidity and yield are created onchain. The protocol accepts liquid assets, including digital tokens and tokenized real world assets, to be deposited as collateral for issuing USDf, an overcollateralized synthetic dollar. USDf provides users with stable and accessible onchain liquidity without requiring the liquidation of their holdings. To complement this, users can stake USDf to mint sUSDf, a yield-bearing token that is powered by diversified institutional-grade trading strategies. These strategies extend beyond traditional basis spread arbitrage and are designed to deliver performance across all market conditions. By bridging the gap between traditional finance and decentralized finance, Falcon Finance offers institutions, protocols, and individuals a transparent and secure way to unlock the full potential of their assets. The platform combines innovation, yield generation, and robust risk management into a scalable infrastructure that redefines how collateral, liquidity, and asset ownership interact across financial domains. $FF is the native token that captures the growth of Falcon Finance. As more assets are deposited and USDf adoption expands, $FF becomes the core asset tied to the protocol’s scale and success. Falcon is building infrastructure designed for trillions in assets. $FF is the way to get exposure to that future.","links":"https://app.falcon.finance/swap/mint","market_cap":218751151,"market_cap_rank":258,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/falcon-finance-ff/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xac23b90a79504865d52b49b327328411a23d4db2","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xac23b90a79504865d52b49b327328411a23d4db2"}},"is_native":false}