{"name":"ISKRA Token","id":"iskra-token","symbol":"isk","description":"1. What is Iskra (ISK)? - Iskra is a blockchain gaming hub that brings together gamers and game studios. Our platform allows gamers to explore and enjoy quality blockchain games and create their own community. Interested users will have the opportunity to explore new game projects for the first time through our Launchpad. Users can also freely trade in-game tokens and other in-game assets minted as non-fungible tokens (NFTs) outside the game. - As a native token, $ISK is used for all types of services provided within the Iskra ecosystem. $ISK has three key utilities: (1) Exclusive currency to buy Pioneer NFTs: After the 10,000th Pioneer NFT is sold, all remaining Pioneer NFTs are only available for purchase with $ISK. (2) Governance token: Holders are entitled to propose and vote on initiatives that govern the Iskra platform. (3) Key currency: ISK serves all purposes in the Iskra platform. It can be exchanged with other assets and can be used as a form of payment for transaction fees and charges for a variety of other services in the Iskra ecosystem. 2. How many Iskra (ISK) coins are there in circulation? - The total supply of $ISK tokens is 1 billion, subject to be distributed over 20 years. As of September 2022, around 18 million (18,031,944) $ISK tokens are in circulation. The details of token distribution plan can be seen here (https://whitepaper.iskra.world/community-economics/token-economy/isk) - A total of 20% of all platform fee revenue will be reserved in Burning Pool to buy back and burn $ISK tokens circulating in the market. $ISK burning will be done periodically by Iskra Team without prior notice to provide lower price volatility, and the results will be announced subsequently. * Note: The details of allocation and distribution plan are subject to change 3. Related Pages - Iskra Whitepaper: https://whitepaper.iskra.world/summary/iskra-the-future-of-play - Recent articles: https://news.iskra.world/","links":"https://iskra.world/","market_cap":1635363,"market_cap_rank":3557,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/iskra-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x17d2628d30f8e9e966c9ba831c9b9b01ea8ea75c","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x17d2628d30f8e9e966c9ba831c9b9b01ea8ea75c"},"klay-token":{"decimal_place":18,"contract_address":"0xd85eff20288ca72ea9eecffb428f89ee5066ca5c","geckoterminal_url":"https://www.geckoterminal.com/kaia/tokens/0xd85eff20288ca72ea9eecffb428f89ee5066ca5c"},"base":{"decimal_place":18,"contract_address":"0xd85eff20288ca72ea9eecffb428f89ee5066ca5c","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xd85eff20288ca72ea9eecffb428f89ee5066ca5c"}}}