{"name":"LBRY Credits","id":"lbry-credits","symbol":"lbc","description":"LBRY (pronounced “Library”) is a decentralized digital content distribution protocol and a marketplace for the same. It supports a variety of content which includes but not limited to videos, songs, ebooks, etc. LBRY uses blockchain at its core, which enables content to only be controlled by its author/ publisher, not by any third party, effectively eliminating issues like censorship and copyright strikes. Since the code of the LBRY project is open-source, developers can create their own decentralized apps (dApps). Content creators can use these apps to upload their content on the LBRY network and monetize it by setting a fee. LBRY credits or simply LBC is the cryptocurrency created by the LBRY network to fuel its entire digital content market. The LBC coin is required by consumers to access the monetized content on LBRY network. The LBRY platform also allows LBC mining by giving block rewards. Jeremy Kauffman co-founded LBRY Inc. with the vision of a decentralized global content hub, controlled and owned by no one. Currently, Jeremy is the chief executive officer of LBRY Inc. Before working on the LBRY project, Jeremy founded TopScore, a million dollars event and activity registrations startup. There are three other co-founders who serves on different positions in LRBY Inc: Alex Grintsvayg (Chief Technical Officer), Josh Finer (Director of Operations and Analytics), and Jack Robison (Protocol Developer). LBRY provides its own official app, which can be used to store LBC. The LBRY app is available for multiple operating systems such as Windows, MacOS, and Linux. Android and iOS versions are still in development. Other than its official LBRY wallet, users can opt for the Coinomi mobile wallet, which is recommended by LBRY. LBC can only be obtained through exchange. Users can also take advantage of LBC mining and various rewards given in LBC coin by LBRY network to its users. Although the concept behind the LBRY network has a lot of potential for growth, it faces competition directly against the entertainment giants such as YouTube and Netflix, and some of these platforms have been around for more than a decade.","links":"https://lbry.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lbry-credits/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}