{"name":"Two Monkey Juice Bar","id":"two-monkey-juice-bar","symbol":"$tmon","description":"We are building a three pronged ecosystem consisting of p2e juice games, nft marketplace and utility, as well as being the first movers in the 3D virtual franchise metaverse space. We are also building a DAPP to aggregate the whole ecosystem together (screenshots in the website). Our P2E games are one of the first to be built on Huawei Cloud and we have a strong tech team in Singapore and Shanghai. Our mission is to make earning rewards simple through our addictive juice games, staking of NFTs as well as sales of secondary juices NFTs through franchising. Through this ease of earning rewards, we hope to attract the young and old, and crypto and non crypto people, thereby lowering the barrier of entry to crypto for mass users. Our first game “Juice Blast” demo video is out and beta will be available in April/May for users to earn for free! - The problem As for the P2E games, there have been many P2E games in the industry such as Faraland, Axie, Rune, Sidus, Star Atlas etc, however none of them are easy to adopt and play given their tedious P2E mechanics (such as requiring scholars and needing to build a team for Axie and requiring intense hardware to process the 3D graphics of that of Sidus and Star Atlas). - The solution and purpose Here at TMON, we provide many choices of rewards for our users (our games, our NFTs, our franchise). A user that prefers intense graphics can earn through our metaverse franchising (selling juices in a 3D environment) while a user who wants to play for fun can run our juice games on mobile which does not require intense hardware. We also lower the barrier of entry to earn rewards, meaning non-crypto players can earn with us at absolutely no cost.","links":"https://www.twomonkeyjuicebar.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/two-monkey-juice-bar/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x2cd24aaf0aeabde7f830d6719eeb8eb3837712de"}}}