{"name":"Lightcoin","id":"lightcoin","symbol":"lhc","description":"LHC is a PIVX fork, the Lightcoin Foundation will develop a use case for the current financial system. Lightcoin, which has its own blockchain, will remain strong on several levels like as ERC20, TRC20, and Binance Smart Chain. The Lightcoin Foundation will safeguard and store currencies on cold wallets as protection for currencies issued on multiple levels of other blockchains. This allows you to preserve the maximum number of coins on the original blockchain while avoiding deflation because the maximum supply will always be the same. It will enable the creation of DeFi applications, NFT, and smart contracts. There will be publicly accessible tools for easily exchanging currencies between all levels. Lightcoin's major tool will be the establishment of payment systems, including integration with bitgoto allow exchanges like as Binance, Bittrex, coinbase, hitbtc, and others to use our ready API for easy intergration. This is also true for hardware wallets like as Ledger and Trezor. It is also planned to join the mycointainer.com platform to facilitate Lightcoin staking. We will also provide a link to indacoin.com for rapid Lightcoin purchases and exchanges. The Lightcoin Foundation also intends to establish its own games in which it will be possible to acquire residences on Mars and sell them in a virtual manner, with limited resources, creating a genuine worth of products that may be exhibited on Binance Market. The LightCoin foundation will also create a unique branch to gather funds for the most needy, known as the LightCoin Charity foundation. Anyone will be able to set objectives and raise funds on the Lightcoin Charity website.","links":"http://lightcoin.io","market_cap":29439,"market_cap_rank":4212,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lightcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x320d31183100280ccdf69366cd56180ea442a3e8"},"binance-smart-chain":{"decimal_place":8,"contract_address":"0x320d31183100280ccdf69366cd56180ea442a3e8"}}}