{"name":"Dogami","id":"dogami","symbol":"doga","description":"Discover DOGAMÍ! A unique play-to-earn AR mobile game supported by the Tezos blockchain, where players adopt and raise beautifully-crafted virtual NFT dogs. DOGAMÍ’s pioneering ecosystem enables users to earn the proprietary utility token $DOGA, the internal currency of the DOGAMÍ metaverse! $DOGA is used to purchase add-ons, upgrade and customize DOGAMÍ, trade items within the game, buy new dogs and interact with other players. It also serves as a governance & staking token offering its holders the ability to decide on the game’s future whilst empowering them through DeFi. Each dog has its own specific attributes that evolve in different stages and players can compete in real-time competitions and events. The better you raise your dog, the more you earn! As you train your dog from a puppy to your best friend, each action you choose earns you $DOGA. Furthermore, $DOGA is required to breed new DOGAMÍ, which can be kept or sold to new owners on secondary marketplaces. DOGAMÍ was created mid 2021 by 4 co-founders and boasts a team of 20 full-time employees - many of whom have extensive experience in game development. It was listed as one of 15 gaming startups to watch in Europe by Sifted. DOGAMÍ was early advised by The Sandbox Co-founder Sebastien Borget. The company successfully raised 6 million dollars through world-famous investors such as Ubisoft, Animoca Brands, XAnge Ventures. Their first NFT drop of 8000 dog avatars sold out in just a few hours propelling them to #1 place in terms of volume traded on major Tezos NFT platform 'Objkt'.","links":"https://dogami.com","market_cap":3514768,"market_cap_rank":2650,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dogami/logo.png","detail_platform":{"tezos":{"decimal_place":5,"contract_address":"KT1Ha4yFVeyzw6KRAdkzq6TxDHB97KG4pZe8"},"solana":{"decimal_place":5,"contract_address":"9o8MnTiZs8i7ahF4MVVW6yEgDso6ksCVXZg4BdcWo8hg"},"polygon-pos":{"decimal_place":5,"contract_address":"0x2f3e306d9f02ee8e8850f9040404918d0b345207"}}}