{"name":"TomTomCoin","id":"tomtomcoin","symbol":"toms","description":"\"TOMTOMCOIN is a project conducted by TOM N TOMS, which has been expanding its presence from offline coffee shops to emersive online expereinces. TOM N TOMS was first opened in 1999 in Korea and currently operates more than 500 coffee shops around the world. It has entered a total of 10 countries including the United States, China, and Thailand, and is planning to expand to countries such as Russia. As the hub of young culture and trend, TOM N TOMS has been working on various projects such as GalleryTom*, TOMS Metaverse**, pet beauty shop in addition to its offline coffee business. Its mobile app called MyTom has 500,000 downloads. *GalleryTom is an initiative that TOM N TOMS are collaborating with Korea Arts Management Service to prmote art works of young and upcoming artists. GalleryTom has exhibited more than 4,000 works in various art fields with 400 artists since 2013. With this deep knowledge and wide network with artists that have been built over last 8 years. TOM N TOMS are working on NFT/digital art programs where selected artists can exhibit and sell their art works both offline and online. **TOMS Metaverse team has been creating content by implementing games, simulators, and camera filters through AR/VR since 2017, and has been conducting various events and marketing activities. it aims to create TOMS World in the virtual world so that people around the world can experience store operations of various brands without restrictions of location or time, thereby generating profits and providing opportunities to open franchises in the real world. With the ecosystem that TOM N TOMS has been building both online and offline, TOMS token has a few utilities. First, TOMS token can be used in more than 500 offline stores. Users can use TOMS token to pay directly at the offline stores or place orders via its mobile app MyTOM. Also, TOMS token in MyTom mobile app can be used for additional services such as staking and token swaps. Also, TOMS token can be used to purchase artists art peices and NFTs which are presented in GalleryTom. TOMS token will be the main payment method in TOMS Metaverse to purchase Lands to open a store and play games to generate revenue by operating the stores in the vitual world. \"","links":"https://www.tomtomcoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tomtomcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbe9ab37a414c517b2be2bfa5945665bb07379054"}}}