{"name":"Bitcoin Limited Edition","id":"bitcoin-limited-edition","symbol":"btcle","description":"About BTCLE What is Bitcoin Limited Edition? Bitcoin Limited Edition (BTCLE) is more than just another token—it represents a bold redefinition of scarcity in a market oversaturated with speculative cryptocurrencies. As part of a broader vision to launch Bitcoin Layer 2 Limited, BTCLE stands at the forefront of innovation, combining exclusivity, transparency, and decentralization with a long-term roadmap to reshape blockchain finance. At its core, BTCLE is not simply an investment; it is a vision for the future of finance, where scarcity meets innovation. With the upcoming Bitcoin Layer 2 Limited initiative, we are building a scalable, efficient, and secure second layer anchored to the Bitcoin blockchain—the most secure network in existence. With a clear goal to bridge Real World Assets (RWA) into crypto, we are providing a simplified and accessible pathway for the next billion users still tied to traditional finance. Through BTCLE governance, stakeholders will help shape a democratized financial system, empowering individuals and communities to participate in this new decentralized economy. Supply Details Max Supply: 210,000 BTCLE Total Supply: 210,000 BTCLE Circulating Supply: 21,000 BTCLE Locked & Vested: 189,000 BTCLE Vesting Timeline: 10 years Tokenomics & Liquidity BTCLE follows strict security and decentralization policies to ensure long-term sustainability and trust: Token Lock: Tokens vested gradually over 10 years, preventing sudden supply shocks. Liquidity Lock: Liquidity is permanently locked, ensuring price stability and community trust. Fair Distribution: No single entity holds disproportionate control, guaranteeing a balanced market structure. Contract Renouncement: Smart contract ownership is renounced, ensuring full decentralization and eliminating central control. This framework provides the foundation for a sustainable, community-driven cryptocurrency designed to grow securely and transparently for the long term.","links":"https://www.bitcoin-limitededition.com/","market_cap":25593194,"market_cap_rank":1183,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitcoin-limited-edition/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9d2144328e1d618f54cd38540f5ee50671f6a208","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9d2144328e1d618f54cd38540f5ee50671f6a208"}}}