{"name":"Virtual Versions","id":"virtual-versions","symbol":"vv","description":"About Virtual Versions What Is VV Token (VV)? VV Token is the main engine across the VV eco-system allowing people to transfer value across the ecosystem, and earn rewards and discounts for VV products and experiences. VV is the native utility token that is used for: Access to virtual entertainment experiences like concerts, museum exhibitions, and comedy shows in the VV metaverse. Purchase wearable NFT's for avatars The native currency for our Metaverse, Unus World Purchasing, rent, and building land Building your Virtual Version to act as the central hub for your digital identity VV tools include: An avatar creation tool that can create a Virtual Version of you within 60 seconds from our mobile app An interoperable identity solution that allows you to traverse the metaverse with ease VV Social - the central hub for your identity that doubles as a portal to access virtual worlds Unus world - a gamified entertainment metaverse built in UE5 An identity wallet Who Are the Founders of VV Token? VV Token was created founded by Harrison Gwinnett, Archie Baker and Tom Gwinnett who have a wide range of experience within the Web3 industry. Harrison Gwinnett is a serial entrepreneur who took his first business from idea to an 8 figure exit in under 3 years, Harrison's passion is creating a brighter future for the internet using blockchain, with his first transaction in BTC being 2017. Archie Baker is a board member and is taking on the role of creative director at VV. His focus is to capture the essence of life through emotion and feeling across documentaries, music, and fashion. He has worked with major brands such as Adidas, Gymshark, Stella Mccartney, Reebok, Sidemen, House Of CB & many more. Tom Gwinnett’s experience spans over 18 months worth of in-depth learning, research, and hands-on experience which has led him to the Web3 lead of Unus labs X VV. He believes that Web3 requires an injection of real-world value and utility, which he aims to provide to our community via our multiple ventures across the ecosystem.","links":"https://virtualversions.xyz","market_cap":37729,"market_cap_rank":5398,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/virtual-versions/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}