{"name":"TATE","id":"tate_ethereum","symbol":"tate","description":"What is the project about? Tate Token is a project that has been initiated with the purpose of promoting the ideals of financial freedom and independence espoused by the renowned businessman, Andrew Tate. Our objective is to provide a platform for innovative thinkers to flourish and excel by offering them a stimulating and conducive environment. We aspire to establish the most extensive Web3 community and are committed to introducing new and innovative features in the near future. What makes your project unique? Our goal is to create a community of individuals who share our vision and are committed to making a positive change in the world. We believe that the power of crypto and blockchain technology can help us achieve this goal. At Tate Token, our objective is to deliver a dynamic and interactive community environment that offers measurable rewards to our token holders. History of your project. The $TATE Token project was founded with the vision of creating a community of dedicated and like-minded individuals who share a desire to break free from the constraints of traditional financial systems and achieve financial independence. What’s next for your project? The $TATE token project may undertake various initiatives to foster a strong and supportive community. These initiatives could involve gamification elements, challenges, or quests that incentivize users to participate and interact with the platform. Another important objective for the project is to increase adoption and attract more token holders. To achieve this, the project may implement targeted marketing campaigns, form partnerships & others... What can your token be used for? Tate Token will provide its users with an array of unique advantages and features . For exemple, by holding a certain amount of tokens, users may potentially be eligible for rewards, such as airdrops, inclusion in a whitelist NFT collection, and exclusive access to secret networking channels.","links":"https://www.tatetokeneth.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tate_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa589d8868607b8d79ee4288ce192796051263b64","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xa589d8868607b8d79ee4288ce192796051263b64"}},"is_native":false}