{"name":"Hermes Protocol","id":"hermes-protocol","symbol":"hermes","description":"What is the project about? Hermes DEX main goal is to let users and other decentralized protocols exchange both volatile assets (DAI to WETH for example) and stablecoins (DAI to USDC for example) through it with low fees and low slippage. Unlike exchanges out there that match a buyer and a seller, the behavior of Hermes is different, it uses liquidity pools like Uniswap. To achieve this, Hermes needs liquidity (tokens) which is rewarded by those who provide it. Hermes is non-custodial meaning the Hermes developers do not have access to your tokens. What makes your project unique? Stable coins have become an inherent part of cryptocurrency for a long time but they now come in many different flavors (DAI, TUSD, MIM, BUSD, USDC and so on) which means there is a much bigger need for crypto users to move from a stable coin to another. Centralized exchanges tend to have high fees which are problematic for those trying to move from a stable coin to another. As a result, Hermes Protocol has become the best place to exchange stable coins because of its low fees and low slippage. And Hermes also allows swaps with volatile assets. History of your project. Hermes Protocol officially launched in February 2022 and started emissions in March 2022. What’s next for your project? Introducing Yield and Concentrated Unified Liquidity Omnichain Marketplaces. Hermes V2 will offer multiple defi services compared to V1, while improving capital efficiency and user experience: - Bridge-less omnichain environment, powered with concentrated (Uni V3) and unified liquidity. - Decentralized Uniswap V3 Liquidity Management. - Uniswap V3 Liquidity Incentives. - Refined ve(3,3), becoming a fungible ERC-4626 - Improved UX and UI - Omnichain Yield marketplace What can your token be used for? Hermes token when staked for veHermes allows liquidity providers to take decisions on adding new gauges, boosting gauge yields, voting on token emission, and receive bribes.","links":"https://hermes.maiadao.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hermes-protocol/logo.png","detail_platform":{"metis-andromeda":{"decimal_place":18,"contract_address":"0xb27bbeaaca2c00d6258c3118bab6b5b6975161c8"}}}