{"name":"Baby Loop","id":"baby-loop","symbol":"bloop","description":"We are the fastest growing rewards token on BSC providing 3% auto LOOP Network rewards to our holders. We offer the cheapest gas fees of any swap on BSC and we are using the Google(Search) Business model of providing a valuable service to the masses - for free with the intent of becoming the go to place for people to swap any tokens for a fraction of the cost. We will continue to provide this valuable service indefinitely and expand on it offering cheap cross change swapping while being innovative along the way. We expect this business model to be very successful with word of mouth advertising and we believe that we can generate revenue with this model down the road. Our tokenomics are simple. 1% AutoBurn, 3% LP Allocation, 3% Rewards & 5% Marketing and we had a 200,000,000,000,000 initial supply with 6.35% of the total supply now burned as of this writing. We have live staking with high APRs and a very intuitive rewards dashboard where holders can check the total rewards paid out, their individual rewards earned to date and they can also claim their rewards at any time. We also have collectible NFTs featuring a lottery system where if someone gets one of our more rare NFTs they will receive an instant prize. Our biggest investor value will come when we will be bridging to the LOOP Network in the coming weeks and providing valuable utility on that, up and coming, blockchain. This unique utility, while not disclosed, is extremely promising in that no one else has done it before and there is no competition. Our team is based out of Halifax, Nova Scotia Canada and is led by a very successful real estate broker/investor who has the marketing skills and the innovation to make Baby Loop the biggest project of 2022! We are fully DOXXED and Pinksale KYC certified and have formed formal partnerships with some of the biggest and most honest influencers in the industry - Including Achilles, Predator & Ding Dang(Large Chinese Community).","links":"https://babyloop.live/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/baby-loop/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xec13736ffb2a50f3a4817e5797c8a8a777a147cb"}}}