{"name":"Thoreum V3","id":"thoreum-v2_binance-smart-chain","symbol":"thoreum","description":"What Is Thoreum (THOREUM)? Thoreum (THOREUM) is a hyper-deflationary, liquidity mining token that works best on a HODL strategy. The project founders describe it as a SafeMoon 2.0, a BEP-20 token that runs on Binance Smart Chain. Thoreum has five auto rewards ecosystems, and can be exchanged to BNB. Thoreum offers double staking rewards — users can either stake to compound its growth or earn other third party tokens. Staking in Thunder farms and Thunder Alliances farms is also tax-free. Thoreum token owners can earn real static rewards up to 40% by holding the coins in their wallet. This is because while the reflection on each transaction is only 4%, this full amount is distributed only to wallets holding less than 10% of the total supply. Meanwhile, over 90% of the total Thoreum supply is staked in Midgard pools and Thunder farms. \\ \\ In addition, Thoreum is also hosting a Lamborghini contest, where those who hold onto their coins can stand a chance to win a brand new Lamborghini Huracan. Entries for the contest depend on the total holding value of the THOREUM tokens one has, including the value of Thoreum in one’s wallet, pool and farms. Every $100 USD worth of Thoreum held is equivalent to one lucky draw ticket. Who Are the Founders of Thoreum? The developers of this project are currently anonymous, which is not uncommon for projects like this in the crypto space. Nothing is mentioned in Thoreum’s website or white paper on when the founders plan to dox. However, we might be able to expect them to dox when they move forward to future phases of their roadmap. What Makes Thoreum Unique? Thoreum claims to be the first of its kind to offer fee-free staking using its Thunder Boost mechanism. \\ \\ Under Thunder Boost, another unique feature of Thoreum is that it gives rewards in third-party coins. Staking THOREUM in one of its earning pools rewards holders with other crypto tokens such as BNB and BUSD, while at the same time earning Thoreum rewards automatically. \\ \\ The magnitude of Thoreum rewards sets it apart from other coins as well. Thoreum claims to have the highest buyback and burn of all coins at 10% of each transaction, which goes to the “THOR” contract for BNB buyback and burn. This decreases the supply of Thoreum over time, which would supposedly increase the value and benefit holders of the token in the long run. THOREUM is consistently burned at 4-5 million per day, and growing at a rate of about 100 BNB each day. Thoreum also claims to give the biggest real static rewards to holders, where 40% of each transaction fee is auto-give to coin holders. With 90% of the total supply locked in high APR pools, the remaining 10% in the wallet gives holders the equivalent of 40% rewards. Another feature Thoreum possesses is its Thunder Alliance mechanism. This makes it the first reflective token where users can farm in other yield farms and stake their tokens without incurring any fees. This is a result of Thoreum being in alliance with other farms known for their safe, non-rug pull environment. Thoreum also offers a referral system to build up its user base, giving all referees an eternal 3% earnings of its referrals’ earnings. Related Pages Take a deep dive into Thoreum features, tokenomics and price prediction. Find out more about SafeMoon in our deep dive. Learn more about yield farming in our guide here. What is web 3.0? Click here and find out. Visit CoinMarketCap Alexandria to learn everything you need to know about cryptocurrency and more. How Many Thoreum Coins are There in Circulation? Thoreum (THOREUM) has a total supply of 5 billion, where 3 billion have been burned initially. 0.5 billion was the initial supply, and the remaining 1.5 billion will be unlocked through liquidity mining. As of September 2021, there are 282,376,260 coins circulating. The total transaction tax is 12-14%, where 4-6% will be reflected as static rewards, while 8-10% goes to the buyback and burn mechanism. Across all farms and pools, there is a total value locked (TVL) of $20,638,656. How Is the Thoreum Network Secured? Thoreum has been audited three times, including by Certik, with the audits showing zero issues. THOREUM is a BEP-20 token on the Binance Smart Chain (BSC). BSC is secured through the proof-of-stake consensus mechanism. 21 validators are elected every 24 hours to validate transactions and maintain blockchain security. These validators have to stake a certain amount of BNB coins with Binance to be eligible to do so. Can Thoreum Coin Hit $1? Across the year, Thoreum has hit a low of $0.005732 and a high of $0.03115. To reach $1 would imply an over 32 times price increase from the current average, which is not an impossible target to achieve, especially in the crypto space. However, as with most coins, hitting this target would greatly depend on the project team reaching its objectives and the community backing it. Where Can You Buy Thoreum? Thoreum is listed on PancakeSwap V2. Cryptocurrency newbie? You can read more about how to enter the market and how to buy BTC, THOREUM or any other token in CoinMarketCap education portal — Alexandria.","links":"https://thoreum.capital/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/thoreum-v2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xce1b3e5087e8215876af976032382dd338cf8401","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xce1b3e5087e8215876af976032382dd338cf8401"}},"is_native":false}