{"name":"Aster","id":"aster-2_binance-smart-chain","symbol":"aster","description":"Aster is a next-generation decentralized perpetual exchange that combines non-custodial trading with advanced features like hidden orders and multi-chain support. The platform emerged from the merger of Astherus and APX Finance in late 2024, with APX token holders able to migrate their holdings to ASTER. Aster addresses the gap between centralized and decentralized exchanges by enabling traders to maintain full control of their assets while accessing deep liquidity and CEX-grade trading tools. The platform supports trading of both cryptocurrency perpetuals and U.S. stocks with up to 100x leverage, all settled on-chain in crypto without requiring traditional financial infrastructure. The platform offers two distinct trading modes to accommodate different user needs. Simple Mode provides one-click, MEV-resistant trading with up to 1001x leverage for beginners, while Pro Mode delivers a full order book with advanced features like automated grid trading and hidden orders that remain invisible until execution. Aster operates across BNB Chain, Ethereum, Solana, and Arbitrum without requiring bridging, with liquidity pooled across markets to support large trades with minimal slippage. A distinctive feature allows users to deposit yield-generating assets like asBNB or USDF as collateral, earning passive returns while trading, maximizing capital efficiency compared to platforms where collateral sits idle. Aster received backing from YZi Labs (formerly Binance Labs), which holds a minority stake through a private fund managing over $10 billion on behalf of early Binance executives. Changpeng Zhao, founder of Binance, serves in an advisory role and has personally invested over $2.5 million worth of ASTER tokens. The ASTER token serves multiple functions including governance rights, staking rewards through liquidity provision, and earning incentives through the platform's points program for traders and liquidity providers.","links":"https://www.asterdex.com/en","market_cap":1718662326,"market_cap_rank":63,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aster-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x000ae314e2a2172a039b26378814c252734f556a","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x000ae314e2a2172a039b26378814c252734f556a"}},"is_native":false}