{"name":"Plebbit","id":"plebbit","symbol":"pleb","description":"PLEB is the official token of Plebbit, a serverless, adminless, decentralized reddit alternative with no transaction fees. PLEB holders can upvote or downvote a community to decide whether it should be visible in the homepage of the app. The token is also required to submit DAO proposals, and it can be used for tipping, awards and get other perks in the apps. WHAT IS PLEBBIT? Plebbit is the only decentralized and scalable social networking protocol where anyone can create and fully own a community. The plebbit protocol is fully open source, and it can be used with any forum interface built on top of it. Each community acts like a server, and each community owner decides how/if to moderate the community, as there are no admins. To combat spam, community owners can set any kind of challenge for their users, such as captcha. WHY NOT FEDERATED? Absolute free speech. Unlike federated social media, Plebbit is pure peer-to-peer: users can always connect to a community directly by knowing its address, and each user has full ownership of their own data, so no instance/relay exists with the power of censoring users or communities. WHY NOT A BLOCKCHAIN? Scalable to millions of users. Unlike blockchain-based social media, Plebbit users can be full nodes on about 2GB of RAM by simply browsing with the desktop app (uses IPFS), automatically seeding all communities from which they download content. All content is text-only (including links for media). HOW CAN I USE IT? Check out the clients on plebbit.com - https://seedit.eth.limo/#/: a Plebbit interface based on the original Reddit UI. - https://plebchan.eth.limo/#/: a Plebbit interface designed with a 4chan UI. - https://plebones.eth.limo/#/: a bare-bones Plebbit interface, initially created for testing purposes. Plebbit represents the next evolution of web3 social media. The voices of the plebs will no longer be silenced. To learn more, please visit plebbit.com","links":"https://plebbit.com/home","market_cap":1916731,"market_cap_rank":3366,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/plebbit/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xea81dab2e0ecbc6b5c4172de4c22b6ef6e55bd8f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xea81dab2e0ecbc6b5c4172de4c22b6ef6e55bd8f"}}}