{"name":"Bware","id":"bware-infra_avalanche","symbol":"infra","description":"What is the project about? Bware Labs is a provider of multichain, scalable solutions, focused on infrastructure and dev tools. Founded in 2020, in Bucharest, Romania, Bware Labs aims to solve efficiency and performance challenges in the Web3 industry. What makes your project unique? Providing unparalleled quality, performance, and ease of use to blockchain API, Blast, Bware Labs API platform innovates by decentralizing its infrastructure through onboarding third-party node providers to participate in the platform. It does this by being the first to adopt a reward model for node runners, incentivizing them in order to increase the decentralization of the platform and ultimately improve access to supported blockchains. History of your project. The Bware Labs founders set out to build an alternative infrastructure platform that focused on high performance, decentralization, security, and accessibility all at the same time, without relying on a centralized authority. This is how Blast, Bware Labs decentralized API platform appeared. Bware Labs now offers a full range of services for Avalanche Subnets and Polygon Supernets, validators, custom indexing services on the Klaytn Network, snapshot services for Aptos, XPLA, Persistence, OKP4, Nolus and Uptick, faucet services, and they are bridge operators for Avalanche, deBridge, Axelar, and Connext. What’s next for your project? Bware Labs expanded well over the blockchain infrastructure business and is aiming to become an all-encompassing ecosystem for all the tools the Web3 players need, servicing not only builders, but also enterprises, blockchains, and App Chains. What can your token be used for? $INFRA is the ERC20 token that enables Blast to run permissionless. The node providers in Blast are rewarded with the INFRA token if they can sustain the quality required by Bware Labs' proprietary Integrity protocol. Holders will be able to stake tokens, run their own nodes, or delegate them to earn more yield.","links":"https://bwarelabs.com/","market_cap":339185,"market_cap_rank":5119,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bware-infra_avalanche/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xa4fb4f0ff2431262d236778495145ecbc975c38b","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0xa4fb4f0ff2431262d236778495145ecbc975c38b"}},"is_native":false}