{"name":"Fitmint","id":"fitmint","symbol":"fitt","description":"What is the project about? Fitmint is a first of it's kind free-to-play and move-to-earn game where you can earn rewards in crypto tokens and NFTs simply by walking and running. Our mission is to help people move everyday by making it fun and rewarding Fitmint's vision is to create world's largest community owned fitness economy where millions of people get fit everyday, get rewarded for their efforts and engage seamlessly with their favourite health/fitness brands. Fitmint is backed by General catalyst, iSeed, Kearny Jackson, Polygon Studios and many other marquee investors/advisors. What is the gameplay? Fitmint's gameplay is designed by keeping these 4 points at the center of it - It should help people get consistent with walking and running - It should be fun and rewarding - It should be simple and free to play for all kind of users, no matter whether they are from web2, web3 or web10 - It should help us build a sustainable token economy The gameplay starts with your personalised 3D avatar which comes along with 4 attributes: Level, Style, Strength and Charm. And each attribute is linked to a specific in-game behaviour of the user like participation in the challenges, avatar assets, referrals and so on. A combination of these 4 attributes decide how much FITT you would be earning everyday. What makes your project unique? With the free, fun and simple gameplay, Fitmint has the potential to onboard millions of users to it's ecosystem and reward them for their fitness efforts in a sustainable manner over a long term. What can your token be used for? FITT is the native utility token of Fitmint which is used: - To reward the fitmint app users for completing their daily fitness goals and levelling up in the gameplay - To participate in the fitness challenges for walking and running activites - To trade the avatar assets in the marketplace Check out our website for more details: https://fitmint.io/","links":"https://fitmint.io/","market_cap":14992.32,"market_cap_rank":9118,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fitmint/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x656bf6767fa8863ac0dd0b7d2a26602b838a2e70","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x656bf6767fa8863ac0dd0b7d2a26602b838a2e70"}}}