{"name":"WeWay","id":"weway","symbol":"wwy","description":"WeWay is a Web3 community-driven ecosystem for learning, earning, and playing. Our mission is to develop the mass adoption of blockchain and cryptocurrencies with the help of influencers, stars and KOLs from all over the world. We have three primary products: WeAcademy — the first Learn2Earn crypto academy, WePad — highly transparent and community oriented IDO Launchpad, where our holders can earn by participating in IDO high-quality projects, and WeGames — Social-Fi games production with the most advanced CGI and AR gaming (our first game is Mad Backpacks, which provides an interesting gaming experience with Find2Earn mechanics for a mass audience). All WeWay ecosystem interactions are based on our highly liquid utility token $WWY. Within the last year we’ve listed on 14 crypto exchanges, grown 1400% and entered the Top 15 tokens by ROI in 2022. The project is strengthened by over 500 influencers including world celebs with about 200.000.000+ followers in total. WeWay is focused on community, we strive to unite crypto enthusiasts and increase awareness and expertise in the crypto world. Who Are the Founders of WeWay? The CEO and one of the co-founders of WeWay Platform is Fuad Fatullaev, also acting CPO of EHOLD (the parent company of WeWay) – a technology-focused group of international companies having unique expertise and vast experience in their fields of practice, such as custom blockchain software development, Enterprise blockchain solutions, Tokenization and NFT, Smart-contract development, Cryptocurrency exchanges, Digital wallets, Decentralized application, Web and mobile applications AR/VR solutions development, Machine learning, Deep learning VR/AR technologies.","links":"https://weway.io/","market_cap":22088060,"market_cap_rank":1038,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/weway/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9ab70e92319f0b9127df78868fd3655fb9f1e322"},"ethereum":{"decimal_place":18,"contract_address":"0x9ab70e92319f0b9127df78868fd3655fb9f1e322"}}}