{"name":"PepManCity","id":"pepmancity","symbol":"pepmcity","description":"What is the project about? Pep X ManCity is a decentralized fan token that aims to empower and guide holders towards wise financial choices while incorporating the fun of being a Manchester City fan. It will help Manchester City fans unlock VIP experiences with their favorite Manchester City players, earn official merchandise, and more. What makes your project unique? 1. safe and easy transactions using state-of-the-art blockchain technology 2. unique fan token experience 3. full usage rights of their assets 4. community filled with ManCity super fans 5. access to exclusive experiences with ManCity 6. ability to make decisions that influence the team in ManCity History of your project. Sports have always been an integral part in many nations' cultures, especially football. Football and cryptocurrency are usually not paired together, and if they are, the token and its features usually fail to accommodate the wants and needs of their holders. So, our team, a bunch of Manchester City diehard fans, decided to band together to make sure to give the best experience to fellow fans in both football and cryptocurrency. What’s next for your project? With the ever-present love for football in all areas of the world and the growing influence of cryptocurrency, the market for the hybrid of these two is still unexplored and underdeveloped.The team aims to change that by providing the means for super fans to have access to their favorites while also earning on the side.As a fan token, all the features of Pep × ManCity will cater towards fans. We know what they would like and with ample experience in cryptocurrency projects, we are sure to bring the best of both worlds to the market. What can your token be used for? Holders will also be able to purchase exclusive Manchester City items through our household DApp by using the token","links":"https://pepmancity.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pepmancity/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcd58d56906318ce6ad9ef4ae5fb21f61e05c417d"}}}