{"name":"Mitosis EOL BNB","id":"mitosis-eol-bnb_binance-smart-chain","symbol":"mibnb","description":"Mitosis' yield-bearing BNB, issued via Mitosis EOL VLF (Vault Liquidity Framework), leveraging the DeFi strategies operated by Lista DAO. \"Mitosis is a cross-chain DeFi protocol that transforms liquidity positions into programmable and composable assets. It addresses two major inefficiencies in decentralized finance: the illiquidity of staked assets and the lack of access to high-yield opportunities for smaller users. Users deposit tokens into Mitosis Vaults across supported blockchains and receive representative assets called Hub Assets on the Mitosis Chain. These can be deployed into two yield frameworks: Ecosystem-Owned Liquidity (EOL) and Matrix. EOL enables governance-driven asset allocation, while Matrix offers curated liquidity campaigns. Each framework issues distinct position tokens—miAssets for EOL and maAssets for Matrix. Unlike traditional DeFi liquidity tokens, Mitosis position tokens are programmable components that can be traded, used as collateral, or restructured into new financial products. The protocol's infrastructure supports advanced financial engineering and transparent price discovery. Through collective liquidity aggregation, Mitosis grants users access to preferential yield terms typically reserved for institutional players. Its governance model ensures that token holders participate in capital allocation decisions, fostering a more democratic liquidity ecosystem. With a cross-chain settlement layer and a design focused on modularity, Mitosis establishes a new standard for programmable liquidity in DeFi.\"","links":"https://mitosis.org/","market_cap":891127,"market_cap_rank":3877,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mitosis-eol-bnb_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":24,"contract_address":"0xa5deb178c729e058018db8bd68a9ffb8418df42d","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa5deb178c729e058018db8bd68a9ffb8418df42d"}},"is_native":false}