{"name":"The QWAN","id":"the-qwan","symbol":"qwan","description":"What is the project about? The QWAN is a decentralized ERC-20 token that serves as the driving force to create a global gaming community. The QWAN is open, permissionless, and can be integrated by any third-party application, platform, or game developer. The QWAN supports a global gaming community with the aim of shaping how the ecosystem - from gameplay models and game development to community experiences and gaming careers - can evolve and expand. The QWAN was designed to put gamers first and create a gaming hub with 3 main goals in mind: 1) To establish one share currency for all ecosystem members a)The QWAN provides a single currency to empower gamers and unify the gaming ecosystem without centralizing power in the hands of any single player, publisher, or third party. 2) To empower gamers to earn across gaming experiences a) The QWAN aims to empower gamers and gaming communities around the world by providing tools to create new experiences and shape how the ecosystem evolves. 3) To provide the gaming community with a gateway entry to web3 a) The QWAN’s utility centers around the governance of The QWAN DAO, the use of QWAN within various gaming platforms, Web2 and Web3 games, and spending of QWAN across The QWAN Ecosystem. The QWAN is also used as an incentive for The QWAN Ecosystem participants and external communities that adopt The QWAN and use it to enhance their gaming experiences. The QWAN Ecosystem includes its stakeholders, The QWAN DAO, the intellectual property rights owned by The QWAN DAO, and The QWAN Foundation. What makes your project unique? The decentralized governance framework that governs The QWAN Ecosystem, including the Ecosystem Fund. Members of The QWAN DAO are limited to holders of QWAN. The QWAN DAO distributes QWANs to a wide community of gamers and publishers through incentives and rewards and creates new Web3 gaming experiences with the","links":"https://theqwan.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-qwan/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xeee0fe52299f2de8e2ed5111cd521ab67dcf0faf"}}}