{"name":"Ether Wars","id":"ether-wars","symbol":"war","description":"Ether Wars is a thrilling GameFi arena where participants engage in high-stakes, 1-on-1 duels for the coveted title of War King. The platform offers an electrifying blend of strategy and chance, where participants wield their wagered ETH as gladiators, with the ultimate goal of mastering the art of war and emerging victorious​ The platform's native token, $WAR, is deflationary in nature and has a fixed supply of 100,000,000 tokens. The tokens serve a multitude of purposes within the Ether Wars ecosystem and can be used in game to unlock unique features and probabilities. The $WAR token not only fuels the gameplay but also powers the platform's decentralized finance aspect. As a reward, liquidity providers receive a share of the protocol revenue paid in real yield ETH and bonus $esWAR tokens, an exclusive reward token that can be unlocked into $WAR over time Ether Wars held its public sale for $WAR on June 3rd, 2023. The funds raised from the sale have been utilized to seed liquidity pools and further the development of the Ether Wars ecosystem​. With three more arenas under development, Ether Wars is set to diversify gameplay options, offering players a spectrum of tactical choices. Looking ahead, the game plans to launch a reward-driven Main Net. An exclusive NFT collection is on the horizon, merging digital art and gaming. The introduction of an elite VIP status and bonus care packages promises to enhance player engagement. Lastly, the forthcoming Ether Wars V2 Expansion aims to bring exciting mini-games, adding more variety and excitement to the platform. These initiatives signify Ether Wars' unwavering commitment to innovation and player satisfaction as it continues to shape the future of risk-to-earn gaming.","links":"https://etherwars.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ether-wars/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x1f6e4b5ffc94cca08cf6bb1479148d6329d4baf5"}}}