{"name":"Riggers","id":"riggers","symbol":"rig","description":"RIGGERS [RIG & OIL] is a protocol that expands on the ERC404 fractionalized-liquidity standard by introducing ERC1155 composability, decayed staking pools and cross-chain messaging. Wrapping the complexity of 404 with gamified tokenomics, Riggers is introducing everyday web3 users to the mechanisms of ERC404, in an accessible way. This approach facilitates both a novel mechanism for liquidity management, as well as more engaged and diversified set of DeFi ecosystem participants. Key Functionalities: - Fractionalized Liquidity - The protocol implements ERC404 to drive generic fractional token liquidity into composable and identifiably-unique whole-tokens. - Decay Pools - The protocol implements novel forms of staking where generically-fractionalized liquidity is gathered into capped-size pools and re-constructed into whole-token vaults in order to mine Optimized Integrated Liquidity. - Optimized Integrated Liquidity - Optimized Integrated Liquidity (OIL) leverages ERC1155 composability to gas-consciously flow liquidity within and across the omnichain space. - Cross Chain Messaging - The protocol implements LayerZero's permissionless interoperability, and leverages ERC1155 composability, to deliver omnichain liquidity for both fractionalized and wholly-constructed tokens. - Gamified Narrative - The protocol engages DeFi participants, and encourages them to learn about ERC404, by wrapping the technology in a real-world mental model: Oil Rigs. Objective: The primary objective of Riggers [Rig & Oil] is to expand on the ERC404 fractionalized-liquidity standard by introducing ERC1155 composability, decayed staking pools and cross-chain messaging. Conclusion: Wrapping the complexity of 404 with gamified tokenomics, Riggers is introducing everyday web3 users to the mechanisms of ERC404, in an accessible way. This approach facilitates both a novel mechanism for liquidity management, as well as more engaged and diversified set of DeFi ecosystem participants.","links":"https://www.riggers.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/riggers/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2b91c5a73b7c4a70a61536429a2bf45461d85b27"}}}