{"name":"Pop Token","id":"pop-token_binance-smart-chain","symbol":"ppt","description":"Through democratizing content ownership and powering the AI creator economy, Pop will bridge the gap between traditional social media and the Web3 shared social experience to bring the next billion users to Web3. Pop Social is your AI-Powered Social Gateway to Web3. The platform will play a fundamental role in the future of creativity, empowering both creators and users on its platform by rewarding them with Pop Tokens for actively engaging with the app. Pop will redefine how we interact with one another by bringing a new approach to social media and elevating the global push toward social decentralization. Pop creates a unified social identity SBT for users through its Chain Agnostic Social Identities, bridging fragmented centralized identities from traditional platforms and technical Web3 protocols to unite decentralized global communities. Traditional social media platforms have built up the creator economy over the years and helped to empower the previous generation of creators; however many glaring problems still remain. Pop targets the pain points of both content creators and social media users to turbocharge the next generation of creators. Content creators face three major problems, equitable monetization, ownership of content and accessibility of organic engagement. Social media platforms’ primary revenue drivers are advertising and monetization of user data. On traditional platforms, most of this value goes directly to shareholders of the company rather than creators and users who actually helped to create the value. Through tokenization, NFTs and our social engagement mechanism, Pop aims to distribute value to those who actually create value for the platform and drive the network effects in the first place. The Pop Token acts as a catalyst for ecosystem interaction and adoption, creating a flywheel effect for platform traction and building a deeper level of engagement between creators and users. In addition, on traditional platforms content creators ma","links":"https://www.popsocial.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pop-token_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xdf061250302e5ccae091b18ca2b45914d785f214","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xdf061250302e5ccae091b18ca2b45914d785f214"}},"is_native":false}