{"name":"ParaState","id":"parastate","symbol":"state","description":"ParaState is participating in ETH2.0 PoS Staking with a new tech stack called SafeStake, a trust-minimized middle layer fostering the decentralization of ETH2.0 staking. SafeStake is a non-custodial infrastructure and protocol for distributed validator technology (DVT). It is written in Rust, utilizes a Threshold Signature architecture, and uses HotStuff for consensus (more robust than iBFT or qBFT). It will provide the ultimate in security, fault tolerance, and decentralization for those who want to earn ETH 2.0 staking rewards (stakers running validators). SafeStake works by securely splitting a validator key into shares and distributing those shares to multiple operator nodes. With this technology, Ethereum validators can now run on multiple nodes instead of just one without violating protocol rules that will result in slashing. In the SafeStake ecosystem, multiple node operators work together in a permissionless, trustless way to: 1) reach consensus, where 3 out of 4 nodes are required to reach consensus and produce a valid data signature equivalent to that of the original key; and 2) ensure validators are online to perform duties, where 1 out of 4 nodes can be offline, unavailable, or compromised, and still reach consensus. Additionally, the built-in, proprietary DKG (distributed key generation) protocol provides top-level security, ensuring no single node operator ever has possession of or is able to recreate the original validator key. SafeStake’s unique implementation of the DKG protocol for configuring public/private key pairs in the threshold signing scheme without relying on a ‘trusted dealer’ is a critical technology feature that enables a fully decentralized, non-custodial solution for ETH2.0 staking.","links":"https://www.parastate.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/parastate/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xdc6104b7993e997ca5f08acab7d3ae86e13d20a6"}}}