{"name":"BetterFan","id":"betterfan","symbol":"bff","description":"Better is a play-to-earn game for sports betting which rewards users' knowledge of sports. Unlike the traditional betting systems, Better is not gambling, it's a gamified web3 sportsbook ecosystem Our mission is to fight against the harmful effects of gambling addiction. We gamify the sports betting industry with the power of blockchain technology for GOOD. Fan Cards Better’s core is Fan Cards which allow players to create bets. One Fan Card allows players to place one daily bet. Consequently, the more Fan Cards players hold, the more daily bet slips they can create. There are four different types of Fan cards in the Better ecosystem: Rookie Epic Champion Legend. In the first instance of Better, only rookie cards are available. Energy Mechanism Each Fan Card starts with 100 energy points. With every valid bet, energy points decrease. As a result, players need to restore energy points by burning $BTB. Otherwise, penalties are applied to your card attributes. Fan Cards Level Players can level up their Fan Cards by burning $BTB. Every level requires different amounts of $BTB and time. Some levels may require $BFF Tokens. Higher-level cards will have higher-level card ratio Gem Slots Every Card has 4 different card slots. Users can unlock them at certain levels. In order to unlock gem slots, users are required to burn BTB Tokens. Fan Card Minting Fan card minting events only can be executed by players. In order to mint(breed) new cards, players need to use 2 mintable cards. Every card has a mint count limit of seven. This means one card can be used a maximum of seven times in a minting event. Users are required to select a fan card from their deck and tap to the mint button. Depending on their mint count and rarity, every card requires different amounts of BTB and BFF tokens. The BTB and BFF costs of minting increase as the mint count rises. Gems There are 4 different types of Gems and every one of them has their own different attributes. Users can either use","links":"https://better.fan","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/betterfan/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}