{"name":"node.sys","id":"node-sys_binance-smart-chain","symbol":"nys","description":"Node.sys is a decentralized IoT platform with its own token. We unite people, companies and devices from all over the world into a global DRepRap factory of the Internet of things. Node.sys aims to create a platform for building a decentralized self-replicating Internet of Things (IoT and IIoT) based on the Cellframe blockchain. Node.sys integrates the physical world of things with Web3. Node.sys is a platform that connects people, companies, devices, cloud computing, analytics and software into a self-replicating, decentralized factory that manufactures products both for the established Internet of Things (IoT) and for the emergent Industrial Internet of things (IIoT). The goal of the project is to enable people, regardless of their location and at minimal cost, to implement a scalable production system. This system will facilitate the decentralized production of physical objects and devices used in everyday life and industry. Internet of Things (Internet of Things, IoT) is a system that connects devices into a computer network and allows them to collect, analyze, process and transmit data to other entities through software applications and technical solutions. Industrial Internet of Things (Industrial Internet of Things, IIoT) is the Internet of Things for corporate and industrial applications. It is a decentralized system that integrates machines, cloud computing, analytics and employees to increase the efficiency of industrial processes.","links":"https://nodesys.io/","market_cap":1434790,"market_cap_rank":3321,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/node-sys_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x279960f9cb21965b33ad3f3ced07349363cb2030","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x279960f9cb21965b33ad3f3ced07349363cb2030"}},"is_native":false}