{"name":"HYME","id":"hyme","symbol":"hyme","description":"HYME is the first scroll-to-find crypto search platform. With HYME, you can delve into the world of crypto projects with excitement and engagement. We believe that by presenting projects in a visually appealing and cinematic manner, we can make learning about cryptocurrencies more accessible, engaging, and entertaining. We are revolutionizing the way you explore and discover crypto projects by providing a seamless and immersive experience that brings the world of cryptocurrencies to your fingertips. At HYME, we understand that traditional methods of searching for crypto projects can be time-consuming and inefficient. Endless clicks, multiple tabs, and complex navigation can hinder your journey of discovery. That's why we've designed a unique scroll-to-find feature that makes exploring the crypto universe as easy as scrolling through your favorite social media feed. Our scroll-to-find technology enables you to seamlessly glide through an extensive list of crypto projects, ensuring that you never miss a hidden gem. As you scroll, you'll be captivated by visually stunning trailers that provide a glimpse into the excitement, innovation, and potential of each project. We believe that information should be accessible, engaging, and entertaining. By presenting crypto projects in the form of captivating trailers, we transform the way you learn about cryptocurrencies. Dive into the action, drama, and stories behind each project, immersing yourself in the fascinating world of decentralized finance, blockchain technology, non-fungible tokens, and more. HYME is more than just a search platform. It's a community-driven hub where crypto enthusiasts, investors, and curious explorers converge. Join a vibrant community of like-minded individuals, share insights, ask questions, and participate in discussions that empower you to make informed decisions in the crypto space.","links":"https://hyme.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hyme/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4c61d70c0089d708040919aac7bdd600da72bc81"}}}