{"name":"Emorya Finance","id":"emorya-finance","symbol":"emr","description":"Emorya is an innovative platform that combines sports and blockchain technology to provide users with a unique and rewarding experience. Through the user-friendly Emorya mobile application, individuals can pursue better health and financial success. Our goal is to offer people worldwide the chance to earn money while living life on their own terms, using a virtual currency called $EMRS, which is earned by tracking calories burned throughout the day. Emorya in the MultiversX Blockchain: Emorya thrives within the MultiversX blockchain, known for its scalability and security. Two tokens, $EMR and $EMRS, work seamlessly together within this ecosystem. $EMRS is earned through physical activity milestones tracked in the Emorya app, while $EMR represents a path to withdrawal and financial freedom. The value of these tokens increases with each transaction, making them attractive for both users and investors. Financial Independence and Prosperity: Emorya offers unprecedented opportunities for individuals worldwide to enhance their prosperity while embracing an active and healthy lifestyle. By adapting to technological and economic changes, Emorya aims to provide financial independence to people globally. The program operates by rewarding users with $EMRS coins, which can be converted into $EMR currency through the app. Conversion Process: The Emorya Sports App tracks daily calorie consumption, granting users $EMRS coins based on their progress. Converting $EMRS to $EMR is a simple process through the app's intuitive interface, with a 3% conversion fee. The $EMRS coin holds an intrinsic value of 30% of the market capitalization attributed to the $EMR coin, injecting significant value into the digital asset. The First Hyper Deflationary concept with supply limited to 1 Million. The STOP Burn Concept was designed so that if the total supply of EMR will reach 1 Million, all of the Burn Functions of EMR will be Halted making EMR more RARE and VALUABLE and also making from EMR","links":"https://emorya.com","market_cap":275339,"market_cap_rank":3454,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/emorya-finance/logo.png","detail_platform":{"elrond":{"decimal_place":9,"contract_address":"EMR-d10ed9"}}}