{"name":"Limited Euro","id":"limited-euro","symbol":"leur","description":"What Is Limited Euro (LEUR)? The unlimited supplies of fiat currencies in circulation and printing in 2021 have caused inflation and further decreased their value. Limited Euro (LEUR) is a cryptocurrency with a maximum supply of one billion coins. LEUR was created on December 11, 2021 on the XRP Ledger (XRPL), which is one of the most advanced, secured and decentralized blockchain networks in the world with the fastest transaction time and cheapest fee. LEUR is one of the cryptocurrencies under the Limited Currency project that is managed and operated by a community of cryptocurrency enthusiasts, with a mission to make the Euro and other countries’ currencies great again. Who are the founders of Limited Euro (LEUR) The Creator of LEUR and also the Founder of Limited Currency project is a proud retiree from the U.S. Army and the U.S. Department of State, with 25 years of public services serving around the world. What Makes LEUR Unique? The founder keeps 7% and wishes to donate the other 93% of the Limited Currency supplies to the general public through airdrops and rewards, and to those helping its ecosystem grow. There are 180 known fiat currencies in the world, of which Limited USD (LUSD) and Limited Euro (LEUR) were already created. To qualify for the LEUR airdrops, one needed to hold a minimum of 50,000 LUSD for the first 300 million LUSD airdrop and a minimum of 100,000 LUSD for the second 200 million LEUR airdrop. The current airdrop and distribution method helps stabilize LUSD and LEUR prices and pave the way for the other Limited Currency coins to grow and be on the same level playing field. Limited Currency is a unique project on the XRPL. Limited Euro (LEUR) is not a stablecoin but a cryptocurrency, where its value could be worth more than one Euro depending on the demand and supply for its one billion coins.","links":"https://limitedcurrency.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/limited-euro/logo.png"}