{"name":"The Essential Coin","id":"the-essential-coin","symbol":"esc","description":"What Is The Essential Coin (ESC)? The Essential Coin is a utility ecosystem that provides rewards to long term holders. The Essential Coin is focused on continuous, sustainable and steady growth. Our main objective is to offer as much value and utility to our community members as possible. Our roadmap includes a governance system that will enable you to have a say in the project’s decisions, a staking platform, farming tools to earn more income, an advanced NFT Marketplace (named Epoch) where you can mint, trade, showcase, auction and stake your NFTs, and a swap platform, all of which will be centrally connected to the ESC token. We also have a set of unique physical NFTs which our members can buy and trade on our platform. We aim to put our tokens to real life use to keep generating new revenue streams for the holders! The Essential Team Our team is international, consisting of people with various expertise and proven track records. We have experienced developers, marketing and promotions managers, graphic designers, and international liaisons. More importantly, we have a bonded relationship that is necessary to keep us going to deliver as promised. The team is doxxed and has been KYCed with various organizations. Project Security The Essential Coin project smart contract is now locked for 52 years thus no changes are possible to any taxes and no transfer of ownership is possible resulting in a secure environment for our investors, we have effectively renounced our ownership. There are no ownership privileges available to the contract owner/team. The Essential Coin does not have a single dev wallet which controls the project. The marketing wallet is a multi-sig Gnosis Safe which requires multiple approvals to carry out any transaction. What makes The Essential Coin unique? ESC has delivered what has been said and described in the roadmap and will keep delivering. The project has completed two audits by reputed firms, Certik and TechRate with no critical findings and passed those audits with flying colors. The ownership of the contract is renounced so no owner privileges are available to the team. With many utilities planned our ultimate goal is to have our own BLOCKCHAIN and become one of the top ten altcoin. The Essential Coin (ESC) has been listed on Lbank (CEX) and plans to list on many other exchanges.","links":"https://theessentialcoin.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-essential-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4c48cca6153db911002f965d22fdefcd95f33be9"}}}