{"name":"CloudCoin Finance","id":"cloudcoin-finance_binance-smart-chain","symbol":"ccfi","description":"What Is CloudCoin Finance (CCFI)? CloudCoin Finance is the next-generation cross-chain & multi-chain decentralized finance, market maker, trading, and liquidity provider DAO driven powered by CCFI Token CCFI is the native utility token that is used for: * Token payments, CloudCoin Finance has its own payment system that can be added to any website. * Running validator nodes on the network via staking CCFI tokens. * The project's strong business cases including IoT, AI, and Green Energy powered by Hydrogen. * Used for governance votes to determine how network resources are allocated. CCFI features include: * Governance * Launchpad * Staking * Liquidity Providing * Farming * NFT Marketplace * Bridges to over 18 blockchains NULS, ETH, HECO, OKC, ONE, Polygon, KCC, TRON, CRO, AVAX, AETH, FTM, Metis, IoTex, Optimism, Klaytn, ENULS, KavaEVM, with more will be added, meaning that the tokens can be swapped with very low fees between blockchains * RaidaPay App * CCFI Launchpad App How Many CCFI Tokens Are There in Circulation? CCFI launched its main net on the 1st of August, 2021 with 1,428,160,512 CCFI tokens created at Genesis. The supply is fixed, it will never be increased, there are no transaction fees, and plans for burning. The swaps of tokens between the blockchains are done within the total fixed supply of 1,428,160,512 CCFI tokens. Who Are the Founders of CloudCoin Finance? CloudCoin Finance is supported by a team of 10 tech, and non-tech professionals based in Germany, The Netherlands, United Arab Emirates, and Romania. Where Can I Buy CloudCoin Finance (CCFI)? CCFI is available for trading on a growing number of exchanges, with cryptocurrency and USDT pairs currently available.","links":"https://ccfitoken.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cloudcoin-finance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x3439baa16ad653f644fb9f1781113d80590542a5","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x3439baa16ad653f644fb9f1781113d80590542a5"}},"is_native":false}