{"name":"Laika","id":"laika","symbol":"laika","description":"Introduction: After the anonymous article introduced the public to Laika, a community of previously misled investors came together to start a movement. Laika is about spreading awareness to retail investors about the dangers and common marketing schemes that are being used to promote projects in the space. Laika encourages investors to do more research, become better informed, and to better protect their crypto assets. Here’s to Laika, the unwanted, undesirable, kicked and curbed canine that, in spite of all her misfortune ended up being the hero we not necessarily deserved, but needed. What is Laika? Laika was the first ever dog sent to space, now reincarnated into a cryptocurrency coin. She has inspired hope in her previous life as a symbol of exploration and courage. Laika was launched on the Ethereum network. The community is known as the LaikaArmy, their role is to dictate and determine the future of the project, taking the necessary steps to reach new goals and milestones. What makes Laika unique? Laika is the first coin to shed light on the dangers and scams happening throughout the crypto space. Laika wants to introduce the concept of believing in the coin and not the founder. She aims to inform and rally a community of investors behind our noble cause. Laika is a 0% tax token and the liquidity and seed phrase have been burnt. The admins of Laika will set a lead to make funds for marketing such as a donation multisig, merchandise, potential launchpads, and more. As the coin develops, we are striving to achieve listings on large exchanges, onboard influencers, and spread general awareness of the potential dangers in the space. Our main goal is to inform and protect retail investors and to reignite their confidence in the space.","links":"https://www.laika-token.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/laika/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x77f9cf0bd8c500cffdf420e72343893aecc2ec0b"}}}