{"name":"Metahorse Unity","id":"metahorse-unity","symbol":"munity","description":"What is Metahorse Unity (MUNITY)? A Unified Token for a Trilogy of Horse-Themed Games: MUNITY is the cornerstone of a vibrant gaming ecosystem related the horses. Developed by Hungri Games and led by former directors from Garena Free Fire(1 billion+ players) and the Game of Thrones Winter is Coming game. It seamlessly merges three distinct yet interrelated horse-themed titles - Stutengarden, a Horse Catching RPG; Metahorse Unity, world’s first mobile Horse Racing RPG; and M-Deed, a Horse Farm Trading Game. Munity serves as the universal token across all these platforms, creating a cohesive and immersive gaming experience. What makes Metahorse Unity (MUNITY) unique? How our technology & project concept differs from existing competitors in the market.: World’s First Mobile Web3 Horse Racing Game Hybrid Genre Focus: horse racing could involve strategic choices, skill trees, or storyline arcs that impact racing outcomes. Advanced Mechanics: Including mechanics like level progression effects, track conditions, and horse class could add a level of complexity that other games lack. FreetoPlay: Core free to play business model to be able to attract mass gamer audience on mobile platform NFT / Web3 Integration: NFT-based ownership for horses, gear, or stables could be a unique feature. Community Involvement: First e-sport focus web 3.0 game title worldwide. Multi-platform Experience: Cross-platform playable client: Android, iOS, PC. First multiplayer horse racing mobile game title in the gaming industry. Narrative Depth: Narrative content for quests, classes, comic books and all in-game content. Quality and Art Style: A unique art style or exceptionally high-quality graphics. Global & Local Events: Regularly scheduled global competitions and local events that allow players to earn unique rewards.","links":"https://www.metahorseunity.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metahorse-unity/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}