{"name":"SOLARIX","id":"solarix","symbol":"solarix","description":"META NEBULAS is a platform formed by few components such as Social Mining, DeFi and NFT, we termed it as the SocialFi NFT Platform. “Meta” from META NEBULAS was derived from the Greek μετα-, meta-, meaning “after” or “beyond” which is a prefix meaning more comprehensive or transcending; the word “Metaverse” is made up of the prefix “meta” and the stem “verse”; the term is typically used to describe the concept of a future iteration of the internet, made up of persistent, shared, 3D virtual spaces linked into a perceived virtual universe. “Nebulas” from META NEBULAS was derived from “Nebula” which describe any diffused astronomical object, including galaxies beyond the Milky Way. Some nebulae (more than one nebula) come from the gas and dust thrown out by the explosion of a dying star, such as a supernova. Nebulae exist in the space between the stars—also known as interstellar space. In the era of rapid technological development in the 21st century, the reproduction of the human race has reached 12 billion people. The development of human civilization and technology is advancing at a cross-age speed, but it ignores the ecological order of the mother of the earth that gave birth to mankind. Mankind was forced to abandon this 4.5-billion-year-old earth and move to other planets in the galaxy. META NEBULAS is the most advanced aerospace technology. Humans only need to exchange META NEBULAS Universal Currency (iONZ) to purchase tickets to board the Noah’s Ark space capsule (NFT) and complete human rescue missions to obtain and accumulate experience points (SOLARIX) to travel to the metaverse. In META NEBULAS, we gather humans and ensure that we blend into other planets in order to discover more. Hence, this is why we have gathered Social Mining, DeFi and NFT in just one platform, which is META NEBULAS. META NEBULAS can bring about the meaning of ‘beyond the interstellar space’ and as we are a SocialFi project; needless to say, it’s SOCIALIZE AND EARN!","links":"https://metanebulas.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solarix/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0xfdce54744801c9eb88d8445673ad267f8d43a9ee"}}}