{"name":"Mother of Memes","id":"mother-of-memes-2","symbol":"haha","description":"HAHA is the Mother of Memes — literally. In Japanese, “HAHA” means “MAMA\" and is the original meme coin of the Astar Network! Created by the OG Astar community Good Kids on the Astar zkEVM network, MAMA is now bringing the laughs to Soneium. Community The HAHA community is made up of Good Kids from all corners of crypto — builders, memers, and degens who believe laughter is serious business. The project fosters creativity through community-led projects, playful campaigns, and burn events that bring everyone together to make the Mother of Memes proud. HAHA keeps finding new ways for the community to join in, have fun, and help keep the supply tight. Tokenomics Initial Supply: 100 trillion • 60%: Initial Liquidity – Fuelling the Meme Economy • 23%: Degeneration Campaigns – Spreading the Laughter • 15%: Project Development – HAHA never stops improving • 2%: Liquidity Providers – Supporting the early builders HAHA is Deflationary by Design • LP Fee Burns - The $HAHA rewards earned by team liquidity pools are burned to keep the supply tight and deflationary, ensuring lasting token value! • Community Burns - Gather the troops! These events bring the HAHA community together to torch tokens, boost value, and celebrate the burn together! • Degen dApp Burns - Community created dApps to burn $HAHA faster than you can say MAMA, adding an extra layer of fun and chaos to HAHA’s deflationary design! • Contract Burn Feature - The ultimate power: burn your own tokens straight out of existence, shrinking the total supply forever. No dead wallets here – just annihilation!","links":"https://hahacoinsoneium.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mother-of-memes-2/logo.png","detail_platform":{"soneium":{"decimal_place":18,"contract_address":"0xa8feaae65c44b458a16ea4e709036a2ee85d073a","geckoterminal_url":"https://www.geckoterminal.com/soneium/tokens/0xa8feaae65c44b458a16ea4e709036a2ee85d073a"}}}