{"name":"SeatlabNFT","id":"seatlabnft","symbol":"seat","description":"SeatlabNFT is an NFT ticketing marketplace where people can issue event tickets and other collectable assets as NFTs. We're helping increase the connectivity between artists, fans, event organisers and brands to create a more immersive experience for event-goers. For the first time, artists and event organisers can create real value from their relationships with attendees by identifying and rewarding loyalty and event attendance with collectable NFTs and real-life rewards. Rewards Centre Simply by holding our token in a wallet connected to SeatlabNFT, users will accrue points, redeemable via the Rewards Centre. The Rewards Centre is easily accessible through the user dashboard and gives $SEAT holders access to a variety of exclusive perks. There are three different types of points that you can earn: Sapphire, Gold and Holographic. The type of points you’ll earn are based on the number of $SEAT tokens you hold in your wallet; Holographic is the top tier, Gold is the middle tier and Sapphire is the base tier. Booking Fee For artists and event creators, selling NFT tickets on SeatlabNFT is completely free. To do this and cover our running costs, we automatically charge a 6.5% booking fee, added to the price of every ticket and collectable sold on SeatlabNFT. Of course, booking fees are pretty standard for all ticketing platforms, but we wanted to make our costs as pain-free as possible for fans and those putting on the show. The booking fee is split three ways; 2.5% goes to the SeatlabNFT treasury, another 2.5% is paid out as rewards to those who stake their $SEAT tokens (more on this in a moment), and 1.5% is a credit/debit card processing fee. Booking Fee Reduction for $SEAT Holders Holders of $SEAT benefit from a reduced booking fee, which scales with the number of $SEAT tokens they hold.","links":"https://www.seatlabnft.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/seatlabnft/logo.png","detail_platform":{"near-protocol":{"decimal_place":5,"contract_address":"token.stlb.near"}}}