{"name":"Wanchain","id":"wanchain","symbol":"wan","description":"Wanchain seeks to link the present to the future, through the exploration and implementation of blockchain technology. Wanchain aims to build a distributed “bank”. Just as traditional banks are the infrastructure of the current financial framework, Wanchain seeks to build a new, distributed infrastructure of digital assets to form an improved, modern framework - an ambitious goal indeed. Wanchain connects and exchanges value between different blockchain ledgers in a distributed manner. It uses the latest cryptographic theories to build a non-proprietary cross-chain protocol and a distributed ledger that records both cross-chain and intra-chain transactions. Any blockchain network, whether a public, private or consortium chain, can integrate with Wanchain to establish connections between different ledgers and perform low cost inter-ledger asset transfers. The Wanchain ledger supports not only smart contracts, but also token exchange privacy protection. With Wanchain, any institution or individual can set up their own virtual teller window in the “bank” and provide services such as loan origination, asset exchanges, credit payments and transaction settlements based on digital assets. Under the guarantee of “banks” based on the blockchain infrastructure, more people can participate in financial services based on digital assets. To describe it more accurately, Wanchain is a distributed super-financial market based on blockchain. Wanchain uses the Locked Account Generation Scheme to secure funds and keys when there are multiple parties involved. Based on Shamir’s Secret Sharing Scheme, it effectively breaks up a key into shares and distributes it to all included participants. The Storemen are responsible for maintaining and managing the appropriate key shares of the locked accounts for transactions. This method of key share distribution has a few benefits. Because Wanchain generates locked accounts through multi-party computations, there’s increased decentralization. And there’s more stability because you don’t need every key share to produce a signature for a locked account. If some of the Validators are offline, transactions can still be executed with a minimum number of shares. Finally, any transaction with a locked account is done via the original chain. This means that any chain can easily integrate and interact with Wanchain without the need for new transaction types or validators. The Wanchain Foundation is a non-profit organization primarily operating out of Singapore but also has a significant presence in Austin, TX. Wanchain was founded by Jack Lu, a respected player in the blockchain space. Before his current role, Lu co-founded <a href=\"https://www.coingecko.com/en/coins/factom\">Factom</a> and started Wanglu Tech, a blockchain application development company. Wanglu Tech has been a primary contributor to the open-source Wanchain project. Dustin Byington serves as the Wanchain President. Byington is a blockchain veteran having founded Bitcoin College in 2014 as well as co-founding Tendermint, a software mechanism to securely and consistently replicate applications across machines. Byington also co-founded Satoshi Talent, a platform to connect blockchain entrepreneurs with developers. WAN tokens were initially distributed as ERC-20 tokens to ICO participants, but it’s now possible to exchange these for tokens on the Wanchain mainnet or buy them directly. It’s a common misconception that WAN is an ERC-20 coin. Wanchain is a pioneering and potentially disruptive project with its sights set on becoming a super financial market of the world. Although achieving its lofty goal(s) is going to require a lot more work, Wanchain is further along its roadmap than some projects. But there’s still a good bit of “in theory” going on here. As Wanchain is addressing the whole financial market, it has a number of competitors. Most notably <a href=\"https://www.coingecko.com/en/coins/fusion\">Fusion</a>, Pantos, <a href=\"https://www.coingecko.com/en/coins/ark\">Ark</a>, and <a href=\"https://www.coingecko.com/en/coins/qash\">Qash</a>; some may even consider big players the likes of <a href=\"https://www.coingecko.com/en/coins/ripple\">Ripple</a>, <a href=\"https://www.coingecko.com/en/coins/stellar\">Stellar</a> and <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> competitors. On the positive side, Wanchain has strong fundamentals, they’ve got a functional mainnet, the vitality of their use case is indisputable, the huge interest in their ICO showed a powerful vein of investor confidence, and the team has a track record of success.","links":"https://wanchain.org/","market_cap":27392207,"market_cap_rank":733,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wanchain/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}