{"name":"DiviDoge","id":"dividoge","symbol":"dvdoge","description":"Launched on August 14, 2023, by a globally distributed team led by a transparent founder, the DiviDoge project integrates the realms of tokenomics, Non-Fungible Tokens (NFTs), and GameFi into a singular, cohesive platform. The primary currency of this platform, $DVDOGE, functions not just as a transactional medium but also as the core of several unique mechanics within the ecosystem. Holders of this token are privy to benefits derived from a well-structured reward system. For instance, token holders accrue dividends from their BabyMilo NFTs, which further incentivizes the retention and utility of both the token and the NFTs. The BabyMilos, on the other hand, stand as distinct NFTs that can be collected, traded, and utilized within the ecosystem. These are not merely digital art pieces; they are interactive assets. Owners of BabyMilo NFTs can engage with them through a GameFi environment, introducing an additional layer of activity and utility. By taking their BabyMilo for virtual walks or engaging in other activities within the GameFi segment, users can earn rewards in the form of $DVDOGE tokens. Beyond gaming and NFT features, DiviDoge is grounded in a sense of community participation. A Decentralized Autonomous Organization (DAO) system has been implemented to encourage democratic decision-making. Those invested in the project can partake in voting processes, suggesting and deciding on future developments or changes to the platform. A unique aspect of the DiviDoge launch strategy involved a pre-sale phase where whitelisted addresses could mint $DVDOGE directly. This whitelisting approach incorporated added benefits for those holding a specified amount of $DIVI on the Ethereum blockchain. To further incentivize diverse participation, bonuses were structured for those minting using Ethereum, while those utilizing $DIVI enjoyed discounts. It's worth noting that the DiviDoge project is built with an emphasis on transpare","links":"https://dividoge.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dividoge/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x027bf54126482b66b0f26a680f03029db3de37aa"}}}