{"name":"CPUcoin","id":"cpucoin_ethereum","symbol":"cpu","description":"CPUcoin is building the sharing economy of compute (CPU and GPU) to power Web 3, High Definition NFT capability and Generative AI in an eco-friendly way. CPUcoin has the benefit of 300 man years of development with over 100mil invested in the base technology, which has been licensed from Equilibrium. This original partnership provided the basis for robust Proof of Productive Work (PoPW) mining software that can wrap and control any back-end service to create scalable delivery of solutions in a sharing economy fast. We are like the “AirBnB” of computing power, and our services are needed by any and all companies with a scaling AI business. Our solution is uniquely suited to handle scaling on-demand creating and delivery of text to image, image to image, language model response AI (SophiaVerse), dynamic middleware to power next generation high-definition NFT’s (Venkman project with Bill Murray), and pushing content processing and delivery of image, video, rendering of text in any language, compositing, etc etc. There’s virtually no limit to what we can put in the platform to auto-scale and deliver results for our customers….but at least one-tenth the price of any other cloud service provider. 1/10TH! How do we do this? The miner network is global and deterministic, which means we can bill on-the-fly without any pre- provisioning and we don’t have the up-front cost of having to spend for capital equipment costs. It just scales and works automatically with our CGN nodes managing the routed traffic.","links":"https://cpucoin.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cpucoin_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6d52dfefb16bb9cdc78bfca09061e44574886626","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x6d52dfefb16bb9cdc78bfca09061e44574886626"}},"is_native":false}