{"name":"Bullieverse","id":"bullieverse","symbol":"bull","description":"\"Bullieverse is an Open Metaverse developed for the community of players and creators. It is built for the Web 3.0 citizen to have an immersive environment. As a result, gamers enjoy an out-of-the-world experience combined with a transparent and fair monetization mechanism that underpins our play-and-earn economy. Furthermore, it is powered by an easy-to-build 'low code' platform for community members creating and publishing games. The result is a high-quality gaming platform, where users come to both play and earn, but more importantly, experience it. In line with the spirit of Decentralized Autonomous Organizations (DAO), Bullieverse will evolve into a community-owned Metaverse. This will be achieved as players and game creators start getting the Bull tokens. These fundamental principles set Bullieverse apart and make it 'The Metaverse,' and not just 'A Metaverse.' Decentralized Governance Immersive User Experience Fair Compensation for users Seamless Game Creation Digital Asset Ownership Bullieverse is built on a strong and loyal community base earned by high-quality experiences. Our community will be able to enjoy the following activities on the platform. Play Earn Own Experience At heart, Bullieverse is a gaming ecosystem. But we believe in compensating our community for their time and loyalty. Our users can not only own NFTs but can also use the NFTs to play our games. Our asset owners can rent and lease their assets to others in the community. The Metaverse can also host events and experiences that our community can enjoy and cherish. In due course, we will also be able to interoperate with other Metaverse economies. The launchpad for the entire vision would be through building a loyal and crypto native community that loves our dope NFT designs, immersive gameplay, and simple game creation mechanisms.\"","links":"https://bullieverse.com/","market_cap":1941231,"market_cap_rank":2175,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bullieverse/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x9f95e17b2668afe01f8fbd157068b0a4405cc08d"}}}