{"name":"Unobtainium","id":"unobtainium","symbol":"uno","description":"What Is MXBOX protocol (MXBOX)? MXBOX, based on the BNB smart chain, is an aggregated public interface involving GameFi, NFT, SocialFi and DeFi for Metaverse. The network runs on Proof-of-Space (PoS), a cryptographic technique where users show a legitimate interest in a service by allocating unused hard drive space to solve a challenge presented by a service provider, and PoA (Proof of Activity) consensus mechanism, which aims to ensure that all transactions occurring on the blockchain are genuine. To learn more about this project, check out our deep dive of MXBOX. This open-source project aims to create an entrance to the Metaverse with the physical world + virtual world + digital information highly integrated. It has two types of tokens, MXBOX and UNO. MXBOX token is designed as the governance token to ensure that owners can participate in the governance votes or operation of the network. UNO serves as the utility token that is mainly used for fees for processing transactions, NFTs upgrades and contributing to the architecture of Web 3.0. How many MXBOX and UNO coins will be in circulation? There will be 210M MXBOX to be minted. The initial mining capacity is 100%, and every 2 years the amount is reduced by half of the total amount till it is fully mined. In the MXBOX ecosystem, there are several types of fees (UNO) that are generated in the Treasure DAO, which include fees for looting other users’ resources, fees for upgrading/synthesizing/repairing in-game avatar/equipment NFTs, and fees for trading in the marketplace. 90% of the Treasure DAO is awarded to node validators, governance workers, MXBOX contributors and community ambassadors. The other 10%will go to the team to cover future costs of development and upgrade, operation, and maintenance of MXBOX. What is unique about MXBOX? MXBOX is a new visualization environment that combines VR and AR technologies to create a seamless virtual-reality world with the physical world, virtual world and digital information highly integrated. MXBOX is not only a physical mining machine but also the first aggregated public interface involving GameFi, NFT, SocialFi and DeFi built on Web3, open to supporting enhanced reality products such as VR/AR, revolutionary HCI, etc. It can be considered the most realized solution to make Metaverse become reality. MXBOX’s highly compatible and transparent futures allow for the speedy development of an application system. Web 2.0 products can take advantage of MXBOX’s technical support as an effort to usher in Web 3.0 era. With innovatively diverse technology empowerment like AI, HCI, decentralized network, etc, MXBOX is greatly expanding: \"\"MXBOX + GAME\"\", \"\"MXBOX + EDUCATION\"\", \"\"MXBOX + MOVIE / LIFE VIDEO“, \"\"MXBOX + SOCIETY\"\", \"\"MXBOX + INDUSTRY\"\" and so on. Our most recent articles about MXBOX: https://mxbox.medium.com/genesis-avatar-nft-e8ad405afda7 https://mxbox.medium.com/what-will-mxbox-bring-to-2022-3bbabeb36df9","links":"https://mxbox.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/unobtainium/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf9372b1e797ece08ecf5597eba2a73ba61a28e94"}}}