{"name":"Etherempires","id":"etherempires","symbol":"ete","description":"What Is legends (FWCL)? Legends, is an open-world exploratory, action, strategic, intellectual and enigmatic game and collector of NFT cards that has been built on binance chain and will be published on personal computers and Mac and mobile phones (ios and android) until 2025. Game has been made for entertainment and obtaining income in legendary adventure which is rich in graphic, new technologies and excitement. Explore 11 stunning lands and discover catastrophic events that plunged land of legends into darkness and restore the land to its glory. How Does legenda Work? Legends Game token ($FWCL) is a BEP-20 token used in the Legends Game Metaverse. FWCL tokens are the fuel of the Legends Game economy. This token can be used to purchase in-game NFT items, earn Play-To-Earn rewards, and earn Staking rewards. FWCL tokens can be bought on PancakeSwap and CoinTiger What Makes legends Unique? Legends of Elysium offers a thriving game ecosystem which gives players a perfect combination of challenging entertainment with earning opportunities. 1.Prior to launch of the game, $FWCL holders may choose to stake $FWCL to access the liquidity mining program 2.Over 500+ characters, discover and possess mortal persons who govern this holy land and each one has synthetic synergy and extraordinary abilities. Update your cards and change them to powerful evolutions so that promote their power and value for battle to the max level so you can form unbeatable team of legends. 3.Allowing the community to participate in the DAO by passing proposals and voting. 4.The greater the size of the legends community, the greater the prospects of decentralised governance as well as a self-regulating community that discourages bad actors and manipulation of governance and the game. Once the game is launched, users can stake $FWCL as a signal of belief and support in the game and its governance model and receive access to governance and distributions from in-game fees. 5.Yield Farming: A total","links":"https://etherempires.io","market_cap":5999414,"market_cap_rank":1715,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/etherempires/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd27b128dc6536309cdebf7f1aff0cb7717bc0268"}}}