{"name":"Robonomics Network","id":"robonomics-network","symbol":"xrt","description":"What is Robonomics Network? Robonomics Network is a Web3 cloud platform designed to manage IoT devices and robotics, facilitating decentralized and secure interactions between humans and machines. It enables users to conduct techno-economic transactions and develop serverless IoT applications, with a focus on global accessibility, cybersecurity, and data privacy. Founded in 2017 by Sergei Lonshakov, Alexander Kapitonov, Alexander Krupenkin, and Alexander Starostin, the project now has over 50+ developers and engineers. Robonomics is operational on Ethereum, Polkadot and Kusama, and is compatible with the Robot Operating System (ROS), positioning itself as a pioneer in IoT, robotics and blockchain integration. Interested in the various use cases and possibilities with Robonomics Network? Discover more: https://robonomics.network/books/ https://robonomics.network/cases/ How does Robonomics Network work? The idea behind the project is to integrate robots and cyber-physical systems directly into the human economy by using smart contracts. Having an established infrastructure on Ethereum and Polkadot, Robonomics allows engineers of smart cities and industry 4.0 zones to build trust among autonomous robots and provides people with direct access to them for ordering products and services. Robonomics users can turn their IoT devices into autonomous economic agents. The robot gets a wallet address and thus the ability to receive payments for the work done or pay for the services of other agents with no humans or bank involved. Robonomics uses blockchain technology to provide transparency and standardize the interaction between the network members. The developers can create open smart contacts for further usage in IoT & Robotics projects, while others may build their applications based on these public contracts. Discover more about Robonomics: https://robonomics.network/ What is a Robonomics Network (XRT) token? XRT is the utility token for the Robonomics Network, designed as the fuel to power interactions and transactions within a decentralized IoT and robotics ecosystem. It enables robots and cyber-physical systems to operate autonomously within blockchain environments, allowing for efficient machine-to-machine and human-to-machine transactions. XRT can be used to pay transaction fees on the parachains or purchase subscriptions for priority IoT services. The token operates across the Ethereum, Polkadot, and Kusama ecosystems. Users can interact with decentralized applications (dApps) through XRT, engage with Robonomics’ parachains, or connect with IoT devices using the Robot Operating System (ROS) and AIRA OS. To ensure long-term sustainability, XRT incorporates mechanisms to manage inflation and includes token-burning protocols to help control supply and demand. For more details on XRT: https://robonomics.network/xrt/","links":"https://robonomics.network/","market_cap":5896664,"market_cap_rank":2219,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/robonomics-network/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x7de91b204c1c737bcee6f000aaa6569cf7061cb7","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x7de91b204c1c737bcee6f000aaa6569cf7061cb7"}}}