{"name":"VMS Classic","id":"vms-classic","symbol":"vmc","description":"What is VMS Classic (VMC)？ VMS Classic (VMC) is a groundbreaking blockchain-based platform powered by the Vehicle Mining System (VMS), which integrates cryptocurrency mining directly into all types of engine-powered transportation. This innovative system has been patented in Korea and the United States, with additional patent applications pending in eight other countries and the European Union. The core of VMS Classic lies in its unique mining method, which combines the GPU (Graphics Processing Unit) and ASIC (Application-Specific Integrated Circuit) technologies. This combination, known as GPU+ASIC=VMC, enables a dual mining approach that enhances efficiency and performance. The ultimate goal of VMS Classic is to create a fully operational \"mining car,\" where vehicles can mine cryptocurrency while on the move, creating a new form of mobile mining that is both sustainable and energy-efficient. The total supply of VMC tokens is capped at 500 million, ensuring a controlled and secure tokenomics model for the ecosystem. In addition to its core mining functionality, VMS Classic (VMC) provides a comprehensive ecosystem for its users. The project is actively engaged with its community through various social media platforms, offering regular updates and engagement opportunities. The VMC token is central to the ecosystem, enabling users to participate in the governance of the platform, pay transaction fees, and earn rewards. For those interested in exploring the technical aspects of VMS Classic further, the project's whitepaper outlines the details of the system's design and vision. Additionally, VMS Classic is listed on Etherscan, where users can track the token's performance and transactions. With its vision of a future mining car, VMS Classic is positioning itself as a trailblazer in the convergence of blockchain technology and transportation.","links":"https://www.vmsclassic.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vms-classic/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd0f3c49297a85c81bfe98bc0bdc966964c0e7173","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xd0f3c49297a85c81bfe98bc0bdc966964c0e7173"}}}