{"name":"XL1","id":"xl1","symbol":"xl1","description":"<!doctype html> <html lang=\"en\"> <head> <meta charset=\"utf-8\" /> <title>XYO Layer One — The first scalable blockchain built for data</title> <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" /> </head> <body> <article> <header> <h1>XYO Layer One: The first scalable blockchain built for data.</h1> </header> <section id=\"what-is-xyo\"> <h2>What is XYO</h2> <p>XYO is a reality bridge connecting real world data with web2 and web3.</p> <p>XYO is the first DePIN and trustless oracle, collects and verifies real-world data through a decentralized network of more than 10 million nodes, enabling Web2 and Web3 companies to integrate trusted real world information into their systems and also leveraging its proprietary Proof of Location and Proof of Origin technologies, which power applications in real-world assets (RWA), location-based gaming, geospatial intelligence, and other real-world experiences.</p> </section> <section id=\"what-is-xyo-layer-one\"> <h2>What is XYO Layer One</h2> <p>XYO Layer One is a data-focused blockchain built to verify and move verifiable real world information on chain for AI, DePIN, AI, RWA, Gaming and other applications.</p> <p>It uses a dual token design where <strong>XYO</strong> powers the contributors ecosystem, rewards, staking, governance and security, and <strong>XL1</strong> is the gas and transaction token that runs the XYO Layer One blockchain.</p> </section> <section id=\"xl1-utility\"> <h3>XL1 is the native utility token used for</h3> <ul> <li>Paying gas and transaction fees for all on chain activity. Activity burns a portion of fees.</li> <li>Powering smart contracts, dApps, and validator rewards on XYO Layer One.</li> <li>Incentivizing participation through staking and step based rewards inside the protocol.</li> <li>Bridging and wrapping for access on other chains.</li> </ul> </section> <section id=\"xyo-tools\"> <h3>XYO tools include</h3> <ul> <li><strong>XL1 Wallet</strong> to hold and use XL1 with XYO Layer One.</li> <li><strong>Explorer</strong> endpoints for testnet and mainnet.</li> <li><strong>SDKs and APIs</strong> across mobile and server languages to plug real world data into apps.</li> <li><strong>Public docs</strong> and a tokenomics guide that explain the dual token model and system overall.</li> </ul> </section> <section id=\"supply\"> <h2>How many XL1 tokens are there</h2> <p>At TGE there are <strong>38 billion</strong> XL1, with about <strong>7 billion</strong> initially circulating, subject to the final listing day snapshot. Long term inflation is around <strong>0.7%</strong> per year after the early emission era, and base fee burns plus slashing can offset issuance over time.</p> <p>Illustrative allocation and unlocks place the majority toward network emissions for node operators, with team and investor tokens on delayed cliffs and long vesting.</p> </section> <section id=\"differentiators\"> <h2>What makes the chain different</h2> <p><strong>Proof of Origin</strong> and <strong>Proof of Location</strong> let devices attest to proximity and data lineage, so apps can trust where data came from and how it changed before it reaches a contract. These proofs are created at the edge with bound witness, then anchored on chain for integrity.</p> <p>The architecture is built for high volume data. <strong>Step hashing</strong> and <strong>bound witness trees</strong> help compress and verify large flows, while the chain keeps a single shared ledger that supports parallelized work across apps.</p> </section> <section id=\"roadmap\"> <h2>Roadmap and status</h2> <p>XYO Layer One is live in testnet with public repos and docs available, with mainnet planned alongside the XL1 launch. Milestones include wallet releases, bridging, staking, and expanded SDK support.</p> </section> </article> </body> </html>","links":"https://xyo.network","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xl1/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}