{"name":"Omm","id":"omm-tokens","symbol":"omm","description":"Omm is a money market on the ICON blockchain. It operates as a DAO, with Omm Tokens (OMM) as its governance token. When staked, OMM grants the holder voting rights and a share of the staking rewards. You can earn Omm Tokens by using Omm: supply or borrow assets, stake OMM, or supply OMM liquidity to the Balanced exchange. The first Omm Tokens were minted on 26 August 2021 (48 hours after launch), and the supply increases daily. 1,000,000 OMM was distributed each day for 30 days, and it now maintains a rate of 400,000/day for the rest of the first year. The daily amount is then reduced by 100,000 each year, until year 5+ when the rate stabilises at 3% inflation. What is Omm? How is it different? Omm is a money market on the ICON Network. You can supply assets to earn interest, borrow against them for short-term loans, and earn Omm Tokens for doing so. Omm is primed to become the leading cross-chain money market. It can leverage ICON's interoperability capabilities to support assets from other blockchains, and offer the widest variety of markets for its users. And it can do that while providing fast and cheap transactions. Designed with new crypto investors in mind, Omm includes Bridge as a sign-in option. Bridge is a wallet that signs you in with an email address, and helps you convert fiat currency into USDS (Stably USD) to supply on Omm. USDS can be converted to US$1 through Stably, and holders can send it to their bank account any time. Benefits of the Omm DAO If you stake OMM, you have voting rights in the Omm protocol, and meta-governance rights for the ICON blockchain. You can vote for ICON public representatives (P-Reps), validators that operate \"nodes\" on the ICON blockchain, which affects the income they earn. Omm governance also allows investors to vote on proposals to change or improve the protocol, like adding new markets; funding community, growth, and security initiatives; and adjusting the token economics.","links":"https://app.omm.finance/#/home","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/omm-tokens/logo.png"}