{"name":"AIENGLISH","id":"aienglish","symbol":"aien","description":"What is the project about? AIEnglish is the world's first language learning platform that combines artificial intelligence and Web3 technology, designed to help users from non-English speaking countries learn English more conveniently and integrate into the global community. What makes your project unique? It is also your English learning companion, where you can summon a bot on AIEnglish anytime to practice speaking one-on-one, correct your grammar, and improve your English skills. History of your project. 1. We know that beginners who are not native speakers often have a sense of shame when talking to people in English, and talking to Ai can dispel this feeling. 2. Language is a very flexible and changeable thing. There are many ways to express a meaning. Traditional English teaching is relatively rigid, and there are established routines. If you do not follow this routine description, you may not get points. 3. Language environment, Ai can talk to you 24 hours a day and practice with you without any complaints. The fourth is very good versatility, breaking the geographical restrictions, not only the Chinese learn English, but also Japan, Southeast Asia, and the Middle East. What’s next for your project? Using artificial intelligence and Web3 technology, AIEnglish aims to provide users from non-English speaking countries with a more convenient, efficient, and personalized English learning experience globally, enabling them to better grasp English skills and improve their international communication and competitiveness. What can your token be used for? 1. Launch professional English courses in a single field (finance, medical, law, technology, etc.) 2. Integrate AiEnglish into smart speakers to cover more English conversation scenarios.","links":"https://aienglish.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aienglish/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x0d8f04522c5792c7378e39c92ab348f315f4fc4f"}}}