{"name":"ZetaChain","id":"zetachain","symbol":"zeta","description":"What Is ZetaChain (ZETA)? ZetaChain is a novel L1 that has chain-agnostic interoperability built-in (EVM-compatible, Cosmos/IBC, Bitcoin, Dogecoin, Tron, etc.). Developers currently use ZetaChain’s messaging capabilities to send data and native value (without wrapping assets) between any chains. ZetaChain will also support native smart contracts, which let developers build omnichain dApps that orchestrate funds across chains from a single contract. Who Are the Founders of ZetaChain? ZetaChain’s founder was an early Coinbase employee and one of the creators of Basic Attention Token (BAT). Investors include all major market makers, top exchanges, early Coinbase and Binance employees including Dan Romero, Sam Rosenblum, and John Yi, as well as major contributors to some of the industry’s most widely adopted protocols and well known funds, including Polygon’s JD Kanani. Advisors to the project include Coinbase’s first Head of People Nathalie McGrath who scaled the industry leading exchange from 10 employees to over 800, and Juan Suarez, who served as in-house counsel at Coinbase from 2013 to 2022. What Makes ZetaChain Unique? ZetaChain is a blockchain that connects everything. It enables interoperability between any blockchains or layers by providing cross-chain value transfer and message delivery, as well as native omnichain smart contract support. Applications built on ZetaChain — omnichain dApps (odApps) — can leverage liquidity and data on multiple networks and read and update state on all connected networks. ZetaChain’s native omnichain smart contract platform lets developers deploy contracts with the same ease as developing dApps for a single network like Ethereum, that orchestrate data and value across many or all chains. ZetaChain’s connectivity is chain-agnostic and can connect to and bring smart contract capabilities to even non-smart-contract chains like Bitcoin and Dogecoin.","links":"","market_cap":173947604,"market_cap_rank":270,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zetachain/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf091867ec603a6628ed83d274e835539d82e9cc8"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0000028a2eb8346cd5c0267856ab7594b7a55308"}}}