{"name":"Trice","id":"trice","symbol":"tri","description":"What Is TRICE(TRI)? Trice is an NFT marketplace that provides a virtuous cycle platform between consumers and suppliers distinct from other projects, resulting in increased transaction volume and ecosystem development. TRI token is paid as a reward to users who have staked SFL in Trice. The staked SFL will be used for operating and maintaining the TRICE platform. TRICE (TRI) is the governance token that is used for the following: NFT issuance and sponsorship Trice provides unique features for all users (creator, buyer, seller) on the platform. Trice's unique governance token \"TRI\" (ERC-20) allows users to become supporters of NFT projects issued by creators. For example, a user can donate a certain amount of TRI tokens (minimum amount of 100TRI) to the creator's support pool and receive a support point. If a user keeps a support point by the end of the project, they will receive up to 25% of the fees incurred by the creator's NFT sales. Furthermore, the sponsorship function provides a stable income for creators, providing an environment in which continuous creative activities are possible, and encourages sponsors to engage in IR activities to run a good project. To sum up, the Trice NFT marketplace provides a virtuous cycle platform between consumers and suppliers distinct from other projects, resulting in increased transaction volume and ecosystem development. Features of TRICE: - Lower Fee Trice offers a low transaction fee of 1% by default. In addition, if users are active in the Taycan network, which is Trice's mainnet, NFT minting and trading are available with a much lower gas fee than the Ethereum network. - NFT Trading on multiple networks - Cross chain - Trice DAO What's The Total Supply of TRICE? TRICE total supply is 1,000,000,000. TRICE Token Information Name: TRICE Ticker: TRI Base: ERC-20 Blockchain: TAYCAN","links":"https://www.trice.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trice/logo.png","detail_platform":{"":{"decimal_place":18,"contract_address":"0xf2ce0d6a776e144db1de94d8ced965bc26d861c0"}}}