{"name":"Pet Store","id":"pet-store","symbol":"psbd","description":"PET STORE an unique store where we are bringing wide range of foods, accessories and other products which is useful for your pet to keep it in good health and good looks in your house premises. Our app is one unique and different form of app in the Google play store from any other application for pet lovers. We look to give you the best products for your pet in the most affordable cost which you will not be able to find in any other pet product application. Browse through our application find the best product for your pet and we can guarantee you that you will not be disappointed in our application. To make your pet related life generally simple we present to you this application which will assist you with getting fundamental data required for your pets. Our products are all imported from various countries of the world in order to give your pet the right nutrition and nourishment your pet needs. Pet Store BD. first and foremost aim is to your pet’s good health and best upbringing as we know that a pet might be an animal but it becomes the most emotional and sensitive part of your daily life as such don’t hesitate to browse through our app and download it first from the Google play store. In order to give you an even better shopping experience, we have decided to equip our shop with blockchain technology. You can now pay directly in the shop with our token [PSBD] and process your transaction with crypto technology. you can also expect many other advantages if you pay in the shop with our [PSBD] token. A loyalty program, raffles and of course hidden prizes. You will also receive a permanent price advantage of 10% on the entire range when paying with our cryptocurrency. What's more you can likewise arrange through the application with only a single tick to get the item for your pet. In addition this application will likewise assist you with managing your pet consideration. We Pet Store BD and provide the quickest way of delivery all over the world To get the delive","links":"https://crypto-pet-store.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pet-store/logo.png"}