{"name":"Messy Virgo","id":"messy-virgo_base","symbol":"messy","description":"$MESSY is an AI-powered DeFi agent on Base that turns complex fund-style trading tools into a simple, approachable experience for everyday crypto users and active traders. The project combines an audited token infrastructure with an AI “due diligence and trading” engine that analyzes narratives, on-chain data, and market signals, then surfaces actionable insights and portfolio strategies for the community to execute. Purpose MESSY’s core purpose is to make professional-grade fund management tools—signal detection, project research, and portfolio construction—accessible through a single, character-driven token ecosystem. The goal is to build a community-governed “alpha-hunting engine” where an autonomous AI operates under human-defined constraints and rewards $MESSY holders as the system improves. Function The project runs a staged roadmap: first establishing community and culture, then rolling out an “Agentic Due Diligence Engine” that tracks social, news, and on-chain signals, followed by an autonomous trader that optimizes portfolios for the associated funds ($MESSYBASED and $MESSYFUND). The AI generates real-time insights and proposed trades, while humans retain final control through a “human-in-the-loop” model. Utility The $MESSY token acts as the core asset of this ecosystem: trades incur a 4.95% fee that funds passive reflections to holders and a treasury for AI development, marketing, buybacks, and burns, tying token activity directly to ecosystem growth. Holders benefit from reflections, exposure to the project’s AI-driven fund strategies, and future community governance as the treasury and protocol transition toward a DAO model.","links":"https://messyvirgo.com","market_cap":254076,"market_cap_rank":5565,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/messy-virgo/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x09f87f948c88848363b124c9099cbb58e4cc7cb6","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x09f87f948c88848363b124c9099cbb58e4cc7cb6"}},"is_native":false}