{"name":"Pyth Network","id":"pyth-network","symbol":"pyth","description":"What is the project about? The Pyth Network is the largest and fastest-growing first-party oracle network. Pyth delivers real-time market data to financial dApps across 35+ blockchains and provides 350+ low-latency price feeds across cryptocurrencies, equities, ETFs, FX pairs, and commodities. The network comprises some of the world’s largest exchanges, market makers, and financial services providers who contribute their own price data for use by smart contracts. The Pyth oracle program aggregates their data on-chain to guard against inaccuracies and manipulation. Finally, the protocol allows users to “pull” the latest price onto their blockchain when needed. In less than a year since the launch of the cross-chain pull oracle, the network has secured over $1B in total value. The Pyth Network has been used by over 200 applications to secure over $75B in trading volume. What makes your project unique? Pyth Price Feeds are a suite of over 350 real-time price feeds for cryptocurrencies, forex pairs, equities, ETF’s, and commodities. Pyth oracle prices update every 400ms, or more than 200,000 times a day to enable precise and secure smart contract operations. Every Pyth Price Feed also provides a confidence interval “band” around the reported price to inform users about market volatility and uncertainty. Developers can permissionlessly integrate with Pyth Price Feeds on more than 35 blockchains including Ethereum, Optimism, Arbitrum, zkSync Era, Base, BNB Chain, Solana and more. These price feeds come from trusted institutions that contribute to the network. More than 85 data providers publish their proprietary price data to the Pyth Network for dApps to use. These providers include major crypto and traditional exchanges, trading firms, financial services providers, and decentralized exchanges. Notable crypto-native data providers include Binance, OKX, Bybit, Wintermute, Flow Traders, Auros, and QCP Capital. Data providers specializing in traditional finance include Cboe Global Markets, Jane Street, LMAX, Susquehanna International Group, Optiver, and IMC. Decentralized exchange data providers include Orca, Raydium, and 0x. You can explore the Pyth Network’s data provider community. History of your project. The Pyth Network started in April 2021 as a collaboration between several individual contributors. Early contributors include the Pyth Network’s data providers, such as GTS, LMAX Group, Virtu, Jump Crypto as well as infrastructure partners such as Triton One and Blockdaemon. In 2021, the Pyth Data Association was founded to promote and grow the Pyth Network ecosystem. In 2023, Douro Labs was established as a new core contributor build the infrastructure and tooling necessary for expanding the network’s decentralized data services. What’s next for your project? Pyth Network is designed to be a self-sustaining decentralized network that coordinates data publishers and consumers. The protocol is designed to attract publishers with high-quality pricing data, and incentivizes these publishers by paying them fees collected from consumer usage of the data. The mechanisms help prevent malicious attackers from manipulating the protocol to their benefit in various ways, such as manipulating the price. Pyth Network will continue to provide more price feeds to 35+ blockchains it supports, and expand the asset coverages to more asset classes other than crypto, FX, equities, and metals. What can your token be used for? The on-chain governance mechanism will approve or reject proposals using a token coin-voting system. Anyone with a minimum quantity of staked PYTH tokens will be able to make a governance proposal. PYTH stakers will then be allowed to vote on these proposals. You can read more about PYTH utility on the whitepaper.","links":"https://pyth.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pyth-network/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"HZ1JovNiVvGrGNiiYvEozEVgZ58xaU3RKwX8eACQBCt3"}}}