{"name":"Minter Network","id":"minter-network","symbol":"bip","description":"What is Minter Network (BIP)? Minter is a DeFi platform with DEX, smart contracts, and cross-chain liquidity. It delivers the simplest and most effective ways to create, earn, store, and exchange cryptos in a fully decentralized way. Minter is integrated with Ethereum and BNB Smart Chain to provide cross-chain transfers and swaps. It allows to build efficient DeFi apps via a rich set of SDK and API tools. What Makes Minter Network Unique? Trading of most cryptocurrencies, tokens, and digital assets within a single network, all in a decentralized way Blocks final in 5 seconds Fees fixed in U.S. dollars in any liquid coin/token Integration with Ethereum and BNB Smart Chain Cross-chain transfers with swaps. For example, BUSD on BNB Smart Chain for USDC on Ethereum Limit orders powered by an implementation at the core level of Minter blockchain Creation of own tokens and liquidity pools BIPx, a mirrored version of BIP, on Ethereum and BSC Decentralized deposits and withdrawals Pool fees and yield farming options How Many Minter Network (BIP) Coins Are There In Circulation? The total supply of BIP---Minter Network's native digital coin---is 10 billion units. They become available as block rewards over the course of approximately 7 years since mainnet launch, which happened on May 15th, 2019. The Genesis block included the pre-mine of 200 000 000 BIPs for the first validators, coiners, and users, of which 50% was airdropped and 50% was distributed to early partners. The Minter blockchain runs on the Tendermint engine with the DPoS (Delegated Proof-of-Stake) consensus algorithm. Block reward started at 333 BIP and will be linearly decreasing down to 115 BIP. BIP coin allows to validate the network through stake delegation (staking rewards for new blocks and fees, voting power), pay all network fees (+30 types of transactions), provide custom coins with reserve. 20% of both block rewards and transaction fees is withheld as taxes and equally distributed between the Team and the Developers' DAO. How Is the Minter Network Secured? Minter Network implements the Delegated Proof-of-Stake (dPoS) consensus algorithm. dPoS is a fast, efficient, decentralized, and flexible consensus model. dPoS leverages the power of stakeholder approval voting to resolve consensus issues in a fair and democratic way. As of now, Minter blockchain has 46 independent masternodes validating 1 block every 5 seconds. Where Can You Buy Minter Network (BIP)? Minter Network's BIP coin is available for trading on various exchanges and also within the Minter Network itself, against many other digital assets (including stablecoins) in a fully decentralized way.","links":"https://www.minter.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/minter-network/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf2ba89a6f9670459ed5aeefbd8db52be912228b8"},"ethereum":{"decimal_place":18,"contract_address":"0xcafe34bae6f1b23a6b575303edcc0578d2188131"}}}