{"name":"Suiba Inu","id":"suiba-inu","symbol":"suib","description":"Suiba is a vibrant, fast-growing ecosystem built on the SUI blockchain, focusing on creating unique experiences in trading, NFTs, and decentralized finance (DeFi). At the core of Suiba is SuibaBot, a Telegram-based trading bot that allows users to trade and manage SUI tokens, particularly memecoins, with ease. SuibaBot stands out for its user-friendly interface, fast transaction speeds, and advanced trading features, which include sniping, copy trading, dollar-cost averaging (DCA), and more. The Suiba ecosystem also features a unique NFT collection of 2,000 rare and custom-designed NFTs. These NFTs not only serve as collectibles but unlock exclusive premium features within SuibaBot, such as reduced fees and access to upcoming advanced tools. The project thrives on community engagement, offering special giveaways, airdrops, and honorary NFTs to recognize key members and supporters. Liquidity within the Suiba ecosystem is supported by the Cetus and BlueMove platforms, where users can contribute and manage liquidity pools. Regular updates and improvements keep the ecosystem evolving, with recent advancements like the speed update, which leverages a dedicated node to enhance transaction efficiency. Looking ahead, Suiba is set to release v2, which promises to bring even more powerful features and tools, solidifying its place in the SUI ecosystem. As Suiba continues to grow, it remains committed to delivering value to its community through innovative features, user empowerment, and constant development.","links":"https://www.suibacoin.com/","market_cap":131657,"market_cap_rank":6237,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/suiba-inu/logo.png","detail_platform":{"sui":{"decimal_place":9,"contract_address":"0xed4504e791e1dad7bf93b41e089b4733c27f35fde505693e18186c2ba8e2e14b::suib::SUIB","geckoterminal_url":"https://www.geckoterminal.com/sui-network/tokens/0xed4504e791e1dad7bf93b41e089b4733c27f35fde505693e18186c2ba8e2e14b::suib::SUIB"}}}