{"name":"K-9 Killed in Shootout","id":"k-9-killed-in-shootout","symbol":"titan","description":"K-9 Titan, a dedicated Belgian Malinois, served with distinction in the K-9 unit of the Springfield Police Department. Born in early 2015, Titan was selected for his exceptional intelligence, agility, and unwavering loyalty. He quickly became a beloved member of the force, known not only for his impressive skills in tracking and apprehending suspects but also for his friendly demeanor and playful spirit. Throughout his career, Titan participated in numerous operations, contributing to the safety and security of the Springfield community. His keen sense of smell and ability to detect narcotics and explosives made him an invaluable asset during critical missions. Titan's bond with his handler, Officer Mark Thompson, was particularly strong; together, they formed a formidable team, building trust and camaraderie that transcended the typical human-animal relationship. Tragically, on November 14th, 2024, Titan lost his life in the line of duty during a tense shootout while assisting in a high-stakes operation targeting a dangerous criminal organization. Despite the chaos and danger surrounding him, Titan displayed remarkable bravery and loyalty, standing by Officer Thompson's side until the very end. His sacrifice not only highlighted the risks that K-9 officers face daily but also underscored the profound bond between police officers and their canine partners. Titan's memorial service was attended by fellow officers, community members, and supporters who came together to honor his courage and dedication. He will always be remembered as a hero who served selflessly, protecting and saving lives until his final moments. Titan's legacy continues to inspire both law enforcement and the community he served, reminding everyone of the vital role K-9s play in keeping us safe.","links":"https://www.titanthehero.com/","market_cap":72772,"market_cap_rank":6357,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/k-9-killed-in-shootout/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"F1uB7phqFVuyzsFoXWkcwNoCY3KJGFNsFLyeSoQYpump"}}}