{"name":"IncogniFi","id":"incognifi_ethereum","symbol":"infi","description":"As highlighted by Vitalik in a recent article, privacy is simulteanously one of Crypto's most important features, as well as one of its most prominent existential threats. Over the last few years, while providers of privacy tools have gained negative media attention (i.e. Tornado Cash), the importance of safeguarding privacy in a Web3 environment has been highlighted by several high profile kidnapping and robbery cases of wealthy Crypto individuals. Moreover, the rise of bots and copytraders have increased the need for users to be able to transact privately, without anyone following their every move. As such, while private transactions can be abused by malicious actors and people looking to use cryptocurrency to hide the source of their funds, privacy should be a right and people should not be forced to share their balances, transactions or online movement. This view has been shared by many prominent figure in the Ethereum ecosystem, most importantly by earlier mentioned developer Vitalik Buterin, who is a renowned supporter of dApps such as Railgun and Tornado Cash. While the importance of privacy in Web3 is thus generally agreed upon, the offering of privacy tools remains fragmented. As described in the next chapter, IncogniFi aims to change that, by creating a one-stop-shop privacy hub for browsing, communicating, transacting and storing crypto in a private way. IncogniFi is an advanced privacy ecosystem, comprising a fully private, anonymous and secure VPN Browser, a Private W2W Communication Tool, a Password & Key Manager, a Non-Custodial Wallet and a Privacy Dex. Ecosystem Products - VPN Browser - W2W Private Messenger - Password & Key Manager - Non-Custodial Wallet - Privacy Dex","links":"https://incognifi.io","market_cap":9545.36,"market_cap_rank":11270,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/incognifi_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x35e445da0c9f6ecea6d95726df6f325bfa902456","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x35e445da0c9f6ecea6d95726df6f325bfa902456"}},"is_native":false}