{"name":"Clearpool","id":"clearpool_solana","symbol":"cpool","description":"Clearpool is a decentralized capital markets ecosystem, where institutional borrowers can access unsecured loans directly from the DeFi ecosystem. Clearpool introduces a dynamic interest model driven by market supply and demand forces. Liquidity providers on Clearpool can earn attractive yields, with pool interest rates enhanced by additional LP rewards paid in CPOOL - Clearpool's utility and governance token. Clearpool LP tokens, called cpTokens, are the building blocks for a system of tokenized credit that will provide Clearpool LPs with risk management and hedging capabilities. As more institutions begin to realize the benefits that decentralized finance can bring to their organizations, Clearpool will provide the new architecture to facilitate flows between the $120 trillion traditional capital markets, and the burgeoning DeFi ecosystem. The CPOOL Token - CPOOL is the utility and governance token for the Clearpool protocol. - CPOOL holders will vote on the whitelisting of new borrowers, a process that will qualify participants to earn additional CPOOL through an incentive reward scheme. - Eventually, a full system of decentralized governance will be introduced, allowing CPOOL holders to propose, vote and implement future changes and upgrades to the protocol. - CPOOL staking will be a required action for borrowers, who must stake an amount of CPOOL to access the area of the protocol where they can make a proposal to be whitelisted. Liquidity providers earn additional CPOOL rewards, enhancing pool interest rates to attractive levels. - Clearpool will announce a buyback program, where a share of protocol revenue will be used to buy CPOOL in the open market, to perpetually sustain reward pools.","links":"https://clearpool.finance/","market_cap":26295087,"market_cap_rank":956,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/clearpool_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"AeXrLftu8chuY4ctc6oDeG4dUx6Yr4aqeakUMFNvACdg","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/AeXrLftu8chuY4ctc6oDeG4dUx6Yr4aqeakUMFNvACdg"}},"is_native":false}