{"name":"Pepe the Frog","id":"pepe-the-frog_binance-smart-chain","symbol":"pepebnb","description":"PepeBNB is a community-driven memecoin that pays homage to the popular meme character Pepe the Frog, known for breaking the internet with his quirky and irreverent personality. As a meme token, PepeBNB is built on the fundamental of a strong and active community, with a shared love of memes, humor, and all things internet culture. PepeBNB is designed to be a fun and lighthearted alternative to traditional cryptocurrencies, offering users a unique and playful way to participate in the crypto market. Users can buy and sell PepeBNB on various cryptocurrency exchanges, as well as use it to make purchases and transactions within the PepeBNB community. But PepeBNB is more than just a memecoin. It's a community of like-minded individuals who share a passion for memes and internet culture. The platform offers a space where members can connect with each other, share their favorite memes, and engage in discussions about all things internet-related. As a community-driven token, PepeBNB is built on the principle of decentralization, with no central authority or control. Anyone can participate in the network as a validator, helping to verify transactions and maintain the integrity of the blockchain. Overall, PepeBNB is a fun and innovative way to participate in the world of cryptocurrencies, built on the strong foundation of a passionate and active community. Whether you're a seasoned crypto investor or a newcomer to the space, PepeBNB offers a unique and engaging way to explore the world of memecoins and internet culture.","links":"https://pepebnb.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pepe-the-frog/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x47fd014706081068448b89fc6baca2730977216a","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x47fd014706081068448b89fc6baca2730977216a"}},"is_native":false}