{"name":"XGLI DAO Protocol","id":"glitter-finance","symbol":"xgli","description":"The XGLI DAO The XGLI DAO’s primary purpose is to govern Glitter Finance’s powerful XGLI token. It empowers token holders to have a say in the direction and utility of XGLI and gives them some control over the future of Glitter Finance. There are four key aspects of Glitter that are either enabled or governed by the XGLI DAO. Development XGLI is the lifeblood that powers Glitter’s cross-chain ecosystem. It runs through swaps, plays a role in Rainbow Network node deployments, and, of course, allows participation in the DAO. While XGLI already has a broad range of utilities, this list will continue to grow as the protocol develops and grows. DAO members have direct input on this utility. Participants can propose new utilities and vote on resolutions regarding development, ensuring all stakeholders have a say in how the protocol grows. Listings As Glitter expands to support more blockchain networks, new XGLI listings will be needed to add the token to additional Decentralised Exchanges (DEXs) and Centralised Exchanges (CEXs). This is an important decision as it will dictate how some new users gain access to the broader Glitter ecosystem via the XGLI token. The DAO will have control over these listings, dictating where and when to list a token, as well as where to create staking pools to encourage liquidity provision. Community empowerment The XGLI DAO provides a platform for all stakeholders to come together and collaborate on important decisions that will shape the future of the Glitter Finance ecosystem. By placing power in the hands of the users who are invested in the future of the platform, the DAO helps to foster a strong and engaged community that is committed to the long-term success of Glitter. In keeping with the decentralized mission of the DAO, Glitter is committed to distributing a majority stake of XGLI tokens to the community. Only 10% of tokens are kept by the team, while the remainder will be used for rewards and incentives.","links":"https://dao.glitterfund.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/glitter-finance/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"FsPncBfeDV3Uv9g6yyx1NnKidvUeCaAiT2NtBAPy17xg"},"algorand":{"decimal_place":6,"contract_address":"607591690"}}}