{"name":"Dex on Crypto","id":"dex-on-crypto","symbol":"docswap","description":"What is the project about? DOCSWAP is a decentralized exchange (DEX) platform that offers a suite of services including DEX trading, an IDO LaunchPad, and a Token Locker. It aims to support a wide range of EVM-based blockchains and tokens, providing a user-friendly and secure environment for decentralized trading. What makes your project unique? DOCSWAP stands out by offering a comprehensive ecosystem that includes DEX trading, an IDO LaunchPad, and a Token Locker, all accessible across various EVM-based blockchains. Its uniqueness lies in its commitment to supporting multiple blockchains, making it easier for blockchain projects to list their tokens and engage with a broader audience. History of your project? DOCSWAP was launched with the goal of simplifying decentralized trading and supporting blockchain projects. Its history includes successful integration with several blockchains, continuous development, and the introduction of features like staking, airdrops, and token burning. What’s next for your project? The project is focused on expanding its ecosystem by adding more supported blockchains, enhancing its LaunchPad and Token Locker services, and exploring opportunities for further integration with different blockchain networks. DOCSWAP aims to continue evolving and improving its services. What can your token be used for? The DOCSWAP token (DOCSWAP) has various use cases within the DOCSWAP ecosystem. It can be used for staking to earn rewards, participating in IDOs on the LaunchPad, providing liquidity on the DEX, and accessing premium features. Additionally, it's distributed through airdrops to token holders, adding to its utility and community engagement.","links":"https://dexoncrypto.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dex-on-crypto/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xde314a065aaaf11e794706f8585c77e3bb7a2741"}}}