{"name":"Blockchain Euro Project","id":"blockchain-euro-project","symbol":"bepr","description":"Blockchain Euro Project (BEUROP) is a legal IT company whose members have more than five years of experience developing smart contracts and blockchain solutions. It aims is to create a unique and genuine ecosystem of digital products, including P2E NFT game, DEX, NFT Marketplace, and CEX. Recently, the company has launched its Crypto DeFi trading & marketing platform and its Educational Platform. BEPR is BEUROP's hyper deflationary token and is connected to all products in the ecosystem. Being a BEPR token owner means having shares in the company; the holders get a percentage as passive income for each buying and selling. Also, have early and free access to each product. Moreover, the token's price fully corresponds to the value of the project - the more demanded products the company launches, the higher the cost of the token. YouCrypto is the DeFi trading & marketing platform powered by BEUROP. It is a complete, secure, and practical tool that promotes tokens, cryptocurrencies, and blockchain projects through a complete advertising package. In addition, it provides traders and daily users with trading tools and detailed reports on new digital assets that may pose a risk of scams. BeSmart is the e-learning platform launched by BEUROP. For BEPR holders, the inscription in this academy is free of charge. The students will acquire digital skills to start their own business or improve their careers with each class. At the same time, it will help young developers gain knowledge about blockchain and improve their skills as programmers. Additionally, the best graduates will get a place on the company's team to continue creating value for Beurop's businesses and customers.","links":"https://beurop.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockchain-euro-project/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xbf0cf158e84ebacca1b7746e794d507073e5adfe"}}}