{"name":"UrDEX Finance","id":"urdex-finance","symbol":"urd","description":"What is the project about? UrDEX - Decentralized Exchange, Non-Custodial Perpetual DEX, Launchpad Project on the Arbitrum Chain. UrDEX Finance offers a comprehensive range of products and services, including a Decentralized Exchange, a Decentralized Perpetual Exchange, Yield Instruments, AMM framework, Staking, Farming, and Launchpad. What makes your project unique? UrDEX is a community-driven project that aims to solve the liquidity problem by enabling disparate forms of liquidity to connect with markets in a decentralized way. The project offers a comprehensive range of products and services, including a Decentralized Exchange, a Decentralized Perpetual Exchange, yield instruments, an AMM framework and staking, and a Launchpad. UrDEX's unique approach is that it intertwines many decentralized markets and instruments, creating a broader range of network effects. History of your project. UrDEX Finance was formed in January 2023, building Decentralized Exchange, Non-Custodial Perpetual DEX, Launchpad. We all have a lot of experience and qualifications in the Blockchain field, including 27 core members. UrDEX team members are from several countries all over the world. What’s next for your project? Launching features: 🔹Fully Decentralized and Non-Custodial 🔹Staking and Farming URD 🔹UrDEX Launchpad 🔹Zero Price Impact Trades powered by Chainlink oracles 🔹Fair Launch and DAO-Driven 🔹Loyalty Rewards 🔹Strategic Partners Pool What can your token be used for? - Staking: URD holders can stake their tokens in the UrDEX DAO governance system to earn rewards. - Protocol Fee: Users who use the UrDEX platform pay fees in URD tokens. These fees are used to fund the DAO treasury - Governance: URD holders can participate in the UrDEX DAO governance system. - Launchpad: UrDEX Launchpad allows users to stake URD to participate in UrDEX Launchpad - Incentive Mechanisms: URD rewards are paid out to users who participate in the UrDEX Loyalty Program","links":"https://urdex.finance/","market_cap":60218,"market_cap_rank":5167,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/urdex-finance/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x842216e0aa2ae608699f7b1063f26ce6b30c5311"}}}