{"name":"Zypto Token","id":"french-connection-finance","symbol":"zypto","description":"***French Connection Finance (FCF)*** What is French Connection Finance (FCF)? French Connection Finance is all about “Empowering Crypto.” As a utility-first crypto company, we launched our crypto payment gateway for e-commerce and brick-and-mortar stores called FCF Pay in February 2022, bridging the gap between crypto and commerce. We empower cryptocurrency holders by allowing them to purchase goods and services through our fully-encrypted cryptocurrency payment gateway. Merchants can accept payment in a wide range of cryptocurrencies, via a fiat to crypto credit/debit card on-ramp or even bank transfer. They can also convert it simply and easily to fiat. This is all made simple by our easy-to-use dashboard. $FCF is our Revenue Sharing Token (RST). All $FCF RST holders get rewarded with fully automated dividends, paid in BNB every 24 hours. These dividends come from a share of the $FCF RST token transaction tax, as well as a share of every transaction fee from FCF Pay, allowing holders to earn passive income while benefiting from the rising price of $FCF RST. Over 1 million USD worth of dividends has been disbursed to holders so far. French Connection Finance was recently recognized as the Most Innovative Project 2022 at the Crypto Expo Dubai. $FCF RST is Certik verified, registered in Canada and has a fully doxxed CEO and team. Who are the Founders of French Connection Finance? The French Connection Finance team consists of seasoned entrepreneurs. FCF is led by John Nasr, who is the Founder & CEO. John is an accomplished entrepreneur with over 10 years of experience in the business development industry. Passionate about cryptocurrency since 2013, John jumped into the De-Fi world after becoming tired of all the scams and failed De-Fi projects. He decided to create FCF and revolutionize the De-Fi world and take it where it belongs. Joe Parkin serves as COO for FCF. Joe is an entrepreneur, all-roun","links":"https://zypto.com","market_cap":8235403,"market_cap_rank":2035,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/french-connection-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7a65cb87f596caf31a4932f074c59c0592be77d7"}}}