{"name":"AllUnity EUR","id":"allunity-eur","symbol":"eurau","description":"AllUnity EUR (EURAU) is a fully regulated euro-denominated stablecoin issued under the European Union’s Markets in Crypto-Assets Regulation (MiCAR). Launched on 31/07/2025, EURAU is designed to offer secure, programmable, and transparent euro liquidity for institutional and retail applications across public blockchain networks. AllUnity GmbH, the issuer of EURAU, is a German company headquartered in Frankfurt and licensed as an electronic money institution (EMI) by the Federal Financial Supervisory Authority (BaFin). The company operates as a joint venture between DWS (Deutsche Bank), Flow Traders, and Galaxy Digital. This structure provides a strong institutional foundation for long-term compliance, infrastructure resilience, and adoption across financial markets. EURAU is fully backed 1:1 by euro-denominated reserves, held with authorized credit institutions (multiple reserve banks) within the European Economic Area. The reserves are safeguarded under strict prudential standards and are not used for lending or investment purposes. On-chain issuance and redemption follow a verified flow with wallet and account whitelisting, designed to align with AML, KYC, and regulatory expectations. Users are able to mint and redeem EURAU through authorized partners and platforms, with an emphasis on transparency and auditability. Technically, EURAU is deployed initially on Ethereum as an ERC-20 token. Future expansion includes Solana and other EVM-compatible chains. The smart contract architecture ensures upgradability through secure multisig control, subject to internal governance procedures. Minting and burning are controlled by permissioned wallets operated by regulated partners to prevent unauthorized issuance and maintain supply integrity. The token aims to serve multiple use cases, including digital asset trading, payments, treasury solutions, and on-chain finance (DeFi). EURAU is designed to be accessible to exchanges, market makers, payment institutions, fintechs, and tokenized asset platforms looking to integrate euro liquidity in a compliant manner. AllUnity maintains active collaborations with infrastructure providers, custodians, and trading venues, including confirmed listings with Gate.io and Bullish.com. The stablecoin plays a foundational role in building a euro-based financial ecosystem on public blockchain infrastructure, while staying fully aligned with European regulatory frameworks. The project roadmap includes expanding interoperability across additional chains, supporting on/off ramps with banking partners, and enabling programmability for enterprise use cases. The EURAU token contract address on Ethereum is: 0x4933A85b5b5466Fbaf179F72D3DE273c287EC2c2","links":"https://allunity.com/","market_cap":20558122,"market_cap_rank":1307,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/allunity-eur/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x4933a85b5b5466fbaf179f72d3de273c287ec2c2","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x4933a85b5b5466fbaf179f72d3de273c287ec2c2"}}}