{"name":"Envision","id":"envision","symbol":"vis","description":"Envision is a Web3 solution dedicated to giving stock media creators the power and control they deserve. Deriving utility from NFT and blockchain technology, Envision facilitates the peer to peer exchange of stock media content where content creators market and sell direct to consumer, avoiding hefty fees or forfeiting rights as per current Web2 solutions. Built on the Ethereum blockchain the Envision Stock platform will act as a tailored NFT marketplace with the UI/UX specifically for the purchase and sale of stock media. The Envision Stock platform is completely fee free which means 100% of the content revenue goes direct to the creator. This allows creators to reduce their pricing, leading to a net benefit to both sides of the exchange and creates a more open transparent market than current solutions. Content will be accompanied by a Non-Fungible Token (NFT) which corresponds to that specific piece of content. The NFT will provide proof of ownership which is validated by participants on the network so there can be no dispute over who owns the rights to said content. The functionality of NFT’s gives the content creator the control to either sell complete ownership rights, rights to one in a limited collection or single rights to one of many. The Envision platform will be powered by VIS which is Envisions fungible ERC20 utility token. VIS tokens are the exclusive form of payment on the ENVISION marketplace where consumers exchange VIS tokens for the NFT associated with a piece of stock media directly with the content creator. VIS tokens are also used to distribute rewards, fund the platform and incentivise platform participants/token holders.","links":"https://envisioncoin.finance/","market_cap":1556619,"market_cap_rank":2441,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/envision/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x469084939d1c20fae3c73704fe963941c51be863"}}}