{"name":"Wall Street Memes","id":"wall-street-memes","symbol":"wsm","description":"What is the project about? Wall Street Memes is a memecoin borne out of WallStMemes Web2 internet phenomenon which aims to create a decentralised movement that challenges the status quo and puts the control back into the hands of the people. $WSM token is the ultimate expression of the internet’s triumph over capitalism. As Gordon Gekko said in the 80s whilst getting rich off useless stocks, “Greed is good!”. 30 years later this is still the case. Thus, Wall Street Memes is tokenising this movement, allowing ordinary people to earn profits from a “useless” memecoin. Buyers can also stake their tokens and earn passive rewards. What makes your project unique? Wall Street Memes is the crypto token with the highest ICO raise in history. The project also has the biggest online community with over half a million Instagram followers and almost 300K Twitter followers. The posts have even reached Elon Musk who interacted with the WSM Twitter account. History of your project. WSM Twitter was created in 2019, initially to make fun of the capitalist movement and its following grew very rapidly. In October 2021, Wall Street Bulls NFT collection was released which sold out in less than half an hour. In 2023, the team decided to tokenise the movement by launching $WSM token on the 25th of May 2023. The presale ended on the 25th of September, reaching the highest ICO raise in history. On the 26th of September, the token was launched on OKX and HTX exchanges. What’s next for your project? Wall Street Memes is going to launch on other top exchanges in the following days and aims to launch on other Tier 1 exchanges in the future. What can your token be used for? Apart from allowing people to gain from a movement which makes fun of useless assets and the capitalist movement, buyers can also earn passive rewards by staking their tokens.","links":"https://wallstmemes.com/","market_cap":2266522,"market_cap_rank":3122,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wall-street-memes/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x62694d43ccb9b64e76e38385d15e325c7712a735"}}}