{"name":"Shib Original Vision","id":"shib-original-vision","symbol":"sov","description":"What is the project about? Shib Original Vision ($SOV) fixes the corruption behind $SHIB by fairly distributing $SOV to those who believe in the genuine Shiba Inu community. $SOV was developed by true devotees in the dream that was once Shiba. They intend on $SOV to be distributed in a manner that is not only equitable and righteous but also transparent, with 80% of the total supply being airdropped to active Shiba Inu wallets. In order to establish a truly equitable community, an equivalent amount of $SOV will be dispersed among Shiba Inu holders who have been active on-chain in the last six months days. 277,000 $SHIB wallets will be eligible for $SOV, making it one of the largest airdrops in crypto history. For holders that have $SHIB on centralized exchanges, a dedicated portion of the token metrics will be reserved for CEX airdrop and listing negotiations, governed by 59 members of the Inu Economic Forum, which is made up of Karma DAO members. What makes your project unique? Shib Original Vision has 80% of its total supply allocated to Shiba Inu wallets that have been active on-chain within the last 30 days. Meaning that each active Shiba Inu wallet will be able to claim a fixed amount of SOV that is equal amongst all Shibes, meaning SOV will be a true community token. History of your project. SOV was evisioned by Karma DAO after witnessing the corruption & strife within the original Shib community that they helped create. They wanted to create an alternative memecoin that followed the original ethos of community & fairness that Shiba Inu was meant to represent. What’s next for your project? Shib Original Vision aims to bring positivity, community & fairness to the entire Shiba community, providing an alternative fairly launched community token. What can your token be used for? SOV is a memecoin so it can be used by SOV community members.","links":"https://www.shiboriginalvision.com/","market_cap":231805,"market_cap_rank":5500,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shib-original-vision/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2c5bc2ba3614fd27fcc7022ea71d9172e2632c16","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2c5bc2ba3614fd27fcc7022ea71d9172e2632c16"}}}