{"name":"Shakita Inu","id":"shakita-inu","symbol":"shak","description":"Shakita Inu, known as $SHAK The #SHIBKILLERby its community is a deflationary lotto token. It has a supply of 8.7B which is purposely much lower than most other dog coins. SHAK aims to follow in SHIB's footsteps and build utility and also aims to beat DOGE to $1. The token has 0% buy tax and 10% sell tax (4% of which is burned from the supply). With the BIG $SHAK LOTTO lucky hodlers are chosen at random with a random number generator to win prizes. The prizes go up as the price gets higher and when the price reaches $1 SHAK plans to give away $1,000,000. Shakita Inu aka $SHAK is a self proclaimed SHIB KILLER. It's tokenomics include 0% buy tax forever and 4% of every sell is burned. The supply is all circulating and constantly getting lower. It is mathematically designed to get to $1 ten times quicker than DOGE and to grow even faster than SHIB. There are constant holder giveaways in the BIG $SHAK LOTTO whereby a random holder is selected to win a prize at price milestones. The higher the price of the token gets the bigger the prize gets. When the price is $1 there will be a $1,000,000 giveaway. There is a 2D game on the way that shows SHAK jumping other its rivals DOGE and SHIB in an endless runner style game. Top scorers will also win tokens. The project intends to expand the token utility and have NFT farming amongst many other features as the community grows.","links":"https://www.shakitainu.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shakita-inu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x53c2a6cc05f9647d59201b19cb5f5e42cc6dc524","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x53c2a6cc05f9647d59201b19cb5f5e42cc6dc524"},"solana":{"decimal_place":6,"contract_address":"3jvnWgxpGpyLDWubHSm2DB6DTFJxjtRienaYUiDHpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/3jvnWgxpGpyLDWubHSm2DB6DTFJxjtRienaYUiDHpump"}}}