{"name":"SyncDex","id":"syncdex","symbol":"sydx","description":"What is the project about? SyncDEX is one of the first decentralized exchanges (DEX) with an automated market-maker (AMM) on the zkSync Era Network. SyncDEX offers the lowest costs for trading in crypto assets as compared to its rivals. Throughout the entire zkSync ecosystem, rewards from staking and yield farming are among the highest paying. Also, SyncDEX wants to involve consumers as extensively as possible in decision-making. Governance Voting is used to make all significant decisions! What makes your project unique? Hi Syncian, we are SyncDex developers. Every corporation and business that wants to develop strongly must build core values from the beginning, as do we. We carry out the mission of dedicating talent and technology to bring our users the best experience. Our goal is to provide users with the lowest costs for trading in crypto assets and offer high rewards from staking and yield farming. SyncDex can be described in terms of these fundamental principles: People: As the key foundation of the community, team members with extensive and professional experience in the cryptocurrency market are able to develop many exceptional features. Change: SyncDex always values users' feedback and recommendations. Integrity: SyncDex aims for a fair, civilized, and upright environment. Community development: SyncDex strives to collaborate with other organizations for mutual development and growth. Thank you for joining us at the early stage. Together, let's keep moving forward. History of your project. What’s next for your project? What can your token be used for? Swap, Staking, Farming, Voting","links":"https://www.syncdex.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/syncdex/logo.png","detail_platform":{"zksync":{"decimal_place":18,"contract_address":"0x3a34fa9a1288597ad6c1da709f001d37fef8b19e","geckoterminal_url":"https://www.geckoterminal.com/zksync/tokens/0x3a34fa9a1288597ad6c1da709f001d37fef8b19e"}}}