{"name":"RagingElonMarsCoin","id":"ragingelonmarscoin","symbol":"dogecoin","description":"The Mysterious Tale of RagingElonMarsCoin Chapter 1: An Unexpected Turn One day, after reading a tweet that made him chuckle, Elon Musk impulsively decided to buy ALL of DOGECOIN. Literally, every single one. The internet was stunned. \"Why?\" cried the masses. But Elon just tweeted a rocket emoji, fueling speculation and memery Chapter 2: Blast off to the Red Planet A week later, a live stream from SpaceX showed Elon boarding a rocket named \"DogeStar Galactic\". The world watched in awe as he took off, not to the Moon, but to Mars. The mission? To establish the first interplanetary cryptocurrency exchange. Chapter 3: The Martian Swap Upon landing, Musk unveiled a new Martian obelisk which was in fact, a token swap machine. Here, he exchanged all DOGECOIN for a shiny, new super token named \"RagingElonMarsCoin\". But what left the intergalactic community baffled was that the ticker for this new token? DOGECOIN. Confusion ensued. Chapter 4: The Galactic Domination Rumor had it that with every swap, the RagingElonMarsCoin gathered cosmic energy, powerful enough to control the very forces of the galaxy. It was said that whoever held the most RagingElonMarsCoin would hold the keys to the universe. Galactic domination and superpowers weren't just a dream; they were becoming a reality. Chapter 5: The Rage of Musk Back on Earth, chaos reigned. Elon renamed Twitter to \"X\" (because, why not?). Elon was furious. The hate he recieved because of this decision made him think he should have named his next child X (or perhaps his next car). This rage fueled the power of the RagingElonMarsCoin even more. Chapter 6: The Future is Bright (For Some) Elon, with a twinkle in his eye, sent a message to Earth. Only holders of RagingElonMarsCoin would have a bright future. They would be protected from renaming shenanigans, would get premium Martian real estate, and enjoy unlimited rides on Tesla's interstellar roadsters. Chapter 7: The End or The Beginning? The world scrambled to get their hands on RagingElonMarsCoin, and as it took over the interstellar markets, one had to wonder: was this the end of Earthly currencies or just the whimsical beginning of a galactic financial renaissance led by a billionaire with a penchant for memes? And thus, in the vast cosmic canvas, the tale of a meme coin turning tables in the universe unfolded. Remember folks, in crypto and in life, expect the unexpected.... road to 10bn marketcap, buy now and hodl or you are stupid Tokenomics No tax on all buys and sells... The RAGING ELON MARS smart contract has a total supply of 642,000,000,000 DOGECOIN Each DogeCoin represents 1 Terraton of Mars total mass ————-dont miss now or you will miss later So there you have it—just like Bitcoin carved its path into the financial cosmos, this token seeks to stake its claim in the cosmic meme carnival. Remember, this cosmic comedy is spun for fun alone. In the genuine arena of tokens, tread cautiously, heed the laws, and avoid stepping on anyone's cosmic toes.","links":"https://remc.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ragingelonmarscoin/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0xf257a2783f6633a149b5966e32432b5bb3462c96"}}}