{"name":"Kintsugi","id":"kintsugi","symbol":"kint","description":"## What Is Kintsugi Network (KINT)? Kintsugi is Interlay’s canary network, an experiment with real economic value deployed on Kusama. Kintsugi and Interlay share the same code base - with the difference that Kintsugi focuses strictly on innovation and will always be ahead in terms of features. Interlay is a decentralized network dedicated to connecting crypto-currencies like Bitcoin with DeFi platforms like Polkadot and Ethereum. The Interlay network is hosted as a Polkadot parachain and will be connected to Cosmos, Ethereum, and other major DeFi networks. Read more about Interlay’s vision of blockchain interoperability. kBTC, Kintsugi's flagship product, is a 1:1 Bitcoin-backed asset on Kusama. Backed by multi-collateral insurance, it resembles an algorithmic stablecoin pegged to and redeemable 1:1 for Bitcoin (i.e. a hybrid). Users must only ever trust that Bitcoin and the DeFi platform they use are secure. KINT is the native utility token that is used for: - Governance votes to decide on protocol upgrades and determine how network resources are allocated, - Fees for processing transactions. ## How Many KINT Coins Are There in Circulation? Kintsugi network launched on October 13th, 2021. KINT has an unlimited supply, with 10 million tokens emitted over the first 4 years. Starting with year 5, there is a 2% annual inflation. 70% of the supply is distributed to the community as airdrops and block rewards: 30% to Vault rewards 5% to governance staking rewards (“stake-to-vote”), and 35% to the on-chain treasury controlled by network governance. 10% are allocated to a reserve, to be spent on network development and community & ecosystem building from the non-profit oriented organization Kintsugi Labs. 20% are airdropped to the (current and future) team and early backers who funded the initial development. ## Who Are the Founders of Kintsugi Network? Kintsugi is the canary network of the Interlay network, created by Alexei Zamyatin and Dominik Harz. The two met in 2017 during their PhDs at Imperial College London where they were the first researchers of the cryptocurrency lab. Both have been researching Bitcoin and Ethereum since 2015/16, authoring over 30 papers with over 700 citations. Both regularly presented their work at Bitcoin and Ethereum conferences, including DevCon IV, EthCC, Building on Bitcoin, and Breaking Bitcoin. The first steps towards Interlay and Kintsugi were made when the XCLAIM paper was presented at the Scaling Bitcoin in 2018 - describing the first-ever protocol to move cryptocurrencies like Bitcoin to Ethereum in an economically trustless and decentralized manner. In 2020, the two founded Interlay to bring research into practice. Today, Interlay employs 18 staff, including developers with experience at Google, Morgan Stanley, Trivago, Accenture, PwC, Worldpay, and Hyperledger. ## What Makes Kintsugi Unique? Kintsugi's flagship product, is a 1:1 Bitcoin-backed asset on Kusama. Backed by multi-collateral insurance, it resembles an algorithmic stablecoin pegged to and redeemable 1:1 for Bitcoin (i.e. a hybrid). What makes Kintsugi’s kBTC unique is the strict dedication to being trustless and decentralized. - Secured by Insurance. Vaults lock collateral on the kBTC parachain in various digital assets in a MakerDAO-inspired multi-collateral system. If Vaults misbehave, their collateral is slashed and users reimbursed. - Radically Open. Anyone can become a Vault and help secure kBTC, anytime. Hence, as a holder of kBTC, you have the following guarantee: You can always redeem kBTC for BTC, or be reimbursed in the collateral currency at a beneficial rate. In case a Vault misbehaves, you will be reimbursed from the Vault’s collateral and will end up making a profitable trade between BTC and the collateral asset(s). At launch, collateral will be put down in DOT. In the mid/long run, this may be extended to stablecoins or token-sets to improve stability. Summarizing, to trust interBTC, you only need to: - Trust that Bitcoin is secure. Meaning: trust that Bitcoin blocks are final after X confirmations. The bridge will recommend a minimum of 6 confirmations, though users and apps are encouraged to set higher thresholds. - Trust that Kusama / the chain you are using kBTC on is secure. This assumption is made by all applications running on top of Polkadot.","links":"https://kintsugi.interlay.io/","market_cap":605233,"market_cap_rank":4266,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kintsugi/logo.png","detail_platform":{"kusama":{"decimal_place":null,"contract_address":""}}}