{"name":"Paladin DAO","id":"paladin-dao","symbol":"pal","description":"Paladin DAO is the decentralized reserve currency protocol available on the BSC (Binance Smart Chain) based on the PAL token. Each PAL token is backed by a basket of assets (e.g., BUSD, PAL-BUSD LP Tokens etc etc) in the Paladin DAO treasury, giving it an intrinsic value that it cannot fall below. Paladin DAO also introduces economic and game-theoretic dynamics into the market through staking and minting. Our goal is to build a policy-controlled currency system, native on the BSC network, in which the behavior of the PAL token is controlled at a high level by the DAO. In the long term, we believe this system can be used to optimize for stability and consistency so that PAL can function as a global unit-of-account and medium-of-exchange currency. In the short term, we intend to optimize the system for growth and wealth creation. We intend to achieve price flatness for a representative basket of goods without the use of fiat currency, in order to allow the cryptocurrency industry to detach once and for all from the traditional finance world! How do I participate in Paladin DAO? There are two main strategies for market participants: staking and minting. Stakers stake their PAL tokens in return for more PAL tokens, while minters provide LP tokens or BUSD tokens in exchange for discounted PAL tokens after a fixed vesting period. How can I benefit from Paladin DAO? The main benefit for stakers comes from supply growth. The protocol mints new PAL tokens from the treasury, the majority of which are distributed to the stakers. Thus, the gain for stakers will come from their auto-compounding balances, though price exposure remains an important consideration. That is, if the increase in token balance outpaces the potential drop in price (due to inflation), stakers would make a profit. The main benefit for minters comes from price consistency. Minters commit a capital upfront and are promised a fixed return at a set point in time; that return is given in PAL tokens and thus the minter's profit would depend on PAL price when the minted PAL matures. Taking this into consideration, minters benefit from a rising or static price for the PAL token!","links":"https://www.paladindao.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/paladin-dao/logo.png"}