{"name":"LEXIT","id":"lexit-2","symbol":"lexi","description":"What Is LEXIT (LEXi)? LEXIT is a full service #NFT & DeFi platform that tokenizes, launches and enables trading of intellectual property rights from Arts and Inventions. The platform will allow anyone who owns the copyrights to art, movies, TV Shows, characters, patents and technical inventions or Collectibles to mint and launch NFTs and have these immediately in liquidity on the integrated LEXIT DeFi Pools. LEXIT brings NFTs to DeFi by offering a decentralized finance platform where users can submit their intellectual property and mint tokenized NFT versions of their artwork, music, etc. These NFTs will then be launched through the LEXIT NFT Launchpad to the general public. Newly minted NFTs will be promoted as an initial NFT offering through LEXIT’s NFT Launchpad. The NFTs will then be available for direct purchase or added by LEXIT pool Managers to various DeFi pools on the platform. Anyone owning intellectual property rights (IPR) to their artwork, music, film/videos, inventions, etc. may submit a listing for approval on the platform free of charge. If approved, the IPR enters the NFT Launchpad as an NFT client. The NFT offering will be available on the NFT client’s scheduled launch day to pre-subscribed LEXIT platform users who must perform social media tasks on behalf of the NFT client to increase the popularity of the offering. The NFT then becomes available for direct purchase on the NFT Launchpad to then be available on the LEXIt DeFi Liquidity Pools, which are curated portfolios of various NFTs available on LEXIT. Pools are managed by pool managers and are open to everyone to join. LEXIT pools allow users to participate in potential high yield token pools. Anyone can become a pool manager and create a LEXIT DeFi Pool. Pool managers define the total liquidity and choose a variety of NFTs from the LEXIT marketplace. The pool manager must stake 5% of the pool liquidity to add “skin in the game.” Liquidity can be provided with popular tokens such as BTC, ETH, BNB and the LEXi coin among others trading pairs. LEXIT will also be coming out with its own Protocol, which we are currently far in development with & will call it the LEXNET. The LEXNET is a high performance Blockchain, which is fully compatible with Ethereum and the Binance Smart Chain Protocols. First tests predict a Hash-Rate of at least 32000 TPS and further scalability. LEXi is the native utility token that is used for: LEXi is a utility token that is used for participation on LEXIT NFT Launchpad, LEXIT DeFi liquidity pool and in the LEXi Coin Community Staking . LEXi components include: * An NFT launchpad allowing users to tokenize and showcase their Intellectual Property as NFTs * LEXNET - an Ethereum-capable Protocol, with capacity far higher than stock Ethereum blockchain technology Same as above How Many LEXi Tokens Are There in Circulation? LEXIT is launching its LEXi Coin on May 19, 2021 via IDO on the www.BSCPAD.com Launchpad with 1,110,000 LEXi tokens at initial circulation, in detail: Total Supply (capped forever) 16,000,000 LEXi www.BSCPAD.com IDO 650,000 LEXi Advisors & Partners 200,000 LEXi LEXIT Liquidity 320,000 LEXi Total liquid circulation 1,110,000 LEXi All Pre-Sale backers are subject to a Lock-Up and additional linear vesting. All LEXi Coin are minted as of this day and ready for distribution. Who Are the Founders of LEXIT? LEXIT was founded by Amir Kaltak (Founder, CEO), Katia Zaitsev (Co-Founder, CBO) and Frederik Prins (Co-Founder, COO). LEXIT started as a project back in 2016 where Amir was trying to monetize on his IPR from tech he created to fund a new idea. He then immediately realized that there is no such place where he can do that, that was when the idea of LEXIT was born. He instantly thought - what if it were possible to tokenize IPR and make it widely available via a Blockchain ? The idea grew & evolved into the next logical step - a protocol that had the needed performance and flexibility, our LEXNET is the result. Now all that was great but it would be even better if our user could easily access liquidity and so Ferhat (CTO), Frederik and Katia worked hard to figure out how it could be possible, the LEXIT DeFi Liquidity Pools were born. This is us, an powerful NFT Launchpad with integrated DeFi Liquidity on a novel LEXNET Protocol. Amir is a serial entrepreneur with 25+ years of experience who began coding at 7 years old. Katia specializes in Business development, Growth in Revenue, Corporate partnerships - with vast experience in growing revenue & developing businesses across various industries. Fredrik is in charge of Operations with vast experience in Banking & executive recruiting. While Ferhat, our CTO is a full-stack crypto Developer who began Bitcoin mining in Europe. One of the first. Where Can I Buy LEXIT (LEXi)? Pancake Bitmart","links":"https://www.lexit.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lexit-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x41a95f152e50fffd7184d9388956a2d0b8756ba9"}}}