{"name":"Aipocalypto","id":"aipocalypto","symbol":"aipo","description":"Hope Against the Algorithm: Humanity's Resolve in AI Take a stand against AI and protect your kin for the #Aipocalypto. Whose side will you be on when Armageddon happens? Will the world go to extinction for the third time, or will it be saved this time? It's up to you. What is #AIPOCALYPTO? ▪️ It's an AI-powered web3 game and free-to-play. ▪️Aipocalypto is a multiplayer, TPS, PvP game that offers both intense 1v1 duels and thrilling 3v3 team battles. ▪️ Set in a cyberpunkish environment with AI infestation, players must harness their unique abilities and strategize with their team to claim victory for their factions. ▪️ Aipocalypto is being developed with a team that is very experienced and has previously worked on games such as Lord of the Rings Battle for Middle Earth Reforged. With #Aipocalypto, you will experience the satisfying gameplay and immersive story of web2 games in a web3 game! ▪️Dynamic Gameplay: With diverse factions, and competitive multiplayer modes, an exhilarating PvP experience that keeps players coming back for more. ▪️AIPOstore: A special marketplace where used for characters' abilities and cosmetics. ▪️AIX Money: Having an in-game currency creates a deflationary structure in the game economy. ▪️\"BET\"ter Fight: Bet on yourself, win the fight, double your MMR Score and rise up faster in the league. ▪️AIPOdao: Recruit more kin to your gang, defeat the opposing gangs to emerge victorious and also have participation in Aipocalypto's future decisions.","links":"https://aipocalypto.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aipocalypto/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x6c511dc18572d31c2c3f7b1505cb2bbc08282fcc"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6c511dc18572d31c2c3f7b1505cb2bbc08282fcc"},"polygon-pos":{"decimal_place":18,"contract_address":"0x6c511dc18572d31c2c3f7b1505cb2bbc08282fcc"},"optimistic-ethereum":{"decimal_place":18,"contract_address":"0x6c511dc18572d31c2c3f7b1505cb2bbc08282fcc"},"blast":{"decimal_place":18,"contract_address":"0x6c511dc18572d31c2c3f7b1505cb2bbc08282fcc"}}}