{"name":"Getaverse","id":"getaverse","symbol":"geta","description":"What is the project about? Getaverse - A Sustainable Credit Protocol Based on Web3 Ecology. Getaverse provides credit value for the construction of a blockchain society, and is the world's first growable credit protocol based on Web3 ecology.Getaverse's credit protocol will become a protocol application that can provide high-value data services for the entire Web3 ecosystem, like Chainlink in the future. While Chainlink provides simple transportation of data, Getaverse realizes the value discovery and precipitation of data. What makes your project unique? Getaverse will implement its own development plan through three stages to establish its own basic traffic pool, run the node network and implement the API access standard of the protocol, improve platform activity, ensure transaction security and stability, provide high-quality credit services and user experience, expand the market space, and bring more interconnection and growth potential to the entire Web3 ecosystem. History of your project. Getaverse team developed more than one years and launched Getaverse DID platform 1.0 in January 2023, then upgraded Getaverse DID 2.0 in April 2023. Getaverse DID Platform has 140k+ active users and 130k+ Geta SBT minted as of July 2023. What’s next for your project? Getaverse is dedicated to creating a unified identity ecosystem where users can easily manage and control their digital identities and data. It allows users to utilize their identities in different applications and scenarios, empowering them with decentralized identity and the ability to assert their identity value in Web3. What can your token be used for? Token Utility : Staking & Governance, Curating Dataset, Paying for Data Consumer Indexing Fee, Improving Credit Score, Paying for Trusted Verifier Node, Paying for Trusted Verifier Node Fee, etc.","links":"https://getaverses.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/getaverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb2192a2829a5220bafd5b0a67f3328e209887bee"}}}