{"name":"Klever","id":"klever","symbol":"klv","description":"Klever app is a simple, secure p2p crypto wallet for blockchain with support for Bitcoin (BTC), TRON (TRX), Ethereum(ETH), and other top tokens, coins, and cryptocurrency assets. Klever uses advanced security mechanisms that completely protect the user’s private keys, and makes private keys and sensitive data available only on the user’s specific device, utilizing the latest military-grade technology for encryption. This means you truly own and control your Bitcoin, TRX, and other crypto and TRX tokens. No third party, including Klever, can access your private keys or restrict any transaction the user decides to make. Transactions of coins and tokens are direct, safe, secure, and fast, and are instantly recorded on the blockchain. Klever support for p2p Bitcoin (BTC) uses SegWit technology, which means the transfer of coins is faster and more secure in the wallet. Klever Features: * Full Privacy: No personal information is required, there is no login or sign up * The all-in-one wallet mobile app for blockchain and cryptocurrency * Industry-leading in-app support and help center * No fees - Yes, that’s right - send and receive is free * A simple and easy to use user interface allows for a fast and intuitive experience * Your keys are yours and PRIVATE to you alone - YOU truly own your crypto * Fully decentralized p2p wallet and gateway to the digital decentralized economy * Optimized push notifications allow for immediate notifications once transactions are processed * The most secure and trusted source to hold digital money in a mobile device * Integration with QR codes enabled quick scanner/reader * Transaction history for Bitcoin and other popular cryptos * Unlock the app and access all functionalities with safer security mechanism like Face ID and fingerprint","links":"https://www.klever.io/","market_cap":14272114,"market_cap_rank":1105,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/klever/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}