{"name":"Arcana Network","id":"arcana-token","symbol":"xar","description":"Arcana is making Web3 effortless with it's suite of products. Arcana offers web3 infra for devs with its suite of plug and play SDKs to help developers build, launch, and scale almost any type of apps. Arcana is a UX-focused Validium chain built to simplify Web3 UX and adoption **Arcana's Products:** 1) Web3 Authentication - Social Auth + much more 2) Gasless Transactions 3) SendIt: Send crypto via emails and a lot more releasing soon. To begin with, Arcana launched the **Auth SDK** - an easy way for devs to onboard users and give them a non-custodial wallet. In other words, app users can use their email or social logins, and instantly get a secure, in-app wallet. No passwords, no seed phrases, no installations. Developers can simplify Web3 Authentication and improve user conversion rates by up to 90%. It is the fastest decentralized social login in web3 with a sub-5-second login time. Arcana's second product is **Arcana Gasless**, an ERC 4337 based solution that allows developers to sponsor gas fees for their users. This solution is in line with the popular trend of Account Abstraction. Arcana's third and popular product is **SendIt**, the Paypal of Crypto. With SendIt, users can send crypto to an email address thereby simplifying crypto payments and making it accessible to everyone. Arcana uses DKG, Threshold cryptography, proxy re-encryption, and other cutting edge cryptography to build its blockchain . Arcana Auth has generation over 3M wallets since its launch in Feb 2023. Private NFTs, Token Gating, Metaverses, DeFi protocols, Games, and Social Networks are some of the usecases that Arcana can power. Arcana's B2C app SendIT allows any user to send crypto to another user with just their email ID. SendIT was launched in July 2023 and quickly gained 100,000 users in 3 weeks, and crossed 500,000 users and 5Mn transactions in Oct 2023. **$XAR** is the native utility token that will be used for ecomonic security of the Appchain","links":"https://arcana.network/","market_cap":5575890,"market_cap_rank":1511,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arcana-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5027fc44a7ba114b8f494b1e4970900c6652fedf"}}}