{"name":"Arcana Network","id":"arcana-token","symbol":"xar","description":"Arcana Network is a leading Chain Abstraction Protocol powered by a modular Layer 1. Arcana’s Chain Abstraction eliminates asset fragmentation and the friction of bridging between chains. It offers users a Unified Balance of their USDC, USDT, and ETH balances across chains, allowing them to spend their entire balance on any chain instantly, without bridging—a seamless, bridgeless, and near-instant experience. Web3 ecosystem has exploded with 100s of L1s, L2s, rollups, sidechains, and appchains, adding immense friction for users trying new chains, while chains struggle to attract and retain users and maintain TVL. Arcana solves this by providing unified balances, auto-funding gas fees with stablecoins, and near-instant multi-chain transactions. In addition to these, $XAR’s Chain Abstraction Protocol does three things extremely well compared to other protocols: - EOA Wallet-Based Orchestration: Users can bring existing wallet addresses without locking funds or depositing into new accounts—maintaining full self-custody of assets. - Gas Efficiency: Upto 5X lower gas fees compared to smart contract-based chain abstraction protocols - Universal Addresses: Arcana does not create app-specific wallets that require users to deposit tokens. So users assets remain in a single wallet, accessible across apps —even on apps that do not support chain abstraction. The Chain Abstraction protocol is live on Testnet, with a Mainnet release planned for Q1 2025. Users can experience Chain Abstraction through Arcana Wallet, a Chrome extension launched in Oct 2024, or via the SDK integrated by app developers. Who Are the Founders of Arcana Network? Founded in 2021 by CEO, Mayur Relekar, and Co-founders Aravindh Kumar and Abhishek Chaudhary, Arcana Network aims to be the most developer-focused chain abstraction protocol enabling high performance and user-friendly apps. Arcana’s Other Products Include: 1. Arcana Auth SDK: An easy way for developers to onboard users and provide them with a non-custodial wallet. Users can log in using their email or social accounts and instantly receive a secure in-app wallet—no passwords, seed phrases, or installations required. It’s the fastest decentralized social login in Web3, with a sub-5-second login time 2. Arcana Gasless: ERC-4337-based Account Abstraction, enabling developers to sponsor gas fees for users. 3. SendIt: The “PayPal of crypto.” SendIt allows users to send crypto to an email address, simplifying crypto payments and making them accessible to everyone. Across these previously launched products, Arcana has experienced tremendous growth. Arcana Auth has generated over 4 Million wallets with 5,000+ apps deployed, since its launch in February 2023. SendIt has onboarded over 500,000 users, who have completed more than 5 Million transactions, since August 2023. Since its inception in 2021, Arcana has raised 4.5Mn+ USD from leading investors and founders in the ecosystem such as Balaji Srinivasan, Founders of Polygon, Polygon Ventures, Woodstock, Republic Crypto, Digital Currency Group, Fenbushi, and 40+ investors. Arcana’s native token, $XAR, had its Reg D public token sale on the Republic platform on November 29, 2023, and is listed on Bybit, Gate, and MEXC.","links":"https://arcana.network/","market_cap":5617245,"market_cap_rank":2248,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arcana-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5027fc44a7ba114b8f494b1e4970900c6652fedf"}}}