{"name":"Arcana Network","id":"arcana-token","symbol":"xar","description":"What is Arcana Network? Arcana is building the data layer for Ethereum and other blockchains, offering a privacy stack for any developer to build secure and privacy preserving apps. Arcana uses DKG, Threshold cryptography, proxy re-encryption, and other cutting edge cryptography to build its blockchain . Arcana runs on its own Proof-of-Stake Blockchain and currently supports Ethereum and other EVM compatible chains, with plans to support other blockchains in the future. Private NFTs, Metaverses, DeFi protocols, Games, and Social Networks are some of the usecases that Arcana can power. XAR is the soon-to-be launched native utility token that will be used to incentivise nodes and validators that offer compute and storage. It will also be used for staking with validators and paying out staking rewards. Arcana launched its Alpha Testnet in November of 2021 and plans to roll out its Beta Testnet and Alpha Mainnet in 2022. Arcana has raised 2.7Mn USD from some of the leading investors and founders in the ecosystem such as Balaji Srinivasan, Founders of Polygon, Woodstock, Republic Crypto, Digital Currency Group and Others. The Four Core parts of Arcana Network’s privacy stack are - 1) Authentication: Onboard users and create wallets with social logins or password-less magic links. Drastically reducing onboarding friction. Arcana secure’s the keys with threshold cryptography that ensures only the users can retrieve the keys. 2) Identity and Access Management: IAM assigns DIDs to data and users can define access policies around who can access it, for how long, and other permissions that they are allowed to do. The access policies are completely enforced onchain without any centralised servers. 3) Key Management: The network securely store’s and shares the keys that belong to the users and their data by ensuring only the right apps/users/servers get access to it. 4) Encrypted Storage: Any asset uploaded to Arcana is encrypted, split up and distributed among multiple storage nodes. Without a single-point of failure your assets are protected against geo-specific disasters and hacking attempts. Arcana not only aims to serve Web3 developers, but scale it to the wider Web2 customers since privacy is a global problem faced even beyond Web3. Who Are the Founders of Arcana Network? Founded in 2019 by the CEO Mayur Relekar, and Co-founders Aravindh Kumar and Abhishek Chaudhary, Arcana Network aims to be the most developer-friendly platform, and gives developers the capability to build more secure and privacy-preserving applications from the ground up. Mayur is a seasoned entrepreneur and was the Chief Product Officer of startup studio before starting Arcana. The founders have been building in the blockchain space across different products since 2018 and decided to build Arcana from the problems they personally faced as Web3 developers.","links":"https://arcana.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arcana-token/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}