{"name":"ArchAngel","id":"archangel-token","symbol":"archa","description":"The ArchAngel Token (ARCHA on ERC20, BSC, and FTM) is a cryptocurrency project that develops innovative solutions designed to accelerate the global adoption of cryptocurrencies and digital assets. ARCHA focuses on four core areas: Industry & Technology, Projects & Ecosystems, People & Communities, and Financial Freedom. The ArchAngel DoV Ecosystem is building a family of like-minded projects who strive to develop and provide real solutions to real problems. Projects within the Ecosystem mutually support each other in a non-competitive environment and share developed features & utilities with each other. This allows each project to focus intently on their individual solution(s) while being able to consume and utilize features and utilities being developed by every project within the Ecosystem. Archa's Staking Pool provides stakers with native tokens from every project in the ecosystem. Ecosystem projects contribute a small portion of their transaction taxes/native tokens, and those tokens are distributed to all members of the staking pool for passive rewards. Archa's NFT Program on OpenSea is being integrated into numerous Archa and Ecosystem project features and utilities. The collection features themed sub-collections which contain just 500 1-of-1 NFTs. These NFTs will play in integral role in major development initiatives occurring within the Ecosystem. Please visit Archa's official website to review our project artifacts: Whitepaper, Technical Roadmap, Ecosystem Roadmap, and our NFT Collection Guide.","links":"https://archangeltoken.com/","market_cap":519167,"market_cap_rank":3214,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/archangel-token/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x36e43065e977bc72cb86dbd8405fae7057cdc7fd"},"fantom":{"decimal_place":9,"contract_address":"0x5e2e2d3ee4944d0e6c0b663625859cf8cc45ca88"},"binance-smart-chain":{"decimal_place":9,"contract_address":"0xb0ff8188f374902bb180bd186d17967b5b1188f2"}}}