{"name":"Wins","id":"wins","symbol":"wins","description":"What is the project about? $WINS is a reward token used by Trophy, a gaming loyalty platform. Trophy is built to serve both mobile and web3 games. Trophy offers a curated list of games for players to choose from, like a miniature app store. Players are financially rewarded for their in-game progress via gift cards or $WINS tokens -- the more they play, the more they earn. On the other side, game developers pay Trophy to be featured and acquire users. In this way, Trophy cuts out the game advertiser middleman, passing along games' ad spend directly to users. What makes your project unique? $WINS emissions are revenue-based, which is a major innovation for reward tokens. Most gaming reward tokens have unbacked emissions, which creates hyperinflation. In contrast, Trophy uses revenue to purchase tokens from open markets, which it then distributes to players. In this way, all token emissions are non-inflationary. History of your project. Trophy is founded by veterans in gaming and mobile advertising. Trophy is seeded by Superlayer, a web3 venture studio focusing on consumer applications. Trophy started development in November 2022, and launched its mobile app on Android in June 2023. What’s next for your project? Trophy will continue to grow its userbase and roster of games in order to connect games directly to players. Trophy will add wallets in partnership with the Rally Network Association (RNA) to onboard mobile gamers to web3. As web3 gaming grows on mobile, Trophy aims to partner with web3 games and integrate with their on-chain needs, be it NFTs or marketplace integration. What can your token be used for? $WINS is primarily used as a sustainable reward token for Trophy users. $WINS will also be able to be redeemed for perks to Trophy users.","links":"https://playtrophy.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wins/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5f48d1fd6814cd1cd38aeb895755e57d519196d1"},"polygon-pos":{"decimal_place":18,"contract_address":"0x1a49e59ab7101d6a66d6b2fa6d09932079cc80ec"}}}