{"name":"INSECT","id":"insect","symbol":"ins","description":"The INSECT token (INS) is the native currency of the INSECT ecosystem. Operating on the TON CHAIN (TON), INS serves as a fundamental component that drives the entire ecosystem forward. With a total supply of [insert total supply], the token plays a crucial role in facilitating various activities within the INSECT Journey project. Utility: INS serves as a utility token within the INSECT ecosystem. Holders can utilize INS for various purposes, such as accessing exclusive features, participating in ecosystem activities, and availing discounts or benefits offered by project partners. Insect NFTs: The INSECT Journey project introduces a collection of limited edition NFTs (Non-Fungible Tokens) that hold significant value and exclusivity within the ecosystem. NFTs are unique digital assets that are indivisible and cannot be replicated, making them one-of-a-kind tokens that can represent ownership of digital or physical items. One of the key features of the limited edition NFTs in the INSECT Journey project is their ability to generate passive income for holders. Each limited edition NFT is designed to provide a lifetime income stream based on transaction volume within the ecosystem. Specifically, holders of these NFTs are entitled to a 0.5% share of the transaction volume, ensuring a continuous and sustainable income source. Play-To-Earn Game: The INSECT Journey project is set to introduce an exciting Play-toEarn game, designed to engage and reward participants. This immersive game will provide players with a unique gaming experience while offering opportunities to earn valuable rewards within the ecosystem. Launchpad: The INSPAD Launchpad is a flagship feature of the INSECT Journey project, serving as a platform to launch innovative and promising crypto projects. The launchpad provides a secure and reliable environment for project creators to showcase their ideas to a wide audience of investors and enthusiasts.","links":"https://insects.vip/","market_cap":279753,"market_cap_rank":3675,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/insect/logo.png","detail_platform":{"the-open-network":{"decimal_place":9,"contract_address":"EQBecg3E6822M1aZOZhqzMWaSRGP712sDRkQgHO4MSgDRDHq"}}}