{"name":"Shila Inu","id":"shila-inu","symbol":"shil","description":"Once upon a time there lived a young couple, Shiba and Shina. They had a vision of bringing cryptocurrency to the world. So they decided to have a baby, whom they named Shila. Raising her was hard work but rewarding, for Shila immediately took to technology and all things crypto-related. By the age of five she could be found programming on her parent’s computers late into the night. Shila always asked questions, and with each answer uncovered more mysteries about how the currency works. She quickly outpaced her parents in understanding wallets, blockchains, consensus algorithms and mining rigs - it seemed like no matter what she did she seemed to instantly understand the concept behind it. When she was just ten years old, Shila decided that it was time to start introducing people around the world to cryptocurrency and teaching them how it works. At first her parents were worried that this was too much responsibility for someone so young; while they believed in her capabilities deeply they didn’t want her to go head first into such an unknown field without any guidance or help from experienced professionals. Nevertheless, being a determined youth she found ways around such resistance and established an online school giving free classes on how use crypto safely and securely. Though many were unaware of who she truly was at first (noting only that she went by “CryptoKiddo”), as word of mouth spread word of her unique teaching style soon spread around the globe; something magical happened as each day more people signed up for her classes eager to learn all they could. While her classes initially taught basics such as balance transfer techniques and wallet set up processes, soon enough participants adopted increasingly ambitious projects – teaching others building smart contracts or coding custom decentralized applications! As people began using these newfound skills in real world situations, though initially scared at what lay ahead Shila eventually realized that de","links":"https://shila.tech/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shila-inu/logo.png"}