{"name":"BigWater","id":"bigwater","symbol":"bigw","description":"BigWater Protocol's vision is grounded in real environmental change. This ranges from supporting large scale afforestation and reforestation projects, preventing pollution of oceans to expanding clean water access to underserved communities. Its approach combines aspects like Real World Asset (RWA) tokenization, Decentralized Physical Infrastructure Networks (DePIN), Decentralized Science (DeSci), and AI-powered environmental analytics on Big Data. The initiative is built mainly on two pillars; Clean Air and Clean Water. BigWater Smart Air Purifiers are DePIN devices that not only provide Clean Air to the user but also enable 1000 litres of Clean Water for underserved communities with on-chain distribution data linked to an NFT issued to every user of the Air Purifier. Above all, users are rewarded with $BIGW tokens issued directly to their wallets for every 20 hours of active functioning. This not only serves as an incentive for people to operate their Air Purifier but also acts as a passive stream of income for them. This ecosystem gathers data on blockchain that ensures traceability and verification thereby delivering Proof of Impact through Impact Assessment Reports that quantify the value of impact delivered by every user individually and the entire network collectively. The commitment to \"Proof of Delivery\" is what truly makes BigWater different from any other project in the DePIN sector. BigWater is supporting the Government of India's commitment of “Net Zero by 2070” being implemented through large-scale afforestation, biodiversity conservation, and ecosystem restoration under the Mission LiFE project. Trees are geo-tagged using geospatial intelligence, AI-enabled drones, and real-time monitoring to ensure \"Proof of Existence\". Projects are also being undertaken in South East Asia, Africa and Latin America to encourage reforestation of the Amazon Rainforests.","links":"https://bigwater.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bigwater/logo.png","detail_platform":{"xdc-network":{"decimal_place":18,"contract_address":"0xc9b1b2842c60303a06f60fdd005654575d6ae466","geckoterminal_url":"https://www.geckoterminal.com/xdc/tokens/0xc9b1b2842c60303a06f60fdd005654575d6ae466"}}}