{"name":"Curveswap","id":"curveswap","symbol":"cvs","description":"What is the project about? Curve Swap is a fully decentralized Curve network swap protocol. Fork of Pancakeswap and User-Friendly interface. Trade, earn, and win crypto on the most popular decentralized platform in the Curve network Blockchain. Curveswap Provide investors with the ability to easily trade, view charts and transaction in details. What makes your project unique? Low fees Why pay more? CurveSwap runs on Curve Network (CRC-20), a blockchain with much lower transaction costs than Ethereum, Binance or Bitcoin. Trading fees are lower than other top decentralized exchanges too, so that's a double win for you! Decentralized Trade directly from your wallet app. Unlike centralized exchanges like Binance or Coinbase, CurveSwap doesn’t hold your funds when you trade: you have 100% ownership of your own crypto. 💸 Earn Earn $CVS and other tokens for free with super high interest rates. Earn tokens with Syrup Pools Stake CurveSwap (CVS), earn free tokens. It’s really that easy. New projects free to join the party frequently, so you can earn more, for even longer. Earn CurveSwap (CVS) with Yield Farms Stake LP tokens, earn CurveSwap (CVS). You take on a little more exposure to market fluctuations than with the Syrup Pools, but can earn higher APR to offset the risk. Earn Trading Fees No farm? No problem. Even if your trading pair isn’t supported on the Farms page, you can still earn trading fees when you stake your tokens in Liquidity Pools (LPs). History of your project. Curveswap is backed by Curve Network team. What’s next for your project? Building Launchpad on Curve Network Mainnet CRC20. What can your token be used for? Staking, Farming, Vote on proposals","links":"https://curveswap.app/swap","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/curveswap/logo.png","detail_platform":{"":{"decimal_place":18,"contract_address":"0x11b834b2b653eaab67acf7369552ee3d7beeb8f7"}}}