{"name":"Kingdom of ANTs ANT Coins","id":"kingdom-of-ants-ant-coins","symbol":"antc","description":"What is Kingdom of ANTs? Kingdom of ANTs (KOA) is a gamified DeFi platform, optimised for speed, flexibility, and ease-of-use. It is built on Solana, powered by yield-bearing NFTs and an integrated AI framework. Users can play and earn from various activities on KOA, besides staking $ANTC for APYs. What is Ant Coin ($ANTC)? Ant Coin ($ANTC) is KOA’s native currency, based on the SLP token standard. It’s a utility token that lets users perform a range of use-case. For example: Payments: The fees for ‘Activities’ in the Kingdom’s ecosystem are payable in $ANTC. Similarly, users can buy, sell, and transfer $ANTC like any other cryptocurrency. Staking: Users can earn staking rewards and APYs by locking $ANTC into dedicated on-chain vaults or smart contracts. Governance: After KOA’s transition to a Decentralised Autonomous Organization (DAO), $ANTC holders can participate in its distributed governance mechanism. When live, this system will use $ANTC holding as a key parameter to determine the user’s voting power. Airdrops & VIP Access: KOA’s circular economy and reward distribution mechanism will ensure consistent rewards and exclusive benefits for long-term $ANTC holders. For example, they will get priority access to future products, NFT collections, etc. What is KOA’s treasury management system? KOA has an AI-integrated treasury management system to ensure sustainable, long-term yields for users. Some of the main ways to ensure the Treasury’s sustenance and growth include: The proceeds from in-game NFT and asset sales will partially return to the Treasury. This will help create a circular economy, with a steady revenue stream. KOA will implement an algorithmic balancing system to invest a portion of the Treasury’s assets for profit generation. The portfolio will be accessible to the community via the Kingdom of ANTs website. Decisions regarding these investments will be made through community voting involving the DAO. AI plays a key role in KOA’s treasury mana","links":"https://kingdomofants.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kingdom-of-ants-ant-coins/logo.png","detail_platform":{"solana":{"decimal_place":5,"contract_address":"4WRST6Q2yyDP1p7Bqszg8PAAoj8j69cj7QY4QLn5Aq3o"}}}