{"name":"Gram Platinum","id":"gram-platinum_polygon-pos","symbol":"gramp","description":"Launched in November 2022, Gram Platinum Token (GRAMP) is an asset-backed token redeemable 1:1 for 1 gram of platinum. Issued by Token Teknoloji Anonim Şirketi, this token is fully backed by platinum on the blockchain at a 1:1 ratio and indexed to the price of platinum. For every GRAMP created, an equivalent amount of physical platinum is held as collateral in the company's reserves. GRAMP provides a cost-effective, fast and secure solution for global users, offering direct ownership with no storage costs and high accessibility for 24/7 transactions and transfers, regardless of geographical boundaries. Unlike platinum transaction limits in the market, there are no minimum transaction limits for GRAMP transactions. GRAMP transactions are executed instantly and any amount of GRAMP tokens can be converted to fiat currencies, ensuring quick and efficient transactions. GRAMP is created and runs on the Avalanche C-Chain and Polygon blockchain, and it is compatible with all blockchain wallets that support EVM. It uses smart contracts to automatically manage the collateralization process. As the demand for GRAMP tokens increases, the Token Teknoloji Anonim Şirketi will add the equivalent amount of physical grams of platinum to its reserves for each GRAMP token upon the request of institutions wishing to meet their demand. This ensures that the 1:1 ratio between grams of platinum and GRAMP is maintained whilst keeping the market in balance between supply and demand. And a coin burn function is built into the blockchain's smart contract to remove a pre-determined amount of GRAMP tokens from circulation when needed, ensuring a balance between GRAMP and the gram of platinum. Thanks to this mint-and-burn mechanism, the price of GRAMP is always in equilibrium with the price of the physical gram of platinum.","links":"https://www.token.com.tr/en/reserve-tokens/gram-platinum-gramp/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gram-platinum_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xe229b734251dd48dda27bb908d90329f229c3531","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xe229b734251dd48dda27bb908d90329f229c3531"}},"is_native":false}