{"name":"Ēnosys","id":"enosys","symbol":"hln","description":"Ēnosys is a Web3 software house, building a suite of DeFi and Web3 products and services. The Flare Network is home to the Ēnosys mainnet ecosystem with a parallel Experimental Finance ecosystem on the Songbird Canary Network. The Ēnosys ecosystem consists of the following products: Ēnosys Dex - Swap currencies and earn rewards by providing liquidity for on-chain trading while taking advantage of L1 rewards. Ēnosys Farm - Non-custodial yield farming and token launchpad with integrated L1 rewards. Ēnosys Loans - A decentralized borrowing protocol for interest-free loans, utilizing integrated cryptocurrencies as collateral for seamless borrowing. Ēnosys Bridge - Cross-chain asset bridge allowing for diversity amongst blockchains and enabling the expansion of the Ēnosys ecosystem towards a multi-chain future by bridging Ēnosys governance tokens to . Ēnosys Gallery - NFT Gallery with both curated and secondary marketplaces and a set of unique NFT related protocols; Ermis - On-chain redemption protocol that bridges digital art to its physical counterpart and Clover - A fair distribution protocol designed for companies to create private events and fair, transparent marketing campaigns. All products within the Ēnosys ecosystem are connected to a Central Yield Aggregator - The APYCloud. A proportion of all protocol fees are contributed to the APYCloud which aggregates fees and distributes sustainable yield to Governance participants through all market conditions. Mainnet Ecosystem Governance Tokens: Apsis (APS) is the primary governance token of the mainnet ecosystem and it is distributed to the community as the primary reward token for participating in the ecosystem. The maximum supply is 15,000. Helion (HLN) is the secondary governance token of the mainnet ecosystem. The maximum supply is 150 million. 30 million HLN will be distributed to the community over the course of 12 months based on their participation within both ecosystems.","links":"https://enosys.global","market_cap":3815997,"market_cap_rank":2256,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/enosys/logo.png","detail_platform":{"flare-network":{"decimal_place":18,"contract_address":"0x140d8d3649ec605cf69018c627fb44ccc76ec89f"}}}