{"name":"XList","id":"xlist","symbol":"xlist","description":"The XList token runs on the XRPL network and its main utility allows XList holders to decide through the power of voting which exchange XList will list on every two months. XList holders can also vote for their favourite XRPL project from a list that is participating in the voting at the same time. The project with the highest number of votes will list on the exchange with the highest number of votes alongside XList. XList covers the listing fees of both projects to list on the winning exchange. XList is working to establish partnerships or close relationships with exchanges involved in the voting process and will be able to negotiate good offers for the listing fees. XList holders vote using their Xumm wallet and the number of votes applied equals the number of XList tokens held in their wallet. XList held its first vote during the presales in May 2022 which finished on 1st June. The exchange for the first vote was Bitrue and the XRPL project which won the vote was Staykx. XList & StaykX therefore listed on Bitrue exchange and XList covered the listing fees for both projects. See XList website for more information: https://www.xlist.one Staking is also available to XList holders and they will be able to stake their XList to earn passive income over time. Staking is available on CEX and DEX platforms. XList is collaborating with the NVL project and NVL holders will earn XList from staking too. XList also launched the XList Totem Pole which represents and commemorates the history of the XList project and the XRP community. It records the history of all XList Vote winners. Every time a vote is completed and the winners are announced then the XList Totem Pole is updated with the logo of the winning exchange and XRPL project. These are added to the rings on the bands of the XList Totem Pole. The rings on the bands are always reserved for this purpose. The XList Totem Pole also has 63 permanent advertising spaces on the wings (front & back) and the tail where a logo or image can be placed. Each space can include one or more links to website URLs or an image of your choice so it is great for advertising. Just click on show or hide annotations to view links on the Totem. Anyone can be featured on the Totem Pole including XRP community leaders, influencers, XRPL projects, individuals, companies, etc. The permanent spaces can be purchased from https://store.xlist.one When all 63 spaces are bought and allocated then additional XList Totem Poles will be generated with blank wings and tail. The rings on the bands will always be exactly the same across every XList Totem Pole showing the exchanges and XRPL projects that XList has helped and supported along its journey. All Totem Poles will be available to view. XList is actively seeking to develop partnerships and collaborations with Metaverse and gaming projects that would like to feature the XList Totem Poles. This will help bring awareness to anyone who is featured on the totem poles and be a bit of fun for anyone involved in the Metaverse or gaming platforms when they stumble across the XList Totem Poles. XList kindly welcomes any Metaverse or gaming projects to get in touch to chat about collaborating. XList has not held any free airdrops or free giveaways to the public. Instead, two rounds of presales were held and Initial Dex offerings. XList is focused on protecting its investors and has a well planned long-term strategy aimed at growing the value of the XList token and the XList project while helping support other great XRPL projects.","links":"https://www.xlist.one","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xlist/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}