{"name":"Tonestra","id":"tonestra","symbol":"tnr","description":"Tonestra is the healthcare and biometric blockchain project that is poised to transform information sharing and record keeping in healthcare industry. This will cover such areas as pharmaceuticals, medicinal research, genome technology, nursing science and the whole ecosystem of biotechnology. Blockchain technology has found a lot of useful application in many areas of human endeavor and health sciences is one of such areas. Tonestra offers the first complete blockchain healthcare project where scientist and healthcare receivers can have their data securely stored for utilization by healthcare practitioners. This platform will provide a veritable system where pharmaceutical industries, healthcare NGO’s, patient affirmative action support agencies, hospitals, drug development companies and insurance businesses all can interact for the advancement of health science and business. Also genomics and biometric companies can utilize the platform in sequencing and storage of scientific data for continuous research development and improvement for humanity. This will prove extremely useful in the advancement of research and development of knowledge in such gene diseases as cancer, Alzheimer’s, autism, lou gherig disease and a host of other diseases that are enshrined in the human genes, including a number of congenital birth defects. The Tonestra token, TNR will be the dynamic currency fuel payment unit which will power the system platform. The tokens will be attached to data storage and in transmitting information across the Tonestra network and ecosystem. Five million Tonestra TNR tokens shall be created and traded on major cryptocurrency exchanges. The Tonestra platform shall provide the largest healthcare technology and medical science data storage system where contributors will have absolute control over how they can utilize the stored data for their financial benefits. The business and research potential is limitless. Tonestra will have an underpinning artificial intelligence research based methodology which will use machine learning techniques in developing and sharing information for all contributors. The use of Blockchain technology distributed ledger system will ensure reliability of the systems, personalized authentication and very importantly engender the elimination of trust problems amongst users. A cryptographic key generator is used in generating keys utilizing assymetric algorithm and permission based smart contract. Contributors will have control over their private keys and will only grant access to users who have been pre-approved through an authentication process. The use of the platform will enable healthcare providers and drug development companies to identify the best course of medical regiment for the treatment of a patient, prevention of diseases in healthy population, prediction of possible outbreaks and mutation, disease diagnosis, prognosis and identification of possible new drug type for treatment","links":"https://tonestra.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tonestra/logo.png"}