{"name":"BOX","id":"box-2","symbol":"box","description":"a leading DeFi Platform on EOS since 2020 Introduction to Defibox Defibox is a professional decentralized finance (DeFi) platform built on the EOS blockchain, offering a comprehensive suite of financial services including decentralized trading, lending, and stablecoin solutions. As one of the leading DeFi ecosystems in the EOS network, Defibox is committed to providing users with secure, efficient, and transparent financial tools while maintaining the core principles of decentralization. Core Features of Defibox Decentralized Exchange (DEX) Defibox operates an automated market maker (AMM)-based decentralized exchange, enabling users to trade EOS and other token pairs seamlessly. The platform supports low transaction fees, high-speed settlements, and deep liquidity pools, making it a preferred choice for traders within the EOS ecosystem. Lending & Borrowing Protocol Defibox’s lending platform allows users to deposit assets to earn interest or borrow against their collateral. The protocol supports multiple assets, including EOS, USDT, and BRAM (Defibox’s native stablecoin), ensuring flexible financial strategies for users. Stablecoin Solutions (USN) Defibox issues USN. These stablecoins provide stability and utility for trading, lending, and hedging against market volatility. Governance & Community-Driven Development Defibox is governed by its community through the BOX token, which allows holders to vote on key protocol upgrades, fee distributions, and ecosystem expansions. This ensures a decentralized and democratic decision-making process. Security & Transparency Defibox prioritizes security with smart contract audits, multi-signature wallet management, and real-time monitoring. Despite past challenges, such as the January 2025 hack, the team has demonstrated resilience by implementing enhanced security measures and initiating a fair refund plan for affected users. Future Roadmap Defibox continues to innovate, with plans to expand cross-chain interoperability, introduce new financial products, and further optimize user experience. By combining DeFi’s efficiency with EOS’s scalability, Defibox aims to remain a cornerstone of decentralized finance in the blockchain space.","links":"https://defibox.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/box-2/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}