{"name":"CYBERTRUCK","id":"cybertruck-2","symbol":"cybertruck","description":"Welcome to the revolutionary world of CYBERTRUCK, the latest project developed by Elon Musk's company. Inspired by the iconic Cybertruck, this meme coin aims to disrupt the cryptocurrency market with its unique and daring approach. Buckle up and get ready to embark on an exhilarating journey unlike anything you've experienced before! In a world dominated by mundane and predictable cryptocurrencies, CYBERTRUCK stands tall, challenging the status quo. Just like its namesake, this coin is bold, unconventional, and ready to break barriers. With $CYBERTRUCK, we're not just offering a digital asset; we're offering a lifestyle, a symbol of rebellion against the ordinary. Memes have become a language of their own, connecting people across cultures and boundaries. CYBERTRUCK leverages the power of memes to create a vibrant and engaging community. Our team of meme experts curates exclusive, hilarious, and thought-provoking content that keeps our community entertained and connected. Get ready to laugh, share, and meme your way to financial success! With CYBERTRUCK, we are not just building a meme coin, but a futuristic ecosystem. Our vision extends beyond the boundaries of the cryptocurrency market. We are actively exploring partnerships and collaborations with various industries to bring the CYBERTRUCK experience to the real world. Community-driven Governance At CYBERTRUCK, we believe in the power of community. We value the opinions and ideas of our community members, and we empower them to shape the future of our project. Through decentralized governance, every member has a voice and a vote in decision-making processes. Together, we will create a vibrant and inclusive ecosystem.","links":"https://cybertruckbsc.space","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cybertruck-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x78948a37bafb910e24a7cf4ccc242d5a6166ea46"}}}