{"name":"WAGMI Token","id":"wagmi-token","symbol":"wag","description":"Introducing a new cryptocurrency with a noble mission - to help children suffering from severe medical conditions and support their treatments through the donations generated from trading fees. The aim of this cryptocurrency is to make a positive impact on society and help those in need. The trading fees collected through the buying and selling of the coins will be directed towards supporting the medical treatments of children with severe medical conditions. The community behind this cryptocurrency believes that everyone deserves the right to good health and that no child should have to suffer because of a lack of financial support. This cryptocurrency is built on the principles of transparency, accountability, and sustainability. The donations will be directed towards reputable organizations that specialize in treating severe medical conditions and have a proven track record of making a positive impact on the lives of children. The community behind this cryptocurrency will work closely with these organizations to ensure that the donations are being used effectively and efficiently. This cryptocurrency is also designed to be user-friendly and accessible to everyone. The platform will be easy to use, and the coins will be available for purchase on various exchanges. The team behind this project is committed to continuously improving the platform and making it more accessible to users around the world. In conclusion, this cryptocurrency project is a unique and innovative solution to a pressing social issue. The project is aimed at making a positive impact on society and helping children in need. The team behind this project is committed to making a difference and working towards a brighter future for all.","links":"https://www.wagmitoken.org/en/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wagmi-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x93442c6fb58a197bd5562891f9e76f07c57df2ba"}}}