{"name":"Poodlana","id":"poodlana","symbol":"poodl","description":"Launched via presale on 17th July, and on the open market on 16th August after 30-days, Poodlana is a poodle-themed Solana altcoin. Tapping into the intense appetite for both high fashion and toy poodles, Poodlana is a coin created specifically for the Asian market. These strategic decisions by the Poodlana team are based on several insights. Firstly, according to recent data published in CoinDesk, 80% of meme coin trading occurs within Asian hours. And according to Statista, the Far East consumes more luxury fashion than any other region. This direct appeal to such a rich market was likely a contributor to Poodlana raising over $1 million in the first 24 hours of its presale. Secondly, poodles have shown particular popularity across east Asia, ranking within the top three breeds in China, Japan, and Korea, according to Statista. Since the meme/altcoin market has been heavily dominated by doge derivatives for the past several years, this poodle-centric decision was made to offer East Asian investors a dog-themed meme coin tailored to Asia's specific dog preference. Roadmap wise, now that Poodlana has listed on CEX it’s ramping up marketing and product development. The Poodlana team has plans to expand its influencer relationships. And, in keeping with its high fashion positioning, Poodlana will be partnering with an array of fashion brands and lifestyle platforms to spread the Poodlana message 360 degrees. In terms of technical innovation and community perks, Poodlana has plans to create a staking platform serving its elite, fashion-savvy audience, as well as offering them exclusive airdrops and bonuses as the project progresses through its milestones. Long-term, Poodlana has plans to take the brand fully global, using its core East Asian community as a springboard. Poodlana is going after international partnerships, high-profile event appearances, and multi-language support. And finally, like any half-decent high-profile fashion icon, Poodlana has plans for some poodle philanthropy, with plans to support a range of canine charities.","links":"https://poodlana.com/","market_cap":3368.26,"market_cap_rank":10307,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/poodlana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"7f7dgNNeL1RwbEd6Eao5BE8KNurTnLZnRZeVjkCGJgQD","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/7f7dgNNeL1RwbEd6Eao5BE8KNurTnLZnRZeVjkCGJgQD"}}}