{"name":"Perpbot","id":"perpbot","symbol":"pb","description":"Our trading bot has a comprehensive suite of features designed to help you win. All free-to-use. Introducing PerpBot Built with on-top of the Hegic & dYdX, we enable users to experience lightning fast multi-asset trading from the comfort of their Telegram account. We aim to provide the most accessible and efficient trading tools for Ethereum and all EVM-Based Layer-2 solutions. Our offering is inclusive of a free to use telegram Sniper & holder perquisite Perpetual / Options trading HUB’s. P2B Sniper The P2B sniper operates in the mempool enabling users to instantly execute per block trades at lightning fast speeds. We have gone a step further to include MEV-Protection, Copy & Automated trading functionality alongside all the home comforts seen in competitor bots. This is all powered by our multi-core P2B cloud technology. P2B Perpetuals The P2B Perp HUB is the first of its kind perpetual trading Telegram bot in existence. To ensure deep liquidity and a secure architecture we have built our tech stack upon the dYdX library using their API’s. Thus allowing users to instantly experience and interact with our unique dashboard UI built into Telegram itself. Without the need to use third party applications or open websites. All possible order types, over 50 perpetual contract pairs and leverage/margin adjustments available on the dYdX platform are directly available to users of our HUB. Revenue Sharing We have spent considerable time synergising both HUBs with the $PB lead token. Thus allowing for a unified earning stream for all eligible token holders. Usage fees from the Sniper and Perpetual HUB are combined and made available for withdrawal to all $PB token holders. Importantly, this includes all fees charged for deposits/withdrawals and position management on the Perp HUB and traditional utility of the Sniper. Allowing for a dual-incentive environment for $PB holders. We also have created a referral model paying 50% of these fees to referrers. You may track this on our dashboard.","links":"https://p2b.wtf/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/perpbot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x996ca7e71c37d70132889e29d17d2e44427a03dc"}}}