{"name":"TCAP","id":"tcap","symbol":"tcap","description":"What is TCAP? For cryptocurrency traders, funds, DeFi users, and insitutions, TCAP is an ERC-20 compatible smart contract that tokenizes real-time Total Market Capitalization from all cryptocurrencies and tokens listed on the most reputable crypto data providers in the world. Combining blockchain technology with the process of data aggregation, raw market capitalization data can be brought to market via crosscollateralized, asset nominal tokenization. Asset nominal tokenization starts with the process of taking a data metric, such as Total Market Capitalization. This metric is then set to a divisor of 10,000,000,000. The new, nominal asset token value now trades in lockstep with the underlying data metric it tracks. Collateralizing the new smart contract against multiple assets like ETH or DAI provides the security that this new tokenized asset is backed by a set of rules and collateral enforced by an Ethereum smart contract, thereby tokenizing total market capitalization. For example, if the total crypto market cap resides at 3.5 trillion dollars. We then add a divisor to that number, just like the S&P 500 or any major financial index would. The price calculation for TCAP is as follows: cc = $3,500,000,000,000 dd = 10,000,000,000 rr = \\frac{c}{d} d c ​ = $350.00 Where cc is the total cryptocurrency market cap, dd is the divisor and rr is the TCAP token price. TCAPs are then minted upon being collateralized by an underlying asset, such as ETH or DAI. What the user receives in return is a newly minted asset nominalized token that moves in real time to the penny of the underlying total market cap metric our TCAP Smart Contract is tracking. Each TCAP is algorithmically collateralized by a corresponding amount of ETH/ or DAI needed to appropriately back each token by >200%, thus creating price exposure to the entire cryptocurrency sector with the single push of a button. How to Use TCAP? Mint TCAP: https://app.cryptex.finance/ Trade TCAP: https://app.uniswap.org/explore/pools/base/0x2B70CeA59a418d77265482564610EF4D681D5ad6 What makes TCAP unique? While referenced and quoted every day by millions of people within the investment community as one of the key metrics measuring the expansions and declines transpiring in the space, Total Cryptocurrency Market Capitalization has no means or ability to be minted in real-time form, until now.","links":"https://cryptex.finance/","market_cap":4126.29,"market_cap_rank":10250,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tcap/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x4e99472385a2522aa292b008da294a78f420a367","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x4e99472385a2522aa292b008da294a78f420a367"}}}