{"name":"Blockasset","id":"blockasset","symbol":"block","description":"Blockasset is the sports network you own. We create, build, and manage sports-centric products, governed by our community of sports fans with value is distributed back to you, our community. The Blockasset suite of products includes: BlockPicks: Make picks, earn crypto. It’s that simple with BlockPicks, the sports prediction game where accurate sports picks earn BLOCK token rewards. Play for free, climb the leaderboard, share with friends and start earning rewards. BlockPicks serves as the gateway into the ecosystem, attracting mainstream sports fans with our unique in-game social sharing tools. BlockBet: A community-driven social sportsbook that shares value through our network of members and BLOCK token holders. BlockSport: Our media and distribution arm targets billions of sports fans worldwide with world-class media, leveraging our roster of athlete partners, including Manchester United legend Wayne Rooney and Khamzat Chimaev from the UFC. By disrupting traditional sports outlets, BlockSport allows BLOCK token holders to govern the content we produce and the athletes we partner with. As a member, you can start earning BLOCK tokens immediately by supporting us on social media, staking, adding BLOCK liquidity, playing BlockPicks, and using BlockBet, as part of our comprehensive rewards program. As you progress, you’ll be eligible for greater rewards. At Blockasset, it pays to be a sports fan. So, claim your member's card, acquire some BLOCK tokens, and start earning.","links":"https://blockasset.co","market_cap":24703895,"market_cap_rank":1296,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockasset/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"NFTUkR4u7wKxy9QLaX2TGvd9oZSWoMo4jqSJqdMb7Nk"},"chiliz":{"decimal_place":6,"contract_address":"0x33e5b3e24501774598367bc0832b52787ac39ca5"},"binance-smart-chain":{"decimal_place":6,"contract_address":"0xbc7a566b85ef73f935e640a06b5a8b031cd975df"}}}