{"name":"Defi Warrior","id":"defi-warrior_binance-smart-chain","symbol":"fiwa","description":"DeFi Warrior is a DeFi x NFT Play2earn Blockchain game with a fascinating crypto galaxy game story. While NFT games are creating a strong trend, DeFi Warrior stands out with the combination of DeFi and NFT in the game, along with the story of the crypto world in miniature. In DeFi Warrior, each blockchain is a planet, and each crypto is a warrior. The planet is also the place where warriors can build their coin mining factory, and fight against bosses or enemies for rewards. The token FIWA backed by BEP 20 is the main token. FIWA token is required for trading on DeFi Warrior's NFT market place. We'll burn FIWA token during the project's operation. The NFT Warriors backed by BEP 721 are the main characters in game can be traded on the NFT market and staked in pool to earn token. Such game dynamics aim to achieve two essential goals: to bring the world of crypto to masses through gaming, and to pique the curiosity of both gamers and crypto investors. I. What makes Defi Warrior unique? The following three things can be mentioned as the highlights of Defi Warrior: 1. The first Crypto character & Crypto galaxy game concept We create a miniature world of blockchain in the game. Each Warrior created is a representative of a Cryptocurrency. For example Bitcoin Warrior, Ethereum Warrior or etc. Some gameplays simulate how blockchain works such as mining or fork. 2 Crypto price movement boosts character’s strength Warrior attributes will be buffed based on the price movement of tokens on the market. 3 The first Initial Game Offering (IGO) Crowdfunding call of projects in the game II. Defi Warrior team Defi Warrior is developed by a team of experienced professionals in both technology and Blockchain. We have 5+ years of expertise in developing 05 Crypto exchanges for Japanese & Global markets, crypto wallets, establishing private blockchains, NFT marketplaces, and DEXs. One of our prides is the in-house game development team, Smart Studio Game, with excellent individuals more than 10 years of experience and also produced many outstanding games. 1. Founding team - Mark Dao - Co-founder Founder & CEO - BAP Group. Former Game System Engineer and PM at CyberAgent Group Japan (Ameba game). 5+ years in blockchain development and crypto investment - Victor Truong - Co-founder FCCA, Certified Internal Auditor. CEO - BAP Ventures 10+ years in Business & Finance 4+ years in crypto investment - Loi Luu - Cofounding Advisor CEO & Co-founder at Kyber Network - Long Vuong - Cofounding Advisor: CEO & Founder at Tomochain 2. Smart Game Studio The forerunner of Smart Game Staudio is the Funkoi company whose founder is Mr. Daniel, a Google Technical Leader in Silicon Valley. Later, Funkoi was acquired by BAP and is continuing to grow at the present. Some achievements can be named as: - The Beat Master - Top #2 US in 2021 - Screw Factory - Top #100 US market - Metal Heroes - Featured on Google Store 3. Advisors - Daniel Jeppsson: Technical Project Lead at Google. 18+ years working in game development - Riley Tran Co-founder GFS Ventures. Country Director - Near Protocol - Barek Sekandari: COO of Fantom. Director of SKchain Ventures - Alexandre De Damas. Founder & CEO of Damacorp Global. Partner of Quantum Fintech Group","links":"https://defiwarrior.io/","market_cap":66392,"market_cap_rank":7730,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/defi-warrior_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x633237c6fa30fae46cc5bb22014da30e50a718cc","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x633237c6fa30fae46cc5bb22014da30e50a718cc"}},"is_native":false}