{"name":"Scientia","id":"scientia","symbol":"scie","description":"\"We face a problem today. Science funding is organized nationally, slow, and bureaucratic. Furthermore, it is often controlled by government or large corporations and not the wider Community. SCIENTIA aims to work towards changing that. The ultimate aim of the project is to establish a trust owned by the SCIENTIA Community. The SCIENTIA Trust will support basic research in academia as well as new research-oriented companies. Uniquely, it will participate in research it funded through returns from funded projects. While establishing the Trust is the long-term goal of SCIENTIA, Science and the SCIENTIA Community can already benefit from SCIENTIA via its Token. The SCIENTIA Token is an innovative token that has entered the Crypto space in October 2021. It was launched on the Binance Smart Chain and has been available on secondary markets since November 2021. SCIENTIA Token operated as an elastic supply token for much of its history, but has stopped rebasing at the beginning of 2022 due to a decision made by the SCIENTIA community. To support its goals, a transaction tax of 9.42% is applied to all transactions of the SCIENTIA Token. This transaction tax is split threefold. 3.14% go directly to the liquidity pool. The rest of the transaction tax is divided into 3 buckets: 2.09% go to science funding. At the end of each funding cycle a decision is made on the use of the science funding budget together with the SCIENTIA community. This could be a direct call for projects to be funded or funding via other funding agencies. 2.09% go towards buyback. This is where SCIENTIA returns to its holders, the SCIENTIA community over time. The final 2.09% go towards development and marketing to support the project further and can also be used to compensate the developers for their efforts. Please educate yourself about SCIENTIA and current project developments, for example in our Telegram group, our Medium Blog or our homepage, and only buy SCIENTIA Token if you fully understand it and want to support the idea of SCIENTIA and be part of the community. Do not speculate with SCIENTIA for profit as this is absolutely not its intention. Please also note that SCIENTIA is not an investment product.\"","links":"https://www.scientiatoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/scientia/logo.png"}