{"name":"Skycoin","id":"skycoin","symbol":"sky","description":"The Skycoin Platform is the most advanced blockchain platform in the world. Developed by early contributors to both Bitcoin and Ethereum, Skycoin’s platform is completely secure, infinitely scalable, and ISP independent. It uses its own specific distributed consensus algorithm, called Obelisk, instead of other commonly used algorithms like proof of work (POW) and proof of stake (POS). Obelisk uses the concept of ‘web of trust dynamics’ which distributes influence over the network and makes consensus decisions depending upon the influence score of each node. Each node subscribes to a select number of other network nodes, and the density of a node’s network of subscribers determines its influence on the network. Skycoin is very fast. With transaction speeds close to 2 seconds and no transaction fees it can rival any other cryptocurrency on the market as a payment method. The transaction costs of Skycoin are covered by Coin Hours. This is value paid to Skycoin holders for each hour they hold a Skycoin. Skycoin is against charging transaction costs and mining incentives as it only drives up the costs of the network. The biggest benefit of Skycoin is that it is energy efficient due to the Web-of-Trust social proof. It can even run on a 30-watt cell phone processor making it great for mobile payments. Centralization becomes less of an issue when anyone can participate in the blockchain. Sia stores tiny pieces of your files on dozens of nodes across the globe. This eliminates any single point of failure and ensures highest possible uptime, on par with other cloud storage providers. A major goal of Skycoin is to promote actual usage of cryptocurrency rather than speculation. Skywire, the flagship application of Skycoin, has the ambitious goal of decentralizing the internet at the hardware level and is about to begin the testnet in April. However, this is just one of the many facets of the Skycoin ecosystem. Skywire will not only provide decentralized bandwidth but also storage and computation, completing the holy trinity of commodities essential for the new internet. Skycoin also has its own ICO platform called Fiber, their own deterministic programming language, CX, derived from Golang, a private decentralized messenger system called Sky-Messenger, and a decentralized social media platform, BBS. Here is another way to think of Skycoin: An open-source, community-owned, hardware-based peer to peer internet designed from first principles and leveraging the incentive system of the blockchain.","links":"https://skycoin.com","market_cap":782479,"market_cap_rank":4525,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/skycoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}