{"name":"XNET Mobile [OLD]","id":"xnet-mobile","symbol":"xnet","description":"What is the project about? XNET is the first blockchain powered mobile carrier. It's a GSMA/3GPP compliant cellular network set up by individuals and companies motivated by our native token. XNET incentivizes cellular radio deployment in areas where traditional telco (AT&T, VZN, TMO) falls short and has coverage gaps or capacity issues. What makes your project unique? A few others companies have tried to build a cellular network using this model- although fell short due to lack of industry expertise. The team comes from decades of experience in the telecom world- knowing the ins and outs of how to get to real world revenue. XNET is also a neutral host- allowing any mobile network operator to use our bandwidth for their customers. Ideally the end consumer wouldn't even know they are on the XNET network as we will have roaming agreements with their current providers. History of your project. Launching in April 2022, thus far XNET has deployed our token on the Polygon blockchain, released it's public API, built up the cellular network in San Fransisco, Houston, and New York. XNET has also advanced it's discussions with Tier-1 mobile network operators. What’s next for your project? https://medium.com/@XNET_Mobile/xnet-q4-roadmap-6857c116acc1 In the next 30 days XNET aims to release the details of it's first premier roaming agreement. Later this year XNET plan on launching it's Foundation overseas, establish the HetNet, and in December XNET plans on having production traffic go live on the XNET network. What can your token be used for? The XNET token is primarily used to bootstrap network deployment - it also will be used to incentivize network mapping at some point soon. The XNET Foundation will use 40% of all revenue generated from mobile network operators (paid in $/GB) to buy and burn the XNET token.","links":"https://xnet.company/","market_cap":1861409,"market_cap_rank":2632,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xnet-mobile/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xbc5eb84c052fd012bb902c258c9fd241b17c0005"}}}