{"name":"Tokerr","id":"tokerr","symbol":"tokr","description":"WHAT IS TOKERR (TOKR)? Tokerr is a comprehensive ecosystem designed to make DeFi safe and accessible for investors and developers. The ecosystem is driven by multiple intuituive utilities and dapps, and the flow of income from the utilities creates a profit-sharing system for TOKR holders, and is also used to buyback and burn TOKR. Tokerr works by finding innovative solutions to existing DeFi problems, and builds either hold-to-use or pay-to-use products for developers and investors to make the trading experience safer and easier. TOKR is the native utility token with multiple usecases: • Holding TOKR allows access to certain utilities and dapps • Holding TOKR allows access to premium features within the utilities and dapps • Used as a transactional currency within the ecosystem TOKERR ECOSYSTEM 1. TOKERR FACTORY: The Tokerr Factory utilities create products that encourage safe developers so that investors feel safe. 2. TOKERR ESSENTIALS: The Tokerr Essentials bundle is designed to provide DeFi investors with the necessary powerful tools to be able to act quickly on investment decisions. 3. TOKERRFUND: A profit-sharing system where percentage of the profits from the entire ecosystems are distributed among TOKR holders. 4. TOKERRDEX (Q2 2023): A hyper-intuitive, customizable, multichain charting dapp, with utilities and modules designed to allow DEX traders access to all the necessary tools from a single, modular interface. 5. TOKERRLAB (Q2 2033): A “decentralized collaboration laboratory”, where ideas can be shared and worked on live, like a hive mind. Two utilities are already live - Tokerr Deployer Bot and Tokerr Bridge. HOW MANY TOKERR COINS ARE IN CIRCULATION? Tokerr launched on September 14, 2022 with 1 million TOKR tokens. Tokerr conducts regular manual burns to reduce the supply.","links":"https://tokerr.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tokerr/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xd9b96fb20610a7d09f68309c524c8c72b7810b40"}}}