{"name":"Lyfebloc","id":"lyfebloc","symbol":"lbt","description":"What is the project about? Lyfebloc a next generation Automated Marker Maker (AMM) that provides frictionless crypto liquidity with extremely high returns. What makes your project unique? Lyfebloc is powered by 3 high capital efficient patent pending DeFi protocols: Automatic Protocol which instantly sources liquidity from thousands markets to ensure the best rates, Multiplier Protocol which allows users to trade crypto with zero price impact, and Deflationary Protocol that gives tokens automatic staking and compounding features, and the highest Fixed APY in the market at up to 500,000%. History of your project. We just launched Lyfebloc AMM version 1 beta and our Lyfebloc Network and its products like Lyfebloc are governed by the community through LyfeblocDAO, a Decentralized Autonomous Organization. LBT holders stake LBT tokens to vote on governance proposals that shape Lyfebloc‘s future and earn LBT rewards from trading fees. What’s next for your project? DAO Token (LBT) Presale May 1st https://www.pinksale.finance/launchpad/0x00b66b43AbdBa776fcBFf2902A81E73691B80562?chain=ETH&refId=0x59E48309Ff1030212D7c33c3c8BfF8049b3b1A21 Then here is Roadmap https://lyfeblocnetwork.com/roadmap/ What can your token be used for? Governance https://lyfeblocnetwork.com/tokenomics/ Lyfebloc Network and its products like Lyfebloc are governed by the community through LyfeblocDAO, a Decentralized Autonomous Organization. LBT holders stake LBT tokens to vote on governance proposals that shape Lyfebloc‘s future and earn LBT rewards from trading fees.","links":"https://lyfebloc.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lyfebloc/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5ac83bfbfcebb3397a40fd259dbe7a4be04237d3","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x5ac83bfbfcebb3397a40fd259dbe7a4be04237d3"}}}