{"name":"MetaTrace","id":"metatrace","symbol":"trc","description":"## What is MetaTrace? MetaTrace is the world's first GameFi project featuring a Free to Play and Earn model on a real-world map. The MetaTrace application is a game incorporating a variety of game mechanics aimed at combining geolocation, blockchain environments, and classic game strategies. It is based on augmented reality technology, which offers users a unique gaming experience and an easy immersion into the world of Web3 technologies. Project team is diligently working on creating a platform that will allow each player to realize their ideas and become the creator of their own adventures. The application is developed by professionals with experience working in top gaming studios: Niantic (Pokemon Go), Wargaming (World of Tanks), Kama Games, Game Insight, and others. The virtual map of MetaTrace is a replica of the real world, reflecting our entire globe. Every step you take in the real world impacts the events occurring within the game. Your physical activity is reflected in the game space, and your avatar accurately replicates your movements. Explore the space and find rewards in Boxes. Each box contains ACE tokens, various NFTs for participating in mini-games. ## What is MetaTrace's mission? Project's team primary mission is to inspire and motivate millions of people to have more contact with the real world and engage in physical activity every day. MetaTrace believes that they can introduce players to the world around them in a new way, help them broaden their horizons, meet people, and explore new locations. Collect digital artifacts within your city and interact with other players, forge friendships, and exchange resources in MetaTrace. MetaTrace is not inventing new \"utopian\" metaverses and virtual worlds; instead, project team enhances the real world with interactive elements using Augmented Reality (AR) technologies. This allows players to feel each challenge more intensely, meet with friends more often, and actively develop beyond the game. MetaTrace also set an ambitious goal for themselves: to introduce tens of millions of users to the world of Web3 technologies. ## What are principles of MetaTrace? - Engaging and understandable gameplay is the primary focus of the project team. - Qualitative Free-to-play, freedom for players to choose their own game format, and the possibility to use NFTs for advanced users. - The stability of the game economy always takes precedence over scaling and profitability. - Transparency and attention to communication with players. It is important for us to be open with our community and improve the product based on user feedback. All information about the project, as well as the team, is publicly available. - Forming prize pools for players through a clear business model. - Simplicity and accessibility of Web3 solutions in the game, convenience for beginners. - The security of each user's personal data. - Active blocking of farming and combat against it in the game. ## What are advantages of MetaTrace? </b>Decentralization</b> We offer you a complete control over your gaming assets. Thanks to NFT technology, every item, character, or artifact you own in MetaTrace becomes unique and irreplaceable. You can be confident that no one can counterfeit, alter, or steal your assets. This gives you complete freedom to own, trade, and collect NFTs. <b>Communication</b> A unique experience of interacting with other players. You will be able to communicate, unite, compete, and collaborate with players from all over the world. Our platform provides safe and transparent transactions, allowing you to confidently interact with other players and trust them. You can create teams, exchange assets, and jointly explore the virtual world. <b>Rewards</b> You can earn cryptocurrency for gaming achievements. Your talent, skill, luck, experience, and game knowledge become the foundation for receiving rewards. You can sell your unique gaming assets or offer services to other players. We stimulate and encourage the community's contribution to creating a stable economic system. <b>Stability</b> We are building a truly stable and fundamental economic system that has incorporated the most successful ways of monetization, reward distribution, onboarding, and other aspects. As you dive into our project and develop your profile, you can be confident in the project's longevity and robustness. <b>Technology scalability</b> Explore the real world at the intersection of technologies. Today, you use our map, a copy of the world, for orientation in the game, \"tomorrow\" it could be augmented reality glasses. Become the most experienced among the players and you will be amazed by the opportunities that will open up for you in the future. Our platform is constantly updated and evolves, offering the latest technological developments and content consumption during gaming adventures.","links":"https://metatrace.me","market_cap":5580502,"market_cap_rank":1591,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metatrace/logo.png","detail_platform":{"polygon-pos":{"decimal_place":2,"contract_address":"0x40d9fc77027a281d85de1fa660c887e645ae26c3"}}}