{"name":"Copybot","id":"copybot","symbol":"copybot","description":"Copytrade elite dex traders or earn Ethereum by amassing a following of copytraders. All through an easy-to-use Telegram bot. The Copybot platform is a unique new Telegram-based tool that simplifies and gamifies copytrading, a potentially rewarding concept that is still very inaccessible for the average trader. Moreover, the 'Leaderboard' concept, where the best Traders earn Ethereum based on their amount of copytraders, creates a unique word of mouth marketing model. Accompanying the Telegram copytrading platform is our proprietary $COPYBOT token. After an initial free-to-use period, users are required to hold a minimum amount of $COPYBOT tokens to use the bot. Moreover, holders of the token earn revenue from our bot automatically, which is generated from monthly pass purchases. As such, the $COPYBOT ERC-20 token is an integral part of our ecosystem and investors have a strong incentive to buy and hold it. Revenue Sharing for Holders The Copbot Telegram bot is free-to-use in the first two weeks after the launch of the platform and the token. After four weeks, users must hold a minimum amount of $COPYBOT tokens to use the platform, ensuring an incentive to hold the token. A second option for users to use the platform after the initial two free weeks is to pay a 0.1ETH monthly fee. All revenue collected from this is distributed to $COPYBOT holders and holders of the token thus share in the success of the platform. All in all, there are two main incentives to hold the $COPYBOT token. Firstly, users get the functionality to effectively use our platform for free. Moreover, they automatically get rewarded in Ethereum through any ETH purchases of our platform.","links":"https://www.copyboteth.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/copybot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x244b36af168cc3b3a24b1e6ade3a90817cf07d22"}}}