{"name":"Kabosu","id":"kabosu-3","symbol":"$kabosu","description":"Kabosu Token pays tribute to the remarkable legacy of a female Shiba Inu, who became the beloved face of the iconic Doge meme. Born on November 2nd, 2005, this Shiba Inu, affectionately named Kabosu, entered the world and captured the hearts of millions worldwide. Rescued by Atsuko Sato in 2008 from a Japanese shelter, Kabosu's story is one of resilience and hope. At a time when her fate hung uncertain, Atsuko Sato provided a new lease on life for this lovable canine, cementing a bond that would soon transcend boundaries, sparking a global phenomenon. The name 'Kabosu' was chosen to honor her distinct round face, reminiscent of the kabosu fruit, and it stands as a testament to her resilience in overcoming adversity. The Kabosu Token project seeks to celebrate the essence and spirit of Kabosu. It aims to channel her legacy of resilience and hope into a crypto project that embodies the values of community, compassion, and inclusivity. Our mission: Honoring Kabosu's Legacy: The Kabosu Token project aims to honor the story of Kabosu, recognizing her as a symbol of resilience and the power of second chances. Community-Driven: With a strong emphasis on community involvement, the project seeks to build a vibrant and supportive community that shares Kabosu's values. Charitable Initiatives: Inspired by Kabosu's story, the project is dedicated to supporting animal welfare causes and shelters, advocating for the well-being of animals worldwide. Innovation and Technology: Leveraging the advancements in blockchain technology, Kabosu Token aims to create a secure, efficient, and user-friendly platform for enthusiasts and investors. Kabosu Token is not just a cryptocurrency; it's a movement rooted in compassion and empowerment. Join us in commemorating Kabosu's journey, honoring her spirit, and contributing to a cause that reflects her resilience and the unwavering love for our furry friends.","links":"https://solkabosu.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kabosu-3/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"3h4DGQd9k5gsiMnNzDuGXAcjkMm5G7iC3knykdvBBnxU"}}}