{"name":"Moca Network","id":"mocaverse","symbol":"moca","description":"Moca Network is building the chain-agnostic digital identity infrastructure for the open internet - one universal account for your assets, identity, and reputation across multiple ecosystems. Moca Network has direct (Animoca Brands) access to a portfolio of 540+ companies to tap into 700M+ addressable users. AIR Kit, as the key product built by Moca Network, enables Web2 and Web3 projects to create a universal embedded account for users to own and use assets, identity, and reputation data, while getting access to a suite of DeFi and consumer services. AIR Kit empowers all large user base apps to create a Telegram mini-app like ecosystem within their own apps with embedded blockchain features, while ensuring these users can use the same account, identity, reputation across all consumer apps on any chains adopting the AIR Kit. Mocaverse, one of the key consumer platforms adopting the AIR Kit, alongside SK Planet, One Football, and more partners, provides curated experiences and rewards to users based on their identity and reputation through Moca ID and products like Mocana, MocaDrop and MocaList. $MOCA is the utility token that powers the Moca Network - used as fees for transactions, data generation, storage, verification for users and AI agents, and for DAO governance. It is issued by the Moca Foundation. Learn more about Moca Network at https://moca.network/","links":"https://www.moca.network/","market_cap":258896309,"market_cap_rank":289,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mocaverse/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf944e35f95e819e752f3ccb5faf40957d311e8c5","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf944e35f95e819e752f3ccb5faf40957d311e8c5"},"base":{"decimal_place":18,"contract_address":"0x2b11834ed1feaed4b4b3a86a6f571315e25a884d","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x2b11834ed1feaed4b4b3a86a6f571315e25a884d"}}}