{"name":"Freebie Life Finance","id":"freebie-life-finance","symbol":"frb","description":"What is Freebie? Firstly, it’s interesting and exciting. Each user will want to take part and get tokens absolutely free! Freebie Life Finance is a project in which everyone (if you are fast enough) can start freebie and is guaranteed to get tokens absolutely free! You can also win tokens in a random manner. Be faster than the rest, be the first to launch freebie and get 100 FRB tokens absolutely free! Anyone with 500 or more FRB tokens in their wallet can do it! You need to keep an eye on the vault, and when there are more than 1200 FRB tokens, you need to run the “/startfreebie” command. And then claim your FRB tokens! You can also win 100 FRB tokens completely randomly if you have 500 or more FRB tokens in your wallet. How does it work? All FRB token transactions are subject to a fee of 5%. If you buy, sell or send FRB tokens from wallet to wallet, then a fee of 5% will be charged. And this fee from all these transactions is accumulated in the vault. When more than 1200 FRB tokens accumulate in the vault, you can start freebie. What happens when freebie starts up? 1200 FRB tokens are withdrawn from the vault and sent to the freebie balance and marketing wallet. 1000 FRB tokens are sent to the freebie balance and 200 FRB tokens to the marketing wallet. These 1000 FRB tokens are distributed equally among 10 users. The first user to launch the current freebie (freebie activator) wins 100 FRB tokens. The remaining 9 users are randomly selected from all FRB token holders who have 500 or more FRB tokens on their balance, and they win 100 FRB tokens each. These 9 lucky winners have 24 hours from the launch of the current freebie to claim their tokens. You need to run the “/claimfreebie” command to claim your tokens. If the winners didn’t claim the tokens, then those tokens that the winners didn’t claim in the current freebie will automatically be sent to the person who launched the current freebie (freebie activator).","links":"https://freebielife.me/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/freebie-life-finance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9bedce29f79076b21dd04958a9fd4b22f63fd86d"},"polygon-pos":{"decimal_place":18,"contract_address":"0x9bedce29f79076b21dd04958a9fd4b22f63fd86d"},"avalanche":{"decimal_place":18,"contract_address":"0x9bedce29f79076b21dd04958a9fd4b22f63fd86d"}}}