{"name":"Chicken Town","id":"chicken-town","symbol":"chickentown","description":"Chicken Town is the NFT liquidity protocol in Arbitrum Chain supporting instant NFT-backed loans, Collateral Listing, and NFT Down Payment. The seamless experience of down payment, borrowing, and listing create a perfect closed loop for users, a one-stop NFT liquidity solution. Chicken Town is building the on-ramp layer for massive Web3 adopition, providing tailored Play2Earn products and onboarding infrastructures for investors to enter the new world of Web3. Chicken Town is aiming at forming an engaging ecosystem of community-owned economies by facilitating and optimizing the onboarding flows for all Web3 pathfinders. Chicken Town is able to capture the heart of many through its innovative fostering of a safe, fun, immersive, & profitable experience for investors. There are many highlights throughout the project expansive roadmap, that of which contains multiple modes of earning for NFT holders. Chicken Town P2E (Play to Earn gaming) video games and virtual worlds where gamer play for profits through crypto tokens rewards. One of the popular P2E games to talk about is Axie Infinity, Gods Unchained, Zedd Run. There are even gamers who spend full-time to play game and make huge profits during the Corona pandemic. There are many highlights throughout the projects expansive roadmap, that of which contains multiple modes of earning for NFT holders. Users are able to enjoy an interactive experience through the Chicken Town dashboard, enabling users to monitor & control their assets with major ease. What exactly does this mean ? User can completely design their own NFTs and sell them on Chicken Town marketplace. All this & more as we work our way to make an ecosystem where users are equipped with Chicken Town NFTs which will unlock the initial stages of all Play2Earn Testing & Features.","links":"https://chickentown.co/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chicken-town/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}