{"name":"Brr Protocol","id":"brr-protocol","symbol":"brr","description":"$BRR is the main currency for the Brr Protocol. $BRR is a deflationary asset used to mint NFTs. Brr Protocol is an innovative Defi as a service (DaaS) built on the Arbitrum Network. Our protocol allows users to mint NFTs and generate passive income (printing money) through our governance token. Brr Protocol is inspired by Universe, a similar protocol that launched on the Avalanche chain a year ago. While there are similarities between the two, we believe that our protocol is superior in a number of ways, and we will highlight these differences throughout this documentation. In the following sections, we will delve deeper into Brr Protocol's functionality and explore how users can benefit from this DaaS. We will cover everything from NFT minting and staking to rewards and governance, providing a comprehensive overview of all aspects of the protocol. The $BRR token serves as the main currency used to mint NFTs and represent the rewards earned from staking those NFTs. With a capped supply and a portion of tokens being burned when minting/upgrading NFTs, $BRR is deflationary, making our protocol more sustainable over the long term. This represents a key difference between Brr and other protocols, such as Universe. By taking a deflationary approach, we are able to ensure that our token retains its value and that our protocol remains viable over the long term. Our team has gone to great lengths to ensure that the math behind the APR, rewards, and fees is correct, resulting in a platform that is both sustainable and profitable for our users. our NFTs are the NFTs you receive in exchange for locking your tokens. Our NFTs generate perpetual passive income and are available in six different tiers, ranging from Tier 1 (featuring a low-tier like Sifu) to Tier 6 (featuring a god-tier, undercover like Powell).","links":"https://www.brr-protocol.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/brr-protocol/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xd6e7c8af05d2d06a76811d44917613bdd258b995"}}}