{"name":"Indigo Protocol iUSD","id":"iusd","symbol":"iusd","description":"iUSD is Cardano’s first fault-tolerant and fully collateralized native stablecoin released in November of 2022 as part of Indigo Protocol v1. iUSD is pegged to the median value of USDC, TUSD, and USDT; this design allows iUSD to maintain its peg even if one of the three stablecoins (USDC, TUSD, and USDT) depegs. The Indigo Protocol is a CDP (Collateralized Debt Position) based DeFi protocol that brings capital-efficient synthetic assets to the Cardano ecosystem. Users can purchase iUSD from a DEX just like any Cardano native asset, or can mint iUSD within the Indigo Protocol by depositing ADA as collateral. When users mint iUSD within the Indigo Protocol, they must deposit sufficient ADA such that their CDP remains above the applicable Minimum Collateralization Ratio (MCR) - meaning a user deposits collateral in the form of ADA that ensures over-collateralization. If the value of a user's ADA collateral begins to decrease toward the MCR, a user can choose to add more collateral to keep their iUSD position above the MCR. If a user’s collateral becomes worth less than the MCR of their iUSD debt, the Indigo Stability Pool providers will allow the user to keep their iUSD but will exchange Stability Pool iUSD for the user’s higher value ADA collateral. Thereby ensuring that iUSD remains overcollateralized and that the Indigo Protocol remains solvent via its efficient liquidation process. Unique to Indigo, users still receive their ADA staking rewards from stake pool delegation while ADA is being used as collateral in a CDP. This CDP Liquid Staking feature presents a unique use case for iUSD in trading strategies. The Indigo DAO controls the iUSD parameters and can therefore vote to raise or lower the Minimum Collateralization Ratio for iUSD and all Indigo iAssets.","links":"https://indigoprotocol.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/iusd/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"f66d78b4a3cb3d37afa0ec36461e51ecbde00f26c8f0a68f94b6988069555344"}}}