{"name":"0xLSD","id":"0xlsd","symbol":"0xlsd","description":"0xLSD is a decentralized liquidity provision protocol that supports multi-chain aggregation. 0xLSD is built on the Binance Smart Chain (#BSC), Arbitrum (#ARB) and Ethereum (#ETH) public chains, with the aim of creating stable and sustainable liquidity for the Web3 world, while also constructing a comprehensive financial service system on top of it. What makes your project unique? 0xLSD has introduced a decentralized liquidity provision protocol that supports multi-chain aggregation, addressing various challenges faced by the LSD sector. This protocol serves as the core component of the 0xLSD ecosystem. By leveraging AI data analysis and intelligent algorithms, the decentralized liquidity provision protocol enables users to engage in a wide range of derivative trading activities using LSD. Through yield farming aggregation pools, users can earn staking rewards while achieving risk management and stable returns with LSD. 0xLSD provides extensive support for various LST assets and offers liquidity for these assets. Users holding LST assets can automatically generate substantial profits through the AI module. Building upon this foundation, 0xLSD is also providing liquidity to LSD protocols, laying the groundwork for the long-term development of such ecosystems. History of your project. The co-founder of 0xLSD, before creating 0xLSD, was pursued in-depth studies in fields such as economics, business, and computer engineering. Subsequently, he conducted extensive research in areas like blockchain technology and cryptocurrency, and actively participated in the early design and development of several prominent crypto projects during the early stages of the industry's development. 0xLSD is a decentralized liquidity provider protocol that supports multi-chain aggregation. Initially built on the Binance Smart Chain (BSC) and Arbitrum (ARB) chains, it aims to create stable and sustainable liquidity for the Web3 world, while also constructing a comprehensive financial servi","links":"https://0xlsd.com/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/0xlsd/logo.png","detail_platform":{"":{"decimal_place":18,"contract_address":"0x14bdcd646a075fc51396ebd0f8df5a831047b805"}}}