{"name":"Citrus","id":"citrus","symbol":"cts","description":"What is Citrus Coin? Citrus is a Binance Smart Chain token that aims to accelerate the transformation of gaming. We will also be offering a range of solutions to the Blockchain world through the next-gen Defi ecosystem, NFTs, and advanced DApps, and more. Citrus is the customisable layer-2 blockchain network that lets you build on Binance. What makes Citrus Unique? Citrus believes that Blockchain should not be limited to early adopters and a few segments of industries. We aim to create solutions that help people realize the true potential of Blockchain. Our efforts are directed towards creating a reliable ecosystem of products and services that enable any user to leverage Blockchain technologies and the crypto marketplace. Our principles and inherited values have led us to create an ecosystem of a shared economy where every human has the right to participate in global growth leveraging the instruments provided by Citrus. Who are the Founders of Citrus? Core team is based primarily in Dubai. The core management team consists of Avanik Vekariya as Founder and Chief Executive Officer, Hardik Joshi as Chief Operating and Chief Finance Officer, Ishaan Dave as Chief R & D and Technology Officer, and Sanket Barot as Chief Services Officer and Chief Marketing Officer. Avanik Vekariya is known businessman with diversified portfolio that includes real estate, manufacturing, automobile and healthcare. Hardik Joshi is a process expert who has helped 17 startups to grow from idea conceptualization to go-live. He is a motivational speaker in his free time and avid motorcyclist. Ishaan Dave is a technocrat holding multiple technical certifications and Agile trainer who has hands on expertise on moving legacy systems to futuristic gadgets. He is a creative artist and carries art workshops in B-Schools during his leisure. Sanket Barot known for his convincing skills and marketing ideas, he is having more than 860k active viewers on his YouTube channel. They all come together for a common goal that is providing easy, efficient and advance technology to everyone and ethics are the single thread that tie them all.","links":"https://www.citrus.tech/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/citrus/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xae67cf598a349afff89f6045108c6c1850f82839"}}}