{"name":"Solanax","id":"solanax","symbol":"sold","description":"Zero front-running, fearless trades, minimal slippage, support for market makers and trading bots with interoperability are all features of a rapid unreliable cross-chain DEX with a built-in order book for establishing stop losses and profit-taking levels. Liquidity providers are incentivized to provide liquidity to low-volume assets for higher rewards, as they receive a share in proportion to the volume they provide to the pool. The DEX fee distribution is 0.3% for the taker and 0.2% for the maker. SOLANAX, as well as providing the fastest DeFi protocol presenting AMM and DEX, will implement a wormhole bridge to access the entirety of crypto assets generated on the Ethereum network. The Wormhole is not a blockchain network, so it can safely depend on consensus and finalization of the chains that it bridges. SOLANAX is truly decentralized since all guardians perform the same computation upon observing an on-chain event and sign a so-called Validator Action Approval. Should a two-thirds majority of all guardian nodes observe and sign the same event using their individual keys, then it is automatically validated by the Wormhole contracts on all chains and triggers a mint/burn. SOLANAX is nothing short of ambitious than being one of Solana’s network-leading AMM and DEX platforms, with this project we are attempting to eliminate centralized intermediaries and to pave the way for full decentralization, censorship-resistant, and safe trading within the Solana ecosystem. SOLANAX users will be able to effortlessly execute smart contract-based trades instantly and only at a fraction of the cost of the Ethereum network in comparison. Our end goal is to create an open-source liquidity and DeFi protocol that offers attractive interest rates in order to attract investors, as well as a protocol that the Solana community can easily adapt and reuse for future projects. Our main advantages are that we are faster and cheaper: We use the Solana blockchain’s efficiency to achieve transactions who’s are substantially faster than Ethereum, with gas prices that are a fraction of the cost. A central order book is needed for ecosystem-wide liquidity: SOLANAX provides on-chain liquidity to the Our own DEX’s central limit order book, giving Raydium SOLANAX users access to the full eco-system’s order flow and liquidity. Trading interface: For traders who want to monitor Trading View charts, place limit orders, and exercise more control over their trading. Liquidity providers have an incentive to provide liquidity to low-volume assets for higher rewards, as they get a share directly proportional to the volume they provide to the pool. When you make a trade or exchange on SOLANAX, you’ll be charged 0.3% for the taker order and 0.2% for the maker. As a reward for liquidity suppliers, 0.4% are redeposited into the liquidity pool and acts as a reward 0.1% of the SOLD tokens are sent to the staking pool as a reward for individuals who stake their SOLD tokens.","links":"https://solanax.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solanax/logo.png"}