{"name":"Bogdanoff","id":"bogdanoff","symbol":"bog","description":"What is the project about? $BOG is a crypto project inspired by the Bogdanoff twins, aiming to create a decentralized platform for meme enthusiasts to connect, share, and trade. The project leverages blockchain technology to provide a secure, transparent, and engaging environment for users to express themselves and interact with like-minded individuals. What makes your project unique? Our project stands out because of its focus on creating a vibrant community of meme lovers, with a user-friendly platform and tools to showcase creativity. We also emphasize the importance of community-driven events and initiatives, allowing the community to have a significant role in shaping the project's future. History of your project. $BOG was conceived in early 2023 by a team of experienced crypto enthusiasts who shared a passion for memes and the Bogdanoff twins. The project has since grown to include a dedicated and diverse community of users, who actively contribute to its development and expansion. What’s next for your project? We have an exciting roadmap planned for $BOG, including the launch of our decentralized meme marketplace, integration with popular social media platforms, and various marketing campaigns to raise awareness and adoption. We'll also continuously work on improving our platform based on user feedback and needs. What can your token be used for? The $BOG token serves as the native currency of the platform and can be used for various activities, such as: Buying, selling, and trading memes within the marketplace. Participating in community-driven events and contests. Voting on platform updates and future developments. Supporting content creators and artists within the community.","links":"https://www.bogdanoffeth.wtf/","market_cap":297156,"market_cap_rank":5859,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bogdanoff/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0ba74fb26ca523f2dc22fa4318581cc2452eaba1","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x0ba74fb26ca523f2dc22fa4318581cc2452eaba1"}}}