{"name":"Arcstar","id":"arcstar","symbol":"arcstar","description":"What is the project about? ArcstarDAO is a DAO-powered market neutral fund. What makes your project unique? The Arcstar is where you predict the stock market using machine learning on financial data. Your models will earn rewards based on performance on live financial data. We have a Google Colab that will put you right in the middle of a working pipeline that make anyone able to predict very simple default prediction. Allowing anyone to participate! Arcstar provides its data scientist community free curated, high quality and obfuscated data. History of your project. Arcstar, is a project that has undergone a transformation. Our journey began with the development of a solid business model and the creation of a roadmap outlined in our GitBook - https://arcstar.gitbook.io/arcstar-dao/roadmap/general-roadmap. The first major milestone we tackled was community building, which kicked off in December 2022. Through effective marketing efforts, we successfully amassed over 5,000 members on Telegram, garnered 700 Twitter subscribers, and established a presence on Medium. What’s next for your project? During this forthcoming period, we have strategic initiatives in place to form partnerships with influential figures on Twitter and YouTube. Additionally, we are set to launch an extensive marketing campaign to promote the beta version of Arcstar. We place immense value on user feedback and plan to thoroughly analyze it during this phase, as it will serve as a guiding force for our ongoing development efforts. Following this assessment, we will open the Arcstar platform to the public. At this crucial juncture, the roadmap will transition into a decentralized autonomous organization (DAO) framework, empowering the community to actively participate in decision-making and shape the future of Arcstar. What can your token be used for? ARCSTAR can be used for Governance, Staking and Rewards.","links":"https://arcstardao.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arcstar/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x746b725a05d08a5829d0b4898abc79dee3928ea9"}}}