{"name":"Namx","id":"namx","symbol":"namx","description":"NAMX as a payment token Namx is a utility token that facilitates payments of utility bills and other public goods and services in countries which have a large unbanked population. As public utilities are an essential service and a basic human right, it is important to have a convenient payment method to ensure continued access to these services is possible. NAMX has partnered with Bright Blue Water International (BBWI), a Water Treatment and Network Distribution company based in Thailand. BBWI has a major project in development in Myeik, Myanmar, where introducing an innovative payment option is essential to giving as many people as possible access to clean drinking water.Water Treatment and Distribution is, however, only one aspect of BBWI’s involvement in the region. Their 40-year government concession also includes: electricity production, waste treatment, and a purpose-built coastal trade port. The trade port will allow for the docking of fishing vessels, where the catch can be processed, packaged, and reloaded onto ships for global distribution. The water infrastructure is a pre-requisite for this trade port, as the current water supply in the region does not meet W.H.O standards deemed acceptable for the processing and of fish for global export. Smart City implementation through IoT devices Namx is a utility token that facilitates payments of utility bills and other public goods and services in countries which have a large unbanked population. As public utilities are an essential service and a basic human right, it is important to have a convenient payment method to ensure continued access to these services is possible. NAMX has partnered with Bright Blue Water International (BBWI), a Water Treatment and Network Distribution company based in Thailand. BBWI has a major project in development in Myeik, Myanmar, where introducing an innovative payment option is essential to giving as many people as possible access to clean drinking water.","links":"http://namx.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/namx/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xeda43fa2f35ea174a7e9b73658b18a7da00adf38"}}}