{"name":"O-MEE","id":"0-mee","symbol":"ome","description":"We’re entering a new era, an ever-changing era. From the metaverse to NFTs, everything is new and it’s coming at us fast. Web 2.0 is starting to seem like a distant memory where we’re still giving away art for hearts and likes. It’s time to re-invent. Unfriend the typical social feeds, unlike shady algorithms, unfollow ads. O-MEE are giving you your independence and equity back so you can experiment, compose and innovate\" What is O-MEE (OME)? O-MEE is a social network and NFT marketplace that facilitates the creator economy by paving the way for brands, businesses, and users to create free and exclusive content. Creators need to emotionally connect. O-MEE reinvents how you build social and economic value in Web3. The O-MEE platform allows users to create, buy, and sell non-fungible tokens (NFTs) in exchange for digital and physical goods while operating within an interoperable social network. O-MEE is able to support exclusive creators Web3 journey by providing a subscription-based framework and gated social spaces by leveraging the use of NFT technology. What makes O-MEE unique? O-MEE is a media company that aims to bring the creator economy into Web3, reinventing the accessibility framework of NFTs and return social network data decentralisation to the people. The social network, NFT marketplace, and subscription based system are the foundations of the O-MEE platform. These are the three main drivers of the Web3 creator economy. O-MEE's complete integration and compatibility enables them to facilitate the growth of social and cultural community value by lowering fees, restoring user control over algorithms, and ensuring creators are fairly rewarded. One of the primary distinctions between O-MEE and other NFTmarketplaces is the extremely low fixed rate commission fee on the buyer and seller of goods, as opposed to the high percentage-based commission fee structure provided by other marketplaces. Furthermore, users can create or \"mint\" NFTs in an extremely simple and user-friendly process, allowing anyone with any level of experience to create or list an NFT. Finally, their 'lazy minting' or ‘post creation’ process enables users to create NFTs for their social profiles without having to list them for sale on the open marketplace. This feature fuels platform activity and serves as the primary foundation for content creation. Supporting social features enables users to engage, interact, share, and message, thereby facilitating the ever-increasing need for communication and organic growth while fostering authentic and meaningful relationships. While its core experience is social media architecture, it also includes community building features such as social spaces. Using access NFT technology, you can create exclusive community spaces to provide more gated content to your audience. Supporting features such as pay-per-view are available to view selected posts for a fee.","links":"https://o-mee.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/0-mee/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbd89b8d708809e7022135313683663911826977e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xbd89b8d708809e7022135313683663911826977e"}}}