{"name":"Canxium","id":"canxium","symbol":"cau","description":"What is the project about? Canxium is a groundbreaking blockchain platform, that introduces a unique economic model which revolves around supply and demand dynamics. Unlike traditional blockchains with fixed supply or inflationary or deflationary mechanisms, Canxium adopts a demand-driven approach, where the total coin supply is determined by market demand. The demand-driven blockchain concept introduces a dynamic and responsive economic system. Unlike traditional models that rely on predetermined supply plans, Canxium allows the market forces of supply and demand to dictate the coin’s availability and value. This approach brought a more flexible and adaptable blockchain ecosystem that aligns with real-time market conditions. Canxium also revolutionizing the blockchain industry with its unique approach to mining and commitment to creating a more sustainable and decentralized future. A key feature distinguishing Canxium from others is its innovative concept of offline mining. Canxium’s offline mining is a new concept never seen in crypto. What makes your project unique? Canxium have two unique features at the present: - The Unique Economics of Canxium: Decentralized Supply Control Mechanism - The Unique Mining Mechanism: Offline More feature are coming soon, especially the new consensus. History of your project. Canxium was established in Vietnam in May 2023. First Canxium block was mine on April-30-2023 08:06:16 PM +7 UTC. After three months of launch: Canxium has achieved many achievements such as: 22,880 transactions, 1013 wallet addresses, 10-30k daily trading volume, more than 100k USD total volume. What’s next for your project? Canxium has a lot of work to do in the next few years, like bringing offline mining to the mainnet, then designing and developing a new consensus algorithm, allowing offline miners to contribute to the creation and validation process of new blocks What can your token be used for? Canxium Coin (CAU) is the native coin that powers the Canxium network and is used to pay for transactions. CAU functions as a utility token and is used to pay for gas fees for transactions on the Canxium blockchain. CAU is a proof of value, which will never be minted, but must be mined through computation to generate new blocks or mined offline.","links":"https://canxium.org/","market_cap":580618,"market_cap_rank":4922,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/canxium/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}