{"name":"Scallop","id":"scallop","symbol":"sclp","description":"Scallop is an innovative fintech decentralized ecosystem built to offer users a faster and more efficient way to securely manage crypto and fiat currencies in a single place. Scallop is a robust platform that combines decentralized financial services with banking features such as bank accounts, cards, remittance and much more - to promote the general usage of crypto in daily life. Scallop’s mission is to bring digital assets into mainstream use and accelerate the transition to a more equitable and decentralised ecosystem. The Scallop token, SCLP, will be an ERC-20 and BEP token and will be an integral within the Scallop ecosystem. It has several native use cases such as receiving trading bonus payments, staking, payment of transaction fees, etc. Scallop offers traditional banking services with a strong cryptocurrency and DeFi integration for both individuals and institutions. It’s the only banking service to directly connect banking accounts to hardware or digital wallets and as such facilitate seamless crypto to fiat (and vice versa transactions. Included in Scallop suite of ten ‘X’ products is: - Scallop Pay - Payment Gateway for businesses to set up on/off ramp from crypto to fiat and vice versa, to receive payments from customers Scallop Cards - Pay for any goods or services online or in-store using digital assets Scallop Chain - World’s first regulated blockchain that will overlay the entire Scallop banking ecosystem. It can power cross-chain financial applications and allows institutional partners to design and deploy secure custody services, interest-bearing savings accounts, debit cards, and a fiat on-ramp to cryptocurrencies.","links":"https://scallopx.com/","market_cap":10997076,"market_cap_rank":1416,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/scallop/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf2c96e402c9199682d5ded26d3771c6b192c01af"}}}