{"name":"Izzy","id":"izzy_ethereum","symbol":"izzy","description":"Izzy, the adorable Golden Retriever of Matt Furie, the renowned creator of the internet phenomenon Pepe the Frog, has officially made her debut on the Ethereum blockchain. Following in the groundbreaking footsteps of Pepe, Izzy is poised to make history in the crypto space, bringing with her a fresh wave of excitement and opportunity. Just as Pepe became a cultural and digital icon, Izzy’s arrival promises to capture the hearts of the community while offering unique features that set her apart from other projects. Built with transparency and trust at its core, the Izzy token operates with a 0% tax model, ensuring that all transactions remain free of fees, a highly attractive feature for investors and traders. In addition to this, the liquidity of the Izzy token has been permanently burned, solidifying the commitment to long-term value and preventing any manipulation of the liquidity pool. This burn ensures that liquidity is locked forever, offering stability and security to investors. Furthermore, the contract has been renounced, meaning that no single entity has control over the contract, and it is entirely decentralized—a key aspect that aligns with the values of the broader cryptocurrency community. Izzy’s journey on the Ethereum chain is more than just a playful homage to her famous predecessor, Pepe. It’s an opportunity for crypto enthusiasts to engage with a project that embraces community-driven growth, fairness, and innovation. Just as Pepe carved out a lasting legacy, Izzy is here to create her own unique impact in the world of decentralized finance and blockchain technology. With a solid foundation, a beloved backstory, and a strong commitment to transparency, Izzy is set to become the next sensation on the Ethereum network.","links":"https://izzy-coin.vip/","market_cap":83840,"market_cap_rank":7314,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/izzy/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x6969f3a3754ab674b48b7829a8572360e98132ba","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x6969f3a3754ab674b48b7829a8572360e98132ba"}},"is_native":false}