{"name":"Dao Space","id":"dao-space_binance-smart-chain","symbol":"daop","description":"What is the project about? Dao Space is a blockchain incubator and launchpad that empowers innovators and project developers through access to funding, community and partnership building, and a full support system to help drive the future of blockchain. The Dao Space platform helps streamline the launch process for new and existing teams looking to make an impact in the crypto scene while providing private and secure opportunities for its community. What makes your project unique? Dao Space offers a low risk alternative for traditional retail investors but limiting the allocation amount, meaning projects also gain a larger loyal following but distributing tokens across a wide audience. Dao Space is built to serve retail investors looking to grow their capital but cannot afford to risk large portions of their money. History of your project. The Daospace project was first conceived when it published the whitepaper in December 2022. The more technical details of how the Launchpad system will work were published in January 2023. A whitelist pre-sale was held in February 2023, and Launchpad went live in March 2023. What’s next for your project? As of now, free NFT minting application has been activated on our website in return for @DAOP token collateral. Next, the Launchpad Platform will be added to run IDOs through the website. Dao Space is considered a complete solution, especially in crowdfunding, community building, and blockchain marketing. It has all the resources and technology one would expect. What can your token be used for? Featuring a launchpad with a tiered allocation mechanism, Dao Space enables $DAOP holders to reedem their tokens and earn while gaining access to quality, procured blockchain through private sales and initial offerings. Investors can trade $DAOP tokens for free with NFT, thus gaining the right to higher purchases from IDOs.","links":"https://daospace.fund/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dao-space/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xaf7c3e578621aabab184c706bad94ffb1a2e0179","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xaf7c3e578621aabab184c706bad94ffb1a2e0179"}},"is_native":false}