{"name":"Morpheus AI","id":"morpheusai_arbitrum-one","symbol":"mor","description":"Morpheus is designed to incentivize the first peer-to-peer network of personal general purpose AIs that can execute Smart Contracts on behalf of a user, known as Smart Agents. Providing users open-source Smart Agents to connect to their wallets, Dapps, & smart contracts promises to open the world of Web3 to everyone. The user’s Web3 wallet for key management & to sign recommended transactions when interacting with the Smart Agent. A Large Language Model trained on Web3 data including Blockchains, Wallets, Dapps, DAOs, & Smart Contracts. The SmartContractRank algorithm to score & recommend the best Smart Contracts to the user. Longterm memory of user data & connected applications stored locally or via decentralized cloud to provide a broader context to Smart Agent actions. Finally, the average user can talk with their Smart Agent in normal language and have it understand the question and take an action based on their intent/approval. This moment is similar to how Google's search engine opened the early internet up to the general public through their easy to use web interface in the late 1990s. To make Smart Agents accessible to everyone and increase decentralization of their infrastructure, we propose the development of the Morpheus network. The Morpheus network will include a fairly launched token (the \"MOR\" token) for incentivizing all four of the key contributors to the network. Namely, the community of builders creating interfaces, coders contributing to the Morpheus software/agents, capital providers adding liquidity and those supplying computation, storage and bandwidth. It has been well shown by the history of Bitcoin and Ethereum that free & open competition for scarce digital tokens can provide scalable infrastructure for a public blockchain over long periods of time.","links":"https://mor.org/","market_cap":10702041,"market_cap_rank":1508,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/morpheusai/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x092baadb7def4c3981454dd9c0a0d7ff07bcfc86","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x092baadb7def4c3981454dd9c0a0d7ff07bcfc86"}},"is_native":false}