{"name":"WECOIN","id":"wecoin","symbol":"weco","description":"What is the project about? Weset is a Web3 platform that allows real world properties to be uploaded and tokenized and fractionalized. This new technology provides new market opportunities for property owners and real estate users and investors. The mission is to To democratize global real estate by building a blockchain platform which makes the market more accessible, affordable, and liquid. What makes your project unique? We provide the utility of allowing token holders to occupy the property or use it for income. We are also a scalable solution that allows any property owner that meets community standards to upload a property. We can create a global community where we create value for property owners, vacations, NFT holders, and real estate investors. History of your project. Weset was launched in 2021 and released its MVP in November 2022. In December 2022, we sold our first NFTs. The Collection of IT Building, Playa del Carmen, allows NFT holders to own weeks of property usage for 30 years. In May 2023, Weset launched its utility token, Wecoin ($WECO) as an IDO. As of May 17, there is roughly $10,000 24-hour trading volume and a market cap of $80,000. now up to 700k usd, What’s next for your project? In June 2023 we will launch our Blockchain as a Service, which will allow for scalability through a greater variety of properties and token configurations to be uploaded for our community. This will allow is to then open up a marketplace to increase liquidity. The marketplace will allow for primary and secondary sales of NFTs with multiple coins, including $WECO. What can your token be used for? $WECO is a utility token for our global community, which will offer the following benefits: ● Payment for goods and services ● Staking for discounts and exclusive access ● Rewards distribution for: Staking Liquidity providers ● Governance","links":"http://weset.io","market_cap":2379158,"market_cap_rank":2168,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wecoin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x5d37abafd5498b0e7af753a2e83bd4f0335aa89f"}}}