{"name":"Global Commercial Business","id":"global-commercial-business_binance-smart-chain","symbol":"gcb","description":"Welcome to GCB (GCB), a cutting-edge utility token operating on both the Binance Smart Chain and TRON platforms. At GCB, we are revolutionizing digital finance by leveraging blockchain technology to tackle the pressing challenges faced in the Middle East, Africa, and emerging markets globally. Our primary objective is to promote financial inclusion by simplifying access to essential financial services through our robust digital platform. GCB serves as the cornerstone of our comprehensive digital financial ecosystem, offering seamless solutions for account management, fund transfers, and decentralized finance (DeFi) opportunities. What sets us apart is our commitment to diversification across multiple industries, enhancing the utility and resilience of the GCB token. Whether it's facilitating cross-border transactions, empowering local businesses, or supporting innovative fintech initiatives, GCB is at the forefront of driving economic empowerment and digital transformation. Behind GCB's vision and success is our dynamic team of industry pioneers and experts. With extensive backgrounds in fintech, business development, blockchain architecture, Web3 technologies, artificial intelligence, and emerging tech trends, we are uniquely positioned to pioneer groundbreaking solutions that redefine the standards of digital finance. Join us on our journey to reshape the future of finance, one innovative solution at a time. Discover the power of GCB and experience a new era of accessible, inclusive, and sustainable financial services.","links":"https://www.gcbex.com","market_cap":32790333,"market_cap_rank":837,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/global-commercial-business/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x84f70be4deb029d5f8aacbeacc74c4dc10737342","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x84f70be4deb029d5f8aacbeacc74c4dc10737342"}},"is_native":false}