{"name":"Jigsaw USD","id":"jigsaw-usd","symbol":"jusd","description":"Jigsaw Finance is a DeFi protocol focused on dynamic collateral management and stablecoin issuance. The platform introduces a CDP (Collateralized Debt Position)-based system that allows users to deposit a variety of supported cryptoassets as collateral to mint the protocol’s native stablecoin, jUSD. Jigsaw Finance is designed to increase composability within the DeFi ecosystem. Unlike traditional CDP systems where collateral remains locked until debt repayment, Jigsaw enables users to dynamically reallocate their collateral across whitelisted protocols. This functionality allows users to pursue optimal yield opportunities while maintaining active debt positions. Supported collateral types can be moved into yield-optimizing platforms, liquidity pools, or lending markets without requiring loan closure. The minting process allows users to borrow jUSD against eligible collateral at a protocol-defined Loan-to-Value (LTV) ratio, depending on the specific asset. A minting fee applies upon creation of each debt position. Once minted, jUSD can be used within the Jigsaw ecosystem for various financial strategies, such as looping, liquidity provision, or leveraged exposure to underlying assets. Borrowing activity is governed by parameters including maximum LTV ratios, borrowing interest rates, and liquidation thresholds to maintain systemic stability. Health ratios are continuously monitored, and users whose positions fall below minimum collateral requirements are subject to liquidation mechanisms designed to protect the solvency of the protocol. Jigsaw Finance integrates with external yield platforms such as Pendle, Spectra, Reservoir, and others, allowing users to deposit their collateral into third-party venues while maintaining their borrowing capacity. This structure optimizes capital efficiency, as users can generate yield on their collateral without sacrificing liquidity access. In addition to core integrations, Jigsaw extends composability by partnering with leading protocols including Aave, Dinero, Fluid, Nucleus, Elixir, Usual, and EtherFi pools. Users can redeploy collateral across these whitelisted DeFi protocols to maximize yield potential. Jigsaw also supports seamless collateral asset swapping without requiring debt repayment. Users can swap between collateralized assets (e.g., BTC ↔️ ETH or USDC ↔️ USDe) while keeping their CDP positions intact. This enhances flexibility and enables users to adjust their strategies dynamically as market conditions change. The stablecoin jUSD is pegged to the U.S. dollar and is backed by overcollateralized debt positions. It is designed for use within DeFi applications, including payments, trading, liquidity mining, and additional yield farming opportunities, offering a stable and predictable unit of account. All collateral deposited through Jigsaw flows directly into partner protocols, enhancing liquidity and value within their ecosystems. By combining dynamic collateral management, stablecoin issuance, and deep DeFi integrations, Jigsaw Finance offers users a flexible framework for capital optimization and yield generation.","links":"https://jigsaw.finance/","market_cap":487859,"market_cap_rank":4558,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/jigsaw-usd/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x000000096cb3d4007fc2b79b935c4540c5c2d745","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x000000096cb3d4007fc2b79b935c4540c5c2d745"}}}