{"name":"Helium Mobile","id":"helium-mobile","symbol":"mobile","description":"What is the project about? The Helium Network is a decentralized, blockchain-based wireless infrastructure project that allows individuals and organizations to deploy and operate wireless networks through token incentivization. It leverages the Solana Blockchain for its foundation. The primary token powering the network is HNT, while IOT and MOBILE tokens are used to facilitate the LoRaWAN and 5G networks, respectively. What makes your project unique? Decentralized Infrastructure: The Helium Network allows for the creation and maintenance of a distributed wireless network by incentivizing participants to contribute resources and share the benefits. Scalable and Secure: The network leverages the Solana Blockchain, which is known for its high scalability, low latency, and robust security. Multi-Use Case Support: The Helium Network supports various use cases, including IoT devices through the LoRaWAN network and high-speed mobile connectivity via the 5G network. Incentivized Participation: The Helium Network employs a token-based system to reward participants and encourage network growth. Proof-of-Coverage (PoC): A unique consensus algorithm employed by the LoRaWAN and 5G subnetworks, which rewards participants for verifying wireless network coverage. What’s next for your project? Today, the Helium Network is a rapidly growing decentralized wireless infrastructure with a global footprint. It continues to attract new users, developers, and organizations, paving the way for innovative applications and services. As the network expands, it aims to revolutionize the wireless communication landscape and further democratize access to connectivity What can your token be used for? The MOBILE token is the Governance token of the 5G Subnetworks, mined by 5G Hotspots through both data transfer proceeds as well as Proof of Coverage.","links":"https://www.helium.com/","market_cap":112048407,"market_cap_rank":347,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/helium-mobile/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"mb1eu7TzEc71KxDpsmsKoucSSuuoGLv1drys1oP2jh6"}}}