{"name":"Legends of Elysium","id":"legends-of-elysium","symbol":"loe","description":"Legends of Elysium is a Play-And-Earn fantasy project made as a Fusion of Card & Board games. The game combines an incredible, immersive classic card game experience with the ground-breaking technology behind non-fungible tokens (NFTs) giving the players true ownership over assets they possess. Unique Stake & Borrow mechanism, enables owners of an NFT to stake it and earn APR, while at the same time other players are able to borrow the staked NFT and use it in their own decks. Strategy in the game is an extremely important element with a nearly infinite number of possibilities thanks to the introduction of a Game Board, which makes Legends of Elysium truly unique and brings additional elements of the strategy. Players are able to plan and adjust their strategy based on multiple factors such as Race and Class of their hero, Boards they play on, NFT cards they use and several other factors. Legends of Elysium offers a thriving game ecosystem which gives players a perfect combination of challenging entertainment with earning opportunities. In Legends of Elysium, everyone will have an equal chance to participate in monthly eSports tournaments and compete alongside professional players for grand prizes. At Legends of Elysium, our objectives are: 1. Becoming the bridge between Gamers from traditional gaming industry and blockchain environment! It's Free to Play - No Entry Barrier. 2. Enabling eSports to everyone! Currently they are exclusively reserved for professional players, we are here to change that - get a ticket and compete in a fair test of your skills. 3. Giving true ownership of in-game assets to the players! We give a choice to the gamers - if they wish to mint NFT, they can do so at any time. 4. Delivering AAA quality game to the blockchain! We bring highly entertaining game and enable monetization of players time - simply Play AND Earn.","links":"https://legendsofelysium.io/","market_cap":500665,"market_cap_rank":4599,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/legends-of-elysium/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x8b78927048de67b9e8c8f834359f15c3822ed871"}}}