{"name":"HyperChainX","id":"hyperchainx_binance-smart-chain","symbol":"hpx","description":"HYPER is currently trading at $.00041 with MCAP of $ 411,463 Hyper is inspired from Great Jugi Tandon https://medium.com/@Hyperchainx/jugi-tandon-nfts-the-inventor-of-the-double-sided-floppy-drive-7d937705b3ed Bridging the Gap between Blockchain & Gaming NFTS and blockchains are the future of gaming, we at HyperChainX are providing a tailored NFT marketplace and gaming platform. Built by gamers. Upcoming \"Hypertron” NFT Collection We are proud to announce that our \"Hypertron” NFT collection will be available soon on our marketplace. The utility behind this collection is that your able to STAKE your NFT to EARN from every transaction made on our marketplace. Whitelist spots and a affiliate program will be available for this presale soon! In the rising crypto gaming industry there is a need for a fully dedicated NFT marketplace that is focussing on the culture, history and its future! We at HyperChainX know what our targeted audience is and we follow the trends. Thats why we are the best marketplace for creators and collectors in the gaming niche. We have all the ingredients that the game needs! The launchpad is designed to give NFT collection creators all the opportunities to create a successful launch. We have it all; custom mystery boxes, whitelisting options, free claims, NFT contract creation support and an affiliate marketing program that will boost the sales. Upcoming \"Hypertron” NFT Collection We are proud to announce that our \"Hypertron” NFT collection will be available soon on our marketplace. The utility behind this collection is that your able to STAKE your NFT to EARN from every transaction made on our marketplace.","links":"https://hyperchainx.com","market_cap":1497907,"market_cap_rank":3271,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hyperchainx/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":7,"contract_address":"0x5b3829ebdf126fadf69b829bbc000e5c749265af","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x5b3829ebdf126fadf69b829bbc000e5c749265af"}},"is_native":false}