{"name":"Crypto Bros","id":"crypto-bros","symbol":"bros","description":"What is the project about? Crypto Bros is a meme token that was created after US Rep. Brad Sherman's remarks before Congress which criticized \"crypto bros\" who, he claims, \"printed over a trillion dollars out of thin air.\" The Congressman's words were quickly shared across social media and a community of likeminded, self-proclaimed \"crypto bros\" organically arose, leading to the creation of the token. What makes your project unique? The $BROS smart contract features a fixed supply of 69,000,000,000,000 meaning that no new tokens can be minted. There are no transaction taxes when transferring tokens on an exchange or to any other wallet. Ownership of the contract has been renounced, ensuring that it is impossible to edit the contract functions in any way. History of your project. $BROS came about as a direct result of Rep. Sherman's comments to the United States Congress on May 10, 2023. Sherman, however, is no stranger to memecoins - in late 2021, also before Congress, his ramblings about a hypothetical \"mongoose coin\" spawned dozens of memecoins and derivatives. Now, over a year later, Sherman is at it again, criticizing so called \"crypto bros\" who \"made over a trillion dollars out of thin air.\" Thus a decentralized community of self-proclaimed cryptobros have come together to support the $BROS token. What’s next for your project? Our project is a grassroots one and relies on word of mouth growth and community-led initiatives that is using memetic power to increase exposure throughout crypto communities. What can your token be used for? This token is a memecoin for purely entertainment purposes and offers no guarantee of value or expectation of financial return.","links":"https://www.cryptobros.gg","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-bros/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x9dcd367e2afa8d6e5d6cf0306094e3eb7bbaaf4d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x9dcd367e2afa8d6e5d6cf0306094e3eb7bbaaf4d"}}}