{"name":"Hunter","id":"hunter","symbol":"hntr","description":"Currently, there is currently a gap in the firearm, gaming, and hunting industries; there is no opportunity for the purchase, ownership, and trade of digital firearms. This is where Digital Arms will become the world's first provider of a digital firearms trading platform partnered with several blockchain gaming platforms with our scarce, highly sought-after gaming NFT firearms that are true-to-life replicas of their real-world counterparts. Digital Arms has partnered with eight internationally reputable firearm brands on the release of IP licensed NFTs, built from the actual CAD used to manufacture the firearm. Our partnerships extend the entertainment industry to build and release firearm prop NFTs from leading media productions. The Hunter Token ($HNTR) will be the core medium of exchange that facilitates the entire Digital Arms ecosystem. It’s expected that other companies will struggle to compete in the space -if they’re able to penetrate the industry at all. Holding IP rights in both the gaming and NFT industries means we can send Cease and desist to any games that have not officially secured IP rights to digital firearms and accessories through Digital Arms. A company that holds exclusive IP licensing rights for the world’s leading firearm brands for the NFT gaming industry has a monopoly on the market. Demand: Brand fans – millions of brand lovers and followers, an area with fast scalability. Collectors – NFT collectors that see strong project utility which can be multiplied by adding gaming partners or the creation of a shooter metaverse that is under construction with our partnered web3 gaming engine (MetaEngine). Investors – NFT/Token investors that can create passive income through lending and staking Gamers – NFT Ownership is required to compete in partnered gaming tournaments, exclusive sponsored events, and game economics. Long playing history with the guns in web2 space, now with the opportunity of true ownership.","links":"https://www.hunter-token.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hunter/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x83451a4e3585fda74feb348ad929f2c4ca189660"}}}