{"name":"Farmer Moe","id":"farmer-moe","symbol":"$moe","description":"Farmer Moe is a groundbreaking blockchain project that aims to combine elements of GameFi and Liquid Staking Derivatives (LSD) to create a new genre of tokenization called MoeFi. LSD and LSDfi have traditionally been complex and inaccessible to the average cryptocurrency user. However, Farmer Moe is set to change that by developing a protocol that is user-friendly and designed for mass adoption. This whitepaper outlines Farmer Moe's roadmap and community incentives, highlighting its vision to revolutionize the GameFi and LSDfi sectors. Introduction: Blockchain technology has revolutionized various industries, including finance and gaming. GameFi, the fusion of gaming and decentralized finance (DeFi), has gained immense popularity by offering users the ability to earn rewards and create value through gaming activities. Additionally, Liquid Staking Derivatives (LSD) have provided users with the flexibility to trade staked assets and access liquidity while participating in proof-of-stake blockchain networks. Farmer Moe aims to bring these two concepts together to create MoeFi, a novel approach to tokenization. MoeFi - The Vision: Farmer Moe's vision is to simplify and democratize the world of Liquid Staking Derivatives and GameFi. By combining the benefits of both sectors, MoeFi offers users the opportunity for high returns and long-term value while ensuring a user-friendly experience. Farmer Moe aims to make LSD/LSDfi accessible to the masses and redefine the way users engage with these technologies. Roadmap: Farmer Moe will follow a carefully planned roadmap to ensure a gradual and secure deployment of its protocol. The initial launch will introduce basic LSD farms and a $MOE staking farm. These farms will allow users to stake their assets and earn rewards within the protocol. As the project progresses, Farmer Moe will develop an aggregated dynamic LSD farm. This farm will select the most promising and successful LSD farms in the ecosystem and create a mirrored rew","links":"https://www.farmermoe.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/farmer-moe/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x881145e5a28b6411cb80d0350497217f549b050c"}}}