{"name":"My Lovely Coin","id":"my-lovely-coin","symbol":"mlc","description":"### What Is the My Lovely Coin (MLC) The My Lovely Coin (MLC) is the utility token of the game My Lovely Planet, the web3 game dedicated to the Protection of the Environment. The concept is very simple, but highly effective. When you plant a tree in the game, we plant a tree in real life. 🌱 The My Lovely Coin (MLC) is at the heart of the My Lovely Planet ecosystem: - Players can buy digital items in MLC directly in the game - Players needs to hold MLC to unlock exclusive content - Players needs to hold MLC to vote for ONGs and participate in the Environmental Treasury ### How Many My Lovely Coin (MLC) Are There in Circulation? Fixed supply of 350,000,00 MLC ### Who are MLP's major partners? My Lovely Planet is part of the Ubisoft Entrepreneurs Lab @Station F, the best accelerator for gaming, with exclusive access to worldwide experts and advisory in game design, 3D, monetization, and retention. Alumni of this incubation program include Axie Infinity or Sorare. My Lovely Planet has won the \"Unity for Humanity\" Award, one of the most selective programs in gaming, which rewards and encourages visionary creators with a mission to create a more equitable, inclusive, and sustainable world. The Unity for Humanity program enables 3D creators to make the world a better place by helping them bring their vision to life and amplifying their impact. ### Who Are the Founders of My Lovely Planet? Clement LE BRAS is the founder of my Lovely Planet, joined by Art Director and Lead Game Designer of the game Candy Crush. Clement is a passionate and dedicated founder who embodies the mission of My Lovely Planet. Graduate of Mines de Paris, France's most prestigious engineering school, with a major in Energy, and trained in environmental issues by the expert Jean Marc Jancovici, Clément LE BRAS is an entrepreneur with a passion for new technologies. After spending a year in Madagascar working with one of the world's poorest communities, which is also one of the most vulnerable to climate change, he decided to dedicate his career to finding innovative climate protection solutions. ### Who are My Lovely Planet target users? MLP first primary audience is young people aged 16 to 30, as they are the most engaged in climate action. Gaming is more and more popular among young generation: - Games are the #1 source of entertainment for Generation Alpha (born after 2010), surpassing social networks, music, cinema, or streaming of films/series. - 50% of Generation Alpha and Generation Z spend money on video games. A large proportion of young people around the world are concerned about climate issues: - UNITED NATION Survey in 2020: A survey conducted by the United Nations revealed that nearly 70% of young people consider climate change to be a major threat. - Thomson Reuters Foundation Report in 2021: This report indicates that 77% of young people (aged 18 to 35) consider climate change to be one of the greatest global challenges. More broadly, our audience is the mobile gaming market, which includes 2.8 billion people worldwide. - 2.8 billion mobile gamers worldwide - 40% of mobile gamers are women - 52% of mobile gamers are between 18 and 34 years old This mobile gaming market represents $116 billion in revenue generated in 2023.","links":"https://www.mylovelyplanet.org/","market_cap":11651127,"market_cap_rank":1475,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/my-lovely-coin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x0566c506477cd2d8df4e0123512dbc344bd9d111"}}}