{"name":"kittyspin","id":"kittyspin","symbol":"ks","description":"The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning. The kitty keeps spinning.","links":"https://www.kittyspin.io/","market_cap":30580,"market_cap_rank":8216,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kittyspin/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"72LTryHMb1m9j4NEcn673sXkFMXMmHvmB8grYcVspump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/72LTryHMb1m9j4NEcn673sXkFMXMmHvmB8grYcVspump"}}}