{"name":"Eldarune","id":"eldarune","symbol":"elda","description":"What is the project about? Eldarune is an AI-Powered medieval RPG based on a storyline with 4K graphics, PvP, and PVE modes. While playing Eldarune you will travel 21 islands, fight in the hundreds of dungeons, and defeat the strongest monsters in the Elymnias world with your clan or alone. Eldarune has four different game modes; every mode offers a different gameplay experience with various game mechanics. To be successful, for every game mode, players and clans need to develop different strategies in battle. What makes your project unique? Eldarune offers a unique and personalized gaming experience that is revolutionized by AI integration by adapting players' play styles and behavior and Eldarune creates a dynamic, ever-changing gaming world that keeps players engaged and entertained. History of your project. Eldarune Head of Game, Tarik has been developing the project since 2016. It started as a hobby project, releasing the game's story mode on Steam as early access in 2019. With the current Eldarune team for over 2 years, blockchain integrations, the addition of new PvE mods and PvP mods have been added. It upped the game graphics to 4K and made it playable on PC and Mobile. What’s next for your project? IGO on May Cex listing on May Mainnet Game on PC Release in June. Testnet Game on Mobile in June Mainnet Game on Mobile in July What can your token be used for? $ELDA Token Utilities: Farming and Staking Token Burn Mechanics, 10% off every Character/Item Chest NFT Sale, 20% of Alec NFT Sales will be burned Players will be able to purchase NFTs with ELDA Token Players will Rent their NFTs to other players with ELDA Token Players will craft their gears to get better and different genre gears Players will be able to Purchase Arena Tickets to Attend Weekly, Monthly, and Season based Tournaments Players will be able to purchase in-game experiences and drop rate boosts with ELDA Token Players will be able to upgrade their NFTs with ELDA","links":"https://www.eldarune.com/","market_cap":2909536,"market_cap_rank":2883,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/eldarune/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xab2ed911bdbea001fd3b29adbc35d8a76e68aae4"}}}