{"name":"Antofy","id":"antofy","symbol":"abn","description":"What is the project about? Antofy is a blockchain designed from the ground up to solve the current problems faced by existing blockchains. We have reimagined every aspect of the technology, from tokenomics to consensus, to create a fundamentally new distributed system. This documentation is the only reliable source of the Antofy architecture. We are still polishing the system's nuances, so the documentation is constantly updated and supplemented. What makes your project unique? The Antofy Platform is a unified infrastructure platform based on technical, traffic, and ecological resources and will be gradually opened to the blockchain industry. It will make the construction of decentralized applications more efficient and cost-effective, and provide comprehensive empowerment in aspects of promotion, traffic, and resources. The Antofy Platform is an EVM compatible blockchain that solves the biggest problem in the Dapp industry and has 0% transaction fees. The Antofy Platform will provide global developers with a series of diverse, innovative facilities and services. History of your project. Antofy labs started its blockchain granny in 2022 with a vision to become the premier blockchain solution provider, till now we have developed many dApps and Dex platforms and have completed our blockchain testnet. What’s next for your project? We are working on a high TPS Antofy mainnet with 100k TPS tested on local environment. Antofy Team is very much satisficed with the results and soon the mainnet will be updated. What can your token be used for? Antofy (ABN is the native coin that powers the Antofy network and is used to pay for transactions. ABN functions as a utility token and is used to pay for gas fees for transactions on the Antofy blockchain, denominated in gwei. Stakers on the Antofy network earn ABN as their reward for securing the network. ABN is also a cryptocurrency, similar to bitcoin, and can be traded on multiple centralized and decentralized exchanges, or even deposited as collateral to take out loans.","links":"https://antofy.io/","market_cap":1879.79,"market_cap_rank":7878,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/antofy/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7062f2e2b917ed14b2b0833e9e0278cb4bc62c69"}}}