{"name":"Sculptor","id":"sculptor","symbol":"sculpt","description":"Sculptor Finance is a decentralized lending protocol and market on BNB Chain. Our goal is to provide users with access to excellent yields and deep liquidity on BNB Chain along with a fee-sharing model that aligns incentives between users and owners. We intend to buck the trend of “set it and forget it” lending protocol owners by being a team of community-engaged and focused leaders who want to truly build. Sculptors lend their assets (BNB, BTC, ETH, Stablecoins, CAKE) and can then “sculpt” their perfect asset portfolio while still having exposure to the original asset. For example, if you have BTC that you do not want to sell, you can lend it, then borrow stablecoins (such as BUSD) to make other purchases. If the price of BTC increases, you can borrow more. If it decreases, you may need to pay some of your loan back or risk the BTC being sold to cover your borrow. The perk of this is that you earn our native token, $SCULPT. With these tokens you can stake them to earn some of the platform fees that borrowers incur as interest. At time of writing, these yields are in the billions of APR. The top percentage shows the APR you receive (or pay) in fees. The bottom is how much you earn in $SCULPT from borrowing and lending. While it may cost you 2% of your tokens per year to borrow $CAKE, you are earning 206 billion percent in $SCULPT APR. Nice! With this $SCULPT you can vest it in the platform over 3 months. This earns you yield in sTokens, such as staked BNB, staked BTC. This increases your borrowing ability, which increases your ability to earn! Another feature we felt lacking from previous lending protocols is the ability to loop your funds, thus increasing your earnings APR. This means lending (say BUSD), then borrowing BUSD, then lending that borrow, which in turn increases your borrowing allowance. Normally this is a tedious process that takes time, gas, and mental stamina to complete. To fix this, we engineered a 1-click Loop deposit function. Simply choo","links":"https://sculptor.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sculptor/logo.png"}