{"name":"IPMB","id":"ipmb","symbol":"ipmb","description":"International Precious Metals Bullion (IPMB) provides a dual-token solution to gold ownership by tokenizing the entire gold supply chain. IPMB has created the easiest and most affordable gold ownership platform in the world by vertically integrating the entire supply chain of investment-grade gold onto the blockchain. Tokenizing gold allows us to lower entry barriers, reduce costs and create a more secure and trustworthy gold ownership solution. Key Features of the IPMB Ecosystem include; Access to no-fee gold ownership. IPMB waives all fees such as storage, management, insurance and even delivery of investment-grade gold. Discount on physical gold. By staking IPMB Tokens, you can unlock an 11% discount on investment-grade gold. Traceable from the mine to the cloud, and in the vault. IPMB manages the entire gold supply chain and integrates the operation onto the blockchain. Regulated, verified and compliant. IPMB ensures all gold within the IPMB Ecosystem is OECD compliant. Our gold reserves are verified regularly by Grant Thornton Advisory. We are insured by leading global firms and ensure our gold complies with LBMA standards. About IPMB The IPMB Ecosystem offers direct access to physical gold, allowing exposure to the stability of gold and the speed and security of the blockchain through a dual-token model. Through this innovation, IPMB is striving to change the gold industry forever. IPMB’s mission is to provide the world access to economic freedom and opportunity, giving choice and control to accelerate a global transition to a low-cost, unified and transparent global currency. ‘From the mine to the vault, and in the cloud’, IPMB manages and operates physical gold production, sourcing, beneficiating, exporting, refining, stamping and vaulting of gold. The IPMB Ecosystem is at the heart of the IPM Group, a group of companies spanning three continents and five countries.","links":"https://ipmb.com/","market_cap":105713881,"market_cap_rank":611,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ipmb/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xff22c94ffb6bb5d1df18beb5fd1dfe7583d3b214"}}}