{"name":"0VM","id":"0vm","symbol":"zerovm","description":"0VM stands as a layer-2 platform designed to facilitate the creation and deployment of decentralized applications (DApps) that are not only scalable but also highly versatile. These 0VM DApps are constructed by combining elements from both blockchain and off-chain domains. The off-chain components are executed within 0VM Nodes, each of which represents the interests and needs of individual DApp users. Within the realm of 0VM Nodes, DApp developers gain access to reproducible Zero Virtual Machines (0VMs) capable of accommodating large-scale verifiable computations. These computations can seamlessly integrate into smart contracts, leveraging robust primitives that provide substantial conflict-resolution assurances. To be more specific, any disputes that may arise concerning the outcomes of computations performed within Zero Virtual Machines can be impartially and efficiently resolved on the blockchain at minimal expense. Moreover, 0VM Nodes offer DApp developers the opportunity to execute native code, allowing them to harness the full processing capabilities of the node, including any available GPUs. Whether these computations are executed natively by the node or within Zero Virtual Machines, the off-chain components operate within a comprehensive Linux operating system environment that caters to the diverse requirements of complex computations. One of the key advantages of 0VM is that it empowers DApp developers to employ a wide range of programming languages, tools, libraries, software, and services with which they are already well-acquainted. By shifting the bulk of intricate logic within their DApps to portable off-chain components, developers are liberated from the constraints and peculiarities imposed by traditional blockchains. As a result, 0VM empowers developers to make informed choices regarding the most suitable runtime environment for hosting each component of their DApps.","links":"https://0vm.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/0vm/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1a8e64b7d6c34d46671f817c0ffa041cd9cee87d"}}}