{"name":"0x Leverage","id":"0x-leverage_ethereum","symbol":"oxl","description":"0xLeverage is a ground breaking all-in-one defi trading bot, accessible exclusively on telegram. The bots capabilities are unparalleled in the space as users will have the power to leverage their buying power and amplify their potential profits like never before. Let’s make it plain. Using leverage when trading is borrowing additional capital to magnify gains but also exposes you to a higher chance of immutability losing your investment. The advantage is it provides traders with an opportunity to earn higher returns using a smaller initial investment. However the higher reward potential carries higher risk as those borrowed funds must be paid back. Either those borrowed funds are paid back when you sell for profit or when the price drops to a liquidation level which is presented to the investor prior to opening a trade. The higher the leverage you choose the closer your liquidation price will be to your initial price, leaving little room when the price of the asset drops, especially if that asset has low liquidity. How our leverage system works on Blockchain When a user is on the leverage menu on our bot, they select their initial funds and the amount of leverage they want to borrow. For example if the user selects $50 and 3x leverage they are borrowing an additional $100 from the leverage pool to give them 3x the position while only risking 1/3 of their actual funds. When they open the trade their $50 are transferred to their unique leverage wallet. Simultaneously $100 are sent from our leverage pool. With those combined funds a trade is opened for $150 in the selected token. Once that trade is open the user must watch their liquidation price closely. They can track their trade but typing /tracklev and close their position at any time. If the users position falls to liquidation price their position will automatically sell. And those funds are all sent back to the leverage pool. If the user closes the position in profit the user gets their initial plus gains sent to their wallet, minus the loaned amount and fees which are sent to the leverage pool.","links":"https://www.0xleverage.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/0x-leverage_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x03ee5026c07d85ff8ae791370dd0f4c1ae6c97fc","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x03ee5026c07d85ff8ae791370dd0f4c1ae6c97fc"}},"is_native":false}