{"name":"Bonk","id":"bonk_binance-smart-chain","symbol":"bonk","description":"Bonk is a dog-themed memecoin on the Solana blockchain, launched on Christmas Day 2022 to revitalize the Solana community following the FTX collapse. Created by an anonymous team of 22 Solana developers and builders, Bonk distributed 50% of its total 100 trillion token supply via airdrop to community members including NFT collectors, developers, and artists. The project positions itself as \"the first Solana dog coin for the people, by the people,\" explicitly rejecting venture capital backing in favor of grassroots community ownership. What sets Bonk apart from other memecoins is its combination of fair launch mechanics, extensive ecosystem integration, and active deflationary strategy. Built on Solana, BONK benefits from fast transaction speeds and low fees that make it practical for everyday use. Native products include LetsBonk.fun (a memecoin launchpad that briefly became Solana's market leader in 2025, surpassing Pump.fun with over 78% market share), BonkSwap (a decentralized exchange) and BonkBot (a Telegram trading bot with built-in burn mechanics). BONK is available across 10 blockchain networks and listed on major exchanges including Binance, Coinbase, Kraken, and Robinhood. Governance is handled by BonkDAO, which holds 15% of the token supply and makes decisions through on-chain voting. The community has organized several major burn events, most notably the December 2024 BURNmas campaign that destroyed 1.69 trillion tokens worth over $50 million. In September 2025, Nasdaq-listed Safety Shot, Inc. formed BONK Holdings LLC and acquired over 2.5% of the circulating supply (valued at $55-63 million), making BONK one of the first memecoins to attract formal corporate treasury adoption. Core contributor Nom was appointed to Safety Shot's board, and the company holds a 10% revenue share in LetsBonk.fun. As with all memecoins, BONK is a highly speculative asset with substantial volatility. Its value is primarily driven by community sentiment, social media momentum, and meme culture rather than traditional utility. The anonymous team, while common in the memecoin space, means investors should exercise appropriate caution. Despite these risks, Bonk has established itself as one of the most successful community-driven tokens in the Solana ecosystem, approaching 1 million unique holders and expanding from a simple memecoin into meaningful DeFi infrastructure.","links":"https://www.bonkcoin.com/","market_cap":681632736,"market_cap_rank":118,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bonk/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":5,"contract_address":"0xa697e272a73744b343528c3bc4702f2565b2f422","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xa697e272a73744b343528c3bc4702f2565b2f422"}},"is_native":false}