{"name":"Treemeister","id":"treemeister","symbol":"tree","description":"What is the project about? All delivery, no hype. Inspired by the iconic early 2000s YouTube meme, \"Drinking Out Of Cups,\" this is a project you won't want to miss. Our core trio comprises a software engineer, Treemeister, a Content Creator, Mr. Balloon Hands, and a Marketing Manager, Mr. Walkway. With a talented ensemble of animators, moderators, voice actors, and more, we're set up to take this meme coin to the moon. We pride ourselves on transparency and ethics to ensure this project is where people will invest with total confidence. What makes your project unique? Calvin Hamilton, Gary Vee's previous social media manager and currently Ryan Serhant from Bravos Million Dollar Listing marketing manager, is a co-founder of this token. There is also a unique 2% buy-only and sell tax to show confidence in the project. A series of animations built around our I.P. 2 episodes have been released thus far, and more are coming. History of your project. It was started by three highly respected founders in their industries worldwide—a marketing manager, a software engineer, and a creative director. We apply our skill sets from those jobs to this project, which sets us apart from the competition. Our community understands they have professionals working for them, actively behind the scenes. What's next for your project? NFT release, IRL events, Merchandise Store, additional animations, continuous marketing, and more. Everything listed above is already mid-process. What can your token be used for? Currently, the videos are public-facing for mass marketing. In the future, videos will be premiered early for holders. Community members are being included in the animations now and in the future.","links":"https://www.treemeistereth.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/treemeister/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfbbe098ee65238e4d9f771404edddcbf89cd689b"}}}