{"name":"Gu","id":"gu-2","symbol":"gu","description":"Kugle is more than just a game, it's a vibrant ecosystem where players can enjoy diverse gameplay modes while earning rewards through strategic engagement with the Web3 economy. Whether you're a seasoned crypto enthusiast or a casual gamer, you're sure to find something you'll like. Join us in the Kugle universe and start your adventure today! - Play-to-Earn (P2E) Mechanics: Kugle integrates P2E mechanics, allowing players to earn and trade assets within the game. Here's how you can benefit: Main Token (GU): The in-game currency used to unlock features and obtain items. GU tokens can be acquired early and held for potential profit as their value increases. NFT Eggs & Kugles: Purchase and breed NFTs to create unique critters. Generate value by breeding the perfect Kugle for racing, or come up with a design so cute nobody can resist it, and sell them on the marketplace. Heat & Carbon: Earned by staking your NFT, boosted through gameplay, these resources are used to hatch and breed Kugles. Their conversion into tokens adds a strategic element to the game, and an opportunity to turn a profit! - How does KugleCorp earn money? Token Sales: Limited pre-sales and public sales of the GU token, with increasing prices as availability decreases. NFT Transactions: KugleCorp earns a small transaction fee when players trade kugles, ensuring a sustainable revenue model, and allowing for continuous updates to the game. Microtransactions: Players can purchase various in-game items and boosts using real currency, with options for converting these into NFTs in the future. - Features: Goshi: Raise and care for your own herd of critters. Breed these NFT-based creatures to create new ones, customizing them by mixing traits from the parents. Breeding leads to powerful NFTs, which can be used to compete in races or sold on the marketplace. Food Hunt: Explore a giant map filled with secrets and puzzles. Master gravity movement at your own pace while gathering food for your Kugles. Party Games: Master of the unique powers of your Kugles and climb to the top of the leaderboards across a variety of game modes, played in short bursts Staking: Holding NFT Eggs or NFT Kugles allow users to play them in-game, and to generate tokens every days that can be used for Hatch & Breeding, or for resell. GU Holding: Puting GU into the reactor of the game allow users to gain tickets & allow to have more NFT staked in-game, to allow to play with more NFT, and stake more tokens to use, or to resell. Breeding: Kuglecorp will distribute only Eggs of generation \"Genesis\" or \"1\", which can be hatched into a Kugle by players. In turn, two Kugles can breed to create a new Egg of gen n+1. To maintain a healthy count of NFTs, Kugles can breed twice, and the offsping have its generation counter increased by 1. Resulting in fewer earned resources and higher hatch/breed cost. Fixing the infinite supply problem we can see with breedign in other games. - Party Games: Racing: With 10 tracks taking place across different galaxies, Mastering each track's secrets and choosing your powers accordingly will lead you to victory! Hide'n'Seek: Hide from seeker Kugles in a crazy game of tag. But the beware, get caught you'll become a seeker too! With many places to hide, each unique spot you hide in will grant extra points. Will you dare jumping between hiding spots to outrank everyone? Coming soon: Kuglecorp never stops! Expect new races tracks every month, and new game modes every few months. Does gravity football sound good to you? or maybe a battle royale? We're happy to provide! Come to our discord LINK and suggest your ideas!","links":"http://kugle.app/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gu-2/logo.png","detail_platform":{"moonbeam":{"decimal_place":18,"contract_address":"0xe8e8bd89a429526561e1283cb789719864ffd0b4","geckoterminal_url":"https://www.geckoterminal.com/glmr/tokens/0xe8e8bd89a429526561e1283cb789719864ffd0b4"}}}