{"name":"SpaceXpanse","id":"spacexpanse","symbol":"rod","description":"✅SpaceXpanse Multiverse is a top-notch project that merges blockchain and AI to create a trustless GameFi platform. This platform, designed for immersive user experience and decentralized applications, provides a space where users can interact and engage without limits. ✅Key to the platform is the ROD blockchain, which powers transactions and storage for its native utility coin - ROD, tokens, NFTs, and a name-value database. The platform also features decentralized DNS for secure domain resolution and digital IDs for trustless user authentication. ✅The Multiverse platform offers atomic trading for asset exchange and a Play-and-Earn model, allowing users to earn rewards while using applications. Development tools like SpeX Library and Democrit facilitate seamless integration with third-party applications, while the DappEngine simplifies the creation of decentralized apps. ✅The Metaverse Simulator is a tool for testing virtual environments, while Metalog will be its inner decentralized social network. The AI-powered chatbot - D.A.R.M.A., will welcome and assist the users in every possible way. There will be Startup Hub that will support projects and initiatives by third parties. ✅Our team of devoted professionals with expertise in different fields follows a structured roadmap, with stages focused on laying the foundation, scaling up, and community engagement. ✅The platform operates under the MIT license, promoting collaboration and innovation by granting developers freedom to modify and distribute their software. Also, it ensures transparency through a registered NGO, allowing community members to track expenses and contribute to development through donations. ✅This is a long-term project that is based on real development and not on mere speculation. The people behind it have the vision, the energy, the knowledge, and the agenda to become major players in the field, so trusting SpaceXpanse Multiverse in this early stage is a once-in-a-lifetime opportunity.","links":"https://rod.spacexpanse.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spacexpanse/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}