{"name":"SpaceXpanse","id":"spacexpanse","symbol":"rod","description":"What is the project about? By putting the crypto technology back on track, we are making a next-gen trustless blockchain platform, designed for rapid creation of metaverses, immersive user experience and easy development of complex decentralized applications. What makes your project unique? By combining ROD blockchain's unique capabilities with visual simulation software and decentralized DNS and data storage nodes, we want to develop the so-called metaverse of the future: a self-sustaining virtual environment, which we called SpaceXpanse Multiverse, where people can create metaverses, communicate with others, have fun, and which can be easily accessed by anyone from anywhere. Except that the project: - Can create, store and transact coins, fungible and nonfungible tokens. - Supports two PoW algorithms for GPU and for merged mining, generating blocks every 30 seconds in 3 to 1 ratio. - Have 3% annual inflation of the mined coins for 59 years after the first 5 years of halving. - Allows to register and transfer arbitrary names aka Digital IDs, for trustless user identification, which can hold and transfer value. - Provides fare amount of secure data storage in every block. - Supports Atomic trading of in-game assets in a trustless manner. - Follows Play-to-Earn model, which allows a part of the block rewards to be \"placed\" inside a decentralized application. /WIP/ History of your project. It has officially started a little more than a year ago but was planned for several years, actually. What’s next for your project? After completing the initial stage of the platform, we started developing SpaceXpanse: Wanderers: a space exploration game in its own metaverse. What can your token be used for? Except for paying a fee for coin transfer, you can use RODs to pay for registering and transferring arbitrary names e.g. u/yourname, issuing fungible and non-fungible tokens, for open side channels with other users in the ROD blockchain.","links":"https://rod.spacexpanse.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spacexpanse/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}