{"name":"Alrihla","id":"alrihla","symbol":"alrihla","description":"⚽ 2022 Qatar world cup official match ball alrihla ⚽ (journey) Alrihla means \"journey\" in Arabic. It is reported that the ball is inspired by Qatar's culture, architecture, iconic ships and national flag. FIFA said that the flying speed of the ball in the air would be the fastest in the history of the world cup. AlRihla is the official ball for the 2022 Football World Cup. As the brand's strategic partner, AlRihla has entered the blockchain to further promote the development of football. With the theme of \"One step AlRihla, the heart has a football dream\", we will build a blockchain football business. At the same time, AlRihla will carry out ecological layout in the future. AlRihla has built an efficient, open and interoperable platform to promote a vibrant new economy, serving digital assets, chain games, metaverse and many other applications, making AlRihla a world-class aggregated ecological platform and the infrastructure of the metaverse, through an open digital economy ecology, to promote the NFT revolution and form an open digital economy. AlRihla's ultimate vision is to build a decentralized virtual emotional football world where users can collaborate to create virtual worlds, engage in web emotional social networking, and have fun and games together. With the improvement of people's awareness of the scope of application and availability of blockchain technology, people have carried out the research, development and implementation of the underlying core technology of blockchain, applications on the chain and the implementation of scenarios with great enthusiasm. In particular, the rise of the concept of NFT and metaverse has given blockchain technology more possibilities for implementation.","links":"https://alrihla.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/alrihla/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9d3e24252876b5f69521f403a5d9065ccdf05466"}}}