{"name":"ETGM (Ordinals)","id":"etgm-ordinals","symbol":"etgm","description":"ETGM is a revolutionary digital currency project designed to explore new frontiers in blockchain technology. ETGM combines the warmth of a community with the mystery of outer space, aiming to create a digital ecosystem that is both friendly and filled with a spirit of exploration. Project Features: Innovative Trading Tools: We have developed a multi-chain inscription bot on Telegram, aimed at providing users with a multifunctional platform that enables inscriptions and aggregated transactions on major blockchains including Bitcoin, Ethereum, Polygon, Solana (SOL), and Cosmos (Atom). This bot is intended to be a one-stop solution for easy access and management of assets across various blockchain platforms. Community Driven: We believe in the power of community. ETGM actively promotes interaction and collaboration among community members through various interactive activities and reward mechanisms. Exploration and Discovery: ETGM encourages users to explore the limitless possibilities of the digital currency world. We regularly organize educational events and seminars to help community members stay up-to-date with the latest developments in blockchain technology. ETGM is more than just a project; it is a community that explores the future and connects the world. We invite you to join this exciting journey. Support leading blockchains such as Bitcoin, Ethereum (ETH), Binance Chain (BNB), Solana (SOL), Polygon, Avalanche (AVAX), Dogecoin (DOGE), Litecoin (LTC), Near, Cosmos (Atom), Arbitrum, etc. This wide range of blockchain support positions the bot to cover a significant portion of the cryptocurrency market. Drive Growth in Digital Assets and NFT Markets Integrate inscription technologies across different blockchains to facilitate the creation, trading, and circulation of NFTs and other digital assets, thereby propelling the overall growth of the digital asset market. Provide a Trading and Circulation Platform In addition to inscription services, offer an aggreg","links":"https://etgm.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/etgm-ordinals/logo.png","detail_platform":{"ordinals":{"decimal_place":8,"contract_address":"fc59f86c1f7ec1f320398336257233c9893ab374915f77ebfc307c6efc7ead17i0"}}}