{"name":"OAK Network","id":"oak-network","symbol":"oak","description":"OAK Network is a trailblazing layer-1 blockchain on a mission to become the 'Stripe for web3,' serving as the premier infrastructure for automated payments and decentralized finance (DeFi). What makes your project unique? With $10 million secured from two rounds of funding led by Greylock, Electric Capital, and Foundation Capital, OAK Network has not only secured a Polkadot parachain slot in Q3 2022 but has also established itself as a leader in the domain of decentralized payment automation. Leveraging strategic partnerships with Polkadot, Moonbeam, and Astar, OAK Network deploys cutting-edge cross-chain automation products specifically designed for decentralized exchanges (DEXes). History of your project. We have become a top project in the Polkadot ecosystem and are providing tier-1 parachains with automation functionalities. Below are the product integration work going in parallel. - Automation dashboard, recurring payment, live - Nova Wallet, one-click auto-restake, live in staging - Mangata.finance, LP reward auto-compound, live in staging - Astar, dApp staking auto-compound, in development - Moonbeam, stop-loss trade for EVM-compatible DEXes, in development What’s next for your project? We are in the final stages of preparing for the launch of our mainnet OAK Network as a Polkadot parachain. Additionally, we are diligently completing the development of our next significant feature: price automation. This feature will empower users to execute limit orders and automate various price-triggered tasks on decentralized exchanges (DEXes). What can your token be used for? The OAK token serves a versatile purpose within the network. It can be utilized to cover automation fees, protocol-related gas fees, participate in on-chain governance voting, and generate staking rewards by actively securing the network as either a collator or a delegator","links":"https://t.co/fVbkPt7RNV","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/oak-network/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}