{"name":"EarnGuild","id":"earnguild","symbol":"earn","description":"\"Earn Guild is a guild for play-to-earn gamers on the blockchain. As a guild, it supports play-to-earn players so that they can earn more. Earn Guild provides a marketplace for the sale and rental of play-to-earn NFTs; coaching for new players; exchange for games tokens; fiat gateways, with an Earn Guild Mastercard; and credit scores for players. Earn Guild maximizes profits across various P2E games in the metaverse. Earn Guild is a platform designed for P2E or blockchain gamers. It aims to be the first all-in-one-place platform that caters to the needs of players by offering them the opportunity to acquire or rent NFTs for different P2E games. It means that players can participate in most blockchain games and increase their income by simply purchasing or renting the NFT required to participate in such games. With an NFT marketplace, Earn Guild lowers the barrier of entry to most blockchain games in a simplistic yet innovative way. By purchasing or renting NFTs, players can gain access to these games conveniently even when the required capital to get started isn't available. You can find most games NFTs on the marketplace. Interestingly, you can decide to sell your NFT or rent it out to desperate players on the same marketplace. According to the developers, Earn Guild will have its P2E NFTs soon. The Earn Guild Exchange is also available, where players can trade and stake their P2E tokens. This unique mechanism enables players to convert their game tokens into $EARN, which can be used to purchase or rent NFTs, convert to fiat, pay for coaching services, etc. Speaking of coaching services, the platform features a coaching system that allows experienced players to monetize their skills and knowledge. These players' turn coaches provide guidance to young and talented gamers. Earn Guild gamers lacking the exposure or looking to enhance their skills can hire a coach of their choice. The appeal of Earn Guild, both to users and to investors, has been its ability to tap into a growing genre of games and solve common user problems. While the idea of playing games and earning a monetary reward from them is attractive, most players have to first buy an NFT in their desired game to get started. This is typically a fairly costly process and for those who can afford it, there are limited options for actually spending their rewards afterwards. After all, few places take NFTs as a form of payment. However, Earn Guild is addressing both of these issues with its features. First, it gives free NFTs to users that want to enjoy P2E games to save them from having to buy the often-expensive NFTs by themselves. This makes it easier for more people to get into P2E games. Earn Guild also offers several options for converting winnings into spendable currency. These include multi-currency accounts, crypto wallets, bank transfers, and its new Earn Guild branded Mastercard that allow users to spend their winnings anywhere in the world. \"","links":"https://www.earnguild.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/earnguild/logo.png"}