{"name":"FairERC20","id":"fairerc20_ethereum","symbol":"ferc","description":"What is the project about? FERC20 is essentially based on the ERC20 standard. It combines the decentralized issuance method of BRC20 and the programmability of ERC20 smart contracts to create a new set of token protocol standards to make token issuance on Ethereum more fair. What makes your project unique? It combines the decentralized issuance method of BRC20 and the programmability of ERC20 smart contracts to create a new set of token protocol standards to make token issuance on Ethereum more fair. History of your project. FERC20 is based on the ERC20 standard protocol, so it has features that BRC20 does not have, including but not limited to: It is convenient to transfer money in wallets familiar to the public, without downloading new wallet software; It can be used in Ethereum's powerful DEFI ecosystem, including DEX, lending, multi-signature, etc.; FERC20 tokens have no owner authority, that is, no owner tokens; Tick characters can be upgraded; There is no pre-mining, the total amount of tokens is mined from zero until the hardcap is reached; Highly decentralized, the system architecture is serverless, including search, search and other functions, all carried out in smart contracts; Users interact directly with the contract. What’s next for your project? However, FERC20 is implemented on Ethereum after all, and it still needs to prevent Sybil attacks and smart contract robots. Therefore, the protocol adds three sets of attributes based on the ERC20 standard contract: Freeze period: When the user mints coins for the first time, he will enter the freezing period. If he wants to continue minting coins during the freezing period, he needs to pay a tip to the platform. For every additional coin, the tip is doubled. For example: 0.00025 ETH will be paid for the first coin minting during the freezing period, 0.0005 ETH will be paid for the second time, and 0.001 ETH will be paid for the third time... It should be noted What can your token be used for?","links":"https://www.erc20.cash/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fairerc20_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2ecba91da63c29ea80fbe7b52632ca2d1f8e5be0","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2ecba91da63c29ea80fbe7b52632ca2d1f8e5be0"}},"is_native":false}