{"name":"Doctor Evil","id":"doctor-evil","symbol":"evil","description":"About Doctor Evil Crypto: Doctor Evil Crypto is a revolutionary meme token aiming to redefine interactions within decentralized ecosystems. The project combines playful mischief with advanced technology to offer a unique and entertaining cryptocurrency experience. Unlike conventional tokens, Doctor Evil positions itself as an inventive force that keeps the competition in the decentralized finance (DeFi) sector alert. What is the project about? Doctor Evil Crypto seeks to inject a degree of playfulness into the financial landscape by merging the concept of memes with cryptocurrency. The token intends to empower users to embrace their mischievous side and engage in an exciting adventure within the dark side of DeFi. What makes your project unique? Doctor Evil Crypto distinguishes itself through its fusion of fun and cutting-edge technology. The token is designed for those who wish to break away from the mundane and explore a thrilling cryptocurrency experience. It's not just a token; it's a movement to disrupt the meme economy and add a dash of mischief to finance. History of your project: Doctor Evil Crypto is a fairly new project; more detailed historical information isn’t provided. What’s next for your project? Doctor Evil has several plans including the launch of super rare DOCTOR EVIL NFTs, an augmented reality game, single-sided staking for loyal holders, a decentralized exchange (EVIL DEX) with low swap fees, and an optimized over-the-counter (OTC) desk for private trades. What can your token be used for? (Utility, NOT tokenomics) Doctor Evil tokens can be used to participate in exclusive NFT launches, play augmented reality games, engage in single-sided staking to earn passive rewards, trade on the EVIL DEX with low fees, and conduct private trades through an optimized OTC desk.","links":"http://doctorevil.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doctor-evil/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcf9560b9e952b195d408be966e4f6cf4ab8206e5","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xcf9560b9e952b195d408be966e4f6cf4ab8206e5"}}}