{"name":"Overnight.fi USD+ (Base)","id":"overnight-fi-usd-base_base","symbol":"usd+","description":"USD+ is a stablecoin fully collateralized by USDC, DAI, and USDT, providing 8-12% APY with daily payouts on Arbitrum, Base, Optimism, and other networks. Purpose: USD+ is designed to offer a stable value pegged to the US dollar, making it ideal for mitigating cryptocurrency volatility. Key Features: Transparency and Security: Daily attestations of reserves by independent third parties ensure trust and reliability. Multi-Chain Support: Available on Artbitrum, Base, Optimism, Linea, Blast, zkSync providing easy access across different blockchain ecosystems. Yield Generation: Offers returns on holdings through a yield-generating feature backed by a portfolio of stablecoins. Utility: Global Payments: Enables efficient, low-cost transactions for businesses and individuals. Market Adoption: Significant circulating supply and daily trading volume demonstrate robust adoption and liquidity. Rebase Mechanism: Rebase Token: USD+ is an ERC20 token, fully collateralized with assets convertible into USDC, with daily rebasing for profit payouts. Profit and Loss: Positive rebase when collateral value exceeds 100% and negative rebase when it falls below 100%. Pegging Mechanism: 'NAV of 1' Policy: Ensures market value of assets equals the amount of USD+ in circulation. Conservative Risk Management: Diversified portfolio of conservative DeFi investments. Daily Profit Distribution: Yield distributed to holders by increasing wallet balances daily. Liquidity Index: Reflects the ratio of issued USD+ tokens to asset volume in strategies. USD+ combines stability, utility, security, and yield generation, making it a noteworthy digital currency. Thorough research is essential to understand the associated risks and benefits.","links":"https://overnight.fi/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/overnight-fi-usd-base/logo.png","detail_platform":{"base":{"decimal_place":6,"contract_address":"0xb79dd08ea68a908a97220c76d19a6aa9cbde4376","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xb79dd08ea68a908a97220c76d19a6aa9cbde4376"}},"is_native":false}