{"name":"Wrapped MOXY","id":"wrapped-moxy","symbol":"wmoxy","description":"Moxy has created the first industry standard protocol enabling video game developers to implement eSports gameplay into new and existing games. ESports gameplay is a game mode that requires an entry fee by players, entry fees create a rewards pool, and winners realize the rewards pool at the conclusion of the game. This type of game play made available “on-demand” natively within a game is defined as eSports game play, as it allows players to compete for real rewards without relying on an organized event and or venue. Currently there is no solution video game developers can utilize to enable them to implement eSports game modes. Moxy is the first solution that can be used industry wide as an “out of the box” solution. Implementation is plug & play, format is open sandbox, the developer is in complete control on how they present eSports game modes along with reward distribution to winners. Moxy is platform agnostic (PC, Console and Mobile games) and no web3 elements need to be adopted by the game developer. Over half a billion gamers watch eSports. However, despite the massive popularity, the 99% of gamers that are not professional players do not have the ability to compete in “on-demand” eSports game modes in their favorite games. Moxy now gives them that ability. Gamers can join the Moxy Platform, acquire a game via the Moxy game store or on other platforms, such as Epic, if the game they are looking for is published with the Moxy enhanced gameplay there. MOXY token is simply a single point of value for gamers around the world to use to engage in eSports gameplay. Players can compete in eSports game modes with the MOXY token, which gives them the ability to define the value they are competing for regardless of the FIAT currency their country utilizes. MOXY token also enables trustless transactions based on programmatic distribution determined by validated game results at the conclusion of each game. The Moxy Platform also provides players with a unified digital wal","links":"https://moxy.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-moxy/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x695afdb42edff97af470a15920a66df81a234c0e"}}}