{"name":"Equilibre","id":"equilibre","symbol":"vara","description":"Équilibre is an ve(3,3) AMM (Automatic Market Maker) designed to provide large liquidity & low swapping fees. Equilibre has added a number of improvements to its protocol to create a more secure and comprehensive application environment: Improvements over Velodrome v1 1. Internal bribes contract has been modified to achieve the following two improvements. 1.1.No double claim of trading fees in the same epoch. 1.2. Errors related to the difference of decimals in tokens when claiming rewards have been fixed. 2. UI simplified on platform to provide users a more direct and simple interaction. 3.API and UX optimization 3.1. Impossibility of errors between volatility and stability when creating an LP. 3.2. No attachment between your veNFT and liquidity. 3.3.Simplification of processes when releasing your veNFT. 3.4 Other small ones such as routing optimization (support of tax tokens). Lighter and simplified documentation to reduce the learning curve and allow new users to understand the ve(3.3) model and app flow. Which tokens has equilibre? Équilibre Finance uses two tokens to manage its utility and governance: $VARA — ERC-20 utility token of the protocol $veVARA — ERC-721 governance token in the form of an NFT (non-fungible token) How you can use our platform? 1. Stake in any LP to earn VARA emissions. 2. Lock VARA to get veVARA 3. Use veVARA to vote for gauges and govern over the VARA emissions distribution. 4. Claim all your rewards: 4.1 Emissions = Protocol's emissions assigned to every LP based on the total votes received during the previous epoch. 4.2 Rebase = A way to prevent the dilution of the voting power over time. The more people there are locking VARA, the more rebase you will receive. 4.3 Bribes = Additional incentives / voting rewards offered to attract voters. 4.4 Trading Fees = Trading fees from the swap transactions related to the LPs you have voted for.","links":"https://equilibrefinance.com/swap","market_cap":3521.99,"market_cap_rank":5071,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/equilibre/logo.png","detail_platform":{"kava":{"decimal_place":18,"contract_address":"0xe1da44c0da55b075ae8e2e4b6986adc76ac77d73"}}}