{"name":"DIGIVERSE","id":"digiverse-2","symbol":"digi","description":"Digiverse is the world's first and only digital metaverse that creates the perception of virtual reality. It is the single most successful and patented example of instantiating Metaverse environments. Digiverse is an innovative blockchain project that merges virtual and real world, implementing it into the physical world securely and expeditiously. It is not just a concept; it's a reality, occupying 5000 square meters in the Land of Legends and commended by world-renowned figures after their visits. At its core, Digiverse is composed of several main components, including a Metaverse, Digital Identity, Crypto Exchange (Centralised), and DigiTravel. It complements these main components with supporting features such as an NFT Marketplace, Digital NFT Auctions, a Project Incubator, Launchpad, Staking capabilities and a Decentralized Crypto Exchange (DEX). Digiverse's Metaverse is a platform that provides immersive experiences to people through diverse regions, each with unique stories and scenarios. It allows individuals to engage with digital art using all of their senses. Its Digital Identity offers a secure and trustworthy system for digital interactions. The in-built Crypto Exchange provides a venue for swift and safe digital asset trading. DigiTravel integrates traveling experiences within the Metaverse, creating a new realm of tourism. In addition to these, Digiverse develops software products with cutting-edge technologies such as AR, VR, hologram technology, and crypto asset exchange platforms, maintaining company's values like continuous innovation, excellence, and ethical business practices. In short, Digiverse aims to advance the blockchain technology by integrating real-world and virtual phenomena, driven by a commitment to technological innovation, customer satisfaction, and enduring business relationships.","links":"https://digiversecrypto.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/digiverse-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7ec0da57eba5398470c6bcb5518406d885240c85","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x7ec0da57eba5398470c6bcb5518406d885240c85"}}}