{"name":"RouletteBot","id":"roulettebot","symbol":"roulettebo","description":"What is the project about? Roulette Bot welcomes you to an innovative and exhilarating experience in the world of online gaming. Powered by cutting-edge technology and designed for seamless interaction, Roulette Bot brings the excitement of a virtual roulette wheel directly to our Telegram group. What makes your project unique? Engage in the thrill of simultaneous betting with fellow participants, as you place your bets on the digital roulette table. The /begin command marks the commencement of an electrifying round, where every participant's intuition and strategy are put to the test. Navigate the game effortlessly with the /bet command, where you have a range of options at your fingertips. Choose from classic colors such as Black, Red, and the high-stakes Green, each offering its own unique multiplier. Bet on number ranges like Low (1-18) or High (19-36), or test your luck with Even or Odd selections. Feeling daring? Go all in with individual number bets, including the elusive 0. History of your project. As the betting window closes, anticipation heightens. Will your choices align with the spinning wheel's verdict? In an exhilarating animated video, the result of the roulette wheel unfolds before your eyes. Winners emerge, payouts are distributed, and the excitement of victory fills the virtual air. Participate without the hassle of multiple platforms or complex procedures. Roulette Bot operates on the Telegram platform, streamlining your journey into the world of online roulette. No intermediaries, no delays. Just instant and secure transactions that put you in control of your gaming experience. What’s next for your project? Embrace the future of online gaming. Welcome to Roulette Bot, where thrilling bets and captivating spins await. Your journey into the world of virtual roulette starts here. What can your token be used for? Telegram Bot","links":"https://roulettebot.app/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/roulettebot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x0c29ff5e5f27ed032eab2a97aa489e9c6da5a4a8"}}}