{"name":"2049","id":"2049","symbol":"2049","description":"What is the project about? TOKEN2049 is the premier crypto event, organised annually in Singapore, where founders and executives of the leading Web3 companies and projects share their view on the industry. We shine a light on the global developments, while taking a unique and widening perspective on the ecosystem and its vast opportunities. ​What makes your project unique? TOKEN2049 brings together the global crypto industry, uniting entrepreneurs, investors, developers, industry enthusiasts and global media - and creates unparalleled networking opportunities. This is the community that will define what’s next in the space. History of your project. TOKEN2049 is the premier crypto event, organised annually in Singapore, where founders and executives of the leading Web3 companies and projects share their view on the industry. We shine a light on the global developments, while taking a unique and widening perspective on the ecosystem and its vast opportunities. ​ TOKEN2049 brings together the global crypto industry, uniting entrepreneurs, investors, developers, industry enthusiasts and global media - and creates unparalleled networking opportunities. This is the community that will define what’s next in the space. What’s next for your project? Mission More people will know about the $2049 token through different marketing. Vision Allowing every investor to enjoy after-tax income. 2049 provides a gateway for a bigger and more innovative financial sector with full and equitable, and non-concentrated reserve of wealth. What can your token be used for? Integrate the 2049 Wallet and allow your players to experience cutting edge blockchain features right within the game. With these features built into our games platform for iOS, Android, and Unity, you can be in-market with playable NFT 's and tokens in just a few days. Best of all, player on-boarding and compliance is entirely handled by 2049, allowing you to focus on building a great game experience!","links":"http://www.token2049.vip","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/2049/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x33e0b24aaea62500ca79d33e26efe576bbf5bacf"}}}