{"name":"Mantle Restaked ETH","id":"mantle-restaked-eth","symbol":"cmeth","description":"Deployed on Ethereum layer 1 (L1) and governed by Mantle, mETH Protocol has, since late 2023, been providing users with access to $mETH, a value-accumulating receipt token that is highly composable across a range of DeFi applications on Mantle Network L2, offering exposure to additional yield-bearing opportunities. Users stake ETH with mETH Protocol and receive yield-bearing $mETH, and unstake $mETH to receive the underlying principal staked ETH and accumulated rewards. Since the inception of mETH Protocol, Mantle's mission has been to deliver the most user-friendly and rewarding $mETH experience. Thanks to ecosystem-wide adoption, $mETH users are able to trade on Mantle DEXs, earn yield by providing liquidity to $mETH liquidity pools, and generate yield within decentralized money markets. With $mETH's increasing adoption and composability within Mantle Ecosystem dApps, the protocol now ranks as the fourth largest ETH LSP by TVL. The introduction of $cmETH, a permissionless, composable liquid restaking token that unlocks restaking opportunities on Mantle, and $COOK, the protocol's upcoming governance token, mETH Protocol enters its next phase with further enhanced offerings. Through these features, mETH Protocol provides its users with capital efficiency, convenience, and a wide range of yield-bearing opportunities within Mantle Ecosystem dApps, all in a design that has been created to maximize security with non-custodial core smart contracts and off-chain services that enforce sanity bounds and risk limits.","links":"https://www.mantle.xyz/meth","market_cap":510465706,"market_cap_rank":154,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mantle-restaked-eth/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe6829d9a7ee3040e1276fa75293bde931859e8fa"},"mantle":{"decimal_place":18,"contract_address":"0xe6829d9a7ee3040e1276fa75293bde931859e8fa"}}}