{"name":"CMC Coin","id":"cmc-coin","symbol":"cmcc","description":"CMC Coin Is the brainchild Of the Crypto Marketing Company. We are a marketing focused project and are the fastest growing crypto marketing agency globally. CMCC is the native coin of Crypto Weekly Magazine with over 100,000 subscribers worldwide. Our underlying principle behind CMC coin is to build in the element of collaborative reward contribution and sharing, through redistribution of transaction fees charged on transfers of the CMC coin by its holders. It offers advertisers in Crypto Weekly Magazine and its associated media outlets, a massive 45% discount from their advertising rates if they pay in CMCC. We also have our own retail platform and integrated payment gateway utilising the Amazon network, payments can be made via CMC Coin offering a truly unique use-case, whilst creating volume and demand. In addition to our retail platform, we have developed an alt coin payment gateway which will allow retailers to be able to accept CMC Coin amongst other partner coins of our choosing. This will allow retailers to enhance and increase their retail sales by accessing an untapped marketplace. CMC Coin has unique tokenomics structure, that has been specifically designed to attract long-term holders and deter short-term pump and dump whales. We have implemented two safeguards that will not only reduce the chances of a dump, but also benefit coin holders even further if whales do decide to dump some of their coins. CMC Coin was developed with a long-term vision, with that in mind the liquidity is locked as well the founders tokens which are released over an eighteen-month period. We believe these safeguards will protect our investors and community at large. The reason why we have launched CMC Coin on the BSC smart chain, is due to the high volume and attraction of the mass investor, and we believe that it offers ease-of-access and high visibility in the crypto sphere. With that in mind, we have bridged to the KCC Network to amplify capital growth and accessibility across blockchains. The CMC team are fully doxed, unlike many projects we are real-world business, with over fifty years marketing experience, that has benefited our clients in both capital growth and community integration and membership. CMC is at the forefront of the crypto sphere, we have a firm focus and ethos on being able to make crypto available to the masses. We have a number of exciting platforms which not only educate, inspire and captivate the newcomer or seasoned investor, but also offers value for money and return on investment (ROI) for our holders. With every platform launch we expect to see growth and stability for our holders and community. The team behind CMC Coin is dedicated to achieving results for our hodlers, by being transparent in our approach so that we can attain the best possible outcome.","links":"https://cmccoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cmc-coin/logo.png"}