{"name":"Aura","id":"aura-2_base","symbol":"aura","description":"Aura is a fully decentralized marketplace engineered for AI models to be seamlessly deployed, validated, and monetized. As artificial general intelligence (AGI) advances and embeds itself deeper into digital ecosystems— particularly within Web3—Aura is pioneering a new paradigm for AI accessibility. By addressing critical inefficiencies such as fragmented model discovery, constrained monetization frameworks, and opaque model selection processes, Aura enables a frictionless AI ecosystem. Aura provides an on-chain AI infrastructure that empowers both AI model Users and Creators through a decentralized AI marketplace supporting verifiable model integrity mechanisms, and an incentive-aligned ecosystem for AI deployment. By fostering model interoperability, autonomous model-to-model collaboration, and cryptographic validation, Aura is accelerating the emergence of collective intelligence and unlocking new frontiers for decentralized AI innovation. Aura consists of two core user segments: AI Model Developers Developers can deploy their AI models on Aura’s fully decentralized marketplace, where they receive a provably fair, transparent ranking among competitors. This ecosystem allows developers to monetize their models directly, earning revenue as users explore and rent them. AI Model Users Users can seamlessly discover, rent, and utilize AI models directly from Aura, accessing cutting-edge technology while supporting developers. Additionally, users can speculate on promising models by trading their associated tokens directly on our platform, creating a dynamic market for AI innovation.","links":"http://aura.fun","market_cap":657435,"market_cap_rank":4252,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aura-2_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x4381bc7d5640bf514a508e2732ec522c650c414c","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x4381bc7d5640bf514a508e2732ec522c650c414c"}},"is_native":false}