{"name":"Game X Change Potion","id":"game-x-change-potion","symbol":"gxp","description":"Game X Change is a gaming platform where users can move assets (virtual cash and NFTs) from one platform, game or blockchain to another in a safe and controlled way. Convert and transfer in-game currencies and NFTs from one game to another! Game X Change offers rewards for playing, earning, and farming throughout the platform through its native utility token, $GXP. 2200 $GXP is required to use the services on the Game X Change platform from game currency conversion, NFT transfer and NFT staking. GXP can be paired with NFTs and staked on the Game X Change in order to receive rewards. Users are able to use $GXP to purchase common weapons in battle and earn from AAA steam gaming. $GXP can be imported into games to buy in-game upgrades and items. Players are able to interact with the Game X Change ecosystem by the following:‌ Play and Earn by transferring in-game currencies and NFT between games Import NFT purchased NFTs into integrated games to be used Convert game currencies directly to $GXP Buy NFT passes and play connected Steam games like PUBG, Rocket League, Destiny 2, CSGO, GTA V, The Witcher, Rust. Convert those achievements into $GXP and other cryptocurrencies. New games are always added! Purchase limited-time partner NFTs from the Game X Change Marketplace or buy admission passes uses $GXP. Collect Exclusive NFTs to sell in the global market. Stake $GXP and NFTs to receive from the ecosystem treasury. How it works To play games and interact with the Game X Change users are required to hold $GXP. If you do not hold $GXP you will be able to view the assets within the platform but you will not be able to play. Once holding $GXP users will have to acquire game-specific NFT admission passes or also known as Non-Fungible Passes. NFT Admission passes NFT Admission passes allow gamers the ability to play and earn. Holding a specific game admission pass makes it possible to convert the in-game currencies to $GXP and other tokens. Use NFTs to unlock play to earn and earn up to 3600% Annual Gaming Yield (AGY). Through the Game X Change marketplace, users can purchase NFT assets that can be used or integrated in connected games. GXP is earned by: Playing games through play and earn Converting in-game achievements to GXP Dismantling NFTs within the ecosystem Staking NFTs backed by GXP to earn GXP or partner tokens.","links":"https://gamexchange.app","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/game-x-change-potion/logo.png"}