{"name":"Lee","id":"lee","symbol":"lee","description":"What is the project about? LeeBet is an ultimate multi-chain gaming platform that offers a seamless and secure gaming experience to players worldwide. LeeBet operates on a decentralized platform that uses blockchain technology, which provides users with a high level of transparency and security. LeeBet is one of the most promising multi-chain i-gaming platforms that offer the best conditions for players from all over the world. What makes your project unique? Decentralized platform: LeeBet operates on a decentralized platform that uses blockchain technology, providing users with a high level of transparency and security. Multi-chain support: LeeBet supports multiple cryptocurrencies, making it easy for users to deposit and withdraw funds from the platform. Daily dividends and bonus tokens: LeeBet offers daily dividends of 4% to its users, and also has a bonus token, $LEE, that users can earn and use to play games. Play-to-mine: LeeBet has a unique \"play-to-mine\" feature where users can earn cryptocurrency by playing games on the platform. Free-to-play activities: LeeBet also offers free-to-play activities for users who don't want to gamble but still want to enjoy the platform. Original games: LeeBet offers a selection of original games that are exclusive to the platform. Provably fair: LeeBet games are provably fair, which means that users can verify the fairness of each game's outcome. Fast withdrawals and 24/7 support: LeeBet provides users with fast withdrawals and 24/7 customer support to ensure that users have a seamless gaming experience. What’s next for your project? LeeBet has big ambitions for the future, including expanding the platform, developing a new game every month, connecting games from providers, expanding the bonus and activity system, creating a multilingual website, adding support for more cryptocurrencies, implementing a voting system for $LEE token holders, introducing rankings and tournaments and adding NFTs to the platform. Learn LeeBet Ro","links":"https://leebet.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lee/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}