{"name":"SOLVE","id":"solve-care","symbol":"solve","description":"What Is Solve.Care (SOLVE)? Solve.Care is a healthcare platform company that uses blockchain to redefine care coordination, improves access to care, reduces benefit administration costs, and helps reduce fraud and waste in healthcare around the world. The Solve.Care platform allows for digital health networks, called Care Networks, to be built and run for patient-centric care based on medical conditions, economic and social needs, and other tailored eligibility criteria, creating an entire healthcare ecosystem. Using the Solve.Care platform, businesses are able to launch networked, interoperable healthcare dApps, within only weeks or even days. Care Networks on the Solve.Care platform use the SOLVE token, a utility token that is used for inter/intra network payments and transaction fees. It also has additional uses including developer rights, staking, marketplace payments, and platform access fees. Who is the Founder of Solve.Care? Pradeep Goel, the Founder and CEO of Solve.Care, has extensive expertise in healthcare, finance and technology. Prior to Solve.Care, he had been in the CEO, COO, CIO and CTO roles at various innovative technology companies over 25 years Pradeep was deeply involved in designing and building solutions for public programs such as Medicare/Medicaid, children health insurance and welfare programs, SNAP/TANF, health insurance exchanges and health information exchanges. He has worked for and with commercial insurance companies as the top technology executive, and implemented benefits administration, consumer engagement, claimed medication and payment systems. Pradeep has built 4 healthcare IT companies and has been at the top of Deloitte’s Technology Fast 500, INC500/5000 fastest growing companies lists multiple times. Pradeep was included in the 100 most promising entrepreneurs globally, complied by Goldman Sachs. What Makes Solve.Care Unique? The Solve.Care platform leverages blockchain and full stack capabilities to deliver significant business value to individuals and enterprises. These business values include ease of usage, privacy, security, control and ownership of data, interoperability, auditability, and enhanced trust between parties. Solve.Care gives healthcare stakeholders a unique opportunity to build their own dApps to form Care Networks, connecting and synchronizing their participants, making instant payments inside their network, and sharing information immediately to reduce opportunities for fraud. Solve.Care is unique because it not only allows networks to run independently, but to also have a fabric underneath that allows them to all communicate. All Care Networks are fully and intrinsically tokenized to manage events, identities, transactions, payments and data sharing using the SOLVE token, which is a combination of transaction fee payment token (like Ethereum as gas), as well as a normal payment currency. The SOLVE token also has a unique property of being able to function inside the Network, either as a variable value token or as a fixed value token (as a stable coin). This property makes it uniquely powerful and appropriate for healthcare usage. Solve.Care has built blockchain healthcare networks for the real-world clients such as Boehringer Ingelheim, Uber Health, Lyft, Aon, Arizona Care Network and others. Solve.Care is the first company in the world to successfully deploy digital currency and blockchain technology for value-based payments in US healthcare. (https://solve.foundation/press-release/solve-care-partner-acn-awarded-for-innovation/)","links":"https://tuumio.com/","market_cap":97939,"market_cap_rank":6657,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solve-care/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x446c9033e7516d820cc9a2ce2d0b7328b579406f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x446c9033e7516d820cc9a2ce2d0b7328b579406f"}}}