{"name":"SAWA Crypto","id":"sawa-crypto","symbol":"sawa","description":"The SAWA project was launched in early 2022 by an international team from Turkey, Russia, Poland, Belarus, Singapore, UAE. SAWA is a Multi-chain platform for users to invest in high-quality projects before their tokens are listed on exchanges with truly decentralized derivative tools for traders. The project already has a working product, this is SawaStarter. Gradually, SAWA will develop into an ecosystem of decentralized products based on smart contracts, which will include its own OTC solution, DEX exchange with derivatives, NFT marketplace. SAWA also launched its own utility token, which will provide token holders with early access to projects to be listed on the SawaStarter, the opportunity to participate in the distribution of platform profits among them, and guarantee the safety of OTC transactions for Purchase and Sale of equity with collateral through the SAWA token. The token will generate non-inflationary returns through staking and farming, by creating liquidity pools for DEXSAWA. Up to 50% commission income from transactions on DEXSAWA will be used for burning. All SAWA holders have the opportunity to vote and participate in the governance of the DAO platform. Another utility model where the SAWA token will be used to pay for SAWA expert access for those who want to publish and monetize their experience. At the beginning, access will be free to attract more users. The SAWA token also provides for staking, which allows platform users to increase their share in the rating system. 32% of total tokens supply is reserved for staking and farming rewards, regarding that amount is limited so when it gets over satking reward would be paid only from SAWA net income. The rates are determined by token holders voting. As voting power as well as received dividend volume depends on the quantity of SAWA tokens held by users - staking is a good chance to earn more tokens to earn more dividends and to get more votes to participate in SAWA growth and development.","links":"https://sawastarter.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sawa-crypto/logo.png"}