{"name":"TeleTreon","id":"teletreon","symbol":"ttn","description":"TeleTreon offers content creators an opportunity to create Private Communities on Telegram requiring Subscription and/or an Entry Payment utilizing Blockchain Technology. We developed another way of Earning Passive Income for content creators on the top 10 worlds biggest biggest social media platform Telegram. TeleTreon created a Patreon style model for Telegram with the help of a free-to-use Subscription bot that takes advantage of the functionalities of Telegram, which allows for owners of Private Communities to have more engagement with their community members in comparison to traditional social media outlets We created a blockchain ecosystem which will not only benefit content creators with their private communities, but also anyone who is participating in it's ecosystem. By utilizing the blockchain, we provide the opportunity to earn passive income for those who own $TTN, TeleTreon's native token, on the BNB Bep-20 network. $TTN can be used for: • Payments to enter private communities • Earning passive income • Cross border payments • Earning rewards by simply owning $TTN • Access to premium functions and statistics Users are currently able to use BNB, USDT and TTN as forms of payment to enter private communities with plans to expand to other Crypto Currency networks. TeleTreon utilizes it's token $TTN, by using 50% of the 8% service fee to buy $TTN and share with it's investors through the staking pool. The ecosystem is more user friendly with more benefits due to Telegram's overall functionalities in comparison to traditional social media platforms, which sets itself to be a competitor in this multi billion dollar subscription and social media industry.","links":"https://TeleTreon.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/teletreon/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x50a9eb8a53f2c2993f46b354bd5f24f1c880bf24"}}}