{"name":"XX Network","id":"xxcoin","symbol":"xx","description":"What is the xx network (xx)? The xx network is a “full-stack” platform which combines a native scalable, quantum-ready layer 1 blockchain with the most private communications network in the world. Invented by cryptographer David Chaum, the godfather of digital currency and privacy, the xx network’s cMix communications layer provides complete metadata protection to all network communications. Using the xxDK, any application or blockchain platform can route their traffic through the xx network and provide quantum-secure, end-to-end encryption to their own transactions. The performance of the network is demonstrated by the xx messenger which is available on major app stores and is the first quantum-secure, end-to-end encrypted messenger that is completely decentralized. The xx network utilizes nominated Proof-of-Stake (nPoS) to incentivize all coin holders to elect consensus and communication nodes and participate in governance. The xx coin is used for: * Small fees for processing transactions * Voting for validator and mix nodes on the network via staking * Used to vote for governance referendums and treasury spending What problem is the xx network trying to solve? The aim of cryptocurrencies (and blockchain more generally) is to decentralize ownership and power so that coin holders, nodes, and users have control rather than entrenched, centralized entities. The blockchain movement, to a large extent, is a populist reaction to a global history rife with exploitation of centralized control by small groups serving their own self-interest. In the modern tech world, the introduction of the high-speed, global internet has enabled email, social media, and mobile applications to transform the way we communicate and exchange value. However, mainstream companies that have become dominant during this transformation have proven unwilling or unable to protect user privacy, and instead, they have opted for maximizing profits based on advertising. xx network is implementing b","links":"https://xx.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xxcoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}