{"name":"STO Cash","id":"sto-cash","symbol":"stoc","description":"STO Cash is a relay platform that provides professional guidance and a progress system for the procedures required for WEB 3-based token issuance, ICO and STO progress. To expand the decentralized blockchain ecosystem, we plan to provide a platform where all users can issue token and conduct ICO, and update the tokenization of real assets and securities to prepare for the market. STOC tokens are used for token issuance, usage fees, and payments within the STO Cash platform. And for STO, you can purchase products from experts who comply with the laws and procedures of each country. We will continue to secure a variety of partners and users. Can issue tokens based on Ethereum, Polygon, and Binance. Simply select the desired token network chain and enter the token name, token symbol, and total issuance amount. Can make multi-transfers by entering the wallet address and amount to be transferred, then selecting the chain and paying the fee in STOC. Can share project information with users by registering an ICO project. And can apply for official listing on another exchange by filling out the listing application form. In the next update, legal evaluation and asset evaluation can be carried out through partners, allowing STO to be carried out on existing platforms, supplying STO projects to exchanges and existing STO platforms Supplier role is possible. We want everyone to issue tokens together and expand the ecosystem. Take advantage of the token issuance function. And try holding an event using the multi-send function. We believe that individuals, influencers, and businesses will use their tokens to connect with the world and that their actions will have a greater impact. Let’s create a blockchain ecosystem with us.","links":"https://www.stocash.io","market_cap":79227,"market_cap_rank":6330,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sto-cash/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x85c6c4e3ff977ce05de71103fb74ad4467cac5ef"}}}