{"name":"The Big Five","id":"the-big-five","symbol":"bft","description":"Africa has always lagged in technological innovation; mostly African people have been reduced to become consumers of the end products of technology. Nzvedaz Big Five Project aims to change that narrative by bringing the benefits of blockchain to Africa. Our project is building Africa’s first NFT Marketplace. We will be introducing African artists to NFT technology that ensures issues such as ownership, royalties are guaranteed by use of smart contracts to enforce such rights. It also opens a wider market, rather than being confined to the pittance of tourist traffic. Our metaverse will mirror Africa’s richness in diversity, natural resources as well as the flora and fauna. You will be able to climb virtual Kilimanjaro, own vast of lands where value in terms natural resources can be extracted. BFT BFT is a deflationary currency, it has now a total supply of 97 billion tokens. With our commitment to burn 1% of the total supply each month we will have reduced the token supply by 8% by the end of the calendar year. And 25% by end of year two. $BFT is the ticker for the native currency that will be used in our ecosystem. It will be the currency that will be used to list NFTs on our marketplace. It will be the currency which will be used to pay final value fees when a seller sells their NFT. It will be the currency that will be used to interact in our first African metaverse. It will be the currency of use in our Play to earn games and as adoption by business expands it will become the transactional digital currency powering web-3 based commerce. Value An early investor who buys and holds $BFT will stand to gain as the value of BFT increases with each use-case. Every planned project will create a buying pressure on BFT. Giving early investors and adopters an opportunity to realise gains over their BFT Holding. As widespread adoption kicks in the value will soar. There are plans to expand its uses to solve issues such as expensive insurance by introducing fractional","links":"https://nzvedazbigfive.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-big-five/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x4b87f578d6fabf381f43bd2197fbb2a877da6ef8"}}}