{"name":"Gamex Coin","id":"gamex-coin","symbol":"gxc","description":"Game X is a decentralized web3 game ecosystem and incubation platform initiated and supported by a decentralized autonomous organization (DAO), dedicated to facilitating the transition of traditional games to web3 and building a player-driven, transparent, and efficient web3 game industry chain. Game X's chain abstraction technology addresses the fragmentation and segregation of Web3 gaming assets, enabling casual players to easily participate in Web3 games and earn rewards, ultimately serving as a gateway to the Web3 gaming world. Game X is committed to addressing the core pain points of the gaming industry by delivering the following key values: 1.Asset Ownership: Empowering players with true digital asset ownership, ensuring that in-game items, characters, and other assets are transferable, tradable, and usable across different games. 2.New Economic Model: Leveraging blockchain technology to optimize the gaming economic system, making transactions more transparent and efficient, while reducing the commission taken by centralized platforms. 3.Player-Driven Development and Governance: Establishing a decentralized governance system to amplify the voice of players in game development, operation, and decision-making processes. 4.Transparency and Trust: Utilizing the verifiability of blockchain to ensure the transparency of game rules, fairness, and economic systems, thereby preventing \"under-the-table operations.\" Game X adopts a progressive evolutionary development path, divided into two main phases： Game X 1.0：Supporting the integration of traditional gaming assets onto the blockchain, providing foundational infrastructure for blockchain-based games, and building the early-stage ecosystem. Game X 2.0：Launching a dedicated Layer 2 public chain (X Chain) to achieve a more comprehensive blockchain gaming ecosystem and propel the advancement of decentralized gaming.","links":"http://www.gamex.life","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gamex-coin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x75c551ade6762b5ad4ebd50dca4238c9de4d357d","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x75c551ade6762b5ad4ebd50dca4238c9de4d357d"}}}