{"name":"BabyAMA","id":"babyama","symbol":"bama","description":"What is the project about? Mrweb Finance provides financial solutions to companies and individuals by developing secure and encrypted decentralized financial systems via blockchain technology. Mrweb Finance evolved to be the ultimate solution for electronic payment transactions. We have developed solutions for electronic payment systems that use the technology of encrypted digital currencies, Blockchain, in the most efficient, secure, and reasonable time frame possible. We aim to solve most of the issues that crypto professionals face by developing a smart application \" smart wallet \" that operates on the Binance Smart Chain, Ethereum, and the Tron network. MrwebFi's system allows you to manage your money online. We developed a cutting-edge system that provides new decentralized financial investing technologies. What makes your project unique? We have put in place comprehensive measures to tackle the above issues that crypto enthusiasts face. Security: We have developed a Cold Wallet for all AMA wallet users for free through a special card to protect the investors' funds from hacking. Our technology will prevent users' wallets from being controlled remotely. This gives access to only the wallet owner. On-Ramp and Off-Ramp: Our wallet card is the first of its kind, allowing users to safely store cryptocurrency while also using Mastercard features on the same device. Through our P2P Market, users will be able to buy crypto with fiat and sell their crypto for fiat. Users will be able to withdraw their cryptocurrencies through ATMs worldwide. Online payment: Through our one-time debit card, users will be able to pay for online products and services. Complex investment structure and poor user experience: We have easily made investments in the crypto industry. Our easy-to-join Defi staking programs offer one of the best APYs in the Decentralized Financial ecosystem. High tra Secure Storage Keeping your money safe is critical. AMA Wallet makes it possible for you. It all","links":"https://mrweb.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/babyama/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x8b025f2dad998c2983cc1bf23d5ebe65124f0fe1"}}}