{"name":"Private Aviation Finance Token","id":"private-aviation-finance-token_solana","symbol":"cino","description":"The CINO token (contract address: BUUB7DpQT1mcTrs55oXawgEbxm5khAozsbmyhMdRpump) is a Solana-based cryptocurrency launched via the pump.fun platform on March 20, 2025. It is positioned as the \"Private Aviation Finance Token,\" intended for use within the private aviation industry. The token was created by Ryan Cino, a corporate aircraft mechanic with 25 years of experience, who serves as its founder and promotes it through social media channels like X (@cinotoken , with over 52,000 followers) and a dedicated website (cinotoken.com).Purpose: CINO aims to function as a financial tool specifically for private aviation operators and maintenance, repair, and overhaul (MRO) providers. It seeks to address industry needs by providing a digital reserve of value and a payment mechanism for services, potentially streamlining transactions in a sector often burdened by high costs and traditional payment inefficiencies. Function: As a standard SPL token on Solana, CINO operates on a decentralized blockchain, enabling peer-to-peer transfers without intermediaries. It is traded on decentralized exchanges like PumpSwap and can be held in wallets such as Phantom as well as Coinstore.The token's supply is fixed at 1 billion units, with no minting authority, blacklist features, or burnt tokens noted in security scans. Current market data (as of August 8, 2025) shows a price around $0.04 USD, a market cap of approximately $40-50 million, and liquidity pools on Solana DEXs.","links":"https://www.cinotoken.com/","market_cap":3111235,"market_cap_rank":2508,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/private-aviation-finance-token_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"BUUB7DpQT1mcTrs55oXawgEbxm5khAozsbmyhMdRpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/BUUB7DpQT1mcTrs55oXawgEbxm5khAozsbmyhMdRpump"}},"is_native":false}