{"name":"ThingsGo.Online","id":"thingsgo-online","symbol":"tgo","description":"Launched on Oct 2021 by a partnership of Brazilian Tech Companies and the IFGICT (ifgict.org), ThingsGo.Online (TGO) mission is to “Create Internet Value for Sustainable Projects and Attitudes”. Its goal is to become the main global, decentralized rewards ecosystem for sustainable attitudes and projects, bringing innovation to the traditional environment impact mitigation market, such as carbon credits and carbon markets. Its vision is to engage and make it easy for every person and every size company to account for and to mitigate their environmental and social footprint, by running, working on, or supporting sustainable projects and attitudes. Let’s improve the way the world supports, engages and promote the growth of sustainability.. TGO bases its economy on the measurement of real conservative quantities related to Sustainable Projects and Attitudes. Those measurements are tokenized and registered on the XRP Ledger blockchain as specific device-tokens, which in turn, are swapped by TGO utility/reward tokens that can be negotiated in the DEX and CEX where they are available for trading. TGO is a utility/reward token whose worth is backed by the wealth from the companies and people, who buy TGO and return it to TGO’s distribution account address, in order to receive the GIVEBACK blockchain certificate. That is what we call: the TGO circular economy. The more circulation the more TGO will be worth. Giveback™ is a concept and a tool by which individuals or companies may retribute, or giveback, their social and/or environmental footprint to the society. In the TGO ecosystem this concept is materialized as a certificate and a non-fungible token (NFT), providing a way to certify the financial support of individuals or companies to sustainable projects/attitudes. Giveback™ is a Trade Mark of Biotecam, one of the partner companies of TGO. By using authenticated physical measurement associated with independent certification, TGO avoids Greenwashing, being therefore an e","links":"https://thingsgo.online/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/thingsgo-online/logo.png","detail_platform":{"xrp":{"decimal_place":15,"contract_address":"rTGoNeK6vpu28U2oE5tiqhH3x8z2jBhxv"}}}