{"name":"New Order","id":"new-order_avalanche","symbol":"newo","description":"New Order was created with a goal to build a self-governing incubator positioned to assist DeFi innovation, through promoting new asset classes, chain independence and machine learning. Our community includes some of the most accomplished and respected DeFi and Web3 professionals and projects. We believe that the immense opportunities of decentralized finance can only be rendered through embracing collaboration, non-segregation and multi-chain at its base. Web3, as compared to the legacy internet of the present, is best utilized through collaboration and communal contribution as opposed to the oligopolistic domination witnessed today. This vision has yet to be widely developed in the blockchain space, and thus is largely bottlenecked by the lack of interoperability, and this is exactly why we are introducing New Order. New Order is an Ecosystem DAO that is built to operate as a launchpad for the most innovative Web3 financial products, tools and applications that contribute to the vision of creating a fully composable financial ecosystem embracing multi-chain DeFi at its core. The DAO will support early stage projects aligned with its vision of being chain-agnostic, focused on a plethora of innovative new-age asset classes including data-driven tokens, NFT's and more. The primary goal is to create an ecosystem that is not bottlenecked by limiting interoperability and allow liquidity to freely enter markets and foster growth in the biggest financial ecosystem in DeFi.","links":"https://www.neworder.network/","market_cap":230235,"market_cap_rank":5691,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/new-order/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x4bfc90322dd638f81f034517359bd447f8e0235a","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0x4bfc90322dd638f81f034517359bd447f8e0235a"}},"is_native":false}