{"name":"Coin of the champions","id":"coin-of-the-champions","symbol":"coc","description":"\"Based in Italy and launched in july 2021, COC token was created to link blockchain and sport industry. The token has been deployed on the Binance Smart Chain network and it is already listed on Pancakeswap. The project aims to create a collectible NFT card game based on sports. In addition to the NFT launch and NFT game dApp, staking and farming functionalities will always be released on the same dApp. COC brand would like to spread the values and the features that distinguish the brand and differentiate it from competitors. Sharing, community building, famous sports testimonials and the chance of saving: these are the concepts conveyed through the structure of the brand. COC will operate in a decentralized economical environment in which goods and services can be exchanged. This environment is guaranteed by the features of blockchain technology, in which COC will represent the coin that will be used daily, based on needs. COC token will be exchangeable with a stable coin so that merchants can easily accept it as a payment method. The tokens are named COC (Coin of champions) and they are utility tokens, they will be issued in a quantity of 1 trillion. Users can use the distributed COCs to pay or purchase goods and services or may be used to buy the historical NFT cards defined as “i continuare”. The users that will embrace COC system can use the COC tokens and exchange them with the future stable currency that will be created at the internal value of 1€. COC will also develop a DAPP to launch NFT Token concerning the historical athletes NFT cards \"\"i continuare\"\". The aim is to create a specific market for all our famous sport testimonials in order to bring fans and followers closer to their favorite footballers by offering the chance to purchase unique digital cards in the form of NFT Token in blockchain. This market is increasingly growing and the platforms related to NFTs are spreading fast. Furthermore, COC will also donate part of the supply to ONLUS organizations. Another part of the supply will be given to non-professional football teams, as a support to sport activities and to encourage sport growth. \"","links":"https://coinofchampions.com/","market_cap":30167,"market_cap_rank":5489,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coin-of-the-champions/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbdc3b3639f7aa19e623a4d603a3fb7ab20115a91"},"ethereum":{"decimal_place":18,"contract_address":"0xc4bb7277a74678f053259cb1f96140347efbfd46"}}}