{"name":"ShopNEXT Reward Token","id":"shopnext-reward-token","symbol":"ste","description":"ShopNEXT is a Web3 Loyalty Platform powered by Visa and BNB Chain. We utilize card payment, NFT, and gamification to invent the Shop-To-Earn model. ShopNEXT allows users to earn token rewards from daily shopping while helping merchants grow their businesses. ShopNEXT token is one kind of loyalty point, but the difference is that it is developed on blockchain and exchangeable. Users can make money from selling the token on cryptocurrency exchanges. That’s how Shop-To-Earn works! How are we different? - Our business can contribute real value to the economy by boosting consumer spending and help merchants grow their businesses. - A sustainable business model. Besides in-app gameplay, ShopNEXT can also earn revenue through external sources (merchants and card issuers) which help us sustain and grow even without new users. - We've launched External Profit Reserve (EPR) to back all STE tokens issued on the market to make sure every STE has an intrinsic value that is generated by our users through their shopping. How to get started? ShopNEXT wants to reward users with tokens on every transaction made through our ecosystem. We believe that this rewarding is the best way to boost customer spending and also improve their motivation to onboard the Web3 world. - Step 1: Download the ShopNEXT app - Step 2: Signup for a ShopNEXT account - Step 3: Link VISA Cards to the app - Step 4: Upgrade MOON membership - Step 5: Collect NFT Cards to increase earnings - Step 6: Improve NFT Card attributes - Step 7: Accumulate STE to redeem NFT card cases That is it! You are all-set and welcome to the world of Web3!","links":"https://shopnext.io/","market_cap":1182.1,"market_cap_rank":4395,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shopnext-reward-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x36530092b1413c21ab7e5203197cf76d4d598888"}}}