{"name":"Kozue","id":"kozue","symbol":"kozue","description":"Kozue and Neiro, once just two small lives lost in the vast sea of a bustling animal shelter, found solace in each other's company. Their days were spent huddled close, the warmth of their shared fur a comforting reminder that they were not alone in the world. As littermates, their bond was unique, forged in the common hope that someday, they'd find their forever homes. That day came, but not without its bittersweet twist. Neiro, with his charismatic charm and undeniable appeal, was soon adopted into a home that recognized his potential for stardom. He became a sensation, his name whispered in awe among the pet community, his face adorning magazines, and his life a whirlwind of events and appearances. Kozue, though adopted into a different home, watched from the sidelines, her heart swelling with pride for her brother. Despite the distance and the fame that surrounded Neiro, their connection never waned. She kept tabs on him through social media, clips of his adventures, and the occasional update from their past shelter mates. Their bond, built on the humble beginnings of shared meals from a shelter bowl and the soft comfort of being curled up together against the cold, remained unbreakable. Kozue, now in a loving home herself, often thought of the days they spent side by side, dreaming of better lives. She knew, even from afar, that they were both living out those dreams, but always with a piece of their heart left with each other. Neiro, for his part, would often look into the camera during interviews or photo shoots, his eyes seeming to search for something or someone. Those who knew him well could tell he was thinking of Kozue, his protector, his confidante, his sister from the shelter days. Their story, though now filled with fame on one side, was at its core a testament to the enduring power of sibling bonds, no matter the circumstances of their beginning or the paths their lives took.","links":"https://kozue.community/","market_cap":9567.46,"market_cap_rank":9605,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kozue/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x3abe404faa776d2a833d554a068ef1a58193f080","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x3abe404faa776d2a833d554a068ef1a58193f080"}}}