{"name":"Sable","id":"sable","symbol":"sable","description":"What is the project about? Sable Finance is the #1 reformative primitive for ETH LSD-backed stablecoin on Arbitrum and BNB Chain. Our codebase enables capital efficiency and yield maximization for USDS users, whilst eliminating the liquidity cost of protocol emission to achieve frugal use of capital. What makes your project unique? Sable Finance is pioneering to give the first ever decentralized stablecoin, USDS, which accepts LSD as collateral on the BNB chain (and Arbitrum when v2 is launched). The design of our protocol is based on Liquity’s codebase, with innovative changes, such as a shared stability pool for liquidations, a multi-collateral design, governance token staking improvements and more. As the embodiment of stability and resilience, Sablecoin (USDS) emerges as the premier stablecoin free from interest rate, censorship, and custodianship. History of your project. It was first introduced to the BNB chain on March 21, marking the beginning of our journey. And our testnet went live on June 16, showcasing its potential and functionality. What’s next for your project? The beta version will be launched soon, offering essential functions of $USDS with BNB as the only accepted collateral. Users can mint the our stablecoin and enjoy features like collateral deposit, liquidation, and redemption. Following that, V2 will bring upgraded designs, higher yield optimization, and a user-friendly interface. V2 will be launched on Arbitrum and BNB Chain, using LSDfi as multi-collateral to meet market needs. What can your token be used for? $SABLE token captures system-generated borrowing and redemption fees through staking. Token holders provide liquidity to the SABLE/BNB pool on a DEX and stake LP tokens in our contract, earning LP trading fees along with borrowing and redemption fees. With the launch of v2, governance will be introduced, allowing $SABLE holders to vote on matters like collateral whitelisting, emissions direction, and parameter changes.","links":"https://sable.finance/","market_cap":138872,"market_cap_rank":4695,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sable/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1ee098cbaf1f846d5df1993f7e2d10afb35a878d"}}}