{"name":"Copycat DAO","id":"copycat-dao","symbol":"ccd","description":"Copycat DAO is a community-driven social trading DAO that leverages the experience and expertise of successful traders and AI technology to generate revenue for its members through copy trading investments. The DAO employs both external and internal community-vetted master traders to execute trades on both centralized exchanges and decentralized protocols. To fund the DAO, a 5% tax is applied to every buy and sell transaction involving $CCD and ETH tokens. The tax is sent to the Copycat DAO treasury, which strategically allocates the funds to copy the trades of master traders. The resulting ROI is used to buy back and burn DAO tokens or provide liquidity. Copycat DAO aims to provide a platform for investors of all levels of experience to benefit from copy trading investments with reduced risk. The DAO prioritizes transparency and accountability and rewards community members based on merit rather than financial contributions. The platform also provides a range of tools and resources, including analytics and market analysis tools, to aid members in making informed trading strategy decisions. The team behind Copycat DAO has extensive experience in the cryptocurrency industry and aims to establish partnerships with leading cryptocurrency exchanges, social trading communities, and service providers related to social and copy trading. This ensures that members have access to the latest tools and resources for successful copy trading investments. Overall, Copycat DAO represents an innovative and equitable approach to social and copy trading investment. It combines the best aspects of social trading, AI, and blockchain technology to create a promising investment platform for its members.","links":"https://www.copycatdao.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/copycat-dao/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd8684adc4664bc2a0c78ddc8657dc005e804af15"}}}