{"name":"Setter Protocol","id":"setter-protocol","symbol":"set","description":"The setter Finance protocol will be a game changing platform in the web3 space as it will offer different stances of products which will clearly define the Web3 concepts and the DeFi analogy. Some of this products will include: GameFi: The Setter Finance protocol will invest and support GameFi projects and, with its outstanding games which would be launched on its platform ready to take over the GameFi industry, the Setter Finance team are well positioned to live beyond the current GameFi hype to build credible web3 games that lives up to its reputation and become the focus of gamers. Launchpad: The Setter Launchpad offers an IDO/IFO portal for new projects looking to raise funds to build their project. After project has raised their required funds, They will not be allowed to withdraw all the funds raised in one time. Setter platform will allow the said project party to withdraw 40% of the fundraising at the first time, and then slowly unlock the remains of the funds once a quarter until the fund raise pool is completely depleted Setter NFT's: The Setter Finance idea of NFT is totally different from how the outside world portrays NFT, while some project are hype made projects, the setter Finance will set a new dispensation on the NFT world by creating unique structures to how NFT should be and how they should be used. Farming: Not your regular farming platform; The Setter platform will be home to high lucrative APY% farming that would benefit everyone with better ROI. Swap exchanges: A platform to swap any asset made by the Setter team or outside world developers. Liquidity Hub: Just like all dex platform, Anyone can add LP to their preferred project assets. NFT Staking: Staking NFT in the Setter platform will be possible and stakers will be able to earn credible and valuable tokens for staking a particular NFT made by the community. Fixed Staking: More of our methods of fixed stakings can be seen below this article for more references.","links":"https://setter.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/setter-protocol/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9c50c41a0ec012173b49b587c5f52c0e247de250"}}}