{"name":"cSigma Finance","id":"csigma-finance_ethereum","symbol":"sigma","description":"cSigma Finance is a DeFi protocol that connects institutional borrowers directly with crypto lenders, eliminating intermediaries to deliver superior capital efficiency. Founded in 2023, cSigma has tokenized over $80 million in business loans across the US, EU, and Asia, providing 15-18% APR from actual business operations rather than token speculation. Unlike other RWA protocols that route through asset managers and credit funds, cSigma brings businesses directly onto the blockchain as borrowers. This direct infrastructure approach eliminates layers of fees while providing transparent access to institutional-grade private credit opportunities. The cSigma ecosystem now includes: - cSigma Protocol: The foundational infrastructure that standardizes lending processes and provides essential services across the ecosystem. - cSigma Edge: A DeFi platform offering access to diversified lending pools backed by vetted institutional borrowers. Edge functions as a \"pool of pools\" using ERC-4626 tokenized vaults, allowing users to earn yields from multiple institutional borrowers through a single interface. - csUSD: A yield-bearing token that automatically captures returns from cSigma's entire portfolio of institutional borrowers. Rather than managing individual pools, users simply hold csUSD and watch their tokens appreciate as yields accrue daily from underlying business operations. - SIGMA Token: A utility token (1 billion fixed supply) enabling staking for platform benefits, governance participation, and rewards distribution. cSigma focuses on sub-$25 million private credit loans to mid-market companies with proven track records. The protocol works with businesses across AI software, trade finance, revenue-based financing, and insurance sectors that have operated for 3+ years and raised $20M+ in previous funding. The platform implements multiple protection layers: borrower-provided first loss capital, collateral security through accounts receivable and business assets, and additional credit enhancements like insurance coverage. A proprietary AI Credit Intelligence Engine continuously analyzes borrower data to assess creditworthiness and monitor loan performance. Pool managers undergo strict KYB procedures and provide first-loss capital that typically covers 99%+ of potential losses. The protocol maintains a 100 million SIGMA token loss reserve as additional protection for lenders. By eliminating traditional intermediaries while maintaining institutional-grade risk assessment, cSigma creates a more efficient capital market that delivers higher yields to lenders and lower costs to borrowers, all backed by real business cash flows rather than crypto market speculation.","links":"https://csigma.finance","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/csigma-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x53162ec0adae49f21515bb8ca91534dd3872c8db","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x53162ec0adae49f21515bb8ca91534dd3872c8db"}},"is_native":false}