{"name":"KnowYourDev","id":"knowyourdev","symbol":"kyd","description":"What is the project about? KYD is a telegram scanner bot that includes a complex integration of different blockchain API's. KYD scans blockchain transactions and links them to initial funded and/or outgoing wallets. The aim of the bot is to ensure safety aspects when it comes to crypto investments. What makes your project unique? A technological Marvel Designed To Safeguard The Crypto Realm. Driven By Advanced Algorithms And complex Search Matrixes, the bot Is A Relentless Detective, Uncovering The Identities Of Project Developers based on social engineering and blockchain records. History of your project. Built On Ethical Principles, $KYD Places Individual Well-Being And Privacy At The Forefront. While Data Processed By The $KYD Bot Is Sourced From Publicly Available Information, We Uphold Responsible Conduct, Discouraging Any Actions That Breach Privacy Or Result In Harm. What’s next for your project? $KYD Bot V1 to V2 transition: Our V1 Bot have been released prelaunch to show proof of concept to the community and we have received a lot of positive feedback about the product. (we are happy that people like the product and this motives us more to have this ongoing development of the KYD bot.) V1 is mainly focussed on the blockchain transactions of developers and is all based on etherscan transactions. Now here is the ALPHA what separates $KYD from all other blockchain scanners: Social Engineering. We are finalizing the KYD V2 bot which will have twitter and google API's integrated functions. This means that the KYD v2 bot now is able to track ANY possible links available on the twitter and google database, and could possible link this to the DEV of a certain project. We are planning on releasing this within a timeframe of 1 week. What can your token be used for? a Path to Developer Deployments Clarity , Detect possible scam developers based on history tracks of records and link it to socials of developers (social engineering)","links":"https://www.knowyourdev.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/knowyourdev/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xd05292be8733c1b189820d042c9e2c3fbabb6966"}}}