{"name":"pSTAKE Finance","id":"pstake-finance","symbol":"pstake","description":"\"pSTAKE is a liquid staking protocol that unlocks the true potential of staked PoS assets (e.g., ATOM). PoS token holders can deposit their tokens onto the pSTAKE platform to mint 1:1 pegged ERC-20 wrapped unstaked tokens represented as pTOKENs (e.g., pATOM). Users can convert pTOKENs into 1:1 wrapped ERC-20 staked representatives called stkTOKENs by staking the underlying deposited PoS tokens. stkTOKENs, representing staked tokens, accrue staking rewards in the form of pTOKENs (This mirrors the workings of most PoS chains where staking rewards aren't automatically compounded but earned in the form of liquid tokens which can be claimed by a user at any point in time). pSTAKE allows its users to utilize stkTOKENs in various DeFi protocols to earn additional yield on top of their staking rewards. Example: Alice wraps (deposits) 100 ATOM on pSTAKE. She receives 100 pATOM representing 100 ATOM deposited onto the pSTAKE platform. As long Alice has 100 pATOM, she can redeem 100 ATOM (1:1) from the platform back into her Cosmos wallet by burning off her pATOM balance (This is the unwrapping process). After receiving 100 pATOM, she decides to stake the underlying deposit of 100 ATOM on the Cosmos Hub to earn staking rewards (assume ~7% Annually). On staking, Alice receives 100 stkATOM, and her pATOM balance is now changed to 0 (pATOM burned, stkATOM minted). Let's assume there's an already existing stkATOM-ETH liquidity pool on SushiSwap. Alice supplies all her stkATOM and an equivalent amount of ETH into the Sushi pool to become a liquidity provider (LP). A portion of the trading fees generated on SushiSwap is distributed to all the LPs (Assume that this results in 9% yields annually). Thus, if Alice doesn't face any Impermanent loss at the end of the year, she would earn (7+9)% yield on her 100 ATOM holdings instead of the usual 7% she would have received by simply staking (and not liquid staking). Alice, being a PoS coin staker, leverages pSTAKE's technology to generate additional yield.\"","links":"https://pstake.finance","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pstake-finance/logo.png"}