{"name":"Kinesis Silver","id":"kinesis-silver","symbol":"kag","description":"What is Kinesis silver (KAG)? Kinesis silver (KAG) is a silver-backed cryptocurrency, launched by Kinesis - a global trading and digital asset utility platform. Each Kinesis silver (KAG) token is backed by 1 ounce of investment-grade silver bullion, securely stored in Kinesis’ fully insured, audited vaults. The mission behind KAG is to reintroduce physical silver backing to money and provide the global community with a stable store of value. Kinesis silver (KAG) has the everyday utility of a fiat currency; the borderless efficiency of a cryptocurrency, and none of the inherent volatility. KAG enables physical silver bullion to be instantly purchased, traded, spent and sent anywhere in the world, bringing real-world access, value, and utility to physical precious metals. A true stablecoin, KAG allows crypto traders to easily exit volatile markets and enter into the enduring value of physical silver, while earning a monthly yield. What makes KAG unique? In an economic first, KAG holders earned the first debt-free yield on precious metals. All KAG holders receive a passive yield - paid monthly in KAG - simply for holding their metals on the Kinesis platform. The yield is calculated from a 15% share of Kinesis’ global transaction fee revenue which is shared with users who store their silver on the platform. Unlike other silver tokens, KAG can be instantly spent with the Kinesis Virtual Card, worldwide. Accessible via mobile device, the virtual card lets people everywhere instantly convert their KAG holdings into local currency at the point of sale, anywhere Mastercard is accepted. Through digitalising physical gold in the form of KAG, Kinesis has successfully reintroduced silver as a currency. Can I redeem my silver? Every single ounce of silver underpinning KAG is available for redemption, at the click of a button. While other silver-backed cryptos offer redemption, they often set very high minimum withdrawal limits, making redemption unfeasible for everyday investors.","links":"https://kinesis.money/","market_cap":137613363,"market_cap_rank":353,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kinesis-silver/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}