{"name":"Civilization Network","id":"civilization-network","symbol":"cvl","description":"CVL Network is a multi-chain ecosystem with a full suite of products including CVL Wallet, CVL Exchange and CVL P2P. CVL Wallet is a non-custodial, multi-chain crypto wallet and gateway, built as an infrastructure to the multi-chain future. CVL wallet provides a one-stop platform for users to access the Decentralized Finance (DeFi) ecosystem, such as decentralized exchanges, lending protocols, on-chain governance (via Snapshot), and blockchain based games. Users may also perform cross-chain migration via the mobile app, which supports over 14 networks such as Ethereum, Binance Smart Chain, Optimism, Avalanche and more. CVL wallet integrates all the most popular decentralized protocols, as well as a p2p system and its own exchange. CVLSwap is a cryptocurrency and tokenized assets exchange like fiat currencies, stocks, metals. It’s commission is the lowest in the world and equals to 0.01%. CVL token is the native utility token of the platform. The current and planned use cases of the CVL token includes: Ecosystem development: CVL revenue from transaction fees will be sent to a DAO treasury fund. Staking and Farming: The other fraction of the treasury fund will be allocated to CVL holders who stake or farm their tokens. The exact distribution is subject to protocol governance and may be changed. Governance: Users may stake CVL in exchange for token DAO GT to gain voting power and participate in the governance process to change product parameters. Unique membership rights: Users will gain tiered benefits on the platform, depending on their CVL holdings. Some benefits include access to participate in CVL launchpads and retroactive incentives from strategic partners as well as the ability not to pay commission on the p2p platform. The usefulness of the token in the ecosystem: The ability to pay commission on the exchange and P2P, the ability to pay network commission","links":"https://cvl.network","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/civilization-network/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9ae0290cd677dc69a5f2a1e435ef002400da70f5"}}}