{"name":"Flash 3.0","id":"flash-3-0","symbol":"flash","description":"What is the project about? Flash Technologies creates a money transfer ecosystem. What makes your project unique? Flash Transfer is the world's first platform that allows you to buy crypto with cash, transfer, or sell cryptocurrencies for cash through our network of merchants, with reasonable fees. Flash Wallet, our non-custodial wallet, has a smart contract that you can use to transfer your crypto in the event of death. When making payments on the blockchain, you can use Flash Pay, our escrow smart contract, to secure your transactions without any third party holding your crypto. Find the best fees with Flash Dex, our aggregator swap & bridge ! History of your project. August 2021 Market study and meeting with professionals for the feasibility of the project. October 2021 Creation of the team of developers. Creation of the Flash Technologies Website. September 2021 Definition of the project and creation of the whitepaper. November 2021 Implementation of the Marketing strategy. Creation of the money transfer platform website. Meeting with influencers for the promotion of Flash Token. January 2022 Launch of the 1st NFT collection. Launch of the Flash Token on the Bnb Chain. February 2022 Release of the beta version of the money transfer. Coming out of the Nft mint platform Deployment. Vip Club Launch on Discord (only for the 200 Nft) Press release. March 2022 Opening of the company in Dubai. April 2022 to December 2022 Development UI/UX for Flash Transfer platform (Flash transfer + backend for admin + backend merchant + mobile App ). Development of UI/UX for Flash wallet (website + app). Development of UI/UX for Launchpad platform. Development of UI/UX for DEX website. Development of UI/UX for Staking website. Development of the Flash wallet website. Development of the Flash Transfer platform What’s next for your project? Be live for thousands of merchants What can your token be used for? This token gives benefits and discounts on your products.","links":"https://flash-technologies.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flash-3-0/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbb19da2482308ec02a242aced4fe0f09d06b12a7"}}}