{"name":"Lotion AI","id":"lotion-coin","symbol":"lotion","description":"LotionAI is an innovative platform that combines artificial intelligence (AI) and blockchain technology, enabling users to create custom AI chat agents integrated into social channels or websites. Powered by the native $LOTION token, the platform unlocks premium features and provides a token-driven economy where participants directly benefit from the platform's growth and improvements. The core vision of LotionAI is to empower users to launch and customize AI agents while leveraging the transparency and decentralization of blockchain technology. The platform addresses a growing demand for AI-driven solutions by making these tools more accessible and integrating them with the financial and governance opportunities enabled by Web3. The team behind LotionAI has deep roots in the AI and Web3 ecosystem, with origins dating back to work at Google Brain and experience across Series A–B startups in the deep learning sector. After successfully launching an AI agent project for small businesses in the Web2 space, the team recognized the transformative potential of combining AI with crypto. This realization inspired the creation of LotionAI—a platform designed to push the boundaries of decentralized AI innovation. Key features of LotionAI include: 1. Token-Powered AI Agents: Users need $LOTION tokens to create or upgrade custom AI agents. 2. Premium Functionalities: Advanced features, such as enhanced memory and specialized integrations, require holding or spending $LOTION tokens. 3. Community Rewards & Governance: The platform envisions a future where $LOTION token holders can earn rewards and vote on key decisions, influencing the trajectory of LotionAI. The team’s roadmap focuses on expanding the functionality of AI agents to handle advanced tasks, such as scheduling, e-commerce integration, and multi-step workflows. Future goals include enabling community governance, where token holders influence feature rollouts and partnerships, as well as deepening integration with businesses and social platforms. LotionAI represents a forward-thinking approach to combining approachable AI tools with the economic opportunities of blockchain. By providing transparency in agent creation and fostering a decentralized ecosystem, LotionAI aims to redefine how AI is used in business and social contexts, creating value for both users and token holders.","links":"https://www.lotionai.fun","market_cap":10508.69,"market_cap_rank":9514,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lotion-coin/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"5Yoc8Wzh5y9nA414VY9qJ1D3GF4qJ3SdhNxZuwn8pump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/5Yoc8Wzh5y9nA414VY9qJ1D3GF4qJ3SdhNxZuwn8pump"}}}