{"name":"Franklin Templeton BENJI","id":"franklin-templeton-benji_avalanche","symbol":"benji","description":"The BENJI token is a digital asset security that represents a share of a tokenized, US-registered government money market fund, known as the Franklin OnChain U.S. Government Money Fund (i.e., the “Fund”). The BENJI token offers daily yield accrual and distribution and is currently available on multiple public blockchains: Stellar, Polygon, Aptos, Avalanche, Aptos, Arbitrum, Base and Solana. The BENJI token may be transferred peer-to-peer among shareholders, who may fund and redeem their tokens via fiat (USD) or through our facility for USDC. While shareholder transaction records are kept by default on public blockchains, shareholder personal identifiable information records are kept on internal systems. Private keys are maintained by Franklin Templeton in Franklin Templeton hosted wallets. Key Characteristics: - Investment Focus: Invests at least 99.5% of its assets in short-term US government securities, cash, and repurchase agreements collateralized fully by government securities or cash. - Stable NAV: Aims to maintain a stable $1.00 Net Asset Value (NAV). One share of the fund is equivalent to one BENJI token. - Yield-Bearing: Generates income through high quality, short-term US government securities. - Natively On-Chain: Directly manages share ownership and recordkeeping on-chain, ensuring all data is verifiably stored and executed on the public blockchains, enhancing trust and transparency. - No Cryptocurrency Exposure: The fund does not invest in cryptocurrencies, though it uses blockchain for operational purposes. While not inclusive of all potential use cases, the BENJI token may be utilized as a corporate treasury and/or reserve management solution, as a funding tool and as a payment solution. Franklin OnChain U.S. Government Money Fund (FOBXX) is registered under the Investment Company Act of 1940, is managed by Franklin Advisers, Inc., and distributed by SEC-registered broker dealer Franklin Distributors, LLC.","links":"https://invest.digitalassets.franklintempleton.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/franklin-templeton-benji_avalanche/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xe08b4c1005603427420e64252a8b120cace4d122","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0xe08b4c1005603427420e64252a8b120cace4d122"}},"is_native":false}