{"name":"CRISP Scored Cookstoves","id":"crisp-scored-cookstoves","symbol":"crisp-c","description":"Everyone wants to see quality climate action - but the way this is financed is challenging. Carbon project developers, such as organizations that provide efficient cookstoves to rural communities in developing countries, run into a major roadblock - the Voluntary Carbon Market (VCM) gives them carbon credits retroactively, but the up-front costs are significant and have to come from somewhere. Generally, this is solved via forward financing, but this industry is inaccessible and opaque, lowering the amount of willing participants and limits access to capital. The result is that quality climate action is slowed down, limiting the impact these projects have in the fight against climate change. CRISP-C is Solid World's token for allowing cookstove project developers to forward-sell their upcoming carbon credits at a discount. The further away the credits are from delivery, the larger the discount. One CRISP-C reflects the value of one ton of cookstove-based carbon credits at maturity, as this is the point where the discount reaches 0% and can be exchanged 1:1 for the underlying supply (plus fees). As the forward credits exchanged for CRISP-C move closer to maturity, this discount is vested to the token's liquidity providers, creating a sustainable source of liquidity incentives while never diluting existing token holders of the token's value. All projects are subject to Solid World's CRISP (Carbon Risk Identification and Scoring Principles) Framework to limit risks of underdelivery, have replacement guarantees from suppliers and are approved by the pool's Curation Council, a set of major liquidity providers for the CRISP-C token. Together with the rest of Solid World's mechanisms - the system functions as a decentralized warehouse for climate finance, connecting buyers and sellers across time, as the supply gets certified and arbitraged out of the system.","links":"https://www.solid.world/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crisp-scored-cookstoves/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x672688c6ee3e750dfaa4874743ef693a6f2538ed"}}}