{"name":"Fina.cash","id":"fina","symbol":"fina","description":"What is the project about? Fina is a defi wallet that fully integrates into the eco-system in Secret network (SCRT). Fina.cash currently provides 3 core products. 1) Fina Card, the Web3 Visa prepaid card which can be topped up with any major cryptocurrencies and connects directly to non-custodial wallets. 2) Fina Wallet, the mobile non-custodial wallet tailored for the IBC ecosystem. Users can easily manage their IBC assets, perform transactions and staking actions, and participate in governance proposals on both iOS and Android. Users can also connect to dApps through our in-app browser. 3) Fina Validator, the tendermint IBC validator that supports the consensus of the blockchain. User can stake their $SCRT to the validator. What makes your project unique? On our product offering, Fina is listed as one of the best 5 web-3 debit cards on Alchemy (see https://www.alchemy.com/best/web3-credit-cards), and is currently the only on-chain integrated off-ramp solution / debit card for retail investors. On our business side, Fina has received funding from SCRT Lab and various funding programs with long runway period projected. History of your project. - Wallet Launch (Accomplished as of August 25th, 2022) - Validator Launch (Accomplished as of September 24th, 2022) - Acquisition of Cryptocurrency Exchange License in Lithuania (Accomplished as of September 29th, 2022) - Fina Card Beta Launch (Accomplished as of March 10th, 2023) - Public Sale of FINA Tokens (May 2023) What’s next for your project? After the token launch, we will aim to extend our service to various L2 blockchains in order to gain market share and earn more fees in core businesses. We believed that all core products can be replicated to other chains and occur +ve cash flow for the project as a whole. As a result, the reverse can be used to buy back $FINA which sustains a fairly long-term value for the token.","links":"https://fina.cash/","market_cap":761913,"market_cap_rank":2903,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fina/logo.png","detail_platform":{"secret":{"decimal_place":6,"contract_address":"secret1s3z9xkpdsrhk86300tqnv6u466jmdmlegew2ve"}}}