{"name":"Danketsu","id":"danketsu","symbol":"ninjaz","description":"Danketsu (formerly known as ADA NinjaZ) is a Web3 media and entertainment business featuring NFTs, literature (manga-comics, screenplays, light novels, books), music, and gamified experiences, with existing intellectual properties of value, and an established community. Its latest deliverable is designed to solve the various problems in today’s gaming industry, including lack of proof of concept; lack of quality or true gaming experience; too much focus on token economy (or the “earn” rather than the “play” part); and not developed by gaming professionals. Danketsu’s products are based on intellectual properties (IPs) co-developed by the team and its community. Over the last year, Danketsu has successfully proven the value of their IPs through the launch of various non-fungible token (NFT)-based media products, including the four collections of Danketsu digital art, the two series of manga-comics (including a physical NFT-linked copy), one light novel, and an animation episode screenplay. The team, with input from the Danketsu community, has also co-produced five songs. Based on the community’s interest, Danketsu is now in the process of developing an NFT web-based gamified staking platform called Danketsu Missions. Danketsu Missions will be live and available to play upon the $NINJAZ token generation event in March 2023. Danketsu has an established community that have been highly engaged with the team and each other, in contributing to the future stories of the “Danketsu” IPs. This community-building success has been proven for the digital art collections, the manga comic series, and the music products that Danketsu has launched. As of 25/01/2023, Danketsu has ~20,000 Twitter followers; ~12,000 Discord members; ~4,700 holders of their digital art collection NFTs; and has achieved more than 1.7 million ADA total trading volume of its NFT collections on the secondary market The $NINJAZ token will enable you to enter, access and participate in the Danketsu Hustle.","links":"https://danketsu.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/danketsu/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"df1d850c46d6c9d12cbf6181c35db9225a91b77c8a646b7f636f8ae40014df104e494e4a415a"}}}