{"name":"Game Federation","id":"game-federation","symbol":"gft","description":"Game Federation Token (GFT) works within the smart chain (ERC20) network. With a decentralized structure and an inflationary and deflationary balance in the network, GFT applies a parameter that ensures multiplicity and intensity of transactions and safe augmentation in users’ wallets thanks to its fair tax distribution algorithm for holders, besides providing value enhancement for its users. In this way, users contribute to the ecosystem while both making transactions with GFT token in the network and keeping them in their wallets. In this way, they obtain shares from the production. In the following stages, new algorithms and contracts will be developed for GFT token. GFT token is a cryptocurrency used as on instrument of payment on mobile and online games which was developed to organize game tournaments. Moreover, it is a cryptocurrency and payment instrument that is used for generation of on ecosystem with the purposes of developing METAVERSE and NFT projects, games and mobile applications, sole and content sole of these products via GFT token, software development, content generation and modeling for “Internet of Things (loT)“, artificial intelligence and other systems, besides being used in broadcasting sector and development of broadcasting applications. GFT founder team plays on important role in planning, development and implementation of our vision regarding the products and services that we provide. GFT team has a transparency, novelty and autonomy that supports variety among members and that enhances our development. The team already has good knowledge of internet technology, online services, “Internet of Things (loT)\" and artificial intelligence systems and also has experience on the issues of blockchain technology, open finance, design and software development.","links":"https://gamefed.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/game-federation/logo.png"}