{"name":"Feenix","id":"feenix","symbol":"feenix","description":"Fee-Nix means Zero Fees! Rising from the ashes of a crypto ecosystem littered with chaos and deceit, Feenix emerges as a new hero. Forged through fire, Feenix is a meme token determined to guide the crypto realm into a new rebirth. Feenix has a great utility in the form of a Telegram bot called FeenixBot. FeenixBot is the ultimate bridge enabling users to swap 100s of tokens across 25+ blockchains with ZERO gas fees and without connecting their wallet. In a market where over 40,000 tokens are launched daily—many of which are scams—Feenix stands out. We’re here to build trust, transparency, and security in the crypto space. With Feenix, you don’t need to worry about rug pulls, hidden risks, or fraudulent activities. Our aim is to make Solana and other blockchains safer and more accessible for users by introducing robust cross-chain swaps and expanding into a full ecosystem with APIs, rewards, privacy tech, and beyond. Feenix Telegram Bot enables you to swap tokens across 25+ blockchains without the need to connect your wallet, sign up for centralized exchanges, or pay any gas fees. With Feenix, transferring assets from Solana to Ethereum, Binance Smart Chain, or any other supported blockchain is as easy as pie - all without hidden fees or complex processes. We’re aiming to capture a significant share of the $1.3 billion+ weekly cross-chain swap market. And with our cutting-edge technology and strong foundation, this vision is well within reach. Join us as we grow into a leading force in the world of Cross-Chain Swaps and beyond.","links":"https://getfeenix.com","market_cap":15735.81,"market_cap_rank":10296,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/feenix/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"FnixeBNA3YXU3JUK9gTeHjDv9t36YGUyuf5Q9od7tTVV","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/FnixeBNA3YXU3JUK9gTeHjDv9t36YGUyuf5Q9od7tTVV"}}}