{"name":"Rave","id":"krav","symbol":"krav","description":"What is the project about? Krav is a decentralized perpetual crypto quanto exchange What makes your project unique? Krav is the first-ever decentralized perpetual quanto exchange. At Krav, you can leverage BTC trades using any altcoin as collateral, and have the gains and losses settled in altcoins. What innovations does Krav offer? Catering to Traders and Liquidity Providers (LPs): Project Krav's unique mechanism allows traders to utilize altcoins to open long or short positions on Bitcoin (BTC), catering to a broad spectrum of trading strategies. Meanwhile, LPs have an opportunity to earn transaction fees each time traders modify their positions, offering a potential for steady income. Enabling Strategic Trading with Limit Orders: The ability to set limit orders offers users enhanced control over their trading strategies. The added layer of execution fees attached to limit orders means traders can further fine-tune their strategies to optimize potential profits. Risk Mitigation Measures: Krav incorporates critical risk management tools to safeguard the interests of its users. The funding fee mechanism balances the distribution of long and short positions, mitigating systemic risk. Additionally, a forced liquidation is initiated if a user's open position exceeds 90% of their pledged collateral, protecting the liquidity pool's overall health. History of your project. Stagnant Altcoins - A Lack of Utility As of today, the global cryptocurrency market cap stands at a staggering $1 trillion, with over 10,000 unique coins tracked by major data aggregators like CoinMarketCap and CoinGecko. This diverse landscape of cryptocurrencies paints a promising picture of the sector's growth. However, beneath the surface, a significant discrepancy becomes apparent. While established, large market cap coins have managed to carve out their space in the digital economy with clear utility and strong traction, the vast majority of altcoins remain comparatively dormant. Despite their numbers, many of these meme tokens lack substantial use cases beyond speculative investment. Often, token holders of these coins remain passive, holding their tokens with no immediate use for them, only hoping for future price appreciation. In a market as dynamic and volatile as cryptocurrency, such a passive stance can limit the potential value and versatility of these tokens. Idle Altcoins - A Missed Opportunity In a market teeming with activity, these idle altcoins represent missed opportunities. Tokens that sit unused do not contribute to market dynamics or liquidity, leaving them susceptible to becoming 'zombie' coins - tokens with little trading activity or functional utility. Furthermore, low trading volumes reduce these coins' market visibility, limiting their potential to attract new investors or users. This passive landscape of idle memecoins also impacts token holders. Instead of being able to actively use or engage with their holdings, these individuals and entities find themselves in a waiting game, hoping for a future upswing in token value. It's a restrictive scenario that counteracts the dynamic, participatory ethos that lies at the heart of the crypto world. Krav: Bringing Volatility to Altcoins Krav's vision seeks to redress this imbalance. By introducing the volatility of the two most traded cryptocurrencies, Bitcoin and Ethereum, into lower-volume altcoins, we aim to breathe life into these tokens, turning them into underlying assets for quanto derivatives. In this model, not only does the trading volume of these altcoins increase, but their utility does as well. Token holders can actively engage with their assets, using them as collateral for leveraged trades on BTC and ETH, thereby creating a dynamic, active market space for altcoins that were previously underutilized. With Krav, we aim to unlock the potential of these altcoins, contributing to a more vibrant and diversified crypto economy. What’s next for your project? Bringing RWAs as trading pairs to crypto. Attracting more altcoin pairs with BTC/ETH. Multi-chain support What can your token be used for? Staking Staking Staked KRAV bestows three types of rewards: Escrowed KRAV Multiplier Points KRAV Rewards For more information on Escrowed KRAV and Multiplier Points, please refer to the Rewards page. 30% of the fees generated from swaps and leverage trading are converted to $KRAV and distributed to staked KRAV tokens. Please note that the fees distributed are the amount remaining after deduction of referral rewards and the network costs for keepers, which typically account for around 1% of the total fees. To stake your KRAV tokens, visit: https://krav.trade/dashboard/stake $KRAV aims to protect the interests of our community's early backers by preventing their stake from being diluted by substantial whales - it guarantees an equal opportunity playing field for all community participants.","links":"https://krav.trade/","market_cap":2551369,"market_cap_rank":2625,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/krav/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xbe3111856e4aca828593274ea6872f27968c8dd6"}}}