{"name":"Buzzshow","id":"buzzshow","symbol":"gldy","description":"What Is BuzzShow Network? BuzzShow Network is a decentralised video social media platform which incorporates blockchain technology in a reward-based ecosystem. The platform uses IPFS, a P2P decentralization technology and a unique social media experience for users, who earn Goldies, the platform’s native utility tokens for creating, curating, sharing, viewing and streaming video content. Integrated with proof of contribution engines, BuzzShow's Goldy (GLDY) coin is designed as a utility token with well thought out full-cycle economic elements. BuzzShow decentralized P2P blockchain platform enables users to receive economic gains for every action they do. Based on a sophisticated proof of contribution mechanism built into the platform, it generously rewards all contributors, without the negatives associated with legacy, central control social media platforms, lack of equitable revenue sharing, biased regulations, and abuse of user data infringements of privacy. GLDY is the native utility token that is given to different groups on the BuzzShow platform. Such as: Video creators earn Goldies for both creating content and adding it to their channel as well as when users view the video. This gives video creators a dual chance of earning revenue. They can also charge premiums if they choose to do so. Video Curators are rewarded when a video added to their channel is viewed on their channel and earn Goldies every time they share a video. Viewers earn Goldies when they watch videos on the platform and share videos. They can use these Goldies to pay for premium content from their favorite content creators. Storage and Streaming rewards are given to FRONTIER NODES and FORERUNNERS NODES created on Buzzshow Network, with Multi-Level options STAKING option that increases yields and earning rewards. Advertisers can buy Goldies to pay for advertising space either from the curators or specific content creators. Validators will earn Goldies by verifying the adverts included in a given video to ensure that advertisers only market based on the advertising space. Community-driven Moderators will earn Goldies by validating whether the content shared by creators adheres to the community principles. They flag issues like racism and inappropriate content to ensure that users do not violate their terms. Developers /Platform retain part of the Goldies reserved for them. Additionally, they earn based on any plugins and upgrades introduced to the platform. Who Are the Founders of Buzzshow? Offer Kohen, Serial Entrepreneur and Film Director, with over 20 years of experience, is the founder and inventor of BuzzShow Network. Offer is a visionary innovator in disruptive technology development, film director & producer, with wide eclectic experience in initiating & directing visionary creative & technology driven concepts into outstanding products. He has worked through all creative & start-up phases starting from idea to launch to reaching end consumer at home as well as directing & managing startups and projects from garage phase through growing into funded & revenue driven companies. Where Can I Buy Buzzshow (GLDY)? Follow this link(https://www.reddit.com/r/BuzzShow/comments/qcl73n/how_to_buy_buzzshow_gldy/) to get a guide on how and where you can buy the tokens","links":"https://www.buzzshow.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/buzzshow/logo.png","detail_platform":{"ethereum":{"decimal_place":3,"contract_address":"0x594207c791afd06a8d087d84d99d1da53ccbd45f"}}}