{"name":"VOLLAR","id":"vollar-2_polygon-pos","symbol":"vollar","description":"INTO is a decentralized Web3 community spontaneously formed by global developers and researchers, with members located in crypto-friendly regions such as Singapore, South Korea, Europe, and North America. Centered on open collaboration, the community focuses on exploring the technical implementation of foundational capabilities such as cross-chain interoperability, identity, and data exchange. Against this backdrop, INTO launched the V-Cross project in 2025 — a decentralized cross-chain interoperability protocol for multi-chain ecosystems. Its first public cross-chain integration targets the Polygon (POL) network, enabling secure cross-chain transfers and mapping between Vollar (VDS mainnet assets) and Polygon. V-Cross aims to open value channels between the privacy chain and public blockchains, allowing VDS native assets to safely access broader DeFi and Web3 applications, unlocking new liquidity and use cases. In its design, V-Cross uses smart contracts and multi-signature verification mechanisms. Through on-chain processes including asset locking, mapped minting, and burn-based redemption, it ensures the security, verifiability, and trustlessness of cross-chain operations. The system is maintained collaboratively by community nodes, without reliance on any centralized entity, providing transparency and decentralization by design. The creation of V-Cross continues the vision of VDS (V-Dimension), a global blockchain built on decentralization and anonymity, dedicated to constructing a “Privacy Internet” for all humanity. Through V-Cross, VDS’s privacy-focused ecosystem achieves its first value interconnection with mainstream blockchains, marking the integration of privacy networks with open financial ecosystems and providing a new direction for decentralized community-led multi-chain collaboration.","links":"https://v-cross.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vollar-2/logo.png","detail_platform":{"polygon-pos":{"decimal_place":8,"contract_address":"0xb4e876f6c9d5ba104112d222083527b1dad17103","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xb4e876f6c9d5ba104112d222083527b1dad17103"}},"is_native":false}