{"name":"Y Coin","id":"y-coin","symbol":"yco","description":"Y Coin is a transfer and payment coin using a new democratic governance model. Currently in cryptocurrency when people vote using the current governance model it’s unfair as it favours the biggest coin holders due to voting power being dictated by your stake in the coin. However with Y Coins democratic governance model this is not the case. Each person will get a single vote regardless of their stake in the coin. Y Coin has a IOS, Android and Desktop application releasing soon called the Y HUB. We have multiple sections where users can interact with the coin in different ways. ⁃ Proposals & Democratic Governance: Users will be able to propose votes and vote on existing proposals. It’s similar to Reddit in this regard that users will post proposals that change a certain aspect of the coin. Each user that meets a certain threshold will be able to vote and create votes. Once you vote on a proposal you can’t vote on any other proposal until the next proposal period. The voting period lasts 3 weeks and on the last week the winner is announced. On the fifth week (next month) the next voting period begins. ⁃ Staking: Users will be able to stake $YCO at 3 different rates. Free: 3% API Coins are unlocked and can be withdrawn anytime Partial: 30% API Coins are locked for 1 month. Maxima: 100% API Coins are locked for 3 months. The more $YCO that gets staked the more these percentages go down once the amount of $YCO staked meets a certain threshold. ⁃ Easy transfers and payments: Users are required to create a username on application signup and users send tokens to each other not with long complex wallet addresses but they send tokens using simple usernames somewhat like Instagram (eg: @ben) Users do not have to pay ANY fee on the application as long as the transfer is on the Y Hub. So user to user transfers on the hub are free. ⁃ Earn: Users will be able to watch 30 second advertisements and for every advertisement earn 1 YCO. This incentivises users using the Y Hub as they are able to earn free tokens. No minimum limit is required to withdraw tokens. The second you watch an advertisement you have a Y Coin in your wallet. (However depending on the future price of Y Coin this reward will fluctuate). ⁃ Trade: Users will be able to buy and sell Y Coin using Apple Pay or Google pay through the Y Hub application. On desktop users can use debit or credit card.","links":"https://www.ycoin.co.uk/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/y-coin/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x3d0293f06daf4311b482564330d57c8db6c10893"}}}