{"name":"D-SHOP","id":"d-shop","symbol":"dp","description":"What is the project about? D-SHOP is a project that aims to become a reward-type beauty all-in-one platform that provides a customer-participating M2E (Mission To Earn) compensation system, user beauty history, and customer management solutions for designers based on the Web 3.0 ecosystem. What makes your project unique? We want to build a Web 3.0 ecosystem by organizing the activation of the user's platform as a mission and providing rewards according to mission achievement. The DP token is composed of one axis of the reward system for the user's mission performance, and the swap of in-app purchase means, It will be used as ecosystem activation fee, etc. History of your project. The DP project was first conceived in 2021 At first, it was conceived as a beauty-related reservation platform, but in order to activate it, it was concluded that a reward was needed to solve the platform's cold start problem around January 2023, and DP tokens were planned as a solution for it. What’s next for your project? The Dshop project team presents solutions for the current hair and beauty industry by linking online platforms and offline stores, a price proposal system that directly connects users and service providers, and customer management based on users' beauty history and personal preferences. aim to do. A solution is in development. We are developing a native application-based platform using blockchain technology and plan to complete the development by 2023. It plans to enter the cosmetics duty-free business within 2023. What can your token be used for? DP Token is a basic coin used as a reward and used in D-SHOP, the self-developed WEB3.0 all-in-one beauty platform. DP is used as a utility token and is used within the platform, and its main functions are as follows. 1) Governance Token 2) Key Currency 3) Staking Benefits 4) FAN Club (NFT)","links":"http://dptoken.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/d-shop/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0xd8f44fb168931305acc68cd8181b626a92639ec2"}}}