{"name":"PAC Project","id":"pacman","symbol":"pac","description":"What is the project about? PACMan ($PAC) - the first non-native coin on the OctaSpace network, which can use in different ways. First of all, it is the Play-2-Earn system. PACMan offer games (computer and mobile). The ecosystem combines NFT trading with virtual heroes where users acquire tokens, monitor their development, and participate in battles with other players. The project’s developers pursue the goal to combine concepts such as the metaverse, play-to-earn (P2E) system, and NFTs. Secondly, project offer to use service, which for convenience collects and combines the most popular neural networks for generating and processing images, videos, voices and texts, such as Midjourney, Stable Diffusion, Kandinsky, ChatGPT and many others. Thirdly, PACMan project allow staking use a “consensus mechanism” called Proof of Stake, which is the way to ensure that all transactions are verified and secured without a bank or payment processor in the middle. Using these technologies pac’s owners can get some profit. What makes your project unique? There is implemented a mining reward system that is different from the rest. A reward in the form of PAC tokens can be obtained by mining the main coin of the network - OCTA. Pacman develop games for mobile devices and integrate blockchain technologies into them, which allows you to synchronize your MetaMask wallet and game account. Also, project give players the opportunity to get additional PAC tokens just by playing own games and completing various tasks. History of your project. The official launch date for the project is April 8th. Already on May 1, was released the $PAC token to a large audience. In such a short time of the existence of the project, PACMan managed to do quite a lot of serious work. • Launch a test augmented reality service using our NFTs. • Launch staking pools of $OCTA and $PAC coins in various formats. • Launch the official mining pool $OCTA + $PAC • Enter a large market by opening trading on two exchanges. • Release our basic version of NFT for sale • Alpha Release AR service • Finished work on a unique NFT collection consisting of 10 different characters from movies and cartoons. • Finished work on a mobile game using blockchain technologies, NFT and token integration into the game. • Bridge $PAC (Octa.Space Network) -> $PAC (Binance Smart Chain). It will allow us to reach a large audience and scale our services, including in terms of creating/selling NFT collections that are necessary to receive rewards in our games. • AI Telegram Bot What’s next for your project? PACMan team don't plan to stop there, we still have a lot of plans that we simply must implement. Among them are: • Interactive bulletin board • Mobile online game. With a combat system, large locations, interesting mechanics. NFTs and $PAC tokens will also be introduced. • Several secret mobile projects. • System of rates and ratings with payments of $PAC tokens • Release of a full-fledged AA project for PC using blockchain technology, NFT, in-game purchases and the possibility of receiving $PAC coins • Crypto Exchange • And of course - improving existing services! What can your token be used for? Currently the PAC token can be used for: • Trading on DEX and CEX platforms. • Purchases of NFTs from our collections for various purposes (use in AR application, mobile game) • $PAC coin staking (also we can get extra coins for staking $OCTA coin) • Mining. We can mine additional $PAC coins while mining the $OCTA coin. • Play-2-Earn. You can use project tokens for in-game purchases, receiving coins for completed tasks. In the future, methods of use will be expanded, with various updates.","links":"https://pac-project.com/","market_cap":524431,"market_cap_rank":3207,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pacman/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"octaspace":{"decimal_place":18,"contract_address":"0x760ee1038b54d5adfebbc9560dd13f46a92d5b3a"}}}