{"name":"neversol","id":"neversol","symbol":"never","description":"$NEVER is a groundbreaking project that brings the power of memes to the Solana network, revolutionizing the way we perceive and interact with digital assets. Built on the Solana blockchain, $NEVER leverages the speed and scalability of Solana to create a vibrant and dynamic meme economy. Key Features: Meme NFTs on Solana: $NEVER introduces a unique collection of meme-inspired non-fungible tokens (NFTs) on the Solana blockchain. These NFTs capture the essence of internet culture and enable users to own, trade, and showcase their favorite memes in a decentralized and secure environment. Community-driven Governance: $NEVER is more than just a collection of memes; it's a community-driven project where users actively participate in governance decisions. Holders of $NEVER tokens have the power to propose and vote on changes to the platform, ensuring a democratic and inclusive ecosystem. Liquidity Pools and Staking: Users can engage with $NEVER through liquidity pools and staking mechanisms. By providing liquidity to meme pairs or staking $NEVER tokens, users can earn rewards, fostering a dynamic and participatory community. Meme Farming: $NEVER introduces the concept of \"meme farming,\" allowing users to cultivate and grow their meme collections over time. The more active and engaged a user is within the $NEVER ecosystem, the greater their potential for cultivating rare and valuable meme NFTs. Cross-Platform Compatibility: $NEVER is designed to be accessible across various platforms, making it easy for users to interact with the meme economy seamlessly. Whether through web platforms, mobile apps, or browser extensions, $NEVER ensures a user-friendly experience for all. Dynamic Marketplace: The $NEVER marketplace serves as a hub for meme enthusiasts, providing a space for buying, selling, and trading meme NFTs. The marketplace is driven by the community, with decentralized features that empower users to set their own terms for transactions.","links":"https://neversol.xyz/","market_cap":1322172,"market_cap_rank":3708,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/neversol/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"CxrhHSqyW8YTDWc4csJMMgo7uBUJSXzNzrWhtw9ULdru"}}}