{"name":"Shackleford","id":"shackleford","symbol":"shack","description":"A STABLE and long-term GROWTH cryptocurrency investment token for securely holding your wealth. Shackleford (SHACK) is a stable and long-term growth cryptocurrency investment token that allows you to securely hold and grow your wealth. Launched in March 2023 by a team based in the USA, Shackleford is a pioneering cryptocurrency designed to empower users through its innovative tokenomics. Operating as a Binance BEP-20 token, Shackleford provides a secure avenue for pursuing financial success. At Shackleford Finance, the team places a strong emphasis on wealth preservation and the achievement of financial objectives. The investment token is positioned as a solution for safeguarding assets while ensuring a steady and progressive growth trajectory. A robust foundation has been established to provide investors with peace of mind. With the team's dedicated commitment to stability and growth, the groundwork for the investment token has been meticulously laid. Investors can rest assured that their investments are guided by seasoned professionals deeply committed to their financial prosperity. Operating as a Binance BEP-20 token, the Shackleford token provides a secure avenue for the pursuit of financial success. #Tokenomics: Shackleford employs a transparent tokenomics model featuring a 3% transaction fee for both buying and selling. This fee structure includes a 1% burn mechanism, reducing the circulating supply over time. Another 1% is allocated to buy back tokens, contributing to liquidity and stability. The remaining 1% supports the development fund, ensuring ongoing enhancements for project sustainability.","links":"https://shackleford.finance/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shackleford/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1f6c1516bdeba1a01643b792eb12d68cec8658ba"}}}