{"name":"DeFi Pool Share","id":"defi-pool-share","symbol":"dpst","description":"What is the project about? Introduction:DeFi Pool Share is a decentralized finance (DeFi) lending protocol on Ethereum that enables liquidity providers to lend their Uniswap V3 LP NFTs to borrowers. It offers predictable returns for LPs through lending fees while allowing borrowers to access these positions' claim fees. This platform aims to enhance DeFi lending and borrowing, leveraging Uniswap V3 liquidity with risk mitigation features. Highlights: - Traders can borrow LP NFTs to access liquidity for trading strategies. - Yield farmers can use borrowed assets for liquidity mining. - LPs can earn a predictable income by lending their LP NFTs. What makes your project unique? \"Certainly, here's a concise list of unique features of DeFi Pool Share: 1. Uniswap V3 Integration 2. Predictable Returns 3. Access to Claim Fees 4. Risk Mitigation 5. Efficiency and Accessibility 6. Smart Contract-Based\" History of your project. What’s next for your project? \"Development Plan of next 3 months （Product&Marketing, etc)\" \" The Go-To-Market Plan: Pioneering DeFi with DeFi Pool Share Our go-to-market plan for DeFi Pool Share is all about driving DeFi adoption, user engagement, and becoming a prominent force in the decentralized finance (DeFi) arena. From targeted marketing to strategic partnerships, we're here to attract liquidity providers, borrowers, and DeFi enthusiasts to our community. Our plan is diverse, leveraging unique strengths while prioritizing security, transparency, and user-centricity. Phase 1: Empowering the DeFi Community In this phase, we empower the DeFi community by deploying liquidity and offering Key Opinion Leaders (KOLs) exclusive access to borrow LP positions at incredible discounts. This innovative approach invites KOLs to explore DeFi Pool Share, generating substantial revenue from borrowed LP positions. We're also igniting the power of automated marketing to amplify our presence. KOLs, as passionate advocates, drive the platform's growth organically. Collaboration with start-ups is a key strategy. By onboarding innovative start-ups, we supercharge liquidity, making DeFi Pool Share an attractive choice for borrowers and liquidity providers.\" \"Phase 2: Pioneering Fractional LP Position Borrowing Phase 2 brings innovation to the forefront with fractional LP position borrowing. Users can now borrow parts of LP positions, making it more accessible and cost-effective. Fractional borrowing expands our user base, welcoming retail users to the DeFi ecosystem. We aim to democratize DeFi, offering efficient lending and borrowing opportunities to all.\" \"Phase 3: Empowering Institutional Adoption and Blue-Chip Partnerships Our final phase focuses on advanced features and strong partnerships with institutions and blue-chip projects. Cutting-edge features cater to institutional participants, offering sophisticated tools for risk management and asset optimization. Strategic partnerships amplify our visibility and strengthen industry connections. Security and compliance take center stage, ensuring a safe and trustworthy platform.\" What can your token be used for? Governance: DPST holders can participate in the governance of the DeFi Pool Share platform by voting on proposals related to changes in the lending fee structure, the addition of new features or services, and other important decisions Premium access: DPST holders can also access premium features and services such as discounted lending fees & priority access to new pools. Staking: DPST holders that stake their share will also be eligible to receive a portion of the platform's revenue through a fee-sharing mechanism. This mechanism will distribute a portion of the platform's revenue to DPST stakers, providing a potentially significant source of passive income for long-term token holders. Rewards: In order to provide an incentive for early adoption and liquidity provision, the DeFi Pool Share platform will distribute 5% of the total supply of DPST tokens to early adopters and liquidity providers through a reward system. This will help to bootstrap liquidity and adoption of the platform in the early stages of its development.","links":"https://defipoolshare.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/defi-pool-share/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}