{"name":"Force","id":"force-2","symbol":"frc","description":"What is the project about? SNKRZ is building a sustainable fitness metaverse platform that combines FitnessFi, SocialFi, and GameFi elements. Backed by the top gaming companies in Korea, Com2uS and Wemade, the team members behind SNKRZ have extensive experience in the gaming industry as well as having been part of the team that built top mobile apps in Korea, such as Naver Map (the Google Maps of Korea), KB Pay and Samsung Pay. Since starting the project in March 2022, SNKRZ has built a community of over 160,000 and is already one of the top NFT projects in the Klaytn network. What makes your project unique? Unlike most Web3 move-to-earn projects, SNKRZ aims to reach a mass audience, primarily a Web2 audience focusing more on the “move” than the “earn” and transferring most of the value created from Web2 to Web3, rather than relying on an unsustainable circular pyramidal model current engage-to-earn apps use. To achieve this, SNKRZ is building a LAND metaverse where users can also own a piece of Land (as an NFT) that is mapped to a real-world map. LAND owners will be able to monetize Web3 and Web2 users’ online and offline traffic, which will be valuable to brands and corporations, as well as hold events and quests. History of your project. SNKRZ is the Move & Earn project started its closed beta in May 2022 and officially launched in September 2022. It is the world's first Move & Earn project that combines Move & Earn and Land-fi, introducing SNKRZ Land3 to create a harmonious ecosystem. What can your token be used for? The $FORCE token can be used for breeding, leveling up, and durability repair of SNKRZ sneakers.","links":"https://www.thesnkrz.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/force-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x58083b54013631bacc0bbb6d4efa543fee1d9ce0","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x58083b54013631bacc0bbb6d4efa543fee1d9ce0"}}}