{"name":"Ninja Squad Token","id":"ninja-squad_solana","symbol":"nst","description":"Ninja Squad Token ($NST) is the native token of the Ninja Traders ecosystem, which provides access to Ninja Traders products developed for both beginner and advanced traders. With a rich history of delivering products and insightful content since our inception in 2017, the Ninja ecosystem continues to evolve and expand, embracing innovation and introducing new features. The key to gaining access to these products is as simple as holding $NST or owning a Ninja Squad NFT. By doing so, traders gain exclusive access to products designed to elevate their trading experience to a new level. In brief, $NST holders have access to the following products; - Ninja Terminal grants access to a live cryptocurrency news feed where traders can connect with their API key to open and manage positions in real-time, ensuring users are not losing any precious second while trading live feed. - Ninja Tools enables users to monitor on-chain and futures data, long/short ratios, heat maps, wallet analyses, economic calendar, and more on a single screen. Additionally, the ability to set personalized alerts ensures that users stay ahead of the market. - Ninja Capital grants exclusive access to allocations from upcoming investor rounds of top projects. It's your chance to invest before anyone else with specially reserved spots for Ninja. - Mentorship grants access to intimate discussions with our professional analysis team. Engage in conversations, gain valuable insights, and refine your trading strategies under the guidance of our analysis team. - Ninja News is a premier digital hub renowned for its real-time coverage of cryptocurrency, blockchain, NFTs, and macroeconomics, providing an unparalleled depth of insight and analysis. - Analysis Channel where you can follow the analysis and strategies of our expert analysts in real time. Stay ahead of market trends and make well-informed decisions. Explore our website to learn more about the Ninja Traders ecosystem.","links":"https://ninjatraders.io/","market_cap":12782724,"market_cap_rank":1379,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ninja-squad_solana/logo.png","detail_platform":{"solana":{"decimal_place":8,"contract_address":"G7iK3prSzAA4vzcJWvsLUEsdCqzR7PnMzJV61vSdFSNW","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/G7iK3prSzAA4vzcJWvsLUEsdCqzR7PnMzJV61vSdFSNW"}},"is_native":false}