{"name":"Debtcoin","id":"debtcoin-2_ethereum","symbol":"dbt","description":"DBT is a digital expression of value and a means of certifying property and non-property rights. DBT is the world's first receivables virtual asset. The issuer of the token is LLC DEBTCOIN FINANCE (the official company name in English), registered in the Republic of Kyrgyzstan. It is part of the KALITA SYSTEM ecosystem, serving as a key component, and maintains close commercial ties (supported by active contracts and agreements) with legal entities within the ecosystem. The key prerequisites for the launch of the project were the absence of international and local competing analogues of DBT, investment attractiveness, the uniqueness of DBT as a collection tool, and the social orientation of the project. DEBTCOIN FINANCE invests in debt obligations of banks, microcredit and microfinance companies, utility sector enterprises, and business debt obligations worldwide. DBT combines the optionality of a security and a utility token. DBT will be integrated into the ecosystem of KALITA SYSTEM companies, which will ensure the commercial potential of DBT (more details in the «Project Roadmap» - Section «KALITA SYSTEM Ecosystem. Ecosystem Functioning. Project Roadmap»). DBT token combines the optionality of security and utility. The token provides quarterly payments from collection revenue and cross-sell revenue. Token holders receive lifetime access to discounts from collection agencies worldwide, receive advice on managing their financial difficulties, and get assistance negotiating with collectors and creditors. The token is secured by accounts receivable, shareholders' personal assets, and the emitter. The token provides guaranteed redemption.","links":"https://dbtfin.com/en/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/debtcoin-2_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x1e3f20bee9884aececee4bc2e83926cf612d48ff","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x1e3f20bee9884aececee4bc2e83926cf612d48ff"}},"is_native":false}