{"name":"Wrapped SAFU","id":"wrapped-safu","symbol":"wsafu","description":"Safura is a decentralized protection protocol designed to cover Web3 users and projects from risks like exploits, cyberattacks, and smart contract vulnerabilities. Safura is a DeFi cover alternative for risk-sharing among members. It allows members to purchase various cover products to protect against risks. The $SAFU token is used within the protocol for risk sharing. Digital assets' value has increased to the trillions over the years. The Web3 economy has a lot of potential but in order for wider adoption, it needs to be safe. Currently, less than 1% of digital assets are covered. This presents a unique opportunity for cover to fill the gap. The implementation of cover will enhance community trust and protect against risks like exchange failures, cyber-attacks, and lost or stolen wallet keys. Safura will provide its own platform while embedding cover offerings on DEXes & wallet front-ends. Smart contract security shouldn't end with the audit report. Safura, a DAO founded by auditors and members of the AuditOne ecosystem, has forked a protocol for asset cover (a clean fork of Nexus Mutual with different parameters & tokenomics) which is being deployed on the Sonic blockchain. Community members can choose to have their funds protected with coverage, giving them peace of mind and protecting their assets from potential risks. Projects can purchase coverage to increase community trust, knowing they're protected against potential vulnerabilities. For AuditOne, it's about putting skin in the game and backing our audits with long-term security guarantees.","links":"https://www.safura.io/","market_cap":38215,"market_cap_rank":7914,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-safu/logo.png","detail_platform":{"sonic":{"decimal_place":18,"contract_address":"0xe8c962493104b71f1bf22bc415e02ed3ef685c26","geckoterminal_url":"https://www.geckoterminal.com/sonic/tokens/0xe8c962493104b71f1bf22bc415e02ed3ef685c26"}}}