{"name":"Suiswap","id":"suiswap","symbol":"sswp","description":"Suiswap is a decentralized cryptocurrency exchange built on the SUI blockchain, with the aim of providing a platform that is secure, efficient, and user-friendly for users to trade their cryptocurrencies. Its purpose is to overcome the limitations of traditional centralized exchanges by leveraging the power of blockchain technology to facilitate peer-to-peer transactions. The Suiswap platform operates with the SSWP token, serving multiple functions and utilities within the Suiswap ecosystem. Key functions of the SSWP token include: 1. Governance: SSWP token holders have the power to influence the direction of the Suiswap platform by participating in governance votes on various proposals related to the platform's operations and development. 2. Liquidity Provision Rewards: Users who provide liquidity to the Suiswap platform are rewarded with SSWP tokens. This encourages more users to participate in providing liquidity, which in turn enhances the overall trading experience on the platform by reducing slippage and improving price discovery. 3. Staking: SSWP token holders can stake their tokens to earn rewards. This not only provides an additional source of income for SSWP holders, but also helps to maintain the stability of the Suiswap platform by encouraging users to hold and stake their tokens rather than selling them. 4. Payment for Gas Fees: In the future, SSWP tokens will be used for payment of transaction fees (Gas fees) within the SUI blockchain through Suiswap Wallet. This functionality would enrich the utility of SSWP tokens, enhancing their inherent value. Suiswap intends to be a long-term, sustainable protocol that can contribute to the development of the broader SUI blockchain ecosystem. With its distinct tokenomics and comprehensive functionalities, Suiswap seeks to deliver an unparalleled decentralized trading experience for its users.","links":"https://suiswap.app","market_cap":8457443,"market_cap_rank":1513,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/suiswap/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}