{"name":"Medicle","id":"medicle_ethereum","symbol":"mdi","description":"What is the project about? Medicle is the world's first WEB3 medical service ecosystem, with the goal of creating a \"blockchain in one's palm.\" We wish to move away from traditional centralized medical data services and create a blockchain-based platform that allows each user to develop and use their own personal medical information in a variety of ways. What makes your project unique? Medicle utilizes DNA database transcription on the blockchain, giving our clients the possibility to use blockchain technology’s utilities for their good, such as amazing speed, decentralization, storing data which couldn’t be replicated, reduced fees on certain financial operations and more. History of your project. With the development of digital technology in modern society, data management has become one of the most important factors in every field, and healthcare is no exception. Currently, a number of data-related services are provided to customers, such as document issuance, customized medical services, and reservation services using vast amounts of customer data, but the fact that the entire process is handled by a centralized entity creates several problems. What’s next for your project? We aim to continue growing after our successful launch on WhiteBit, in just couple days our trading volume made us sure that there is demand from community for products carrying great utility since our holders count is increasing each day. We aim to create a movement, a community, composed of believers who will not only hold the tokens, but also utilize them as much as feasible in their daily lives. Our next milestones are global expansion, getting listed on more major exchanges. What can your token be used for? 1. Reservation and payment for medical facility 2. Provide customized medical services using personalized data 3. Support easy access/storage/submission of medical documents 4. Various medical supplies can be purchased within the MEDICLE shopping mall","links":"https://www.medicle.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/medicle/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x848896470d989f30503d8f883c331f63b73b66ea","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x848896470d989f30503d8f883c331f63b73b66ea"}},"is_native":false}