{"name":"PHOENIX","id":"phoenix-2","symbol":"phx","description":"Phoenix is a hyper deflationary protocol built on top of Inferno and functions as a staking whale in three separate Titanx projects: Blaze, Flux, and Titanx. Rewards received are used to maintain the stakes and fuel the Phoenix buy&burn. This buy&burn will route through Inferno first before buying Phoenix off market. The Phoenix brought off market is split 50/50: half is burnt, and half is sent to an auction balance where 1% of the balance is auctioned off daily for Titanx. Titanx received is recycled back into Phoenix. The Staking Trinity Phoenix will have partial ownership in three staking protocols. The rewards received will be split between maintaining the stakes and fueling the Phoenix buy&burn / buy&bid. Titanx stake- 20% of all Titanx that enters Phoenix through the mint phase will be max staked. Flux stake- 28% of all Titanx that enters Phoenix through the mint phase will first buy Inferno before buying Flux to be max staked. Blaze stake- 9% of all Titanx that enters Phoenix during the mint phase will first buy Inferno before buying Blaze to be max staked. For the first 110 days 100% of rewards received will be reinvested to grow the stake. Daily auctions Whenever the Phoenix buy smart contract is triggered by a user Titanx will buy Inferno before buying Phoenix. The Phoenix brought is split 50/50: 50% will be burnt. 50% will be sent to an auction balance. Starting after the mint phase perpetual auctions will commence with 1% of this balance being up for grabs in return for Titanx. The Titanx received will be recycled back into the Phoenix buy smart contract and will also be used to further support the three stakes.","links":"https://app.phoenix.win/","market_cap":53176,"market_cap_rank":8424,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/phoenix-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfe3f988a90dea3ee537bb43ec1aca7337a15d002","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xfe3f988a90dea3ee537bb43ec1aca7337a15d002"}}}