{"name":"WALC","id":"walc","symbol":"$walc","description":"WALC is an ecosystem accelerator program launching in October 2021 that aims to drive mainstream adoption of blockchain technology through collaboration. Based in the UK and built on the NEAR blockchain as an NEP141 token, WALC provides a full suite of solutions to address common hurdles faced by blockchain projects including lack of expertise, funding struggles, and challenges achieving commercial viability. The WALC accelerator program supplies new projects with support from an experienced team to fill skill gaps in areas like marketing, finance, planning, and operations. WALC also ensures continuous funding for projects through a hybrid model utilising raised funds, grants, and profits from WALC's initial project, Real Time Payments (RTP). RTP is a banking infrastructure software solution that facilitates instant settlement of FX transactions between institutions. All projects joining the WALC ecosystem adopt the native WALC token, promoting stability and shared success. Profits from RTP are used to conduct token buybacks and burns, powering growth while increasing utility. The WALC token serves as the singular native asset across the collaborative ecosystem. WALC tackles blockchain's main obstacles to mainstream business adoption - risk, complexity, and lack of expertise. With comprehensive solutions centred around cooperation, WALC aims to be the number one accelerator program on NEAR. The project brings real-world viability to crypto, connecting blockchains with commercialisation. Backed by an experienced leadership team with decades of success across startups, blockchain, and Fortune 500 companies, WALC provides the ingredients to transform innovative ideas into profitable blockchain solutions. By addressing the adoption challenges head-on while sharing collective benefits, WALC is positioning itself as a catalyst for unlocking blockchain's true mainstream potential.","links":"https://www.walc.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/walc/logo.png","detail_platform":{"near-protocol":{"decimal_place":24,"contract_address":"walc.near"},"arbitrum-one":{"decimal_place":24,"contract_address":"0xdc1bb8018e711f71293a6edfb5c148187008ebdc"}}}