{"name":"RaiseR Token","id":"raiser-token","symbol":"rzr","description":"What is the project about? RaiseR is a market for permissionless credit issuance and secondary market liquidity (RaiDEX). Anyone is able to borrow capital, without necessarily posting collateral, by relying on their on-chain creditworthiness. Lenders are able to assess the quality of borrowers through on-chain credit scoring, and by participating in the borrowers’ communities, creating channels of accountability. RaiseR tokenizes each borrow, creating a zero-coupon bond market, allowing lenders to tap liquidity prior to maturity, and providing speculators the ability to participate in a true credit market. What makes your project unique? RaiseR is unique, as it will be 100% owned and governed by the community, allows for open access to all whether they want to become a borrower, lender or trader. Further, it allows anyone to create an issuance while offering lenders the choice to fund diverse opportunities based on the borrowers' credit profiles. Moreover, traders will be able to tap into secondary markets for all successful issuances, which none of the current lending/borrowing platforms offer. History of your project. The idea was conceived in the aftermath of last year's crash, in December 2022 with the aim that a credit market is the need of the DeFi/crypto space. As the aim is to put governance ultimately in the hands of the community, the team chose to remain anonymous, working on the project and bootstrapping to prepare for launch in 2023. What’s next for your project? The platform Testnet will be live in some weeks, followed by the RaiseR Mainnet on Solana blockchain. RZR on the ETH blockchain will be bridged to RZR on Solana as well. What can your token be used for? RZR is the fuel of the platform; it is burned as a fee in every transaction. This includes the creation of issuances, as well as funding any issuances or trading on RaiDEX, and serves as an anti-spamming barrier. It will also be needed to acquire veRZR, the governance token.","links":"https://www.raiserdapp.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/raiser-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa3a80559bbc1989654e6b8385f5001fa1333332f"}}}