{"name":"Hive Vault","id":"hive-vault","symbol":"hiv","description":"HIVE VAULT APP is the world’s first powerful ECOSYSTEM app which includes a suite of features as AUTO-PRESALE BUYER, A SHITCOIN CHART VIEWER, A BIAS VOTE ON THE UPCOMING PROJECT, ECO-APP, STAKING, AND PROPER DAPP. Everything in between defi & our Shitcoin world is under an application designed for its users to manage their Presales/Fairlaunch & tap into innovation in a secure globally accessible way. AUTO-PRESALE BUYER: 📍HIVEVAULT app includes an automatic buyer for the presales/fairlaunches coming for the one future that you want to buy but you are unavailable at that moment. A SHITCOIN CHART VIEWER: 📍Users can always check the price of a coin on a particular launchpad, including pinksale ,dxsale,LBANK, launchzone and trustpad . It is also possible to track the volume of cryptocurrency trading on the exchanges you are interested in. DOEPAD app can notify you about the changes in the coin price, its capitalization, and changes in the market share — all you have to do is set the ranges of changes. A BIAS VOTE ON THE UPCOMING PROJECT: 📍The HIVE VAULT is systematized in the “Categories”. Also, the “Top token ” tab contains the most relevant and popular token launched or about to launch based on a bias vote from the app-certified users and a comment section. Users can customize the feed and ‘certified users’ they want to receive comments. Each token has an audience interest index. Users will not miss the upcoming project — the push notifications will remind them of the most important ones. ECO-APP: The application is well optimized: it takes not much space on the disk and CPU, and it also consumes little battery power. ALERTS: Receive push alert the second your order is filled, never miss an incoming wallet transfer, be the first to know when the market moves, set specific price-dependent alerts on any of the supported exchanges, and receive notifications & live updates on the market to help you make informed decisions and react swiftly to the ever-changing mark","links":"https://hivevaultapp.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hive-vault/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x95efdc8ebe732fee41803478dd8ab170d99675b9"}}}