{"name":"BounceBit","id":"bouncebit","symbol":"bb","description":"BounceBit is the first-ever native BTC Restaking chain. The BounceBit network is secured by staking both Bitcoin and BounceBit tokens. BounceBit's PoS mechanism introduces a unique dual-token staking system by leveraging native BTC security with full EVM compatibility. In a groundbreaking move, BounceBit introduces the mixed DeFi and CeFi yield mechanism, allowing BTC holders to earn yields through native validator staking, DeFi ecosystem, and a CeFi mirroring mechanism powered by Ceffu and Mainnet Digital. The $BB token has several uses on the BounceBit platform: Staking: Stake $BB to actively participate in the PoS dual-token staking mechanism. Protocol Incentive: The token is paid out as staking reward to validators who secure the network. Gas: $BB is the denomination of the gas fees that are required to conduct transactions and execute smart contracts. Governance: Use $BB to participate in on-chain governance, e.g. voting on protocol upgrades. Currency: $BB can be used as currency on the BounceBit platform. It can be used in various applications and infrastructure, as medium of exchange or store of value. BounceBit’s Layer 1 consists of the following components: Dual-token PoS: A hybrid consensus mechanism where each validator can accept both $BBTC and $BB tokens; Native LSD module: A module allowing the delegation of staking to validators and receiving a LST voucher in return. BounceBit has a foundational CeFi layer which consists of below components: Regulated Custody: All user funds are stored in secure custody solutions utilizing MPC wallets. Off-Exchange Settlement (OES): OES enables safe access to CEX liquidity, while transactions are settled off-exchange.","links":"https://bouncebit.io/","market_cap":55802605,"market_cap_rank":748,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bouncebit/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""},"solana":{"decimal_place":9,"contract_address":"76SYfdi8jT84GqxuTqu7FuyA4GQbrto1pLDGQKsy8K12","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/76SYfdi8jT84GqxuTqu7FuyA4GQbrto1pLDGQKsy8K12"},"ethereum":{"decimal_place":18,"contract_address":"0xd459eceddafcc1d876a3be7290a2e16e801073a3","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xd459eceddafcc1d876a3be7290a2e16e801073a3"}}}