{"name":"EDNS Domains","id":"edns-domains","symbol":"edns","description":"What is the project about? EDNS Foundation is an integral part of the whole EDNS Ecosystem and its associated products. It manages the implementation of every product within the ecosystem, delivering exceptional value and limitless opportunities for users and ecosystem partners. EDNS foundation is also responsible for issuing the EDNS Ecosystem’s native token $EDNS. As the key product of the EDNS Ecosystem, EDNS Domains is a decentralized name service built on Polygon, which is a side-chain and scaling solution on top of the Ethereum, allowing users to translate their machine byte-code to human-readable name. What makes your project unique? EDNS has been dedicated to infrastructure building – Web3 domains (EDNS Domains), Web3 storage (DeDrive) and Web3 communication (SendBlock). Our EDNS Domains is a decentralized name service built on Polygon, and will expand to support more blockchains, and ultimately become a cross-chain and omni-chain service. History of your project. The EDNS Domains Platform was launched in April 2022 on the Polygon Network and delightedly released blockchain-based domain TLDs like .meta, .music, .ass, .404, .web3, .gamefi, and .sandbox to the public. In June 2022, we launched our beta EDNS messaging feature. In addition, EDNS Domains released a search engine for wallet plus text records linked to your EDNS domain on the blockchain. You can follow our progress and check out previous events and a lot more on our website at https://www.edns.domains/news. What’s next for your project? DeDrive (the aggregator of Web2 and Web3 storage solutions) together with Web3 Web Builder as an extended feature of DeDrive, as well as SendBlock (the Web3 communication tool) within the EDNS Ecosystem. What can your token be used for? Our token holders and users will enjoy a seamless Web3 journey by using our products and services. As token holders, they will have access to exclusive offers, rewards, incentives, voting rights, and additional perks.","links":"https://www.edns.domains","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/edns-domains/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x14ee88cd0e3c1534bff13d6d716b8575532c7138"}}}