{"name":"Yummy","id":"yummy_binance-smart-chain","symbol":"yummy","description":"A unique token ecosystem that combines contract tax tokenomics with staking funds, a single token staking platform with includes stable asset staking (upcoming), and educational content to add value to all holders Unlike other tax/reflect tokens, Yummy's ecosystem is not solely powered by token volume or price. It has a $1.3M Growth Fund that generates $2,000-$3,000 a day through staking yields that is utilized to buyback (creating daily buying pressure) and burn Yummy tokens (reducing supply) To provide the opportunity for investors to earn passive income, Yummy has launched it's very own staking platform. The platform has a wide variety of single staking pools, vaults, partner pools, charity pools and several other options. Also the opportunity to stake stable assets. YummyDog NFT's launched late 2021 to provide additional APR boosts for users staking on the platform. Yummy has launched a stable coin known as the Yummy Dollar (YUSD) that will further fuel the Staking Ecosystem, increase daily Yummy buying pressure from the growth fund yield and gives investors a high APR stable asset staking option. Since the inception of Yummy V2 contract the team bought back and burned approximately $4,000 a day in tokens. More than $605,000 (60B tokens) have been burned this way as well as a Mega-Burn of $1.5M (150B) of unclaimed tokens. Over 58% of Yummy circulation has been burned since inception and supply will continue to be reduced weekly through strategic buy backs. The entire team (including the CEO) are extremely active on Telegram and always around to answer questions.","links":"https://yummy-crypto.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/yummy/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xb003c68917bab76812797d1b8056822f48e2e4fe","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xb003c68917bab76812797d1b8056822f48e2e4fe"}},"is_native":false}