{"name":"NUSA","id":"nusa-finance","symbol":"nusa","description":"NUSA's Vision: Enabling an accessible Web3 experience for everyone. We see the future of internet technology will enter the Web3 era where all internet users can have full control over their belongings on the internet. NUSA Features: - Lending Market: Enable users to deposit cryptocurrencies and earn interest or borrow other crypto assets against them. - Swap: Swap your tokens within the BEP20 network a few clicks away. Hassle-free, secure, and low-cost swap platform. - Liquidity Provider: By adding liquidity to pairing tokens, you will get an LP token that can be utilized to get a percentage of the swap fee from the respective liquidity pool. - Farm Pools: More ways to circulate your earnings; Rather than holding your LP token, put it in the farm pools for staking and get a NUSA reward. - Airdrop: Join a strong community by supporting a project while getting rewarded. - Governance Token: NUSA will launch a governance mechanism where holders can get a portion of the revenue generated by Nusa protocols. (Coming Soon!) - NFT Marketplace: NFT marketplace to buy and sell your favorite NFT on the Polygon network. (Coming soon!) There are several utilities for NUSA: - Add any BEP20 token into Nusa Lending Market. - The requirement to join Nusa Airdrop and many other events. You can say it is a participation ticket to join events. - Governance token. In NUSA, there is a governance model where the staked Nusa will represent your portion in a protocol revenue distribution monthly. (Coming soon) - More utilities will be developed as more features are being developed.","links":"https://tadpole.finance","market_cap":827410,"market_cap_rank":4463,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nusa-finance/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe11f1d5eee6be945bee3fa20dbf46febbc9f4a19","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xe11f1d5eee6be945bee3fa20dbf46febbc9f4a19"}}}