{"name":"Ohmcoin","id":"ohm-coin","symbol":"ohmc","description":"Ohmcoin is a fast, secure, energy efficient cryptocurrency and soon to be donation platform, where new supply is minted by people holding Ohmcoin in their wallet or in a Karmanode. Very soon karmanode holders will be able to vote on donation campaigns similar to gofundme or givealittle, all on the blockchain. Once a campaign or cause has been voted on, the ohm network may donate to the approved cause. Like most successful cryptocurrencies, Ohm is associated with a growing community, through which its ideals are being spread with a purpose. People have been drawn to the coin by their interpretation of its name, which carries many different meanings, and by its message: the spread of positive thinking, and of random acts of kindness. The question becomes \"how do we get from that, to Ohm's much-vaunted mission of changing the world?\" The simple answer is \"one transaction at a time,\" rewarding actions that serve to brighten a person's day, make a change in the life of someone less fortunate, and otherwise remind us all of the immutable power of positive action. Ohm, and Random Acts of Kindness Ohm is poised to change the world -- not in some vague, ethereal sense, nor through the establishment of new laws or policies, but through the provision of a simple, everyday reminder to engage positively with other human beings. Ohm reminds us daily that none of us exist in a vacuum. We all rely on other people; we want to have a positive impact on other peoples' lives, and to be well-regarded for our conduct and our character. Some new coins are developed through multi-million-dollar investment portfolios; Ohm is being developed by a team of volunteers, some of whom have contributed substantially of their own personal resources to reward those who find their way to the Ohm community. This kind of dedication and enthusiasm is made possible by the pure truth of Ohm's message: practice random acts of kindness, engage with other people constructively, and you will inevitably make the world into a better place. This idea doesn't require a great leap of the imagination. It is the obvious result of treating other human beings with acceptance, compassion and patience. Technical Specifications Ohm is a proof-of-stake coin created in March of this year. An initial proof-of-work pre-mine hit 6% of the 500 million total coinage, and is now being used for giveaways through the alternate reality gaming community, to help spread awareness. The variable POS APR begins at 20%, reducing gradually down to 5% over the course of several years. There's a 30-second block target, with 30 confirmations for minted blocks, and 4 per transaction. Ohm has been publicly traded since mid-May.","links":"https://www.ohmcoin.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ohm-coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}