{"name":"iNFT","id":"inft-platform","symbol":"inft","description":"At present, there is a vacuum in the NFT ecosystem, namely, the appraisal field. In the traditional financial field, there are actually many appraisal institutions and organizations for various works of art or financial derivatives, such as the appraisal of jewelry, calligraphy and painting, etc. In fact, most of the time the appraisal link is indispensable in the auction and transaction. Therefore, although games are very popular in THE NFT ecosystem, many auctions and transactions of NFT works are not well received. Even in OpenSea, many goods photographed can not be sold at 50% discount price, which is due to this. Established in September 2020, iNFT has been dedicated to building a trading and service platform for NFT. Therefore, in order to solve the above problems, WE put forward DAM -- decentralized price detector to supplement the vacuum field of NFT ecology and make NFT ecology more perfect. 1.DAM (Decentralized Appraisal Machine) isa pricing mechanism proposed by iNFT platform to realize NFT through smart contract +DAO, aiming to solve the pain point of asset liquidity in the primary and secondary markets of NFT. DAM is a decentralized price discriminator. At present, there are many NFT projects, but the market pain point is also very obvious, casting an IP picture is very difficult to sell, false prosperity phenomenon is obvious in the market, the core problem is the asset premium and user purchase intention is inconsistent. Because sellers only want to sell at a higher price, it is difficult to form a single consensus of buyers' purchasing power. DAM's initial pricing model was designed and completed by the iNFT Global team, mainly referring to the pricing business of sotheby's auction and other professional institutions and the design of the paper \"\"An Efficient Price Mechanism for NFTs\"\". The technical team will continue to iterate and update the pricing algorithm, and the pricing nodes will update and upgrade the pricing model according to the voting rules written by DAO. 2. Distributed Autonomous Organization (DAO) The DAO is a fully automated organization that any person or group can join or leave at any time if it meets the requirements. The pricing machine system manages and operates node ecology through DAO, and implements rules and benefit distribution through smart contract management agency, which is transparent and fair. We believe that only by making DAM governance institution open and fair can the price range formed by it be reasonable 3. Appraisal Model DAM's initial pricing model was designed and completed by the iNFT Global team, mainly referring to the pricing business of sotheby's auction and other professional institutions and the design of the paper \"\"An Efficient Price Mechanism for NFTs\"\". The technical team will continue to iterate and update the pricing algorithm, and the pricing nodes will update and upgrade the pricing model according to the voting rules written by DAO.","links":"https://inft.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/inft-platform/logo.png"}