{"name":"MatchNova Champion Coin","id":"matchnova-champion-coin","symbol":"mcc","description":"What is the project about? MatchNova is a Web3 Social Gaming APP. What makes your project unique? We believe it is best to bridge Web2 and Web3 world through gaming and social activities. Traditional mobile games have massive user base but little learning curve, tactical depth and luck element. The team aims to re-innovate those games and introduce them into Web3 world. We hope MatchNova will be the first Web3 app that billions of traditional internet users will use. Besides from enjoying the game and social functions we built in, users will also be guided in all the blockchain related activities. This will include: creating their first Decentralized Wallet, purchasing their first NFT and trading their first Token! We've streamlined the whole experience so these tasks can be easily completed without confusion. History of your project. You may find the detailed roadmap from our official website https://matchnova.com/. What’s next for your project? Currently, the game can be downloaded and played from both Google Play and IOS TF. MCC earning starts and more gaming and social features. You may find more details from our social media: Website: https://matchnova.com/ Whitepaper: https://matchnovaofficial.gitbook.io/ Twitter: https://twitter.com/MatchNovaGlobal Discord: https://discord.gg/MatchNova What can your token be used for? MCC (MatchNova Champion Coin) is the utility token for MatchNova and the supply is unlimited. Users can trade MCC with USDC directly from our in-app decentralized wallet. MCC can be earned from: a) Play PvP match3 games b) Rewards in Battle game c) Open up a Loot Box MCC can be burnt by: a) NFT character’s level up/recover/enhance/customization/mint b) Treasure Hunt c) Open up a Loot Box d) Gem Upgrade e) Unlock Gem sockets f) Display fee in Gallery g) Service fee in Battle field set up h) Lucky spin’s EV gain i) Service fee for withdrawal j) Extra time charge in the gameplay etc.","links":"https://matchnova.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/matchnova-champion-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd18a65de8dd028139f088cbd87cdd7fd196c00d7"}}}