{"name":"Metaxy","id":"metaxy","symbol":"mxy","description":"What is Metaxy (MXY)? Metaxy is a decentralized NFT based fighting game, featuring the most diverse anime-inspired characters, that creates a Multiverse where players can summon their favorite superheroes to battle and earn massive rewards of NFT collectibles and MXY tokens. Metaxy takes place in a fantasy world where superheroes are summoned for the great Multiverse War. Each game character comes with different appearances and unique fighting attributes that are developed over time along with the user’s experience. The game allows each player to engage in battle against other online players (PvP) in real-time, whilst during idling, players can immerse themselves in an enticing narrative story plot (PvE) with intense AI-based combat governed by a wide range of Metaxy superheroes. In the first period, every player will be offered 4 characters for free to choose one from them and with that character they can have prior experience of the game. But they can't earn MXY tokens without using NFT characters. They need to buy character NFTs on the secondary market - the Marketplace or open packages in game. During GamePlay, players will have a chance to receive rewards as Card Equipment NFTs and MXY Tokens. Players can sell these NFTs on the secondary market to new players. Players can use MXY tokens to Swap to Coins (in-game) to upgrade character levels. Players can use MXY tokens to Buy Souls to evolve and upgrade the level of their Characters. Players can use Card Equipment NFTs for their characters to strengthen them. The more powerful characters they have, the more tokens they earn. By owning NFTs, players can take part in the decentralized financial market to earn more profit. What’s more, players can stake MXY and NFTs on the Marketplace to earn MXY and other rewards! Who are the founders of Metaxy? The game is created by Onegame Studio, a famous game studio with more than millions of users and many significant achievements for their mobile version games, and incubated by V2B Labs, one of the pioneering blockchain incubators in Vietnam. Established in 05/2013, Onegame has millions of users using their apps on both Apple and Google Play store. On 12/2020, Onegame was proud to receive the prestigious award from HUAWEI. The mobile version of Metaxy has won a place in the Best Game award category for AppsUP 2020 – Huawei HMS App Innovation Contest (APAC) and formed a solid community with almost 500k organic users. What Makes Metaxy Unique? Metaverse is the new trend of conversion to create liquidity for NFT. Although the coverage of the internet in everyone’s daily life is undeniable, recently, as there has been an enormous increase in the number of people who are interested in cryptocurrencies and NFT games, Metaverse can be utilized in visual reality so that users can have more methods of buying and spending their money.","links":"https://www.metaxy.game/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metaxy/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x965d3704de812f5e1e7eef1ac22fe92174258bd9","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x965d3704de812f5e1e7eef1ac22fe92174258bd9"}}}