{"name":"Sallar","id":"sallar-2","symbol":"all","description":"Sallar is a decentralized mobile distributed computing network designed to transform smartphones into computational nodes within a global infrastructure. Built on the Solana blockchain, Sallar utilizes a DePIN (Decentralized Physical Infrastructure Network) model to enable users to share their devices’ processing power in exchange for rewards. The project focuses on providing cost-effective and scalable computing solutions for high-demand industries, including artificial intelligence (AI), big data, cryptography, and scientific research. Users connect to the Sallar network via a dedicated application, which manages the distribution of computational tasks and rewards. Sallar tokens ($ALL) are earned as a reward for contributing computational power and can be held within the app’s blockchain sub-wallet to unlock additional reward bonuses. This model incentivizes user participation while creating a decentralized infrastructure that reduces the dependency on traditional server farms. Sallar's infrastructure supports industries requiring extensive computing resources by offering an eco-friendly, decentralized alternative to conventional data centers. The project’s smart contract reserves approximately 9.4 billion tokens for rewards, ensuring sustainability as the network grows. To ensure security and transparency, Sallar’s smart contract has been audited by Hacken, achieving a score of 9.1/10. With a focus on accessibility and scalability, Sallar is actively expanding its ecosystem, partnering with organizations in AI and big data fields, and working on a dedicated mobile application for enhanced user experience. By leveraging the collective power of millions of smartphones, Sallar democratizes access to high-performance computing, supporting innovation across various industries.","links":"https://sallar.io/","market_cap":1491961,"market_cap_rank":3205,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sallar-2/logo.png","detail_platform":{"solana":{"decimal_place":8,"contract_address":"GKHgTd6tqvycgG3mqcZraSZDFR32hXhRgo6sZQtudMsC"}}}