{"name":"Solana","id":"solana","symbol":"sol","description":"About Solana (SOL)? Solana (SOL) is a high throughput cryptocurrency based on the Proof of History (PoH) and Proof of Stake (PoS) consensus. Built by a team of networking engineers, Solana aims to become the blockchain infrastucture for modern internet applications. Who is the founding team behind Solana? Solana was founded by 4 co-founders, led by Anatoly Yakovenko. Anatoly Yakovenko wrote and published a whitepaper on the concept of Proof of History in November 2017. Proof of History is a concept introduced to keep time between computers in a network in sync which forms the basis of scaling the number of transactions. Greg Fitzgerald, whom used to be Anatoly's colleague at Qualcomm participated in the project by suggesting and writing the Proof of History codebase in the Rust programming language. Stephen Akridge and Raj Gokal joined the project shortly later and together the 4 individuals incorporated the new blockchain network called Solana in 2018. What Makes Solana Unique? Solana is a general purpose blockchain similar to Ethereum. It has a different technical underlying such that developers write applications using Rust instead of Solidity or Vyper. End user applications in the Solana ecosystem includes decentralized finance (DeFi), non-fungible tokens (NFT), marketplaces, games, e-commerce and more. One of its biggest feature is its scalability in which Solana is able to process over 700,000 transactions per second. Its high throughput capability appeals to high frequency traders, in which spearheaded by FTX and Alameda Research. What is the SOL currency used for? Solana's native currency is SOL. Solana (SOL) is used to pay for transaction fees and staking in order to support the network. Solana in 2022 Solana crypto price experienced a hyperbolic growth in 2021. With the advent of multichain and increased adoption of DeFi and NFT, Solana managed to capture a large market share. Developers were attracted by the technical underlying and started building dapps such as Star Atlas, Mercurial, Orca, Saber, and more. Yield farming on Solana caught on shortly after that as a way to attract liquidity and activities to the network. In 2022, it remains to be seen if Solana and its ecosystem of dapps is able to capture market share. While Solana has been on a high note, it did experienced some setback with network outages lasting as long as over 16 hours on September 15th, 2021. The Solana team and node operators coordinated a reset in order to revive the network. Despite that, Solana coin managed to remain steady above $150 after the incident occured.","links":"https://solana.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solana/logo.png"}