{"name":"PERL.eco","id":"perlin_polygon-pos","symbol":"perl","description":"Tokenized real-world ecological assets Perlin’s latest project PERL.eco, the Planetary Ecosystem Registration Ledger will use blockchain technologies for real-world ecological assets through tokenizing carbon credits and biodiversity, NFTs and decentralised (DeFi) rewards. PERL.eco focuses on tokenization and achieving broader adoption of ecological-related assets like tokenized carbon assets, genomic biodiversity and more. PERL allows token holders to play a critical role in determining the incentive system, building a wide base of stakeholders, and facilitating economic value flow in the network. PERL holders get to vote on this fee model and distribution, as well as other important decisions. PERL.eco is focusing on these key areas: 1. Carbon We are tokenizing carbon credits and users may be able to offset their emissions and participate in the future growth of carbon. 2. Biodiversity We are looking to create a marketplace that links the supply and demand of biodiversity value. This will encourage the conservation of biodiversity, something that is urgently needed as climate change worsens. 3. NFTs We are working with globally recognised wildlife, ocean and environment charities to develop NFTs to fund the conservation of critically endangered species and habitat. 4. DeFi We will allow PERL token holders to yield farm for good and earn free incentives. 5. Blockchain infrastructure We are planning to have our own proof-of-stake blockchain. 6. Education and evolution We believe in empowering the community to join us in protecting the planet.","links":"https://PERL.eco","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/perlin_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xb121fcd122daaa153bb8a102754127b2682645cb","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xb121fcd122daaa153bb8a102754127b2682645cb"}},"is_native":false}