{"name":"Pi Network","id":"pi-network-iou","symbol":"pi","description":"What is Pi Network? Pi Network is a novel cryptocurrency and developer platform that (1) allows mobile users to mine Pi coins without draining the device’s battery, reducing the environmental impact, and (2) fosters the world’s most accessible and ubiquitous apps platform where developers can offer users real life utilities and products in exchange for Pi coins. With its 30+ million engaged user base (as of December 2021) that allows anyone to mine straight from their smartphones, Pi Network strives to bring real economic power back to the masses. Pi’s blockchain secures not only economic transactions via a mobile meritocracy system but also a full Web 3.0 experience where community developers can build decentralized applications (dApps) for millions of users. Who developed Pi Network? Pi Network is founded by Dr. Nicolas Kokkalis and Dr. Chengdiao Fan — two Stanford PhD’s in computational engineering and social sciences. Dr. Kokkalis, in addition to developing/founding several startups and human-centered technologies in the past, teaches a Stanford’s computer science class on Decentralized Applications on Blockchain. Dr. Fan, receiving her PhD in computational anthropology, has also worked as a founding developer of several startups and projects around scaling social communications and surfacing untapped social capital for people everywhere. Both are strong and long term believers of the technical, financial and social potential of cryptocurrencies, but frustrated by their current limitations. To resolve traditional blockchains’ shortcomings, they employ a user-centric design philosophy that turns the development process of new blockchains upside down. What makes Pi Network unique? Pi’s blockchain uses an adaptation of the Stellar Consensus Protocol (SCP) — an instantiation of the Federated Byzantine Agreement — to validate transactions. Compared to traditional blockchain mining methods like proof of work or stake, Pi’s protocol uniquely provides decentralized control, low latency, flexible trust and asymptotic security at a fraction of the environmental cost. In short, fault tolerance is achieved through a decentralized web of nodes reaching consensus via a trust network of mobile users who validate their daily presence and vouch for others’ authenticity in the network to earn Pi. Environmental impact is vastly lowered since this method does not require energy-intensive hardware to mine. Pi Network’s robust economic design is built on an intuitive and transparent model, facilitating Pi coins as a medium of exchange without token concentration. Key tenets include fair distribution (every user has the same base mining rate), scarcity (the mining rate decreases as more people join), and meritocracy (rewards are distributed based on contributions to the network). Pi Network’s developer platform also offers numerous qualities that may interest developers. As the world’s largest identity-authenticated userbase, Pi Network has pre-built infrastructures such as a crypto wallet, user authentication, notifications, deep linking, app interoperability and many other functionalities in its pipeline. Its App Engine uses an operating system similar to Apple’s iOS, with a secure blockchain component. Community developers can incorporate Pi’s SDK and user-authentication measures into their apps, enabling Pioneers to seamlessly integrate into the Pi ecosystem and move back and forth between different interoperable apps without logging in separately or providing other contact information. Are Pi coins available for sale? Pi Network is currently transitioning from Testnet to Mainnet, where Pi coins will eventually become available for public sale. The Network is NOT having any ICOs or any type of crowdfunding, and any sales of Pi are unauthorized and have no affiliation with Pi Network. Those wishing to join Pi Network can download the mobile application from the Google Play Store or Apple App Store and start mining.","links":"https://minepi.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pi-network-iou/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}