{"name":"World of Legends","id":"world-of-legends","symbol":"wol","description":"What is the project about? BattleCity is web3-gaming project creates World of Legends Games, including MU of Heroes, Legends of Tank, and more by blockchain technology constituting for everyone can joy and contribute with BattleCity’s ecosystem, excited and be together with, as our vision: [PLAY for JOY] - [EARN for FUN] – [OWN for REAL] = (“Play To Earn”) for all game-players around the world!!! What makes your project unique? BattleCity project has an unique business model that makes the players with superior gaming skills take advantage from less skilled players, by means of the mode player-to-player value transfers. BattleCity is to create a hybrid technology that will will result to separation of the game and blockchain parts. This will assists the project to deal with lag and slow loading issues that most game-fi experience. BattleCity also target users to complete control over NFT minting (NFTs on Demand), which will allow the user to save 95% of the network fee (gas fee). History of your project. The BattleCity project was initially conceived and published the whitepaper in 2021. The WOL Audit Report and BattleCity Trade Mark Register on how BattleCity project as well as WOL token would work, was later published at the end of 2021. BattleCity's WOL token completed an IEO on Bitmart Exchange on March 10, 2023, followed by an official open trading WOL/USDT on March 16, 2023. What’s next for your project? Now, BattleCity's first game is complete and ready to launch Mainnet immediately following INO in April, 2023 with both a Web and mobile version (Android). Furthermore, BattleCity intends to launch PvP Mode Gameplay in the test-net for the second game MU of Heroes in June. What can your token be used for? WOL is the governance token used on the BattleCity Platform. WOL functions as the primary currency in BattleCity's Games, allowing users to access all key features of both the Legends of Tank and Mu of Heroes, as well as future BattleCity's games.","links":"https://battlecity.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/world-of-legends/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x5eeb28b5aef44b6664b342d23b1aadce84196386"}}}