{"name":"Cyber City","id":"cyber-city","symbol":"cybr","description":"What Is Cyber City (CYBR)? Cyber City is a new Open Economy Play-to-Earn Game with Tradeable NFT Assets, aimed at delivering a high-quality Gaming Experience with Sustainable Tokenomics. The game takes place in the endless metropolis of the cyberpunk world. This is a nuclear mix of RPG, strategy, and turn-based combat with cool mini-games. To learn more about this project, check out our deep dive of Cyber City Setting In the not-so-distant future, Cyber City dominates the planet, and corporations run the world. These corporations control all the wealth and resources, leaving the inhabitants of the City in a dire existence. Cyber City streets are ugly, cruel, and dangerous. A perfect environment for the strongest and most cunning to claw their way to the top. The year 2088 - a world without borders cultural and national. Corporate greed, ever-increasing consumption, ecological disasters, wars, and technological advancement of the 20th and 21st century turned the planet into a wasteland covered by a seemingly infinite Megapolis of slumps. An Urban “Hell” of the megacity is the new physical reality. But there is another, digital reality, an unregulated widespread access to the World Wide Web created a new plane of existence, a mix of the Physical and Digital existence of humans. One dire, ugly with scarce resources, another with the “infinite possibility and unimaginable freedom\". What Makes Cyber City Unique? * 10000 unique characters and 10000 city blocks for making passive income * Groundbreaking P2E global MMO with city building/management elements * Full-scale battlegrounds with a turn-based battle system * Intertwined social interaction between players and clans To learn more about Setting, Gameplay, Characters & Companions and Marketplace peculiarities you may check the full description here https://docs.cybercity.game/game-details/setting.","links":"https://cybercity.game/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cyber-city/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x728d06c26be85ebc8efa334453863b1df00ec493"}}}