{"name":"Chromia","id":"chromaway","symbol":"chr","description":"What is Chromia? Chromia is an open source public blockchain conceived of by Swedish company Chromaway AB. The Chroma token (CHR) was launched in May of 2019. The technology behind the Chromia blockchain is adapted from an earlier technology called ‘Postchain’, a solution provided by Chromaway AB for enterprise clients. How does Chromia work? Chromia is a standalone Layer-1 blockchain and EVM compatible Layer-2 enhancement for Binance Smart Chain and Ethereum. It is designed to enhance existing dApps and allow for the creation of next-generation dApps by providing scalability, improved data handling, and customizable fee structures. The blockchain uses a unique architecture called relational blockchain, as well as a custom programming language called Rell. Rell is designed to code and function very similarly to SQL, allowing developers to leverage the security and immutability of blockchain while storing and handling data with the efficiency of a relational database. Each dApp running on Chromia operates on its own sidechain which is rooted in the main blockchain. This allows each application to scale more efficiently and gives each application developer the freedom to choose from a variety of fee structures. For example, one application may require users to pay transaction fees in CHR (similar to how Ethereum or Bitcoin work), while another application could stake enough CHR to reserve computational power and allow their users to make unlimited transactions without paying any fees at all. What applications have been built on Chromia? Chromia already has a wide variety of applications building upon their blockchain, using their chain as a decentralized storage layer, and using their Layer-2 enhancements. These applications range from DeFi options trading platform Hedget, to open world farming game My Neighbor Alice, to government land registry initiative LAC PropertyChain. One of the latest features in development is a new NFT standard called Chromia Originals, which will operate both as a native standard on Chromia’s chain as well as an enhancement layer for existing ERC-721 and BEP-721 tokens. Work on these Layer-2 enhancements are being developed in cooperation with My Neighbor Alice. Who is behind Chromia? Chromia’s core team consists of industry veterans Or Perelman, Henrik Hjelte and Alex Mizrahi. All three have deep roots in the crypto space, going back to the early days of Bitcoin and Ethereum. For example, Alex published several early academic papers on Proof of Stake consensus and was also one of the key figures behind Colored Coins, one of the first projects to develop the idea of ‘tokens’ that would later be brought to prominence by Ethereum. In summary, Chromia is a Layer-1 and Layer-2 blockchain solution under active development, with the goal of delivering enhanced features and data handling and storage capabilities to decentralized applications.","links":"https://chromia.com/","market_cap":87771953,"market_cap_rank":575,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chromaway/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x8a2279d4a90b6fe1c4b30fa660cc9f926797baa2","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x8a2279d4a90b6fe1c4b30fa660cc9f926797baa2"},"binance-smart-chain":{"decimal_place":6,"contract_address":"0xf9cec8d50f6c8ad3fb6dccec577e05aa32b224fe","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xf9cec8d50f6c8ad3fb6dccec577e05aa32b224fe"}}}