{"name":"Pepe Governance Token","id":"pepe-governance-token","symbol":"peg","description":"What is the project about? Pepe's Game is a DeFi protocol that is powered by a one-click binary options game. It aims to provide entertainment for its users while also providing savvy investors with access to some of Arbitrum One's most powerful decentalized finance engines. The token will be the primary backing currency for Pepe's Nation, a suite of DeFi products built on top of Arbitrum One and harnessing the governance power of PlutusDAO. What makes your project unique? Pepe's Game combines DeFi, trading and entertainment in a massive flywheel. Each section of the Pepe's Game flywheel is net positive, generating real yield from the game, the trading fees and eventually the vaults. History of your project. Pepe's Game was initially incepted in August 2022 when the cofounders, Jiraiya and Adam, wanted to build a one-click leverage machine, which later became the binary options game we have today. Pepe's Game conducted a private raise in March 2023, and conducted a public raise for both USDC and PLS token in mid-April 2023, finally launching its token for trading on 30 April 2023. What’s next for your project? Pepe's Game is continuing to build out the base game to integrate features to make it even more fun for users. There will also soon be new games that users can enjoy. On the DeFi side, Pepe's Game is working hand-in-hand to build vaults that leverage PlutusDAO's governance power over the Arbitrum ecosystem in order to direct liquidity across the chain. What can your token be used for? The $PEG token can be entered in a liquidity pool position in order to receive a portion of the yield generated from the base game. It also grants governance to the whole Pepe Nation suite of products.","links":"https://pepesgame.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pepe-governance-token/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x4fc2a3fb655847b7b72e19eaa2f10fdb5c2addbe"}}}