{"name":"SWFTCOIN","id":"swftcoin","symbol":"swftc","description":"SWFT Blockchain is a cross-chain swap aggregator, while SWFTC is the native token of SWFT Blockchain. SWFT Blockchain focuses on cross-chain swap of DeFi, Gamefi, Metaverse, etcetera. One important function of SWFTC is to be used as membership for all SWFT Blockchain products. Upon holding, users are entitled to transaction fee discounts, community governance, and other rights and interests. SWFT Blockchain (www.swft.pro) was established in Silicon Valley in 2017. It is a cross-chain swap aggregator for DEX/CEX/NFT marketplaces, both on-chain and off-chain. Combining blockchain and Artificial Intelligence technology, it now supports all major public chains, including BTC, ETH, Polygon, Arbitrum, Polkadot, BSC, Heco, Solana, Terra, Fantom, Tron, OkexChain, XRP, and 400+ cryptocurrencies, as well as mainstream NFT trading platforms and NFT projects. With one click, users can enjoy a really swift cross-chain swap that is fast, safe, and characterized by low rates. With 4 years of effort and dedication, SWFT Blockchain has products covering the following fields: 1. SWFT Blockchain Wallet APP (iOS/Android): This allows you, upon registration, to use a one-click cross-chain swap through the wallet, as well as access to multiple additional functions, including social media red packets, payment, aggregate transactions, group buying, mining pools, etc. 2. SWFT AllChain Bridge (www.allchainbridge.com), H5 Version One-Stop Cross-chain Swap: It can be directly connected to the user's wallet (no registration or login required) and swap can be accomplished simply with one click. Recently, we launched the NFT swap section on the platform. Users now have access to leading NFT trading platforms such as OpenSea, LooksRare, Rarible, Treasureland, Bakeryswap, as well as leading NFT projects such as Bored Ape Yacht Club. Users can also use any token on any chain supported by SWFT to swap for top NFTs with one click, which greatly facilitates the smooth multi-chain flow of blockchain assets for DeFi and NFT users. 3. SWFT Cross-Chain Swap API + Widget: This provides a third-party wallet/platform integration and partnership with no extra cost, including the right to share transaction fees. 4. The Beta Version of the SWFT NFT Aggregator (www.linknft.io): Combined with cross-chain technology, this has aggregated many NFT marketplaces, just like 1inch version of NFT marketplaces. Users can purchase popular NFT projects from multiple public chains with any tokens, and the system will automatically match the best price for users. It is the NFT cross-chain platform trading NFTs with one click. SWFT Blockchain has received investment from first-tier venture capitals in the United States including Draper Dragon, and graduated from Berkeley Blockchain Xcelerator’s first-ever batch in 2019. In the past four years, it has established cooperation with many industry elites, and its swap API has also been integrated into many well-known wallets, including MathWallet, Ledger, Huobi Wallet, TokenPocket, Ballet, BePal, MyKey, BitKeep, and so on. Tokens listed on the SWFT platform can also enjoy exposure and traffic from major wallets and platforms, which usually lead to increased liquidity. SWFT Blockchain also has a mature risk control mechanism to ensure the safety of users’ assets and it has not encountered any security incident since its inception in 2017.","links":"https://www.swft.pro/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/swftcoin/logo.png"}