{"name":"3DPass","id":"3dpass_ethereum","symbol":"p3d","description":"3DPass: Transforming Real and Virtual Assets into Digital Masterpieces 3DPass is an open-source, decentralized Layer 1 blockchain platform specifically designed for the tokenization of both physical and virtual objects, converting them into secure digital assets. Since our inception in 2019, we have dedicated ourselves to addressing the challenges associated with the digital transformation of real-world items. In 2020, Michael Co introduced our groundbreaking algorithm, Grid2D, which has since evolved into the Pass3D recognition toolkit. This toolkit serves as the foundation for our network's consensus protocol, known as Proof of Scan. The primary vision of 3DPass is to empower individuals to seamlessly integrate real-world objects into digital environments through smart contracts and transactions, fully harnessing the myriad benefits this integration offers. By developing and implementing advanced recognition algorithms within our network, we are effectively bridging the gap between the decentralized blockchain space and the trillions of dollars in transactions that occur globally. Many individuals are wary of the information surrounding Real World Assets (RWA) available on the internet, mainly due to a lack of trusted identity verification. This skepticism often hinders peer-to-peer (P2P) transactions, making them insufficient without a reliable intermediary. Discover how 3DPass is revolutionizing object authentication by transitioning this crucial process from individual entities to a decentralized network consisting of trustless parties.","links":"https://3dpass.org","market_cap":167461,"market_cap_rank":6188,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/3dpass_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x4f3a4e37701402c61146071309e45a15843025e1","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x4f3a4e37701402c61146071309e45a15843025e1"}},"is_native":false}