{"name":"Kyuzo's Friends","id":"kyuzo-s-friends_binance-smart-chain","symbol":"ko","description":"Kyuzo’s Friends is a Web3 gaming ecosystem built on existing blockchain infrastructures, combining licensed intellectual property (IP) with social gaming experiences. The project was initiated in 2024 by a team based in Hong Kong, Taiwan, and Japan, and it integrates elements of casual gameplay with blockchain-based ownership and asset management. The project is most recognized for its flagship title, Kyuzo’s Friends, a board game experience inspired by the mechanics of dice-based social games. The game is officially licensed with the DNAxCAT (Kyuzo) IP, a popular cat character brand originating from Japan and Taiwan. By incorporating established IP into gameplay, the project bridges Web2 entertainment culture with Web3 game economies. The in-game mechanics are designed to focus on social interaction and player engagement. Players earn Prosperity Points (PP) through activities such as rolling dice, completing quests, participating in mini-games, logging in daily, making in-game purchases, and synthesizing NFTs. These Prosperity Points function as a measure of user activity and are central to reward allocation, including future token airdrops. The system ensures that rewards are distributed to genuine players rather than speculative participants. Kyuzo’s Friends operates within a broader platform called Gravforce, which is being developed as a hub for multi-IP integration. Gravforce will provide a marketplace for NFTs, including trading, auction, and rental systems, as well as tools for creators to generate in-game assets. The platform is designed to support not only the Kyuzo IP but also future licensed IPs from Japan, Korea, and other regions, creating a multi-franchise Web3 gaming environment. As 2025, Kyuzo’s Friends has accumulated more than 12 million registered users, with approximately 2 million monthly active users and over 90 million on-chain transactions. The community is particularly strong in Japan, Taiwan, Korea, and Southeast Asia. Active social channels include LINE, Twitter, Telegram, Facebook, YouTube, and TikTok. The KO token serves as the core utility token of the ecosystem. It will be used for in-game purchases, participation in marketplace activities, governance, and reward distribution. Token issuance follows a conservative release schedule, with an emphasis on sustainability and avoiding excessive inflation.","market_cap":1591902,"market_cap_rank":3199,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kyuzo-s-friends_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x2d739dd563609c39a1ae1546a03e8b469361175f","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x2d739dd563609c39a1ae1546a03e8b469361175f"}},"is_native":false}