{"name":"Hokkaido Inu","id":"hokkaidu-inu","symbol":"hokk","description":"HOKK Finance builds decentralized financial products that challenge modern banking, empowering you to do more with your money. We are one of the original meme-tokens, born in early 2021, that is transforming ourselves into a powerful, DeFi 2.0 player. HOKK Finance is best described as Meme-Utility™, the combination of using a meme and turning it into a currency that can be utilized to send, spend, and invest using financial products and services. Meme-Utility™, fuses memes, crypto, NFTs, and DeFi enthusiasts, with real world use cases that are disrupting the traditional way of doing things in a new decentralized way. The meme side is driven by individuals that push these new concepts by using memes in the various social networks by way of social posts, PFP (Profile Pictures) changing to individual owned NFT’s, etc. The “Meme” is further fuelled by the utility that those projects bring to supplement and sometimes completely disrupt or outright replace real world products and services. Meme-Utility™, thus is a new frontier for crypto-currencies, one the HOKK-Finance is positioned to lead the landscape by creating an inclusive, financial ecosystem through our portal, HOKKFi. Through HOKKFi, you’ll be able to send and spend your money from anywhere in the world, faster, and more affordably than ever before. We’re a multi-chain token, avaliable on ETH, BSC, HECO, with staking, rewards, and incredible products that you can use in your everyday life, to grow your wealth, unlocking your money in ways you never thought were possible. We believe in what we refer to as ‘’frictionless money’’ – the idea that money should not come with barriers when transferring and purchasing. We’re leveraging our global community of 60,000+ investors that contribute to our decentralized, autonomous operation. This means lower fees, faster build-time, and incredible products designed specifically for the crypto-generations of tomorrow. With the combined efforts of our passionate leadership, a supportive and loyal community, and new strategic hires, HOKK Finance is on a bold journey with a goal to make history.","links":"https://hokk.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hokkaidu-inu/logo.png"}