{"name":"Voucher GLMR","id":"voucher-glmr","symbol":"vglmr","description":"vGLMR (voucher GLMR) is a liquid staking derivative (LSD) of staked GLMR, with fully underlying GLMR reserve and yield-bearing feature of GLMR staking reward. Users can deposit GLMR into Bifrost SLP protocol and get vGLMR as return, vGLMR can be traded in the open market or be redeemed back to GLMR. Holding vGLMR equals to holding the GLMR staking position, staking rewards appriciate the exchange price of vGLMR. Why vGLMR? 1. Liquid Staking The product allows users to stake GLMR for liquid vToken, (vGLMR). vGLMR will keep receiving staking rewards and can continue to be used in Bifrost and Moonbeam-based DeFi for additional rewards. 2. Automatically Staking rewards capturing without scenario limitations SLP will issue Staking rewards to vGLMR by adjusting the price of vGLMR / GLMR upwards. vGLMR Rate = SLP Staking GLMR (SUM) / vGLMR Total Issuance. 3. Floating redemption period, vGLMR redemption ≤ 28 days While Moonbeam’s original chain Staking has a fixed 28-day redemption period, Bifrost SLP helps users to realize the possibility of early vGLMR redemption by matching the real-time vGLMR minting quantity with the redemption quantity at the protocol layer in the form of a queue. Theoretically, it can achieve second-level redemption. 4. Higher Staking Yield In the SLP protocol, the protocol screens more than 10 verified nodes through governance (subsequently increasing with the overall staking volume) and adds multiple filters such as the number of nominees, commission ratio, and history of blocks out to maximize the return of this verifier portfolio while ensuring that none of the nodes have experienced slashes. 5. Multi-environment Compatibility vGLMR is one of Substrate assets in Bifrost parachain, by using the HRMP channels between Bifrost and others, it can be easily utilized in EVM, WASM and Substarte competiable parachains.","links":"https://bifrost.app/vstaking/vGLMR","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/voucher-glmr/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}