{"name":"AngelBlock","id":"thol-token_ethereum","symbol":"thol","description":"AngelBlock is a Crypto and FinTech investment platform connecting investors with noteworthy startups with a focus on early-stage investments. AngelBlock is on its way to creating the largest decentralised venture capital fund for the Crypto, FinTech, and Blockchain space. Their mission is to build a cohesive and synergistic community of investors, supporters and entrepreneurs developing innovation within the blockchain space. AngelBlock will allow Crypto, FinTech, and blockchain start-ups to raise funds and receive support from knowledgeable, experienced professionals solely via their online platform. The Tholos token ($THOL) is the native token for the AngelBlock platform. The Tholos token will have the following utility and functionality: Access to the AngelBlock platform and AngelBlock community Loyalty Tiers – gaining additional privileges, bonuses based on the amount of tokens held in a specific wallet Fundraise Staking Discounted fees or circumvention of platform fees entirely Investor Accreditation Priority listing for startups looking to raise funds Angel Mentorship given to startups post-funding Access to a Tokenized Equity Marketplace OTC desk access & fees Additional forms of raising capital via token Priority deals and exclusive listings Deflationary APY Staking xThol based governance model Community building incentivization The Tholos Token is designed to be always in a state of demand from the platform’s users, on both sides, investors as well as startups looking to raise funds. The token itself will be capped at 400,000,000 Tholos tokens. The idea for the AngelBlock platform was envisioned by Alex Strześniewski, accompanied by co-founders Dawid Wasilewski and Marcin Majchrzak.","links":"https://angelblock.io","market_cap":12604.38,"market_cap_rank":10700,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/thol-token_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x207e14389183a94343942de7afbc607f57460618","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x207e14389183a94343942de7afbc607f57460618"}},"is_native":false}