{"name":"FishVerse","id":"fishverse","symbol":"fvs","description":"FishVerse,is an innovative W2E fishing game that leverages AI and multiple blockchains to deliver an engaging open-world GameFi experience.This Fishing game stands out by seamlessly integrating WEB3, providing immersive gameplay, and a dynamic token economy, eliminating the monotony of traditional WEB3 games. Millions of fishing and GameFi enthusiasts can monetize by catching and utilizing NFT fishes, competing in tournaments and PVP, completing missions and much more… Highlights: The first decentralized fishing gaming ecosystem, has achieved a significant milestone: successfully raising a VC backed Seed funding round along with oversubscription from launchpads. FishVerse is backed by a strong network of over 40 partners, bringing a broad spectrum of expertise and support to the project. The partnership base includes some prominent names in the GameF sector. Furthermore, the rising popularity of fishing games in WEB2 presents a prime opportunity for FishVerse to establish itself as a leader in the WEB3 space. FishVerse is pioneering a new way to earn tokens called Win2Earn, this token new economy model is sustainable and deflationary which gives loads of room for token performance and player earnings. Utility: In FishVerse, users can stake $FVS on staking protocols and get rewards, holders can participate in DAO voting as well. The token is essential for various in-game activities like purchasing NFTs, entering tournaments, and competing in W2E PVP stakes. Fish NFTs can be traded, used as bait, or bred on NFT lands for profit. $FVS is used for major and minor equipment upgrades, purchasing NFTs, fishing passes, in-game asset purchases, multiplayer stakes, tournament tickets, and more. Team: We are a team of highly experienced and dedicated GameFi/tech enthusiasts from Vilnius, Lithuania. A team who have known each other for five years since our student days. A well balanced team which has great marketing, problem solving, game logic and development skills.","links":"https://thefishverse.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fishverse/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x72319a036ccb449cffbac0d6e95dcd5c6e86cd0c"}}}