{"name":"CRD Network","id":"crd-network","symbol":"crd","description":"The CRD network is taking a multipronged approach to building out its network and enabling Cryptocurrency and Defi adoption. On the one hand, we are building out our new hybrid crypto-banking and staking platform, with advanced fully regulated banking features connected to the legacy banking ecosystem with everything you would expect from a traditional banking point of view, i.e. with online banking, debit cards, banking app, cashback, rewards, discounts etc At the same time, we are also enabling seamless access via your account to all the best that the world of cryptocurrency markets has to offer i.e.: fiat to crypto exchange, decentralized markets, defi, staking, yield farming, (not to mention, tokenised shares, on-chain derivatives markets, NFT's etc) On the other hand, we are also delivering infrastructure and accelerator programs to influencers, developers, fintech builders, to enable them to build out products and communities. By empowering developers, builders and influencers, with the tools, incentives, community and framework to fund, develop and build out futureproof products, paired with ready to go crypto communities, we are not only simultaneously growing the CRD network on an infrastructure and community level, but also helping educate, and to accelerate the broader adoption of these technologies. The CRD Network uses its own token, known as CRD, which gives access to the network and fuels all transactions within the network, including fees, and governance/staking. Technology Infrastructure The CRD Network smoothens interoperability between the worlds of centralized finance and decentralized finance (DeFi). It runs on Hyperledger Besu, an enterprise blockchain on Ethereum, and uses CRD Nodes and APIs to operate. This infrastructure enables third-party developers to build a wide variety of fintech applications on top of it. For further details please see: https://www.crdtoken.org/whitepaper\"","links":"https://www.crdtoken.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crd-network/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xcaaa93712bdac37f736c323c93d4d5fdefcc31cc"}}}