{"name":"StrongHands Masternode","id":"stronghands-masternode","symbol":"shmn","description":"StrongHands™ (abbreviated SHND), also known as StrongHands™ and Peer-to-Peer Coin is the first cryptocurrency design introducing proof-of-stake consensus as a security model, with a combined proof-of-stake/proof-of-work minting system. StrongHands™ is based on Bitcoin, while introducing many important innovations to cryptocurrency field including new security model, energy efficiency, better minting model and more adaptive response to rapid change in network computation power. StrongHands™ secures the network by providing 250k pr/block reward of the coins that are held by miners after 30 days. StrongHands™ is a currency since it is a copy of Bitcoin. The basic difference is about being a currency for all the people. Every single person may be able to have millions and can give as present, donate, buy goods to friends, family and whoever is in need. Bitcoin will become the currency of elites. We are normal people and we love SHND because it is a coin for the people. StrongHands™ will be able to mean the real financial freedom for the sports world where business, athletes and companies can work together as a great ecosystem and make a olympic dream of a non financial supported sportsperson become true for example. Athletes are very welcomed to represent our brand no matter which sport are practicing or entity is defending as long as fairplay, doping and anti drugs policies are highly respected. StrongHands™ is not only a cryptocurrency, it’s a symbol of passion from a community and the true spirit of competition where adversaries are never enemies and yes good friends without language, skin color, religion, sexual option or territorial borders dividing.","links":"https://www.stronghands.info/masternodes/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stronghands-masternode/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}