{"name":"Foxcon","id":"foxcon","symbol":"fox","description":"Foxcon is a technology project established with the goal of promoting the development of Blockchain and applying Blockchain technology in daily life (Real assets on Blockchain). It includes the following ecosystems: NFT Collection: Foxcon focuses on developing a special NFT collection, which are not only digital art pieces but also symbols of rights and shares in the project. Owning Foxcon NFTs is not only aesthetically pleasing but also a way for the community to show commitment and connection to the project's development. Decentralized Social Network (Social-Fi): Foxcon's Social-Fi feature is not just an ordinary social platform but also an opportunity to earn money. Users can not only interact with the community but also participate in income-generating activities, making efficient use of their free time. Next-Generation Decentralized Exchange: Foxcon introduces a next-generation decentralized exchange where users can experience efficient trading with low fees. This exchange not only helps users choose potential projects but also enhances transaction speed, quickly meeting the community's trading needs. Decentralized Wallet and Validators: To ensure safety and security, Foxcon integrates decentralized wallets and Validators into its ecosystem. This allows users to make transactions safely and reliably, while also controlling and verifying transaction processes. Game-Fi: Foxcon is not just a cryptocurrency project but also a place where the gaming community can turn their gaming passion into an income source. It provides opportunities for players to utilize their skills and earn money by participating in Game-Fi related events and activities. All these features are tightly integrated into the Foxcon platform, with the main goal of creating a diverse and safe environment for users, while also promoting positive development within its community.","links":"https://foxcon.io","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/foxcon/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x2885c2e374301d494208fc9c66ad22ced289a97f"}}}