{"name":"KebApp","id":"kebapp","symbol":"kebabs","description":"The KebApp Coin journey began with the recognition of the enormous yet under-digitized kebab industry in Europe. We saw an opportunity to unify kebab shops under one decentralized ecosystem, providing technological advancements and community engagement that traditional models lack. Moving forward, our goal is to revolutionize the food industry by integrating Web3 principles, tokenized incentives, and Real World Assets (RWA) to create a decentralized network that benefits both small kebab shop owners and consumers. KebApp Coin aims to digitalize and decentralize the kebab industry, bringing modern tech solutions to small and medium-sized kebab shops. By utilizing blockchain technology, we offer tokenized real estate funds, interoperability with food merchants, and a unique rewards system for community participation. Our project enables users to earn and use tokens for various services, vote on platform decisions, and earn additional rewards through staking. We partner with industry leaders to provide automated solutions and improve operational efficiency. Our vision is to elevate the kebab industry to new heights by leveraging Web3 technologies and fostering a strong community spirit. Use Cases of Kebapp Coin: Tokenized Real Estate Funds for Restaurants: Enables investment in restaurant properties through tokenized assets, facilitating easier and more transparent real estate investments. Interoperability: Accepted by food and kebab merchants, allowing seamless transactions across different businesses within the ecosystem. Rewards for Community Participation: Incentivizes users for engaging with the platform and contributing to the community, fostering a sense of belonging and support. Governance Voting: Token holders can vote on platform decisions, ensuring a democratic and community-driven development process. Loyalty and Marketing Features: Restaurants can reward loyal customers and attract new ones through innovative loyalty programs and targeted marketing","links":"https://kebapp.club","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kebapp/logo.png","detail_platform":{"solana":{"decimal_place":null,"contract_address":""}}}