{"name":"Token Teknoloji A.Ş. EURO","id":"token-teknoloji-a-s-euro_avalanche","symbol":"eurot","description":"Launched in September 2023, EURO Token (EUROT) is an asset-backed token redeemable 1:1 for 1 euro. Issued by Token Teknoloji Anonim Şirketi, this token is fully backed by euro on the blockchain at a 1:1 ratio and indexed to the price of EUR. For every EUROT created, an equivalent amount of EUR is held as collateral in the company's reserves. EUROT provides a cost-effective, fast and secure solution for global users, offering direct ownership with no storage costs and high accessibility for 24/7 transactions and transfers, regardless of geographical boundaries. Unlike fiat euro transaction limits in the market, there are no minimum transaction limits for EUROT. EUROT transactions are executed instantly and any amount of EUROT tokens can be converted to fiat currencies, ensuring quick and efficient transactions. EUROT is created and runs on the Avalanche C-Chain and Polygon blockchain, and it is compatible with all blockchain wallets that support EVM. It uses smart contracts to automatically manage the collateralization process. As the demand for EUROT tokens increases, Token Teknoloji Anonim Şirketi will add the equivalent amount of euros to its reserves for each EUROT token upon request from institutions wishing to meet their demand. This ensures that the 1:1 ratio between euro and EUROT is maintained whilst keeping the market in balance between supply and demand. And a coin burn function is built into the blockchain's smart contract to remove a pre-determined amount of EUROT tokens from circulation when needed, ensuring a balance between EUROT and the euro. Thanks to this mint-and-burn mechanism, the price of EUROT is always in equilibrium with the price of the euro.","links":"https://www.token.com.tr/en/reserve-tokens/euro-token-eurot/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/token-teknoloji-a-s-euro/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x14eb40fb7900185c01adc6a5b8ac506d8a600e3c"}},"is_native":false}