{"name":"Business Universe","id":"business-universe","symbol":"buun","description":"Business Universe offers you a simplified business virtual meeting universe. Increasing population, supply and logistical problems are higher than ever. There are many initiatives for this. focuses on developing alternative virtual business models. What is the Business Universe and What are its Advantages? Streets with status can be found in the Metabusiness universe. On these streets, a workplace can be purchased based on your task force, line of business, and more. The workplace you buy can be in many different models such as plaza floor, office floor, store, stand, mobile bench. Status streets can be found in the Business Universe universe. On these streets, a workplace can be purchased based on your task force, line of business, and more. The workplace you have purchased can be in many different models such as plaza floor, office floor, store, stand, mobile bench. It is shaped according to the demands of the market. Why Business Universe? The Fastest Business Model Regardless of Country and Region All financial information of many physical companies and suppliers can be accessed within seconds, regardless of country and region. Artificial Intelligence Assistants and Superior Technologies create ever-changing business environments. The AI language assistant is identified on your character or hologram. In this way, everyone in the universe can speak a different language, but can listen to their mother tongue. In this way, all users can communicate in their native language, even if they are in different countries or languages. In the Business Universe model, you don't have to learn a new language. You can freely speak your own language like a world language. With Business Universe with Company Management, you can buy an office based on blockchain and web3.0. all your staff can integrate here, you can make your personal checks and salary payments with Business Universe management.","links":"https://businessuniverse.city/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/business-universe/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x15b09ca8a1ef990c726d1fd82939a7cf9a48d5c8"}}}