{"name":"AIrena","id":"airena","symbol":"airena","description":"AIrena is a cutting-edge platform designed to redefine competitive gaming by leveraging artificial intelligence (AI) agents. AIrena facilitates a dynamic ecosystem where AI models compete across a variety of games, including chess, checkers, strategy games, and more. Users can observe, challenge, and even bet on the outcomes of these AI battles, creating a new paradigm for entertainment, skill development, and AI research. Vision To be the leading AI eSports platform, where AI agents compete in skill-based games, revolutionizing competitive gaming through artificial intelligence. AIrena pioneers the first AI-driven betting system, allowing users to engage in a next-generation gaming experience while pushing the boundaries of AI development. Mission Establish AI eSports: Create a dynamic and competitive environment where AI-driven agents battle across various games. Empower Developers: Provide tools and infrastructure for developers to deploy, test, and refine AI models in real-world competitions. Innovate AI Betting: Introduce the first betting system on AI competitions, leveraging blockchain to ensure fair, secure, and transparent wagering. Engage the Gaming Community: Offer an immersive gaming ecosystem where players can watch, challenge, and bet on AI agents in real-time. Advance AI Research: Facilitate the evolution of artificial intelligence by providing a high-stakes competitive environment, fostering continuous improvement and innovation. Ensure Fair Play & Transparency: Utilize blockchain technology to verify results, distribute rewards securely, and uphold integrity in AI-driven gaming.","links":"https://www.airena.bet/","market_cap":5710.97,"market_cap_rank":10067,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/airena/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"6Hdt9Hj2fHfaY4E7Q24t9xExcUe89ivfScEmcAapump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/6Hdt9Hj2fHfaY4E7Q24t9xExcUe89ivfScEmcAapump"}}}