{"name":"DeCloud","id":"decloud_ethereum","symbol":"cloud","description":"DeCloud is built to revolutionize remote access by combining the revolutionary aspects of blockchain technology with the potency of sophisticated Remote Desktop Protocols (RDP). DeCloud is an avant-garde solution at the forefront of remote connectivity that combines the revolutionary aspects of blockchain technology with the conventional remote desktop capabilities in a seamless manner. DeCloud is a major advancement in the field of remote access. Cloud Token (CT) serves as the native cryptocurrency powering the revolutionary Cloud platform, which aims to transform remote access by combining blockchain technology with sophisticated Remote Desktop Protocols (RDP). Positioned at the forefront of remote connectivity, Cloud seamlessly integrates blockchain innovation with traditional remote desktop capabilities. CT facilitates secure transactions and interactions within the Cloud ecosystem. Through its robust architecture, Cloud ensures the integrity and security of users' remote interactions, instilling confidence in the protection of their data. CT plays a pivotal role in incentivizing network participants, facilitating seamless access to decentralized remote services, and fostering the growth and sustainability of the Cloud platform. With CT, users can access a variety of decentralized remote services, including remote desktop functionalities, in a secure and efficient manner. Additionally, CT holders have the opportunity to participate in governance mechanisms, such as voting on platform upgrades and protocol changes, thereby contributing to the decentralized governance of the Cloud ecosystem. DeCloud's solid architecture, users are secured in the integrity of their distant interactions, knowing that their data is protected.","links":"https://getde.cloud/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/decloud/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf2dfdbe1ea71bbdcb5a4662a16dbf5e487be3ebe","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xf2dfdbe1ea71bbdcb5a4662a16dbf5e487be3ebe"}},"is_native":false}