{"name":"LIF3 LSHARE","id":"lif3-lshare-new","symbol":"lshare","description":"Lif3 is an emerging powerhouse protocol in the decentralized finance (DeFi) sector that provides a comprehensive suite of features to manage digital assets across multiple blockchains. Encompassing the various products Lif3 has to offer, users are able to safely and securely invest in a multitude of options that best fit their financial goals, preferred strategies, and risk profiles. The available features include but are not limited to swapping between different cryptocurrencies, yield farming, providing liquidity to earn incentives, and engaging in a decentralized lending market that offers yield on single assets and liquidity paired assets, as well as leveraging. We also offer avenues for users to acquire crypto with credit cards and to trade derivatives on our decentralized spot and perpetual exchange that sup- ports low swap fees and zero price impact trades. Additionally, with the Lif3 mobile wallet for cryptocurrency, users can easily access and manage their digital assets from their phones on a secured mobile app, making it easy to stay on top of their investments without having to worry about third-party security risks. Currently, Lif3 is a multi-chain protocol that is operational on Ethereum, BNB Chain, Polygon, and Fantom Opera with plans to expand in the future. And as a part of our commitment to pushing the boundaries of DeFi and making the most innovative and advanced solutions accessible, we have decided to launch our own permissioned Layer 1 (L1) blockchain. As an extension of our L1 infrastructure, we offer Layer 2 blockchains as a Service. This allows developers to build on top of the permissioned Lif3 Chain and utilize its high-speed infrastructure and security to power their DeFi applications. Lastly, a crucial element of our success has been due to our very own Lif3 community. We are proud to have a highly engaged and passionate user base that actively contributes to the growth of Lif3 through governance, constructive feedback, suggestions, and social engagement. This collaborative approach is the key to building a strong and sustainable DeFi ecosystem. Our team is committed to delivering the ultimate DeFi experience to investors of all types, whether they are looking for low risk and low maintenance investments or seeking more exciting high yield opportunities. We strive to be at the forefront of the DeFi revolution and evolve the emerging sector of the financial industry.","links":"https://lif3.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lif3-lshare-new/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8e01397163b21f64cec1f06ca6cc7d9aa8f718e9","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x8e01397163b21f64cec1f06ca6cc7d9aa8f718e9"},"polygon-pos":{"decimal_place":18,"contract_address":"0x5eab32fe1d104ce0c5436fedc3433b646096e47c","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x5eab32fe1d104ce0c5436fedc3433b646096e47c"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x0c08638473cafbca3beb113616a1871f4bfad4f9","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x0c08638473cafbca3beb113616a1871f4bfad4f9"},"fantom":{"decimal_place":18,"contract_address":"0x8ff27b58e1d969befc9c8aeae93a6eb7e2250c8f","geckoterminal_url":"https://www.geckoterminal.com/ftm/tokens/0x8ff27b58e1d969befc9c8aeae93a6eb7e2250c8f"}}}