{"name":"Levana","id":"levana-protocol","symbol":"lvn","description":"Levana Well-funded Perps is a protocol for perpetual swaps, which are leveraged trading contracts. It aims to manage risk and provide benefits to both traders and liquidity providers. For traders, Levana's solution is to make all positions \"well-funded,\" meaning that the maximum profit for each position is locked in advance. This eliminates the possibility of bad debt and insolvency, providing greater security. Liquidity providers, on the other hand, receive a yield for taking on the risk of market instability. They supply funds that act as collateral, and in return, they earn a fee with a risk premium. The protocol addresses the issues with existing perpetual swap models, such as the virtual AMM. These models rely on complex mechanisms to maintain price stability, but they have limitations and can be risky in volatile markets. By separating different trading pairs and creating a decentralized market for liquidity, Levana reduces the risk of contagion between different markets. This also makes it easier to expand to other blockchain networks. Overall, Levana's perpetual swaps protocol offers a reliable and secure platform for traders and liquidity providers. It ensures fair settlement, minimizes risks, and allows for the development of additional financial protocols on top of tokenized positions.","links":"https://www.levana.finance/","market_cap":3190974,"market_cap_rank":2419,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/levana-protocol/logo.png","detail_platform":{"injective":{"decimal_place":6,"contract_address":"ibc/4971C5E4786D5995EC7EF894FCFA9CF2E127E95D5D53A982F6A062F3F410EDB8"},"osmosis":{"decimal_place":6,"contract_address":"factory/osmo1mlng7pz4pnyxtpq0akfwall37czyk9lukaucsrn30ameplhhshtqdvfm5c/ulvn"},"neutron":{"decimal_place":6,"contract_address":"ibc/4971C5E4786D5995EC7EF894FCFA9CF2E127E95D5D53A982F6A062F3F410EDB8"},"terra-2":{"decimal_place":6,"contract_address":"ibc/4971C5E4786D5995EC7EF894FCFA9CF2E127E95D5D53A982F6A062F3F410EDB8"},"archway":{"decimal_place":6,"contract_address":"ibc/6A9571DE6A3F60D7703C3290E2944E806C15A47C1EA6D4AFCD3AE4DC8AF080B1"}}}