{"name":"FiboDex","id":"fibodex","symbol":"fibo","description":"\"What Is FiboDex (FIBO)? FiboDex is a decentralized financial services ecosystem that is created from several centralized and decentralized platforms and aims to provide more solutions in one platform. We launched the FIBO token for the following reasons: • Introduction of Fibodex Ecosystem Project before launch • Expanding the global community • Raise capital and contribute to financial resources FIBO is the native utility token that is used for : • Use FIBO until the launch of the Fibo blockchain and the release of FIBO COIN, for reward system control • Use as a native token in FiboDex Exchange Fibodex ecosystem platforms include: • Fibodex Hybrid Exchange, which will be the most important supplier of ecosystem financial resources. (We have started the coding process with 10 experts since May 2021 and this project will be launched soon at the right time, its technical documentation will be provided on the official website, and on our social media.) • Fibochain, which is created by combining several blockchains, will be the bedrock for all parts of the ecosystem to connect with each other. • NFT Marketplace • Special game asset Marketplace • Game developer platform • NFT developer platform How Many FIBO Token Are There in Circulation? We launched the Fibodex smart contract in August 2021 with 100 trillion FIBO tokens, and we offered approximately 620 billion tokens in a private sale. Also, according to the sales plan, we intend to offer 5% of the total tokens in the Latoken exchange as IEO. Who is the Founder of FiboDex ecosystem? The FiboDex ecosystem was established by the international company Fibodex. Where Can I Buy FiboDex (FIBO)? The official offering of FiboِDex tokens will start on February 21, 2022 at Latoken Exchange, after the completion of the IEO process, FiboِDex tokens will be available for traded on USDT pair. We also already have agreements with other reputable exchanges to make FiboِDex available to more traders over time.\"","links":"https://fibodex.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fibodex/logo.png"}