{"name":"Diment Dollar","id":"diment-dollar","symbol":"dd","description":"# What is Diment Dollar? Diment Dollar (DD) the only pre-audited and pre-backed Stablecoin by the value of Diamonds. ## What is the concept of Diment Dollar (DD)? DD is an outstanding digital product that redefines the concept of “value-security” in the financial world by reinventing the present Stablecoin model. Diment Dollar represents a paradigm shift in the realm of Stablecoins. Priced at 1 USD and backed by Diment's diamond reserve USD-value on a 1-to-1 basis, it offers users a digital asset rooted in tangible value and stability. ### What is the mission of Diment Dollar (DD)? The mission is to redefine reliability, transparency, and stability in the financial world by combining the physical value of diamonds with the potential of blockchain technology. With Diment Dollar, the aim is to secure the financial future of users and investors while adding resilience to the crypto ecosystem. #### What is a stable cryptocurrency backed by diamonds? A stable cryptocurrency backed by diamonds is a type of digital currency where the value is pegged to the value of diamonds. This means that the stablecoin is backed by a reserve of diamonds to maintain its stability. ##### How does a stable cryptocurrency backed by diamonds maintain its stability? The stability of a stable cryptocurrency backed by diamonds is maintained by the value of the diamonds held in reserve. The stablecoin is designed to be redeemable for a specified amount of diamonds, which helps to anchor its value. ###### What are the advantages of using a stable cryptocurrency backed by diamonds? Using a stable cryptocurrency backed by diamonds can provide the benefits of digital currencies, such as fast and low-cost transactions, while also offering the stability and security associated with diamond reserves.","links":"https://www.diment.io/","market_cap":5001007,"market_cap_rank":1891,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/diment-dollar/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x71b3a0566f4bf80331d115d8026a7022bf670cce"},"arbitrum-one":{"decimal_place":6,"contract_address":"0x71b3a0566f4bf80331d115d8026a7022bf670cce"},"ethereum":{"decimal_place":6,"contract_address":"0x71b3a0566f4bf80331d115d8026a7022bf670cce"}}}