{"name":"LOONG","id":"long","symbol":"long","description":"The Loong project is a Dragon Coin cultural exchange token based on a decentralized public chain. The project aims to promote and inherit the Dragon Coin culture through innovative technical means and economic models, encourage the participation of Dragon Coin enthusiasts and believers around the world, and promote the dissemination and development of China's excellent traditional culture. Loong's core goal is to establish a global Dragon Coin cultural ecosystem and create a diversified application scenario and community related to Dragon Coin. The ecosystem will be launched in the form of NFT Dragon Coin games, Dragon Coin maps, Dragon Coin malls, etc., providing users with a full range of Dragon Coin cultural experience and participation opportunities. By participating in games and activities, users can earn Loong rewards and enjoy interaction and communication with other Dragon Coin enthusiasts. The Loong project adopts the decentralized Dragon Coin DAO organization and voting mechanism to ensure the democratic governance and community participation of the project. Users holding Loong will have the opportunity to participate in decision-making and voting, and vote and influence the development direction and major operational decisions of the project. Loong also introduces an innovative economic model and destruction mechanism, which scarifies the token supply by destroying a certain proportion of Loong, thereby increasing its value. In addition, the Loong project also focuses on community building and business cooperation, cooperating with Long City cultural exchange organizations, offline merchants and brands to jointly promote the promotion of Long Coin culture and the development of commercial value.","links":"http://longcoin.vip","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/long/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xfc8774321ee4586af183baca95a8793530056353","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xfc8774321ee4586af183baca95a8793530056353"}}}