{"name":"Sheep","id":"sheeptoken","symbol":"sheep","description":"The live SheepToken price today is $0.000005 USD with a 24-hour trading volume of $28,897.92 USD. We update our SHEEP to USD price in real-time. SheepToken has no change in the last 24 hours. The current CoinMarketCap ranking is #4332, with a live market cap of not available. The circulating supply is not available and a max. supply of 100,000,000 SHEEP coins. Here at SheepToken we have built an amazing asset with an even stronger community behind us. We have a 6% tax on all transactions this allows us to burn 3% of every transactions into a wallet that nobody has access too, and also give 3% of all transactions back to all wallet holders in interest. Once a week we will be holding a lottery with a low entry cost allowing one luck winner to take home some BNB as the prize, 90% of the winnings go to the wallet that wins and 10% goes to the World Vision Foundation to place sheep in villages around the world where they are to be used as a necessity, here is the charity we use https://donate.worldvision.org/give/sheep. We have already went through a website refresh, integrated live streaming into the site for the community. Ownership of the contract has been renounced to a 0 address, and liquidity is locked with an plan to evaluate and re-lock the liquidity every 3 months. On our road map we have some cool things we are starting to work on the first being a rug check tool, this would allow users to connect their wallet to our webapp we would scan their assets look for time locked contracts and provide the unlock dates if no time locked contracts are found then it would be identified as a possible rug pull. The next thing we are going to be building is an NFT exchange where users will transact in SHEEP. I hope this is what you are looking for and we are very excited as owners and as the community to be listed on coin market cap!! We are also setting up a merchandise site where you can purchase sheeptoken gear!! check out our site at https://www.sheeptoken.cash","links":"https://www.sheeptoken.cash/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sheeptoken/logo.png"}