{"name":"Era7","id":"era7","symbol":"era","description":"Era7: Game of Truth is a metaverse-style TCG, developed on the Binance Smart Chain (BSC), which has been created by a team of core blockchain technicians and members of well-known casual game development companies. This is an addictive yet state-of-the-art card-trading game that uses a ground-breaking new gaming method. With the perfect combination of fighting and strategy, this game becomes thrillingly immersive and is split up into separate three-minute games. Players can combine the cards in their own card library in different ways to ensure that their deck is as strong as possible. They can play either PVE or PVP by deploying and placing cards. Different cards have different effects, and whether we’re talking about Common or Legendary cards, players will be keen to collect them all. Players will be tasked not only to watch their own deck but also to carefully observe the movements and positioning of their opponents. This provides the player with an incentive to practice and develop their in-game skills over time while receiving fantastic brain training akin to that received by chess players. Only, this training is manifested in skilfully using heroes to ride thousands out to the battlefield. Of course, in addition to the game being fun, each one of the player’s cards has its own value. Players can obtain high-value cards by collecting, fighting, trading, summoning or synthesizing certain cards. This is also one of the biggest charms of GameFi when compared with traditional games. Era7 will continuously update the game’s content, adding new cards, playing methods and battle passes to meet the continuous needs of players while generating revenue across the board. Early players of Era7 will enjoy dividends from the ecosystem. We have a reward mechanism in place for inviting friends and sharing the game. Era7 provides a whole host of profit models for individuals and organizations from a variety of backgrounds and vertical markets. E-sports is a core element of Era7: The game’s competitive ecosystem can be used by players who wish to place bets. Play to Earn: Era7 establishes an immersive gaming experience and a complete closed-loop economic system inside its metaverse. Era7: Game of Truth is a metaverse-style TCG. Different from ordinary games, Era7 combines NFTs, DeFi and the blockchain, transforming it into an international NFT-based GameFi experience. This really fleshes out the concept of ‘NFT + Gamification + DeFi’. The cards in the Era7 metaverse not only manifest as NFTs, so collect and appreciate in value on the blockchain, but also feature a range of playability within the game itself.","links":"https://www.era7.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/era7/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6f9f0c4ad9af7ebd61ac5a1d4e0f2227f7b0e5f9"}}}