{"name":"STACKS","id":"stacks","symbol":"stacks","description":"What is the STACKS project about? STACKS aims to be a respected store of value and DeFi banking system on the Binance Smart Chain where holders can park their idle crypto money and earn passive rewards in the form of BNB automatically sent to their wallets multiple times per day just for holding. What makes the STACKS project unique? STACKS utilizes a 3% tax on both buys and sells to power it's unique tokenomics. - 1.5% of all transaction volume is converted into the BNB rewards that are passively added to holders wallets. - 0.5% of the tax is automatically added to the Pancakeswap liquidity pool for chart stabilization and security for the holder base. - 0.5% of the tax is utilized for the \"True Burn\" mechanism burning tokens not to the traditional \"dead\" wallet, but instead to the 0x0 wallet, which eradicates the tokens from circulation and updates not only circulating supply, but also the individual holder percentage in real time. -0.5% of the tax is sent to the developer wallet, which transparently funds and compensates the development efforts. History of the STACKS project. The STACKS Token was officially launched on July 4th 2023 by a team dedicated to bringing a sustainable DeFi rewards yielding financial system to the Binance Smart Chain. What’s next for the STACKS project? Now that the STACKS Token has launched and contract has been verified, the project is focused on mass adoption and awareness efforts. The long-term goal is focused on said mass adoption, and ultimately a debit style card where STACKS can be converted seamlessly to Fiat currency for spending in various retail and real-world scenarios. What can STACKS be used for? STACKS on the Binance Smart Chain can be used for a store of value and financial system where the individual holder can potentially earn not only an ROI due to token price appreciation as with other tokens in the cryptocurrency space, but also potential passive income rewards based on the transaction volume of the token in a DeFi manner.","links":"https://stackbnb.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stacks/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x14220f5893e945eed36389905b991d6b972e04f0"}}}