{"name":"Crazy Tiger","id":"crazy-tiger","symbol":"crazytiger","description":"What is the project about? Crazy Tiger is a rapidly growing community with an ambition to infiltrate every household and provide you with X. It strives to become the most beloved and successful project by adhering to all market standards and surpassing all indicators. The community of Crazy Tiger is robust and supportive, encouraging each other to succeed. Unlike fraudulent projects that have eroded people's trust in the market, Crazy Tiger aims to restore this trust and ensure the safety of investors. What makes your project unique? Crazy Tiger is a token on the Binance Smart Chain that never stops growing through TRUE deflationary techniques and further income generation for its ecosystem. Crazy. One of the main issues cryptocurrency projects face is the lack of continuous volume. This problem dampens marketing and development during low-volume days/weeks or even months.Crazy Tiger solves this by hedging a portion of the marketing wallet into Yield bearing assets to generate additional income that can be used to develop further, Market, and in the future, reward holders with BSC through Crazy Tiger. History of your project. Crazy Tiger is a token on the Binance Smart Chain that never stops growing through TRUE deflationary techniques and further income generation for its ecosystem. Crazy Tiger launched on April 11, 2023 with Ten Septillion billion CRAZYTIGERtokens. What’s next for your project? Long Term vision is to dominate the metaverse ecosystem (CrazytigerVerse). In CrazytigerVerse, the platform envisions reducing the carbon footprint of a province managed within the global map created. What can your token be used for? Crazy Tiger aims to offer a variety of options to the users for improving their carbon footprints by using green energy and reducing carbon dioxide emissions, planting more trees, and helping to reduce and combat global warming.","links":"https://crazytigertoken.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crazy-tiger/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xedd52d44de950ccc3b2e6abdf0da8e99bb0ec480"}}}