{"name":"Xdoge","id":"xdoge","symbol":"xdoge","description":"XDOGE will help DOGE in the upcoming plans: 1. Farm plan XDOGE is cooperating with https://bunnypark.com/ to create a Farm pool for XDOGE holders and help DogeCoin establish a wide range of liquidity mining sites on BSC. After that, DogeCoin holders will be able to exchange DogeCoin to XDOGE at https://bunnypark.com/ at any time to earn additional liquidity mining profit. Users can also exchange XDOGE back to DogeCoin at any time. 2. Light Up Plan 2.1 XDOGE will officially start the “Interstellar DogeCoin & Interstellar XDOGE” NFT on https://xdoge.space/ to light up XDOGE project. Everyone will be able to use XDOGE to light up NFT at homepage. XDOGE that paid by users to light up the NFT will be used for Space Station project (check next plan below). 2.2 Light up New York Times Square Giant Screen As the most valuable decentralized token in the world, DogeCoin and XDOGE should be known and recognized by more people, which will be a long-term and meaningful process. Elon Musk, as DogeCoin father, should be respected for his contributions. XDOGE, as the purest heir of DogeCoin, should assist Elon Musk in advancing this process. We will light up giant screen for Elon Musk, DogeCoin and XDOGE in the most dazzling advertising space in the world: New York Times Square! 3. Space Station Plan Users who hold more than 200 million XDOGE will be invited to build Space Station and they will be required to pay a fixed amount of XDOGE. These XDOGE will be allocated by other users through the NFT lottery. At the same time, XDOGE that paid by other users to light up [Interstellar DogeCoin & Interstellar XDOGE] NFT will be evenly distributed to the members who build the Space Station.","links":"https://xdoge.space/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xdoge/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4c0415a6e340eccebff58131799c6c4127cc39fa","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x4c0415a6e340eccebff58131799c6c4127cc39fa"}}}