{"name":"BODA","id":"boda-token_binance-smart-chain","symbol":"bodav2","description":"\"BODA V2 is a deflationary DeFi token on the Binance Smart Chain. Allowing holders to automatically earn up to 19% in BUSD rewards just for holding! BODA V2 gives 6% $BUSD rewards directly back to holders from every buy, and a huge 13% in $BUSD Rewards from every sell order. BODA offers an easy-to-use dashboard for tracking BUSD dividend rewards. (https://bodatoken.app). (Please Note: A Minimum of 3 Billion tokens is required to start earning $BUSD rewards to ensure the token system cannot be manipulated or exploited. As a dividend reward system, the more tokens you hold the more you will earn.) 2% of every transaction is auto-burned. Making BODA V2 Token a hyper-deflationary token. An additional 1.5% in transaction fees is collected and manually burned each week to speed up the supply reduction process. The less tokens in circulation, the more rewards per token share each holder will receive – meaning there is more $BUSD earned per token. Reducing overall supply makes the token scarce and increases value in the long term. Full details on our tokenomics can be found on the main website - https://bodatoken.org A BODA Swap Exchange will be released by the end of Q1 2022. Allowing users to purchase BODA V2 tokens and other Binance Smart Chain tokens, as well as being able to purchase cryptocurrency with fiat using credit or debit cards. By the end of 2022 the BODA Swap Exchange will also cater for token purchases on the Ethereum, Solana, and Polygon networks. BODA Swap exchange is capable of avoiding slippage fees, providing users with more tokens per transaction. BODA Swap will also be listing Safemoon V2 and Baby Doge Coin upon launch, with many more token listings to come. A first of its kind Yield Farm for reward tokens is in development and should be realised in 2022. BODA Token has entered a new partnership with PINFT who will be launching their own NFT Marketplace on Binance Smart Chain in 2022. A lottery game and NFT Game will be released in 2022. A Token Minter, Token Locker and Governance Voting Platform will be designed to add to the BODA V2 ecosystem in 2022. BODA V2 is managed by a doxxed team primarily located in Australia, with experience in the cryptocurrency industry since 2016 and a strong focus on community and honesty. We encourage everyone to come join our vibrant BODA Discord Community Server - https://discord.gg/XMF4UctSnv\"","links":"https://bodatoken.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/boda-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xdc847755343c3a2b94d6afc0aae57651e1b14064","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xdc847755343c3a2b94d6afc0aae57651e1b14064"}},"is_native":false}