{"name":"tBTC","id":"tbtc","symbol":"tbtc","description":"What is tBTC? tBTC allows you to unlock your Bitcoin’s value to borrow and lend, mint stablecoins, provide liquidity, and much more. tBTC is a decentralized wrapped Bitcoin that is 1:1 backed by main-net BTC. Existing solutions bringing Bitcoin to Ethereum require you to send your Bitcoin to an intermediary, who then issues you an Ethereum token representing your original asset. This centralized model requires you to trust a third party and is prone to censorship, sacrificing Bitcoin's promise of secure, permissionless decentralization. How does tBTC solve this issue? Instead of centralized intermediaries, tBTC uses a randomly selected group of operators running nodes on the Threshold Network to secure deposited Bitcoin through threshold cryptography. That means tBTC requires a threshold majority agreement before operators perform any action with your Bitcoin. By rotating the selection of operators weekly, tBTC protects against any individual or group of operators colluding to fraudulently seize the underlying deposits. By relying on an honest-majority-assumption, we can calculate the likelihood any wallet comprised of a quorum of dishonest operators. An insurance backstop (the coverage pools), serves as an emergency fallback in the event a wallet is compromised. What is Threshold Network? Threshold.network stems from the merger of NuCypher and Keep networks into a single decentralized network — it delivers a suite of threshold cryptography services for web3 applications through a decentralized network of staking nodes. The whole community is governed by a DAO. Flagship services of Threshold Network include Threshold Access Control (TACo) – which enables end-to-end encrypted data sharing and communication without the need to trust a centralized authority, tBTC v2 - the only decentralized and permissionless Bitcoin-to-Ethereum asset bridge and thUSD - an overcollateralized and decentralized USD stablecoin that uses both ETH and tBTC as collateral.","links":"https://threshold.network/","market_cap":556025837,"market_cap_rank":146,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tbtc/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x18084fba666a33d37592fa2633fd49a74dd93a88"},"bob-network":{"decimal_place":18,"contract_address":"0xbba2ef945d523c4e2608c9e1214c2cc64d4fc2e2"},"hydration":{"decimal_place":18,"contract_address":"asset_registry%2F1000765"},"optimistic-ethereum":{"decimal_place":18,"contract_address":"0x6c84a8f1c29108f47a79964b5fe888d4f4d0de40"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x6c84a8f1c29108f47a79964b5fe888d4f4d0de40"},"base":{"decimal_place":18,"contract_address":"0x236aa50979d5f3de3bd1eeb40e81137f22ab794b"},"polygon-pos":{"decimal_place":18,"contract_address":"0x236aa50979d5f3de3bd1eeb40e81137f22ab794b"},"solana":{"decimal_place":8,"contract_address":"6DNSN2BJsaPFdFFc1zP37kkeNe4Usc1Sqkzr9C9vPWcU"}}}