{"name":"Flex Perpetuals","id":"flex-2_base","symbol":"fdx","description":"Flex Perpetuals is a decentralized perpetual derivatives exchange built on the Base chain, designed to revolutionize trading within the DeFi ecosystem. It offers traders the ability to engage in perpetual contracts with high leverage, up to 1000x, without the need for KYC, ensuring privacy and accessibility. The platform stands out with features like gasless trading, which eliminates transaction fees, cross-margin collateral management for efficient capital use, and multi-asset collateral support, enhancing trading flexibility. Flex Perpetuals focuses on providing a user-friendly, secure, and transparent trading environment, leveraging partnerships with entities like Aerodrome, Chain-link, and Pyth for liquidity and price accuracy. The project aims to democratize market making by allowing all investors to participate in liquidity provision through the Flex Liquidity Pool (FLP), where they can earn significant yields from trading fees. Additionally, Flex Perpetuals introduces innovative tokenomics with $FDX as its governance and revenue share token, offering community incentives and fostering a sustainable ecosystem. The initiative is geared towards creating a vibrant community with ongoing engagement through contests and governance participation, ensuring continuous innovation and growth in the DeFi trading space. It's for traders, built by traders. Beginner to expert, everyone can have a great time with the Flex ecosystem. It has a vision to make the base trading smooth and user-friendly. There will be educational content by the Flex team in the future.","links":"https://flex.trade","market_cap":1457517,"market_cap_rank":3303,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/flex-2_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xe248c0bce837b8dfb21fdfa51fb31d22fbbb4380","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xe248c0bce837b8dfb21fdfa51fb31d22fbbb4380"}},"is_native":false}