{"name":"Matrak Fan Token","id":"matrak-fan-token","symbol":"mtrk","description":"aming industry has warmly welcomed blockchain technology. Successful ventures have also created virtual economies that provide “play-to-earn” incentives to gamers like Axie Infinity. As an industry which has thrived to monetize screen-time spent by participants, many methods have been tried by start-ups and established firms. These include licensed software or “as-a-service” subscription models, merchandise including in-game item sales, branding based advertising revenue during in-game entertainment, price competitions, all of which intersect somewhat with a financial model. As much as blockchain technology has disrupted the financial services industry, gaming is most likely the second major one with both fungible and non\u0002fungible tokenization methods being experimented by a growing ecosystem of gaming industry start-ups. Matrak is a gamification platform that extracts economic value out of DeFi and distributes passive yield to gamers based on their performance. Trading of financial assets is a real-sector economic activity for stocks, bonds, commodities and derivatives. In the case of cryptocurrencies and utility tokens, this has given birth to the crypto-currency exchange industry. Crypto asset exchanges generate economic “value-added” from trading commissions, listing fees, withdrawal fees and other charges. Decentralized Exchanges (DEX) like UniSwap [5],[6] have extended the sharing economy to liquidity providers through which a passive yield from trade commissions are distributed. Matrak taps on this passive yield as an over-the-top (OTT) service built on existing DeFi platforms like UniSwap and rewards gamers with real cash-based returns.","links":"https://www.bitci.com/en/projects/MTRK","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/matrak-fan-token/logo.png","detail_platform":{"Bitcichain":{"decimal_place":18,"contract_address":"0x07c6ae17d4fe7952f62f90e6bafc6032a3efa2bb"}}}