{"name":"Enrex","id":"enrex","symbol":"enrx","description":"Enrex will enable: • Investing in a growing environmental market. • Offsetting your CO2 emissions directly by way of balancing them from one cryptocurrency for other cryptocurrencies and for real world use cases. • Trading mandatory carbon offsets and renewable energy certificates directly with cryptocurrency. Enrex is for: • Launching sustainable and CO2 neutral ICO/IEO/IDO on any blockchain. • Making any cryptocurrency transactions and mining, NFT, CO2 neutral or based on renewable energy. • Track transactions and cryptocurrencies for sustainability. By Elon Musk's account, climate concerns disqualify Tesla from accepting Bitcoin. Tesla CEO Elon Musk said the company will resume bitcoin transactions once it confirms there is a reasonable clean energy usage by miners. Bitcoin cryptocurrency consumes more electricity than the entire annual energy consumption of the Netherlands, Cambridge University researchers state. In renewable energy certificates and CO2 allowances directly from crypto. Enrex provides five application products that lets its users navigate the inner working of the Enrex ecosystem. Those applications are: Enrex Exchange - the secondary market for government-mandated renewable energy certificates and CO2 allowances directly via a $ENRX token; Enrex DEX v2 - users will be able to track all offsets on the blockchain, and it will be available to be accessed and checked by anyone within the ecosystem; Enrex Offsetting - Enrex decentralized application (dapp) will let you cancel/use your certificates and allowances by entering comments to provide the cancellation amount and the cancellation object (CO2 allowances or renewable energy certificates). For crypto transactions/ smart contracts / ICO/IEO/IDO/mining; Tracking Offsets on the Blockchain - users will be able to track all offsets on the blockchain, and it will be available to be accessed and checked by anyone within the ecosystem; Enrex Environmental API - will enable decentralized and","links":"https://enrex.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/enrex/logo.png","detail_platform":{"solana":{"decimal_place":2,"contract_address":"5s4BYUXLuvs9ZcVDTxkTpKhThWFSpaU8GG55q2iySe2N"}}}