{"name":"Varen","id":"varen","symbol":"vrn","description":"Our vision for Varen is to be an Ethereum based multi-chain DeFi hub, with a focus on bringing multi-chain services to retail DeFi users, powered by our DEX at varen.exchange. Varen, or Varenne originally, was considered the dark horse in trotter racing. Always coming up from behind, before eventually going on to become a legendary racing horse. This is our thesis at Varen: build quietly, focus on a long term sustainable ecosystem, and dedicate to building high quality code, an immersive user experience, and provide accessible information to push the defi user experience and user value forward. Varen is a rebrand of an old memecoin called YFL which has been taken over (via formal DAO processed) by a community team, rebranded and token migrated. We're currently transitioning out of supporting a DEX that lost the network effect wars and did not successfully carve out a niche. We're about to drop our first product in partnership with Ren, which will be a DEX-style swap UX for cross-chain for any ERC-20 renASSET supported chains (Dogecoin, BTC, LUNA, FIL, ZEC etc etc). It will allow you to convert any ERC-20 to any native asset Ren supports. So you visit a UI which looks like Uniswap, you can select any token in your wallet ie. $AAVE and you can swap $AAVE to real BTC on the BTC chain or real ZEC on the ZEC chain. The platform takes your $AAVE, converts it into $renBTC and burns $renBTC across the bridge into BTC all in a single transaction behind the scenes, where a retail user is simply connecting their Ethereum wallet, inputting their BTC address and swapping from ERC20 to real BTC. We even support BTC on BTC chain -> Dogecoin on Dogecoin chain in a single transaction using Ethereum as the bridge (BTC -> renBTC -> renDOGECOIN -> Dogecoin).","links":"https://varen.finance/","market_cap":107113,"market_cap_rank":4000,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/varen/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x72377f31e30a405282b522d588aebbea202b4f23"}}}