{"name":"would","id":"would","symbol":"would","description":"The \"Would\" meme, emerging in September 2022, represents a significant moment in internet culture through its simple yet effective format. The meme typically features various subjects - from animals to people - speaking or interacting with microphones, accompanied by the single-word caption \"would.\" While the original creator remains unknown, the first widely-circulated version showed a cat scratching its nose on a microphone. The format gained initial traction through X account x.com/reactjpg, but truly exploded in popularity when users began deploying it as a reaction to @mugshawtys' posts - a X account known for sharing attractive mugshots. The meme's implied meaning of \"would have sex with\" became its defining characteristic, though its usage expanded to include reactions to food, cars, and various other subjects through accounts like x.com/fuckedupfoods and x.com/fuckedupcars. One particularly memorable variant features the chaotic 2018 Japanese Parliament brawl photo, which became one of the most widely shared versions of the meme. Throughout late 2022, the format maintained strong momentum across social media platforms, with users creatively adapting it to various contexts while maintaining its core humor. The meme's cultural impact reached new heights when Elon Musk, known for his influential social media presence, tweeted about it twice on November 23rd and 24th, 2024. Declaring it his favorite meme, Musk's endorsement transformed what was already a popular format into a mainstream social media phenomenon, cementing its place in internet history. The \"Would\" meme's success lies in its versatility and simplicity - a single word carrying layers of meaning, from genuine appreciation to ironic humor, making it a perfect example of modern internet communication.","links":"https://wouldmeme.com/","market_cap":35228542,"market_cap_rank":1107,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/would/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"J1Wpmugrooj1yMyQKrdZ2vwRXG5rhfx3vTnYE39gpump"}}}