{"name":"Mutant Pepe","id":"mutant-pepe","symbol":"mutant","description":"What is the project about? Mutant Pepe is a memecoin project with a mission to become the next big Pepe memecoin. Our goal is to create a fun and engaging platform for the crypto community, where users can participate in farming/staking, collect unique NFTs, and influence the future of the project through governance tokens. By conquering one Pepe at a time, we aim to create a community-driven project that offers real value to its users. What makes your project unique? Our project is a unique memecoin that involves the new trend around the frogs. It is a mutated frog that has a lot of potential to be the next $PEPE. History of your project. - Successful fair launch on Pinksale 165.0976299212817 BNB Raised: https://www.pinksale.finance/launchpad/0xbC7675bEbB5AC8259Ba796AaEF3833bcA1321Fbb?chain=BSC - Achieved over 4x from launch in ATH - Volume, did over 275k volume within the first 5 days: https://www.dextools.io/app/en/bnb/pair-explorer/0xc4da2629bd707ff785e1a4e04d7d05e97c9ca51d - Review by big youtuber: https://www.youtube.com/watch?v=v303TEFnhko - Over 1300 members already and only 4 days since launch: https://t.me/TheMutantPepe - Reached a high audience in our Twitter Account: https://twitter.com/PepeTheMutant - Multiple partnerships: the first one is with PEPA INU: https://twitter.com/pepa_inu What’s next for your project? - Staking/Farming Implementation coming soon! - Swap DApp within our website implementation coming soon! - NFT Genesis Collection coming soon! - MEXc Listing coming at 2M market cap! - Collaboration with reputable crypto figures such as Eric Cryptoman, Dogen, Travladd, etc What can your token be used for? Our token will be the currency that will be used within the implementations mentioned above, it will be used for staking/farming, swap main currency to swap multiple tokens with out token, tokens will be utilized with the NFT Genesis Collection for greater APY in Staking/Farming.","links":"https://www.mutantpepe.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mutant-pepe/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x5b41028f250204fae2d96a8b1ffe33e2944dc9a6"}}}