{"name":"Kekius Maximusa","id":"kekius-maximusa_ethereum","symbol":"kekiusa","description":"This project is about Kekius Maximusa, Elon Musk's new character in *Path of Exile 2*. This is the continuation of his previous character, Kekius Maximus, which Elon Musk played in the original *Path of Exile*. Starting from April 4th, Elon Musk will be going live again, marking a new chapter in his journey as Kekius Maximusa, and we have created a meme to support both Elon and his character on this exciting, long road ahead. Elon Musk, known for his ventures in space exploration, electric vehicles, and even the realm of artificial intelligence, has always had a knack for bringing unexpected fun and excitement to his followers. *Path of Exile 2* provides him with a new platform to engage with his fans in a fresh and interactive way, offering an entertaining blend of gaming and personal branding. By resurrecting Kekius Maximus in the form of Kekius Maximusa, Elon is taking fans on another adventure, and it’s one that promises to be filled with challenges, victories, and lots of laughs along the way. Kekius Maximus, Elon’s previous character, was an iconic part of *Path of Exile*'s community, known for its humorous and occasionally absurd interactions with other players. With the release of *Path of Exile 2*, Elon’s decision to continue this legacy through the new iteration of the character, Kekius Maximusa, shows his commitment to both the game and its community. The transition from one character to the other symbolizes growth, adaptation, and the endless possibilities within the *Path of Exile* universe. As Elon goes live again on April 4th, the gaming community eagerly anticipates his return, eager to see what new adventures and memes will come from his online persona. To celebrate this momentous occasion, we’ve created a meme that pays tribute to Kekius Maximusa and the excitement that surrounds this next chapter in Elon Musk’s gaming journey. This meme is not just about the game—it’s a way for fans to join Elon on his epic quest, showing their support for his character and the world of *Path of Exile 2*. In the coming months, as Kekius Maximusa embarks on this long journey, we look forward to seeing how this story unfolds. With Elon Musk leading the charge, we can expect plenty of entertainment, humor, and perhaps even some unexpected twists along the way.","links":"https://kekiusmaximusa.com/","market_cap":9947.77,"market_cap_rank":11189,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kekius-maximusa/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x7ee089ebb18771caf5bf483a4ee49c4de04295f2","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x7ee089ebb18771caf5bf483a4ee49c4de04295f2"}},"is_native":false}