{"name":"SENSO","id":"senso","symbol":"senso","description":"What is the project about? What is Sensorium? SENSO token is the in-platform currency of Sensorium Galaxy, a social VR platform that aims to rethink the way people interact with each other and experience the arts. ERC20 SENSO token drives all value transactions within Sensorium Galaxy, an alternate universe that is being built in partnership with artists, producers, and entertainment companies. Sensorium Galaxy will go live in H1 2021. The technology was first introduced to the public in 2019 at the Electronic Entertainment Expo (E3) in Los Angeles. Sensorium expects to attract over 1,8 million users by the end of 2022 who would pay for access to the content exclusively with SENSO tokens. About Sensorium Corporation Sensorium Corporation oversees the technological and business development of Sensorium Galaxy. The corporation supplies Sensorium Galaxy with events and experiences through global content partnerships. Sensorium’s management team claims that technological collaboration and strategic partnerships are always directed towards the attainment of Sensorium’s most relevant contribution to the virtual reality landscape—to make it fully social. What makes your project unique? History of your project. Founded in 2018, Sensorium is a Swiss company and a leading metaverse developer, leveraging cutting-edge XR and AI technology to deliver next-generation virtual experiences in entertainment and social interaction. The award-winning Sensorium Galaxy metaverse project, the company’s flagship product, is currently the only global VR multiplayer platform that immerses users into multi-sensory experiences in virtual worlds, across content hubs of various forms. What’s next for your project? What can your token be used for? SENSO Use cases: https://sensoriumxr.com/articles/senso-tokenomics-update","links":"https://sensoriumxr.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/senso/logo.png","detail_platform":{"ethereum":{"decimal_place":0,"contract_address":"0xc19b6a4ac7c7cc24459f08984bbd09664af17bd1"}}}