{"name":"Chooky Inu","id":"chooky-inu","symbol":"$choo","description":"CHOOKY INU is a hyper deflationary, NFT, and meme driven cryptocurrency ecosystem that has never been seen before in Defi. It launched on the Ethereum network, December 2022. Chooky enhances the power of the community meme appeal and brand to act as the driving force for the token. $CHOO CHUNES is going to be our Music NFT platform and we are producing an Anime TV series with our DAO. Our exclusive NFTs are initially split into six different categories: Raider, Staker, Gamer, Anime, Multichain Special Edition and Music (more will be explained on each of these NFTs in the \"Marketing and Development\" section). There are plans to deliver more NFT collections in the future. The Raider NFTs have a referral mechanism that allows the buyer to receive tax back on their purchase of $CHOO tokens and the referrer to receive $CHOO tokens too. Win, win. We then have staking NFTs which will allow for high yielding APY for holders. Anime NFTs which will have input and direction into the anime series that is currently in preproduction(early access to the website and voting in the DAO). Gamer NFTs, which allow for a skin in partner metaverse games. Multichain NFT, where we onboard influencers, celebrities and ambassadors to endorse their own NFTs. There will also be music NFTs and a music NFT marketplace, where artists upload content and receive royalty shares. The NFTs, upon initial mint and resale offer a % of rewards from our NFT royalty sharing protocol in Ethereum (7% of each sale goes to the rewards pool for $CHOO holders, please note you need to hold a minimum amount of $CHOO tokens to qualify for these rewards). We have a tiered system for our token holders, the more $Choo you hold the higher the rewards payouts in Ethereum. The NFT royalty sharing protocol for our token holders will be a constant passive earning feature for our holders which will apply to every NFT that’s sold. The supply is constantly decreasing with a big percentage of the taxes going toward","links":"https://chooky-inu.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chooky-inu/logo.png"}