{"name":"moonthat coin","id":"moonthat-coin","symbol":"moonthat","description":"Our mission is simple yet powerful: \"Moon that!\" This phrase embodies the heart of our vibrant and loving community. We are united by a shared vision to uplift and empower everyone to achieve their fullest potential. At the core of who we are is a desire to see every individual succeed, no matter their background, goals, or challenges. Together, we are committed to building a world where positivity reigns, and dreams come true. We firmly believe that optimism and good vibes can change lives, and we work tirelessly to spread that energy far and wide. Every interaction, message, and action is rooted in kindness and encouragement, creating a ripple effect of hope and inspiration. Through our signature phrase—\"Moon that!\"—we aim to remind everyone to dream big, take bold steps, and never let fear or doubt hold them back. This is more than just words; it’s a call to action, a way of life, and a mantra for success. \"Moon that!\" is more than a phrase—it’s a movement. It’s about looking at every challenge as an opportunity to rise higher. It’s about refusing to settle for less than what you deserve and striving for greatness in every aspect of life. When you say \"Moon that!\" you’re declaring your commitment to pursuing your passions, supporting others in their journeys, and believing in the power of a united community. Our community is a safe space for people from all walks of life to come together, share their dreams, and find the support they need to make those dreams a reality. Whether you’re reaching for personal goals, professional success, or simply looking for motivation to keep going, you’ll find it here. Together, we celebrate victories big and small, learn from setbacks, and cheer each other on every step of the way. So let’s take this journey together, lifting each other up and spreading positivity wherever we go. Let’s embrace the power of optimism and the strength of a supportive community. Let’s dream, create, and achieve—together. And most importantly, let’s always remember to \"Moon that!\" Now is the time to rise above and make great things happen. Let’s join forces, share our light, and MOON THAT!","links":"https://moonthat.world/","market_cap":9635.74,"market_cap_rank":9597,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/moonthat-coin/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"5gGmuUZfpEYBzyTsNMXnuRtVPacocHzFjyUWxZ4Npump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/5gGmuUZfpEYBzyTsNMXnuRtVPacocHzFjyUWxZ4Npump"}}}