{"name":"Chronos Finance","id":"chronos-finance_arbitrum-one","symbol":"chr","description":"Chronos is a decentralized exchange (DEX) on the Arbitrum network that aims to become the native liquidity layer, fostering value creation for all participants. The exchange introduces a unique model that rewards early supporters and maximizes community engagement by launching a limited edition Non-Fungible Token (NFT) collection, The Lost Keys of Chronos. Which comprises 5,555 individual pieces, each offering holders access to stable, real-yield revenue streams. Sale proceeds from these chrNFTs will provide initial liquidity for CHR upon its launch on the Chronos platform. The Lost Keys of Chronos collection is at the forefront of NFTfi (NFT finance) with a diverse stream of revenues. Chronos also introduces maturity-adjusted liquidity positions, maNFTs, which earn boosted CHR emissions over time. After 6 weeks, the rate at which these maNFTs increase their earning potential will level off and continue earning rewards at the boosted rate until the user chooses to withdraw their liquidity. Users can also sell their maNFTs on a secondary marketplace for a premium to the underlying assets. This means Chronos will be able to retain liquidity over time. The Chronos flywheel is a powerful, self-sustaining cycle that drives the platform’s growth and enhances its liquidity. As the flywheel gains momentum, it becomes an unparalleled source of liquidity. Chronos has introduced the concept of maturity-adjusted LPs, which enables us to create “sticky” liquidity, ensuring that liquidity providers are adequately rewarded and incentivized to maintain their liquidity position during times of price volatility. The maturity-adjusted LPs mechanism revolutionizes the Chronos flywheel by ensuring that liquidity remains on the platform, allowing the counter-cyclical effect (price down = APY up) to take place and stabilize the CHR token price.","links":"https://chronos.exchange/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chronos-finance_arbitrum-one/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x15b2fb8f08e4ac1ce019eadae02ee92aedf06851","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x15b2fb8f08e4ac1ce019eadae02ee92aedf06851"}},"is_native":false}