{"name":"Feathercoin","id":"feathercoin","symbol":"ftc","description":"Feathercoin (FTC or ₣) is an open source cryptocurrency, published under the license of MIT / X11.1, based on the <a href=\"https://www.coingecko.com/en/coins/litecoin\">Litecoin</a> protocol. On 16 April 2013 Feathercoin successfully forked from Litecoin by the creation of its genesis block. As a cryptocurrency, creation and transfer of coins is based on an open source cryptographic protocol (the blockchain) and is not managed by any central authority. The hashing algorithm chosen for Feathercoin was the Proof-of-Work NeoScrypt, which had premiered on Phoenixcoin. <a href=\"https://www.coingecko.com/en?hashing_algorithm=NeoScrypt&view=market\">NeoScrypt</a> is 25% more memory intense, which makes it less feasible to create ASICs for it. The main programmer is Peter Bushnell, at the time running the information technology for the Brasenose College of Oxford University. He explained his motivation for developing the coin in an interview with Vitalik Buterin. One month after launching Feathercoin, Peter Bushnell left his job as head of IT at the Brasenose College of Oxford University and lived off his Litecoin savings. Feathercoin was launched on 16th April 2013 and as developed by Peter Bushnell. It was forked from Litecoin, with the aim of making Feathercoin what Litecoin was supposed to be: a faster, more secure, and stable version of <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a>. The consensus mechanism is based on the Proof of Work (PoW) concept. The Feathercoin network runs on the NeoScrypt hashing algorithm, making it much easier and faster to mine. Feathercoin enjoyed rapid adoption by users soon after its launch, gaining immense popularity, and establishing itself as a worthy contender in a BTC/LTC dominated market. Feathercoin can be mined using either processors (CPUs) or graphics cards (GPUs). Due to the hashing algorithm of FTC, it cannot be mined with an ASIC card. Mining software is available for download at their official site. Wallets for FTC can be found over at their official website, including both desktop and mobile wallets.. While the paper money you are used to carrying around is (or can be) stored in a physical wallet, cryptocurrencies, like all digital currencies, have to be stored in a software-based digital wallet. Although you will find links to feathercoin wallets throughout the web, the only safe way to know that you're downloading the latest and correct version is by scrolling to the bottom of the coin's official home page and selecting the button for your particular operating system. Feathercoin wallets are available for Android, Linux, macOS and Windows platforms.","links":"http://feathercoin.com/","market_cap":3392509,"market_cap_rank":2177,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/feathercoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}