{"name":"Talent","id":"talent","symbol":"tnt","description":"Talent TV is a blockchain-based Christian content service platform. We aim to be a major Christian content hub, a brand new Christian platform using blockchain technology that adds depth and breadth to the faith of Christians. In the past, it was difficult to exchange between small and medium-sized churches, and it was difficult to participate in the church community without attending worship services.Through the Talent TV platform, we lower the barriers to entry to the church, induce the participation of non-Christians who are interested in Christianity, and build an online community so that they can easily participate in the community in the church. In addition, it forms a network between small and medium-sized churches that have been disconnected and enables flexible collaboration among ecosystem participants with the same purpose within the faith, such as churches, religious organizations, non-profit organizations, and media production companies, through the blockchain ecosystem. Talent will build a blockchain-based trading and payment system in the platform to resolve traffic issues that can be caused by a large number of downloads of huge videos or audio files or a high increase in the number of users, protect the copyright of the content via Smart Contract and secure the safety and transparency of the trades on the Talent Store with the distributed ledger. TNT Tokens and TNT Points are used as a measure for exchanging values and rewards. TNT Token is used as the basic payment method for all trades made on the platform, TNT Tokens purchased on the exchange can be exchanged for TNT points via TNT exclusive wallet that is to be developed in the future, and the users can use exchanged TNT Points to purchase charged services on the platform.","links":"https://talent-tv.io/index_en.html","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/talent/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6692de64716a177c15360d8d010bc522bbc530a0"}}}