{"name":"Cowrie","id":"cowrie","symbol":"cowrie","description":"COWRIE is a blockchain-based international utility gifting token, built as a cornerstone of South Africa’s digital economic recovery plan. The COWRIE is a COBRA initiative developed for the benefit of the upliftment of local people and the development of their local communities within South Africa. The COWRIE initiative, which combines legal, with blockchain and mobile as core technology, places much-needed community upliftment income directly into the hands of the people or projects they are intended for from all around the world – whilst ensuring radical transparency. Blockchain gives us a way to track every transaction made in a network and avoids corruption or irresponsible spending, whilst mobile gives us reach into all the unpenetrated areas where communities are underdeveloped due to financial constraints or demographical challenges. Meet COWRIE The vessel to unlock endless possibilities in the digital realm. When Schindlers Si (Schindlers Innovation) attorneys and Virtual Nation Builders were approached to develop the COWRIE project, the primary concerns of the COWRIE project were not only to ensure that our grassroots citizens benefit from this initiative but to also find a way to uniquely safeguard all South Africans from loss in their initial purchase of COWRIE tokens to contrast a world where crypto scams are rife. Being the leading blockchain attorneys in South Africa, it was important that Schindlers Si Attorneys were specifically appointed to therefore provide professional oversight over an incorruptible trust (founded on radical transparency) created to fund community-based projects. In addition, Schindlers Si attorneys were also appointed to manage the escrow arrangement to ensure a money-back guarantee of a full refund for all purchases of COWRIE during the ICO VIP launch sale. Legal and Blockchain join forces Despite its disruptive solutions, tokenized blockchain projects have not been able to fully harness their potential due to a l","links":"https://community.mycowrie.org/","market_cap":694,"market_cap_rank":7508,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cowrie/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xde51d1599339809cafb8194189ce67d5bdca9e9e"}}}