{"name":"Cats Coin (BSC)","id":"cats-coin-1722f9f2-68f8-4ad8-a123-2835ea18abc5","symbol":"cts","description":"Cats coin is a community-driven token based on a meme with a big dream and was created by Osaka Yona for the cat community We are working to deliver this token to the Moon so that it can compete with the tokens of the first class and we aspire to make our token the first among the Meme Coins Cats Coin is a meme driven coin issued on the binance smart chain,that follows the example of other successful Shiba coins like Shiba inu, Floki inu. we also are planning on reaching a value of 100 million Marketcap • The core of Cats Coin is to bring competitive player vs player(pvp) gamers to the crypto community • Due to the crypto gaming scene being dominated by [ Pay To Win] and [ Pay To Earn] Games. • Cats Coin is unique in the sense that we’ve designed the project in such a way that’s its both. • Rewarding and fun so that you will wager your coins and increase your holdings of the coin. • While at the same time having fun, We will be supporting NFTs at launch.with the ability to buy,sell and trade within the game’s marketplace. • We offer NO [pay to earn] or [pay to advance] microtransaction. • the playfield is leveled for all game’s participants Our currency contains the feature of reflection that brings investors their own token from any other buying and selling process in the currency We have created this token after careful consideration of all the other tokens, and we have chosen this distinctive cat to express our goals, and one of the goals of the coin is to establish a hospital to care for cats in poor countries. In addition to establishing a special school for children with autism, and the name of the school bears the name of our token","links":"https://cats-coin.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cats-coin-1722f9f2-68f8-4ad8-a123-2835ea18abc5/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa5331bb3a3f1e1cb98ba8160176569ac0a80e61d"}}}