{"name":"BeFaster Holder Token","id":"befasterholdertoken","symbol":"bfht","description":"BeFaster.fit is a decentralised fitness and lifestyle application that connects the sports world with the crypto world. The stated goal is to increase general crypto-positivity and to get the world's population moving and reward them for it. The sports app is designed as a game and offers a single-player mode where users can increase their own performance and health. In addition, it also offers a multiplayer mode where competitions with other users are possible in dual and multiple variants. The multiplayer mode is possible both in the national currencies and in cryptocurrency. However, the use of a cryptocurrency in challenges or tournaments is more lucrative for the user. In a simple and playful way, BeFaster.fit motivates its users to engage with the crypto world and thus be prepared for the future. BeFaster.fit has implemented two BEP-20 tokens. The PAID (Personal activity internal distribution) is the InApp token and the BFHT (BeFasterHoldertoken), which is considered as an investor token. According to the BeFaster.fit protocol, all BFHT holders can stake their BFHT and participate in the Staking Pool distribution. 50% of the companies revenue are transferred to the Staking Pool and distributed to the staked BFHT on a daily or monthly basis, depending on the source of revenue. Long term stakers receive additional Staking Rewards. Following the BeFaster.fit Multi Currency Option, each holder can decide in which cryptocurrency they would like to receive their personal payout. The distribution can be made in BFHT or other major coins. The name BeFaster.fit describes the principle of the Dapp. The algorhytms developed especially for the app, the anti-cheating and the self-learning mechanisms put the fairness and equality of sporting performance in the foreground. The DApp is available to the public since 14. August 2022.","links":"https://www.befaster.fit/en/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/befasterholdertoken/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x577ad06f635b402fc2724efd6a53a3a0aed3d155"}}}