{"name":"SupplyCon","id":"supplycon","symbol":"splc","description":"Supplycon is a combination of supply and continuity, which contains the future value and will of project developers and foundations to ensure continuous and stable supply of core minerals. Normalizing the distribution of strategic minerals, securing economy by profitability analysis, transparent operation of distribution channels, value calculation through accurate cost analysis, economic life evaluation of mining points, safe mineral management and commercialization, and maintenance of global distribution order are essential factors in the strategic mineral market. Although mining methods, cost calculation, product and refining processes, and commercialization processes are needed for each mineral, it is true that uniform management and transaction methods that do not fit the characteristics of each mineral have been introduced. Since each mineral has its own unique mineral, market, and chemical characteristics due to different uses, values, casting methods, refining, and mining methods, it is necessary to separately mine, safely manage, transact, calculate cost and evaluate economic value. Supplycon advocates the 'Global Strategic Mineral Supply Chain', which is optimized for the characteristics of these minerals. The key elements of the success of the global mineral supply chain are information accuracy, irreversibility, transparency, and non-forgery. Refined information should be accurately classified according to global trading standards without any hacking threats and provided to buyers in a timely manner to make the fastest and most accurate economic decisions. With a solution that can meet these needs 100 percent, Ethereum, the most reliable ERC20, is used as a critical blockchain and dual-chain DB and platform operations utility in more than 200 countries around the world, completing the most ideal blockchain-based global strategic mineral supply chain.","links":"http://supplycon.io/index_eng.html","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/supplycon/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbe7a4f88c6b15a722aa960b487badf9880184ec5"}}}