{"name":"Morse","id":"morse_solana","symbol":"morse","description":"Welcome to the encrypted frontier — where silence speaks, and meaning must be earned. In a world overwhelmed by noise, we’ve chosen a different path: one where communication is no longer instant, but intentional. At the heart of our project lies a timeless language — Morse code — reborn for a decentralized age. Every dot and dash carries value. Every sequence is a challenge. Every solution brings you closer to the truth… and the reward. This is Decrypt to Earn (D2E). We’re not just building a protocol — we’re crafting an ecosystem where knowledge, curiosity, and precision are the currency of the future. Messages are no longer free—they are encrypted, coded, hidden in plain sight. Only those willing to engage, to focus, to decode, will reap the benefits. Each interaction becomes a mission. Each transmission, a riddle. Each solution, a step toward value creation. Powered by the Solana blockchain, our system is fast, trustless, and fair. Users are invited to participate in cryptic challenges—some visual, some audio, some embedded in the very protocol. Whether you’re decoding secret tweets, hunting hidden wallet keys, or solving layered visual puzzles, the principle remains the same: engagement equals reward. We call it encrypted communication with purpose. Others will call it the future of on-chain interaction. But this isn’t just for developers or crypto natives. It’s for anyone who still believes that discovery matters, that truth should be uncovered, not fed. It’s for creators of mystery, and solvers of the unknown. It’s a space where lore meets logic, and the blockchain rewards those who read between the lines. And most importantly — it’s a game. A hunt. A living experience. No two messages are the same. No two minds will decode the same way. This is D2E: Decrypt to Earn. The value is hidden. The reward is real. Will you understand before the others?","links":"https://morsesol.xyz/","market_cap":6256.55,"market_cap_rank":12024,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/morse_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"6FsxGihJiV5CeP87Bw9ADF85gHt4JcNmiWPAsL7YbZdf","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/6FsxGihJiV5CeP87Bw9ADF85gHt4JcNmiWPAsL7YbZdf"}},"is_native":false}