{"name":"Perseid Finance","id":"perseid-finance","symbol":"ped","description":"Perseid Finance is a highly intuitive profit strategy platform designed for all your DeFi investments, aiming to minimize correlation with the general market. Every form of profit in Perseid is calculated based on the funds you inject. At Perseild Finance, both your profit earning and assets are visualized and decentralized. Asset positioning is stable with minimal impermanent loss. Perseid Finance invests a significant amount of assets and places high importance on security. Perseid has an open and experienced development team, as well as an open bug bounty system (with bounties of up to 20,000 USD). Automated yield farming bot: Perseid Finance provides individuals with automation bot that were previously only available to certain institutions. It is also a capital protection bot denominated in USD, protecting your assets 24/7. Strategy monitoring bot: Perseid Finance monitors the ever-changing market conditions and utilizes bots within its ecosystem to execute pre-configured strategies, ensuring users' profits remain at the highest level within the Scroll ecosystem. Simple and easy cross-chain accessibility: Perseid Finance can quickly operate on other EVM-compatible blockchains, aiming to interact with other blockchains , and users can earn profits from cross-chain platforms. 100% secure collateralized loans: One of the key features of Perseid Strategy is its ability to achieve under-collateralized loans and improve capital efficiency. This is achieved by using LP tokens of the position as collateral in its contracts. By doing so, Perseid Strategy effectively protects itself from potential risks caused by underwater positions and minimizes the risk of bad debt.","links":"https://www.perseid.finance/Home","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/perseid-finance/logo.png","detail_platform":{"scroll":{"decimal_place":18,"contract_address":"0xfec65bfb6e5bbcc9ab8ae98f62a8aab2ea51c495"}}}