{"name":"Synergy Land Token","id":"synergy-land-token","symbol":"sng","description":"Synergy Land is a Web3 multiplayer ARPG inspired by popular games, such as Diablo and Path Of Exile, the game aims to combine the best of these worlds, with a game-first vision where regular and hardcore players will enjoy an excellent gameplay experience as well as an ecosystem for players who want to collect and trade NFTs, giving the community true ownership of their digital assets. The player will take on the role of a hero, exploring dungeons in a great adventure against very powerful creatures and other players, using a dynamic skill system that will allow players to combine spells and items creating synergies between them thus generating a rich and evergrowing in-game economy through their game store and marketplace. Driven by a game-first mentality, we are committed to prioritizing the player's experience above all else. We focus on crafting engaging narratives and immersive gameplay. We are uniquely positioned to bring unprecedented quality to the Web3 gaming ecosystem. We leverage decentralized technology to give players greater control and ownership in our games. This includes everything from player-owned assets to transparent and fair game economies. Synergy Games is a game development studio established by professionals with more than 16 years of experience in the video game industry. The team has worked for companies such as Ubisoft, 2K Games, MercurySteam, Ilion Studios, Konami, Nintendo, Riot Games... and on popular IPs such as Assassin's Creed, Metroid, and Castlevania Lords of Shadow. SNG will have lots of utilities within our ecosystem such as: Governance token of Synergyland Serves as currency for Crafting and Tavern Webapps Required for Marketplace Purchases and Crafting Activities Caters to Land Taxes and Breeding Fees Used for Dungeons Fees Offers Special PVP Ranking Rewards What’s next for your project: NFT Land Sale on June 2023 Synergy Land: Early Access release on July 2023","links":"https://www.synergyland.live/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/synergy-land-token/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xad9f61563b104281b14322fec8b42eb67711bf68","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xad9f61563b104281b14322fec8b42eb67711bf68"}}}