{"name":"Regent Coin","id":"regent-coin","symbol":"regent","description":"What is the project about? Regent is a simple utility token created with an existence on Binance Smart Chain! As the name suggests, this token encompasses the entire crypto universe in one circle. It can be used to transact directly among the users. It is available on DEX and CEX platforms. The token has been curated in such a way that it solves multi purposes in one go! The primary function being paying for different kinds of transactions flawlessly. Regent is not restricted to any particular domain, it can be utilised for all sorts of online payments. What makes your project unique? Regent coin is the most trending utility token! It has dealt with the major issues of distinguishing between utility tokens and normal tokens very well. By putting across all the points and properties of basic utility tokens and compiling them all into the most profitable results of the crypto world, Regent has simplified the whole utility coin scenario for you. History of your project. Regent coin launched on PinkSale at a price of 10 cents on Nov 11, 2022 (9:00AM GMT), and sale ends on Nov 18, 2022 (9:00AM GMT), Acceptable currencies is BNB and the token for Sale is 29,00,000 REGENT, anyone can buy REGENT COIN on the top cryptocurrency exchanges for trading in REGENT COIN stock are currently LBank, Coinsbit, and PancakeSwap v2 (BSC). Also in its journey, it touched the rate of 6$+, and also our project is audited by CertiK What’s next for your project? Our forthcoming strategy involves leveraging Regent for seamless transactions on various e-commerce platforms, enabling users to purchase goods, book tickets, order food, and much more. Additionally, we have ambitious plans to introduce our proprietary crypto ATM and establish our own blockchain network, among other endeavors, as part of our broader objectives. What can your token be used for? Our versatile Regent token holds universal utility, spanning from seamless bill payments to convenient ticket booking.","links":"http://www.regentcoin.finance/","market_cap":383790,"market_cap_rank":4875,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/regent-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4ffa143ce16a24215e8df96c0cef5677a7b91ee4"}}}