{"name":"Broovs Projects","id":"broovs-projects","symbol":"brs","description":"What Is Broovs Project (BRS)? Broovs Projects (BRS) are human and user-oriented projects established by Academics. Broovs Projects is an ecosystem that aims to share its revenues with users, does not share users' information with third parties, and is integrated with social media platforms within the project. It works on the mechanism of directing users and advertisers to useful channels and content. Broovs Projects (BRS) is the native utility token used for: With Broovs search engine, it provides the user with the most useful information in the fastest way, https://broovs.com With Fanmeter tv, it scores the phenomena and provides the most accurate content from the most useful user, https://fanmeter.tv Correspondence and conversations with Swift Messenger allow safe data transfer and information exchange without sharing them with third parties, https://swiftmessengerweb.com Working with the PoS algorithm, Broovs Project creates an ecosystem that ensures data storage, storage, sending, backup and security with XRAY Blockchain. https://raychain.io Broovs Project mediates the listing and offering of secure projects with CoinSwifter Exchange and SafeCoinList Projects. https://coinswifter.com Allows BRS to be swapped, staked and securely stored with the Broovs.io Wallet application. https://broovs.io How Many BRS Coins Are in Circulation? Broovs Projects launched its mainnet on April 06, 2021 with 11 billion BRS tokens created at the time of formation. By burning 9.5 billion tokens on 31.01.2022, the total supply was reduced to 1.5 billion and the transition to the BSC network was achieved. There are 350,000,000 BRSs in circulation. Who are the Founders of Broovs Projects? Broovs Projects was established by Konya Technical University Engineering Faculty Academicians in 2021 at Teknokent Technology Development Center. All of the founders are people with extensive experience in programming. Broovs Projects employs more than 30 staff, including academics, interns and experienced developers. Detailed information with the main team is given on the official website of Broovs Projects.","links":"https://broovs.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/broovs-projects/logo.png"}