{"name":"Betted","id":"betted","symbol":"bets","description":"What is the project about? Betted casino is a Fiat and multi-blockchain poker, casino and sports betting company with a mission to become the largest Crypto & Fiat full-stack casino platform and be the benchmark for crypto casinos globally. Betted casino will cover the three most popular segments in the gaming world: casinos, poker, and sports betting. Focusing on the Crypto world without neglecting to play and/or bet with Fiat money as well What makes your project unique? Our Casino let people to play in local money and also with any chain as BTC, LTC, ETH, etc. Also we can include any community token. Our tokenomics let the people get rewards from casino revenue with staking process. Bring the best of two worlds: cryptocurrency and Casino-Slots, Sportbets and Poker Wide range of games including Hold’em, Omaha, Stud, Razz, Chinese and Open Face Chinese poker, and more. We can integrate any cryptocurrency, accept and convert Bitcoin, Ethereum, XRP, Litecoin, etc. or we can add your own token into a poker room to play with your community. History of your project. The idea was born a few years ago when several members of our team, who played poker, started \u001firting with the blockchain in 2015. Now, after months working and creating important alliances with poker, casino and betting software companies, we are ready to launch this great project. Bring the best of two worlds: cryptocurrency and Casino-Slots, Sportbets and Poker Wide range of games including Hold’em, Omaha, Stud, Razz, Chinese and Open Face Chinese poker, and more. We can integrate any cryptocurrency, accept and convert Bitcoin, Ethereum, XRP, Litecoin, etc. Also we can add your own token into a poker room to play with your community. What’s next for your project? Launch the token with full accesible platform on html5-web3, windows-mac, android-ios. Special tournaments What can your token be used for? 1. To play on poker tournaments, casino games and sportbet 2. Staking for Revenues and for tickets","links":"https://betted.gg","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/betted/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3bcea5a1612f50e5aad16b741ac473e4679daa2c"}}}