{"name":"Lord of Dragons","id":"lord-of-dragons","symbol":"logt","description":"Lord of Dragons (LOD), a 3D MMORPG, offers NFTs and Play-to-Earn mechanics optimized for mobile devices. The game emphasizes player experience, boasting stunning graphics and a dual-token economy. Prioritizing sustainability and engaging P2E gameplay, LOD attracts users seeking immersive, rewarding experiences in a thriving ecosystem. Lord of Dragons excels as a unique Play-to-Earn game with various activities, including dungeons, boss fights, PVP duels, and 500-player guild sieges. Promoting group play, LOD incentivizes teamwork and offers customizable battle experiences through class selection, weapon allocation, and party combinations. The medieval fantasy narrative entices exploration while outstanding graphics heighten immersion, making LOD an exceptional gaming experience. Developed by an experienced game studio, Sotem Mobile, Lord of Dragons gained dedicated 60k followers on Twitter and 35k on Discord after its announcement in early 2022. The open beta test in Q4 2022 drew 15k active user wallets worldwide. In Feb 2023, LOD's governance token, $LOGT, listed on Poloniex, quickly became the top gainer, gaining global attention from eager traders. The next phase elevates gaming experiences for fans, leveraging open beta feedback. LOD's team addresses bugs for seamless gameplay while organizing the Beny Mystery Box NFT collection debut. With NFT sales, the game officially launches, immersing players in LOD's enthralling world. The team focuses on community expansion and ecosystem growth through consistent, engaging content updates. Players earn and spend LOGT and LORT tokens for diverse purposes. LOGT, a governance token, empowers top players in decision-making on game policy. LORT, a reward token, is earned through daily quests. Both tokens can be used to cash out or purchase items, boosting characters and fostering a thriving in-game ecosystem. This dual-token system incentivizes players, driving the game's continued growth and success.","links":"http://lordofdragons.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lord-of-dragons/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xba58444c8050ed9385b7417533a73644036d21eb"}}}