{"name":"3 Kingdoms Multiverse","id":"3-kingdoms-multiverse","symbol":"3km","description":"What is 3KM? 3KM is evolving into a governance token that is the basis of a multi-game platform ecosystem where various co-exist. The first game, Three Kingdoms Multiverse, will be published and serviced. Our Ecosystem will be expanded as time goes. We are building a Klaytn-based ecosystem through an agreement with ISKRA and are open to linking with various partners participating in ISKRA and Klaytn foundation. Our team wants to take on the challenge of changing the world. Believing that Play to Earn is not simply about making money through play. But about building a self-sustaining eco-system through cooperation with all members of the eco-system. The self-growth ecosystem we think of means is an eco-system where blockchain is used to independently produce and consume. To this end, we want to overcome the inflation caused by infinite token mining by adding usage(burning) and granting production authorization to the users in the game not just by limiting them with the reward system limited to acquiring simple tokens, this would make it possible to build a fair system that all users can run the ecosystem together. Our First Game Three Kingdom's Multiverse (\"3KM\") is NFTs and blockchain-driven, trilateral story-based Play to Earn game. You can earn token rewards by clearing the stage while collecting huge stories, heroes, and items. With approximately 370 different combinations of attacks, defense, recovery, support, and magical heroes, you can enjoy thrilling competitions between users, collecting and strengthening specialized equipment for each hero type, and completing a stronger team combination to enjoy the game. 3KM is waiting for you with a variety of PvE and PvP basic content including mission mode, one-on-one matches, and occupation battles, as well as attractive token compensation. Produce tokens, set aside, and collect NFT numbers and equipment! More rewards and powerful hero classes will welcome you. 3KM games can grow by collecting 3KM governance to","links":"https://3km.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/3-kingdoms-multiverse/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0x0ab503536019cb4303bda69467c1ec5de1589918"}}}