{"name":"GG MetaGame","id":"gg-metagame","symbol":"ggmt","description":"GG MetaGame is GreenGrey Holding's most ambitious venture yet—a revolutionary gaming ecosystem that amalgamates a number of game titles. It promises players not just games, but experiences backed by unique rewards, NFT assets, and exclusive monetization opportunities. This is all executed under the vast and reputable umbrella of GreenGrey Holding. About GreenGrey Holding GreenGrey Holding is an international technology firm with a strong specialization in interactive entertainment for mobile platforms. With expertise spanning game publishing, technology innovation, and digital entertainment solutions, GreenGrey is at the forefront of the mobile gaming industry. From their standout titles like “Raid & Rush,” “Series,” “Samedi Manor,” and “Word Estate” to the extensive team of over 90 industry-leading professionals, the company has continuously showcased excellence in game design, development, and publishing. The company's vision resonates with a future where gaming integrates effortlessly with state-of-the-art technology, envisioning a vast, immersive ecosystem easily accessed on mobile. GG MetaGame Features GG MetaGame exemplifies the fusion of classic gaming traditions with groundbreaking advancements in the P2E gaming and blockchain domains. - Holistic Gaming Ecosystem: Unlike conventional platforms that operate with segregated titles, GG MetaGame integrates a diverse array of games into a single, interconnected universe, ensuring a seamless user experience across genres and studios. - Blockchain Integration & NFT Implementation: A pivotal differentiator is GG MetaGame's forward-thinking integration of blockchain technology. This facilitates the transformation of in-game items into NFTs, establishing a tangible bridge between gaming and the dynamic realm of cryptocurrency. - Established Audience Base: Another strategic advantage lies in GreenGrey Holding's expansive web2 mobile gaming audience. Rather than starting from a nascent stage, GG MetaGame taps in","links":"https://ggmt.io/","market_cap":8288192,"market_cap_rank":1529,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gg-metagame/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x76aab5fd2243d99eac92d4d9ebf23525d3ace4ec"}}}