{"name":"Forta","id":"forta","symbol":"fort","description":"The FORT token is an ERC-20 token running on the Ethereum network. The use cases of the token are: 1) Node Runner Staking. Node runners must deposit FORT Tokens to provide economic security for the work they are performing, since the staked FORT can be slashed if a node fails to execute their assigned work or performs their work maliciously. Once FORT is staked, it may only be withdrawn subject to a thawing period, which provides ample opportunity for verification and dispute resolution. Active node operators may earn rewards in FORT from the Network if they maintain the minimum stake and emit alerts and execute their assigned work correctly. 2) Delegated staking: FORT holders have the possibility to delegate to scan node pools. This action improves the security of the network and enables delegators to participate in the rewards distribution. 3) Minimum Bot Stake Requirement. The purpose is to protect the network from spam and malicious bots. Therefore there is a minimum stake required (100 FORT) for any detection bot to execute on the Forta network. 4) Governance. While Forta is continuing to develop, including further evolution of community governance, it is crucial to maintain stability for Forta users that are relying on the Network’s real-time monitoring. For that reason, Forta intends to decentralize governance over the Network progressively, beginning with a period of Council governance, where FORT holders are able to participate and vote to express their opinion and shape the evolution of Forta via Snapshot Voting.","links":"https://forta.org/","market_cap":50092439,"market_cap_rank":674,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/forta/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x41545f8b9472d758bb669ed8eaeeecd7a9c4ec29"},"polygon-pos":{"decimal_place":18,"contract_address":"0x9ff62d1fc52a907b6dcba8077c2ddca6e6a9d3e1"}}}