{"name":"Readia.io","id":"readia-io_solana","symbol":"read","description":"Readia.io is the first of its kind x402-native platform. Focused on content monetization based on micropayments with a custom peer-to-peer payment flow. Being open source allows for free publishing and monetization of content. Hosting fees and associated costs are funded by pumpfun creator rewards. There are no ads, no subscriptions, no middlemen, and no fees. Which means writers collect 100% of revenue. And readers pay a small price for content they want. Article access is stored on the blockchain so its 'forever'. Users can also elect to accepts multiple payment methods. The platform is fully live and functional. With more content being published and purchased daily. Expansion plans include a crowdsource marketing/shilling campaign platform called ShillQuest. Intended to help developers and teams easily reward content creators (written, video, X, etc.) for promoting their token/project/feature. This is achieved by utilizing the same custom peer-to-peer x402 payment flow that powers the primary Readia.io platform. The flow is automated beyond the creation of the Quest. Working with X API allows for automated content verification (based on account, keywords, content lengths, duplicate content, etc.) and the platform facilitates payouts directly into the content creator's wallet. Unlike the core platform, ShillQuest will generate revenue by collecting fees for Quest creation and offering custom campaign configurations for larger/more intricate campaigns. The ShillQuest platform is currently in limited user base testing and set to launch by Jan 1, 2026. The next addition to the Readia ecosystem is a substack-like fee-based platform powered by the same peer-to-peer payment flow.","links":"https://www.readia.io/","market_cap":51186,"market_cap_rank":8114,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/readia-io/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"C8wvVNuRPm237bQqqcfRxas77GTK3RzzoBCkWgrGpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/C8wvVNuRPm237bQqqcfRxas77GTK3RzzoBCkWgrGpump"}},"is_native":false}