{"name":"Oobit","id":"oobit","symbol":"obt","description":"Oobit (OBT) is a financial services provider that has developed a cryptocurrency payments gateway solution powered by blockchain. Its products and underlying technologies facilitate the fast and easy execution of crypto-to-fiat transactions by people and businesses around the world. Promote the everyday utility of digital assets while addressing the unmet needs of >1b global citizens. Oobit is harnessing crypto to felicitate a connection to traditional finance. Oobit was launched in 2017 with a simple yet ambitious aim: to increase cryptocurrency adoption in everyday life. Oobit’s native token (OBT) runs on the Ethereum blockchain. OBT is the fuel that runs the Oobit ecosystem — enabling fast and secure payments and transfers while maintaining crypto-to-fiat transactions at low fees. What Makes OBT Unique? Oobit (OBT), enables cross-border payments. The Oobit ecosystem is fueled by OBT, offering a wide range of rewards, perks, and benefits, applicable to its holders by offsetting transaction fees when making direct payments at almost any POS globally, buying crypto assets, sending crypto, or converting crypto. The company's core value is the ecosystem enabling crypto payments globally, simply, fast, efficient, and at a low cost How Is the Oobit Network Secured? The OBT token runs on the Ethereum blockchain. The OBT token is a standard version ERC-20 token. The platform also functions as a secure MPC and Cold wallet backed by GK8 military-grade security and hosts its OBT tokens. Where Can You Buy OBT? Swapping crypto or Buying OBT with a credit card on the Oobit App, swapping USDT for OBT on PancakeSwap, Receiving OBT through Community Airdrops Winning OBT through Contests","links":"https://www.obttoken.com/","market_cap":8815320,"market_cap_rank":1984,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/oobit/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x07f9702ce093db82dfdc92c2c6e578d6ea8d5e22"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x07f9702ce093db82dfdc92c2c6e578d6ea8d5e22"}}}