{"name":"Ovr","id":"ovr","symbol":"ovr","description":"What is Over the Reality (OVER)? OVER is an unparalleled Web3 Spatial Computing platform that merges the physical and virtual worlds through geo-localized Augmented Reality (AR). It's a visionary space where creators and brands converge to build the next evolution of the Internet—the Spatial Web. This transformation unlocks our existing web experience to create immersive, three-dimensional marvels that exist anywhere and at any time. The physical realm transforms into a digital canvas, enriched by limitless possibilities for play, social interaction, and commerce. OVER introduces a digital layer enveloping the physical world, comprising trillions of hexagon-shaped digital lands, known as OVRLands. These represent spatial domains, much like web domains control their webpages' content. In OVER, owning an OVRLand NFT grants control over the AR content displayed in 3D at specific geographic coordinates. OVRLand empowers users to forge unique geo-localized experiences that seamlessly bridge our physical and digital realities. At the heart of the Decentralized Physical Infrastructure (DePIN) movement, OVER's revolutionary Map2Earn™ program leverages the OVR token to incentivize community members to create detailed 3D maps of physical locations—OVRMaps—using just their smartphones. Participants can choose to mint their 3D data into an OVRMap NFT, retaining ownership, or sell it directly to OVER, thereby engaging in the Map2Earn incentive program. OVRMaps, serving as digital twins of the physical world, are vital for enabling spatial computation. They allow for remote, real-time exploration and precise indoor and outdoor re-localization, marking a significant leap from traditional to spatial computing. Dedicated to cross-platform interoperability, OVER supports real-time augmented reality features, AI avatars, motion-captured interactions, and hyperrealistic NFT assets. With over 1.2 million registered users, 870,000+ OVRLands sold to more than 30,000 unique wallets.","links":"https://www.overthereality.ai/","market_cap":7403112,"market_cap_rank":1447,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ovr/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x21bfbda47a0b4b5b1248c767ee49f7caa9b23697"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7e35d0e9180bf3a1fc47b0d110be7a21a10b41fe"},"polygon-pos":{"decimal_place":18,"contract_address":"0x1631244689ec1fecbdd22fb5916e920dfc9b8d30"}}}