{"name":"Mines of Dalarnia","id":"mines-of-dalarnia_binance-smart-chain","symbol":"dar","description":"Mines of Dalarnia is an action-adventure game with procedurally generated levels on Binance Smart Chain (BSC). Players mine and collect various in-game items (i.e. minerals, rare relics and artifacts), improve their skills and gear to unlock the secrets of the Dalarnia universe. There are different mines with varying terrains to be explored and monsters to conquer in the quest for these rare resources of the Dalarnian world.The game aims to engage the broader player audience, particularly those with little to no prior experience in crypto, and bridge the gap with the traditional gaming industry. Through issuing the in-game assets as NFTs, players can own and monetize their game experience through trading on in-game or external marketplaces. With the governance process, players are able to influence the game development, and have ownership of the game. Play-to-earn: The DAR token economics design includes various incentives for players to earn in the game. Depending on each player’s strategy, they could be rewarded through actively playing the game, winning in competitions or passively earning from renting out their land plots to other users. Diverse Gameplay: Besides the exploration of mines across the Dalarnian world, there is a real estate gameplay element to the game. Players that choose to buy land plots, can rent out to other players to explore and in return earn a rental fee. Reversely, instead of out-right purchasing land plots, players can choose to rent land plots of their choice to explore and gather resources.","links":"https://www.minesofdalarnia.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mines-of-dalarnia_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x23ce9e926048273ef83be0a3a8ba9cb6d45cd978","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x23ce9e926048273ef83be0a3a8ba9cb6d45cd978"}},"is_native":false}