{"name":"Wortheum","id":"wortheum","symbol":"worth","description":"Wortheum is an innovative and forward-looking decentralized blockchain and ecosystem built on the Delegated Proof of Stake (DPoS) protocol. It is the first highly-scalable DPoS blockchain independent of central authority that addresses the problems of mass adoption and versatility of use. Wortheum allows the easy storage and retrieval of immutable strings of data and information. It supports three-second zero fee transactions and is designed to store vast amounts of content and to make it available for time-based monetization. Wortheum recognizes that transaction fees are often one of the largest challenges to facilitating development and flexibility of use on a blockchain. Instead of requiring potentially costly and inconvenient transaction fees, Wortheum uses a novel stake-based Resource Credit mechanism to create a fee-less model. Wortheum also aims to overcome mainstream adoption shortcomings in blockchain technology and content publishing by improving on their accessibility. It leverages the coined Proof-of-Brain (PoB) concept by distributing a portion of the inflation to content creators and consumers. To earn without financial investment, individuals partake in a wide range of activities. Those include blogging, participating in discussions, curating others, building and engaging with dapps, playing games and more; their limits are only constrained by their own imagination to further the decentralization of the system. All content is always readily-available on the blockchain and retains its original integrity. Since its inception, Wortheum has steadily grown as an ecosystem. Wb3 orientated dapps, APIs and front-ends contribute to a general and straightforward accessibility of data, transactions and records, so that this existing diversity and utility ensure that the ecosystem is welcoming to content creators, consumers, investors and builders.","links":"https://wortheum.io","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wortheum/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}