{"name":"OpenVPP","id":"openvpp_ethereum","symbol":"ovpp","description":"OpenVPP is a decentralized payment and tokenization layer designed specifically for the $10 trillion global electric utility industry. The project creates blockchain infrastructure tailored to modernize energy payments and enable seamless integration of distributed energy resources (DERs) such as electric vehicles, solar panels, batteries, and smart thermostats. The platform addresses inefficiencies in legacy energy payment systems by providing regulatory-compliant, on-chain infrastructure for accounting, usage tracking, and payments. OpenVPP operates 24/7 with stablecoin-based settlement, enabling machine-automated processes and micropayments required by smart energy applications. OpenVPP's technology stack includes three core components: a bespoke stablecoin payments layer with direct stablecoin integration, a decentralized integration layer for DERs described as \"DNS for DERs\" with standardized APIs, and gas abstraction for seamless customer experience through OAuth-based secure wallet access. The platform currently operates over 175,000 devices deployed worldwide. With OpenVPP 2.0 now live on Base blockchain, the project has launched OpenVPP World Beta, which is a dApp that brings vehicles onchain by turning them into Base NFTs. The system updates the blockchain every time connected vehicles charge or fill up on gas, with plans to offer future charging programs coordinated with electric utilities as the network grows into a global Virtual Power Plant. The $OVPP token serves multiple functions including gas fee payments, utility program participation, network governance, and ecosystem incentives. With a total supply of 1 billion OVPP tokens, the project positions itself as the \"Internet of Energy\" to capture value from the transition to distributed energy resources and smart grid infrastructure.","links":"https://openvpp.energy/","market_cap":6436254,"market_cap_rank":1874,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/openvpp_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xb4c6fedd984bc983b1a758d0875f1ea34f81a6af","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xb4c6fedd984bc983b1a758d0875f1ea34f81a6af"}},"is_native":false}