{"name":"Meta Monopoly","id":"meta-monopoly","symbol":"monopoly","description":"Meta Monopoly is a meme inspired project with real utility and a strong user base.Featuring the MMNFT (Meta Monopoly NFT) and a PvP (player vs player) game studio that allows users to play against each other and win real crypto.With MMNFT every character gets transformed into an animated video and posted all over our social channels such as TikTok, Instagram, and Twitter. The collection is exclusive and limited. Currently there is only 272 total supply. The originals were airdropped to the private presale buyers. Any future NFT will be airdropped as the smart contract is renounced and does not have a public mint function.Suite of PvP crypto games allows users connect their wallet, deposit crypto, and play each other in a fast paced, friendly style gameplay. Users will play with ETH on initial launch, then have the option to play with the $MONOPOLY token when live on market.Galaxy Run is our first game (launched on May 16, 2023) and as of writing this, there are currently 1,500+ users and over 200+ eth in transaction volume. We started to make mini animated meme-clips of each character and upload on the social media channels, starting with TikTok and Instagram, followed by now Twitter as well. The first few videos started going viral so we just kept doing it and it was a really funny cool thing and now this is what we do for every character, every week, on every social channel.We do believe that if a certain video gets more engagement - it raises the value of that specific MMNFT, and we never know which one it will be.","links":"https://www.metamonopoly.org","market_cap":17015.29,"market_cap_rank":8972,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meta-monopoly/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7d4a7be025652995364e0e232063abd9e8d65e6e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x7d4a7be025652995364e0e232063abd9e8d65e6e"}}}