{"name":"FutureSwap Finance","id":"futureswap-finance","symbol":"fs","description":"Futureswap is a decentralized platform that provides a low-cost and low-slippage solution for stablecoin trading on the Findora blockchain. With privacy at the forefront of its design, Futureswap takes inspiration from the successful Curve Finance protocol to bring stability and security to stablecoin trading. Individual users (and decentralized protocols alike) can easily trade stablecoins with just a few clicks (or via APIs), thanks to Futureswap’s user-friendly interface. The platform is fully community-governed and incentivizes active participation through its governance token $FS. In addition, Futureswap features its own stablecoin, $USDF, which serves as (the equivalent of)LP tokens for its liquidity pools and is pegged to its underlying stablecoin assets. As a standard FRC20 token, USDF can be used as a stablecoin and is one of the pioneering private stablecoins in the web3 space. The FutureSwap (FS) tokenomic is an integral part of the Future Swap ecosystem. The FS token is a utility token that serves multiple purposes within the platform. It is used to incentivize users and provide benefits to holders, while also acting as a governance mechanism. At the start of the platform, 10 million FS tokens are generated and will be gradually unlocked over a two-year period to ensure stability and promote long-term growth. $FS Token Utilities Liquidity Mining: The FS token also provides benefits to its holders in the form of rewards and staking opportunities. Holders of FS tokens can earn rewards through liquidity provision and staking. This incentivizes users to hold onto their FS tokens and provide liquidity to the platform, contributing to its overall stability and growth. Governance: In terms of governance, holders of FS tokens are granted significant decision-making power within the Future Swap. They possess governance rights, including the ability to vote on proposals for improvement. The collective decision of FS holders will shape the future of the Future","links":"https://futureswap.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/futureswap-finance/logo.png","detail_platform":{"findora":{"decimal_place":16,"contract_address":"0xd086386ed9f4fb4f731fcfbae04e573e76e018f6"}}}