{"name":"Molecules of Korolchuk IP-NFT","id":"molecules-of-korolchuk-ip-nft","symbol":"vita-fast","description":"What is the project about? VitaDAO, a decentralized autonomous organization, introduces VITA-FAST, an innovative funding model for longevity research. Leveraging the Ethereum blockchain, VITA-FAST are ERC-20 tokens, signifying fractional ownership of the Intellectual Property Non-Fungible Token (IP-NFT) from longevity research conducted at the Korolchuk Lab, Newcastle University. VITA-FAST token holders gain governance rights over the IP, democratizing the decision-making processes in scientific research. 1. What is the project about? The project is focused on discovering and developing therapeutic compounds that can reactivate autophagy in Npc1 -/- cells. This involves screening bioactive and commercial small molecules in cell survival assays to identify potential autophagy activators that are not cytotoxic. The project uses advanced techniques like luciferase-p6 clearance and Halo-GFP-LC3 orthogonal assays for this purpose. 2. What makes your project unique? The project's uniqueness lies in its approach to identifying novel compounds that can induce autophagy in NPC1 -/- cells, a crucial process for treating Niemann-Pick Type C disease. Unlike existing treatments, this project employs high-throughput screening methods and innovative assays to discover compounds with high chemical variability and no similarity to existing autophagy inducers, opening up possibilities for new iIP. 3. History of your project. The project, led by Dr. Korolchuk and his team at Newcastle University, has progressed from generating data on thousands of compounds using advanced screening assays to identifying lead compounds with potential autophagic properties. It has evolved to include the synthesis of derivatives of these compounds and is now moving towards drug translation processes, including pharmacokinetics and scalability studies. 4. What’s next for your project? The next steps involve screening third-generation compounds, conducting in vitro and in vivo models using patient","links":"https://vitadao.com/vita-fast","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/molecules-of-korolchuk-ip-nft/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6034e0d6999741f07cb6fb1162cbaa46a1d33d36"}}}