{"name":"Extra Finance","id":"extra-finance","symbol":"extra","description":"What is the project about? Extra Finance is a leveraged yield farming & lending protocol built on Optimism. What makes your project unique? On Extra Finance, users can implement customized farming strategies, or deposit to lending pools to earn lending interest. History of your project. Mar 23, 2023 - Testnet Launch on Optimism May 9, 2023 - Mainnet Launch on Optimism What’s next for your project? Extra Finance’s roadmap is as follows: 2023 Q3: Integrate CLAMM One-click Yield Farming Templates Yield Farming Simulation & Calculation Tool 2023 Q4: Release of Advanced Strategy Vaults 2024 Q1: Social Farming: User-to-User Yield Strategy Following Extra Finance V2 What can your token be used for? Extra Finance uses two tokens to manage its utility and governance: `$EXTRA` — ERC-20 utility token of the protocol `$veEXTRA` — ERC-20 governance token of the protocol `$EXTRA` is used for rewarding liquidity providers through emissions. `$veEXTRA` is used for governance. Any `$EXTRA` holder can vote-escrow their tokens and receive a `$veEXTRA` in exchange. Utility By holding `$veEXTRA`, users can unlock the following benefits and features: APR rewards, sourced from both protocol fees and `$EXTRA` token incentives. - The protocol fee comprises various tokens collected into the treasury and is shared once per epoch. It is used to buy back `$EXTRA` tokens from the market and then distribute them to holders of `$veEXTRA` tokens. - A portion of the `$EXTRA` tokens allocated to the community will also be assigned to `$veEXTRA` token holders, subject to a specific emission plan. - At the end of each epoch, rewards will be accumulated. Unlock up to 4x leverage for yield farming pools. Gain access to lending pools with a high utilization rate. (`$veEXTRA` holders only) Vote & Governance in the community. `$veEXTRA`is the voting power in Extra Finance's on-chain governance process. Users could use it to cast for/against community proposals.","links":"https://app.extrafi.io/","market_cap":7589092,"market_cap_rank":2019,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/extra-finance/logo.png","detail_platform":{"optimistic-ethereum":{"decimal_place":18,"contract_address":"0x2dad3a13ef0c6366220f989157009e501e7938f8","geckoterminal_url":"https://www.geckoterminal.com/optimism/tokens/0x2dad3a13ef0c6366220f989157009e501e7938f8"},"base":{"decimal_place":18,"contract_address":"0x2dad3a13ef0c6366220f989157009e501e7938f8","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x2dad3a13ef0c6366220f989157009e501e7938f8"}}}