{"name":"Cropto Corn Token","id":"cropto-corn-token_polygon-pos","symbol":"croc","description":"Cropto Corn Token, agricultural asset-based Corn Token in a wide region stretching from Europe to Asia, offer a way to invest in agriculture, with agricultural products stored in audited warehouses in return. Cropto Corn Token is a digital currency for agricultural products in the history of mankind. Such indispensible commodity, corn which is of strategic importance in international trade, is carried to blockchain through the Cropto Corn Token, and present their means of transparent and decentralized transfer of assets to the agricultural industry and this investment opportunity to the people. Cropto Corn Tokens are created by tokenizing agricultural corn products stored in audited warehouses on a blockchain technology-based platform in terms of the location of the relevant warehouse, and type and quantity of the relevant agricultural product. Agricultural products dating back to the dawn of mankind are turned into investments for today and tomorrow through Cropto Corn Token. Cropto is collateralized one on one with a physical commodity thanks to its nature of asset-backed token. Each Cropto Token is created by carrying a physical asset to the blockchain. This tokenization provides such advantages as high liquidity, easy access, equal access and buying in parts. Cropto Tokens are created by tokenizing them one on one against agricultural products stored in audited warehouses used by the agricultural industries in the worldwide. The agricultural products stored in such warehouses and documented with Warehouse Stock Receipts prove their existence without doubt. Cropto Corn Token (CROC) is a digital Corn, powered by blockchain technology, an asset-backed stablecoin that is pegged 1:1 to 1 kilogram of Corn.","links":"https://www.cropto.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cropto-corn-token_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x0735fa49eb7d9ddf3e4d9a9f01229627f67632a1","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x0735fa49eb7d9ddf3e4d9a9f01229627f67632a1"}},"is_native":false}