{"name":"Photon Milky Way","id":"photon-milky-way_ethereum","symbol":"pmw","description":"What is the project about? Photon Milky Way (PMW) is an ERC-20 based Layer 2 digital currency, a core component of the Photon Space Chain (PSC) web 3 ecosystem. What makes your project unique? PMW and its Layer 1 blockchain PSC are taking a significant stride in reshaping the technological landscape through its pioneering Layer 1 blockchain. This innovative approach harnesses the potential of blockchain technology to advance economic, educational, and societal equality, all the while addressing critical environmental concerns entwined with the challenges of an evolving civilization. PSC's Layer 1 blockchain innovation underscores its unwavering commitment to delivering unfettered access to transparent and dependable information. This commitment dovetails with the overarching aim of cultivating fairness across economic, educational, and social domains. Moreover, PSC proactively recognizes the environmental and climate-related ramifications that manifest as civilization progresses, diligently implementing measures to confront these challenges head-on. History of your project. PMW was initiated by ZTQ Games, an entity under ZTQ Holding, co-founded by Ramon Lee, Sean Kim, and Jun Seo. What’s next for your project? PMW embarked on its journey with the launch of the \"AuroraHunt\" platform earlier this year. This platform introduced beta services such as the stimulating Claw Machine for cognitive development and the intriguing Mining Maze for puzzle-solving enthusiasts. Simultaneously, partnerships are being formed with local public education institutions and content development organizations in pivotal regions, including South Korea, Singapore, and Taiwan. Additionally, PMW is actively engaging international partners to expand its global footprint through overseas launches and comprehensive publishing support. Anticipating the horizon, PSC's forthcoming milestone is the highly awaited October launch of its second platform, GCX. This beta service is poised to pave the way for tangible carbon credit trading, contributing significantly to a comprehensive response addressing climate concerns within our ever-evolving technological landscape. Photon Space Chain (PSC) positions itself as an agent of transformation, augmenting access to information while championing sustainability. With its multi-dimensional approach and state-of-the-art blockchain technology, PSC endeavors to reshape societal norms and provide a holistic solution to contemporary challenges. What can your token be used for? PMW acquired through prosumer activities within the PSC ecosystem is used as a payment method to purchase goods or services on various platforms such as game-fi \"AuroraHunt\" or climate risk hedging platform \"GCX\".","links":"https://photon-milkyway.com/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/photon-milky-way_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x47b751e318fe7e9769f4b56fabbffb05d530a88c","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x47b751e318fe7e9769f4b56fabbffb05d530a88c"}},"is_native":false}