{"name":"XRP20","id":"xrp20_ethereum","symbol":"xrp20","description":"What is the project about? Drawing inspiration from the original XRP, but built as an ERC20 token on the Ethereum blockchain, XRP20 is a more user focused and accessible token, featuring Stake To Earn utility and a burn mechanism making it deflationary. XRP20 aims to democratize access to a token that has traditionally served institutional players. Anybody holding XRP20 can stake their tokens to earn passive income. XRP20 is set up as a deflationary token with a buy and burn mechanism that sends 0.1% of every buy and sell to a burn address. 10% of the total supply is allocated to be burned. XRP20 team firmly believes in the power of decentralization and that creating a new token for the XRP Army will strengthen the ecosystem and embolden the community’s resolve in the wake of its current challenges What makes your project unique? Built on the foundations of XRP and following the movement of offering second chances for those who missed those out years ago, XRP20 aims to offer accessibility, inclusivity, utility, and simplicity and bridge the knowledge gap for new crypto participants as the original XRP token benefited institutional investors. Moreover, with the staking feature, buyers are now able to earn passive income. History of your project. XRP20 presale started on the 31st of July and concluded on the 15th of August, selling out the hard cap of $3,680,000.00 in about 2 weeks. Staking was launched on the 14th of August and over 50% of the tokens available in presale have been staked since then. Claiming of XRP20 went live on the 22nd of August and a trading pool has been created on Uniswap at the same time. What’s next for your project? After a successful launch on DEX, the next phase in the roadmap is the implementation of a token burning mechanism. This feature will automatically reduce the token supply with each transaction, increasing scarcity. Awarding staking rewards is a continuous process which will take place over the course of 4 years. 3,750 tokens are being emitted per ETH block. What can your token be used for? The project is a great opportunity for people who missed out on the early gains of XRP but this time, they can receive staking rewards and earn some passive income as well.","links":"https://xrp20coin.com/en","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xrp20/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xe4ab0be415e277d82c38625b72bd7dea232c2e7d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe4ab0be415e277d82c38625b72bd7dea232c2e7d"}},"is_native":false}