{"name":"Moon Pepe","id":"moon-pepe","symbol":"$mpepe","description":"Project Description: Moon Pepe ($MPEPE) is a meme coin and gaming project built on the Arbitrum chain. The main aim of this project is to create a fun and interactive ecosystem that incorporates both gaming and cryptocurrency. MPEPE has a total supply of 420,690,000,000 MPEPE, with a unique tokenomic structure that ensures stability and long-term growth for the token. Tokenomics: MPEPE has a unique tokenomic structure, designed to provide stability and growth for the token. The tokenomics are as follows: Liquidity: 20.73% of the total supply is reserved for liquidity on decentralized exchanges (DEXs). This ensures that there is always a healthy supply of MPEPE available on exchanges, which makes it easy for users to buy and sell the token. Development and marketing: 5% of the total supply is reserved for development and marketing. This fund will be used to develop the Moon Pepe Arcade game, as well as for marketing efforts to promote the project to a wider audience. Team: 5% of the total supply is reserved for the team. This is to ensure that the team is incentivized to work on the project and deliver on their promises. Cex & future liquidity: 5% of the total supply is reserved for CEX and future liquidity. This fund will be used to provide liquidity on centralized exchanges (CEXs) and any future liquidity requirements. Burned forever: 64.27% of the total supply will be burned forever. This means that there will be a finite supply of MPEPE, which will help to prevent inflation and ensure the long-term stability of the token. Moon Pepe Arcade Game: The Moon Pepe Arcade game is a fun and interactive game that allows users to earn MPEPE tokens while playing. The game is currently live on the Moon Pepe website, and it is designed to be easy to play for both new and experienced gamers.","links":"https://moonpepe.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/moon-pepe/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":6,"contract_address":"0xce0b3f1258189da17bbd8c7e0509f5f7e001a998"}}}