{"name":"NodeBunch","id":"nodebunch","symbol":"noch","description":"NodeBunch is a futuristic AMM Dex Build on solana blockchain. We are continuously working to make NOCH better, secure and hassle free for users which gives them a seamless experience of trading on DEX. 1. AMM DEX With the power of serum’s central order book, users can place, sell and buy bids and trade at market prices. This empowers users to swap their currencies at desired prices with high speed. AMM solves the problems of high slippage tolerance, Gas fees going to waste and liquidity by executing trades between traders and not through a liquidity pool. Coin Swaps The central liquidity pool provided by serum empowers users who does not want to use AMM, to swap tokens at high speed and low fees at NodeBunch token swap. Pools Through NodeBunch, users can contribute to the serum liquidity pool in lieu of LP tokens. The liquidity is then used by swaps to perform high speed reliable swaps. The user earns profit as the value of each LP token raises overtime due to fees accumulated through swapping. The user contributing to the liquidity pool must be aware of the concept of impermanent losses. Stake If users are holding NOCH (Nodebunch official tokens), staking is an easy way to earn additional NOCH. The users can stake their NOCH on NodeBunch and earn regular APY based on the transactions happening on NodeBunch. Farming Users can stake their LP tokens on NodeBunch farms to earn APY based on swap transactions happening on the NodeBunch platform. This is another way of Nodebunch to reward its users for providing liquidity to the pool. Launchpad Another NodeBunch initiative is to provide support to new projects on the Solana blockchain and to help the Solana ecosystem grow is Nodebunch Launchpad. In Launchpad, Nodebunch will help new projects by helping new projects raise capital by circulating initial liquidity in a decentralized and interoperable manner. This will help in offering the new tokens to the curated members of the Nodebunch and project community. New Project Scan & Listing New Project scan is an Initiative by NodeBunch where we will be scanning for new projects and keep the community informed about them, if the community finds any project interesting, we will assist the project to get onboarded on NodeBunch Launchpad. NFT Trading NodeBunch provides a platform for artists to list their NFTs at low fees thanks to the Solana blockchain and sell them to traders across the globe. With the power of an on-chain decentralized program to mint and list NFTs, NodeBunch removes the middleman fees by directly connecting sellers to the buyer.","links":"https://nodebunch.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nodebunch/logo.png"}