{"name":"RALLY","id":"rally-3_ethereum","symbol":"rally","description":"What is R-Link? R-Link is a decentralized video conferencing platform that, utilizing the Rally Blockchain, will reward meeting hosts and attendees with the Rally Digital Rewards. Why Choose R-Link? Custom Call-to-Action Buttons: Easily add interactive buttons to your meetings to drive conversions. Web Page Poppers: Display web pages during presentations without distracting your participants. Seamless Streaming: Stream simultaneously to multiple social media platforms to maximize reach. Decentralized Security 256-bit Encryption: Ensure your communications are secure and private. Blockchain Technology: RLink products and services are built on a decentralized network that guarantees that your data stays yours, protected from breaches. Blockchain Community Governance: Opportunity to Participate in Rally Blockchain community decision-making processes that help shape the platform. Earn Rewards for Activity: Get blockchain digital rewards for hosting meetings, participating in video conferences, and inviting others. Redeem for Premium Services: Use digital rewards for additional features and services within the R-Link marketplace. Future Marketplace: Spend digital rewards on various products and services decided by the Rally Blockchain community. Check your appearance and test sound quality before entering the live meeting room. Customizable Event Titles: Easily name and organize your virtual conferences and webinars. On-Screen Clickable Links: Provide attendees with easy access to documents or web pages. The Rally Blockchain is empowered by a global and self-governing decentralized node network where node licensees are rewarded, by the blockchain, with Rally Digital Rewards. The RALLY ERC-20 Token is the Rally Digital Reward once it has been bridged.","links":"https://r-link.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rally-3/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x19640000000ba88d36206beb10d0e86011c8d08c","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x19640000000ba88d36206beb10d0e86011c8d08c"}},"is_native":false}