{"name":"Fit&Beat","id":"fit-beat","symbol":"ftb","description":"FIT&BEAT is a unique fitness solution that radically changes the existing fitness model using Blockchain technology paired with Virtual and Augmented reality solutions to provide a next-level fitness experience. FIT&BEAT represents a vital part of Metaverse, because it focuses on the interactions, virtual gyms, VR training, virtual world - FitBeatVerse, AI enhanced mobile app, first of a kind Proof of workout, Play2Earn Sport games, and NFTs. We are releasing two major products: FitBeatVerse - FitBeatVerse is our newly developed metaverse, where you will be able to purchase your land and you can provide various services. Our FTB Land will be focused on wellness, fitness and health and will include all stakeholders. Users, who purchase a piece of land will be able to sell their coaching services, as well as other wellness services. Users will be able to purchase meal plans, workout plans, watch video, chat and get relevant information from the best professionals. Furthermore, users will be able to enjoy various gyms located in FTB land, and will also be able to educate themselves through our license and become a professional. Moreover, you could buy and sell stuff from our partners, interact with your business partners as well as different people from our FTB community. Video presentation: https://www.youtube.com/watch?v=u3Qy97uLEvg Our new AI-enhanced, first of a kind Proof of workout mobile app the Fitbeat app is a mobile application meant for an active lifestyle combined with a proof of workout technology. The Fitbeat app will monitor your workout with the sensors available on your smartphone in combination with our advanced AI software. Your workout will be monetized with the so-called proof of workout technology and you will be able to spend the earned tokens inside our ecosystem. This means that you will be able to buy products from our partners in the metaverse and also able to do in app purchases Video presentation of our FitBeat App: https://www.youtube.com/watch?v=rEYKx8FGlIM","links":"https://www.fit-beat.io/en/ ","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fit-beat/logo.png"}