{"name":"peaq","id":"peaq-2","symbol":"peaq","description":"What is peaq? peaq is a layer-1 blockchain powering the Machine Economy. It is designed to power Decentralized Physical Infrastructure Networks (DePINs) and the billions of devices, robots and vehicles (RWAs) that run on them. At the time of launch, peaq is home to over 50 DePINs in 20+ industries. What is DePIN? Decentralized Physical Infrastructure Networks (DePIN) is the name for decentralized applications that use tokens to incentivise communities to build physical infrastructure networks (think mobility, electric vehicle charging, telecoms etc.) from the ground up. More on DePIN: https://www.peaq.network/blog/what-are-decentralized-physical-infrastructure-networks-depin Why do DePINs build on peaq? peaq is designed to power real-world Web3 applications. peaq’s Modular DePIN Functions — which include Machine IDs and DePIN Data Verification — work as building blocks DePINs leverage to speed up their development and deployment. peaq’s DePIN ecosystem enables DePINs to explore synergies with peers, peaq’s DePIN-focused enterprise ecosystem gives DePINs opportunities to expand their demand side, and peaq’s fundamentals give them affordable and fast transactions as well as a high degree of decentralization. More on peaq’s DePIN-specific features: https://www.peaq.network/blog/peaq-a-layer-1-blockchain-designed-for-depins-decentralized-physical-infrastructure-networks What can you build on peaq? On peaq, you can build any decentralized application that taps real-world devices to offer services. Some examples of projects built on peaq include: - Silencio: A DePIN crowdsourcing the world’s largest noise pollution map via a phone app that rewards people with tokens for collecting local noise data, with 360,000+ users across 180 countries. - XMAQUINA: A tokenization platform for autonomous robots behind the world’s first tokenized automatic robo-cafe. - Farmsent: A DePIN for smart agriculture and a peer-to-peer farm produce marketplace which has already onboarded 160,000+ farmers across Asia and South America. - MapMetrics: A drive-to-earn DePIN rewarding people for collecting navigation data via a phone app counting 60,000 users. - Teneo Protocol: A DePIN for crowdsourcing real-time social media data via more than 250,000 Community Nodes. Explore the peaq ecosystem: https://www.peaq.network/learn/ecosystem What enterprises does peaq work with? peaq is collaborating with leading IoT manufacturers such as Bosch and is involved in the Bosch-led moveID project, which also includes names like Airbus and Continental. peaq is also collaborating with Mastercard. Explore the peaq enterprise ecosystem: https://www.peaq.network/learn/ecosystem?category=Enterprises","links":"https://www.peaq.network/","market_cap":378523404,"market_cap_rank":273,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/peaq-2/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}