{"name":"Kyber Network Crystal","id":"kyber-network-crystal","symbol":"knc","description":"What Is Kyber Network (KNC)? Kyber Network is a hub of liquidity protocols that aggregates liquidity from various sources to provide secure and instant transactions on any decentralized application (DApp). The main goal of Kyber Network is to enable DeFi DApps, decentralized exchanges (DEXs) and other users easy access to liquidity pools that provide the best rates. All transactions on Kyber are on-chain, which means they can be easily verified using any Ethereum block explorer. Projects can build on top of Kyber to utilize all the services offered by the protocol, such as the instant settlement of tokens, liquidity aggregation, and a customizable business model. Kyber looks to solve the liquidity issue in the decentralized finance (DeFi) industry by allowing developers to build products and services without having to worry about liquidity for different needs. The Kyber Network Crystal (KNC) token is a utility token that is the \"glue that connects different stakeholders in Kyber's ecosystem.\" KNC holders can stake their tokens in the KyberDAO to help govern the platform and vote on important proposals — and earn staking rewards in Ethereum (ETH) that come from trading fees. What Makes Kyber Network Unique? Kyber Network is the first tool that allows anyone to instantly swap tokens without the need of a third-party, like a centralized exchange. The unique architecture of Kyber is designed to be developer-friendly, which enables the protocol to be easily integrated with apps and other blockchain-based protocols. DeFi has many use cases and possibilities. Therefore, no single liquidity protocol can fit the needs of all liquidity providers, takers, and other market participants. Kyber’s liquidity hub architecture allows developers and the Kyber team to rapidly innovate and integrate new protocols into the overall Kyber Network to cater to different liquidity needs. In April 2021, Kyber launched the Kyber DMM, the world’s first dynamic market maker protocol (DMM). Kyber DMM is a next-generation AMM designed to react to market conditions to optimise fees, maximise earnings, and enable extremely high capital efficiency for liquidity providers, especially for stable pairs with low variability in price range (like USDC/USDT, ETH/SETH). They will be able to support pools with extremely high amplification factors, which means given the same liquidity pool and trade size, slippage can be 100x (or more) better than typical AMMs. Depending on their amplification strategy, liquidity providers can maximise the use of their capital and have the opportunity to earn much more fees relative to their contribution size, while takers can enjoy extremely low slippage on their trades. Kyber DMM is the first of many new liquidity protocols that will be launched on the Kyber 3.0 Liquidity Hub. In the Kyber ecosystem, KNC token holders play an important role in deciding new growth and value-capture opportunities and incentive mechanisms. Through KyberDAO, KNC holders can participate in the governance of the network by voting on important proposals. Kyber’s community is sizable and made up of a wide range of developers, in addition to other members of the blossoming DeFi industry. Kyber’s fully on-chain design enables the protocol to maintain full transparency and verifiability. The platform claims to be the most used liquidity hub in the world. How Is the Kyber Network Secured? As an ERC-20 token, Kyber is built on top of and secured by the Ethereum blockchain. In addition, Kyber uses an extensive trust and security model that protects users from misbehaving administrators or exchanges, thanks to security measures built in both at the protocol and smart contract level. The platform has been audited by several third-party security firms and researchers, including Chainsecurity, which have determined that the protocol is secure and hence free of vulnerabilities.","links":"https://kyber.network/","market_cap":116587279,"market_cap_rank":562,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kyber-network-crystal/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xdefa4e8a7bcba345f687a2f1456f5edd9ce97202"},"polygon-zkevm":{"decimal_place":18,"contract_address":"0x6a80a465409ce8d36c513129c0feea61bed579ba"},"zksync":{"decimal_place":18,"contract_address":"0x6ee46cb7cd2f15ee1ec9534cf29a5b51c83283e6"},"fantom":{"decimal_place":18,"contract_address":"0x1e1085efaa63edfe74aad7c05a28eae4ef917c3f"},"optimistic-ethereum":{"decimal_place":18,"contract_address":"0xa00e3a3511aac35ca78530c85007afcd31753819"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xe4dddfe67e7164b0fe14e218d80dc4c08edc01cb"},"polygon-pos":{"decimal_place":18,"contract_address":"0x1c954e8fe737f99f68fa1ccda3e51ebdb291948c"},"linea":{"decimal_place":18,"contract_address":"0x3b2f62d42db19b30588648bf1c184865d4c3b1d6"},"avalanche":{"decimal_place":18,"contract_address":"0x39fc9e94caeacb435842fadedecb783589f50f5f"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xfe56d5892bdffc7bf58f2e84be1b2c32d21c308b"}}}