{"name":"FLOKI SHIBA PEPE CEO","id":"floki-shiba-pepe-ceo","symbol":"3ceo","description":"What is the project about? The Floki Shiba Pepe CEO project was born in August 2021. We affirm with certainty that we aren’t one of the “many projects”, but since immediately we’ll aim to be “THE PROJECT” and we’ll aim to do better than our predecessor Safemoon. Floki Shiba Pepe CEO is decentralized and is meant to be within everyone’s reach. In this project, nothing is left to chance, from the name choice to more ambitious goals. Our aim will be to go “Over the Moon”. We have noticed the huge amounts of money have been invested in the discovery of space in recent years. We asked ourselves: “What are we doing for the planet where we walk?”, “How can we go to the moon if we don’t learn to appreciate what’s on Earth first?” Hence our project and our name. What makes your project unique? One of our main objectives will be “DONATIONS”. Yes! We know what you are thinking about it, most of the tokens are making donations. We strongly believe in our charitable purpose; our goal will be to cooperate with associations already known for their contribution on safeguarding of the environment. Today, climate change causes irreparable damage and they are closely linked to other factors, such as fires. Climate change is already taking place and is leading to a constant increase in global temperature, resulting in an increase in extreme weather events. The effects, in combination with severe droughts, heat waves and forest fires, already have a serious environmental impact. We know that simple donations will not change a lot, but the community we are going to develop will make this possible. This will represent a fundamental marketing strategy as well as the first 02 CHARITY case of use of the token. History of your project. What’s next for your project? FLOKI SHIBA PEPE CEO GAME Game based on real characters s What can your token be used for? NFT MARKETPLACE Buy and sell your nft directly from our marketplace NFT COLLECTION Exclusive NFTs based on the FLOKI SHIBA PEPE CEO","links":"https://fspceo.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/floki-shiba-pepe-ceo/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xed0353560c43f3e0336d197e4081c81e1015dd51"}}}