{"name":"RektSkulls","id":"rektskulls","symbol":"rekt","description":"## What Is RektSkulls project? RektSkull is as a ready-made utility NFTs + REKT token ecosystem, with GameFi and DeFi elements, such as multi-level staking and in-house auctions system. First big goal is to earn enough funds to start the development of MMORPG. To do that RektSkulls implement an innovational approach to fundraising, instead of getting money from VCs or selling NFTs for ETH - funds are earned from ecosystem activity, from token tax mechanic. It means that team will continuously support demand for the token and each NFT in the ecosystem by implementing new mechanics and utilities. No matter what type of NFT or token user holds within the ecosystem, there will always be different options how to spend or use it, and other strategies that user can choose to benefit as part of the RektSkulls project. ## What is REKT token? * The native token is the key part of the RektSkulls ecosystem, every product, service, and mechanic within the ecosystem is paid by REKT token. * Has 2.5% tax mechanic on sell/buy/transfer transactions (except interaction with project mechanics, such as auctions). Tax mechanic is the only source of funding for project. * 95% of $REKT token is obtained from Essences and LP staking. * 5% reserved for future in-game economy bootstrap. * Has burn mechanics - all token from the winning bid of Genesis Skulls auctions are burned. Future mechanics also will include burning of REKT token. * Royalties from NFTs secondary market trading will be used to buyback and burn REKT token. ## How are REKT tokens distributed? 95% (95,000,000) of REKT tokens are distributed through staking over two years, with 20% rewards decrease every 3 month (“halving” mechanic). Staking of Essences (RektSkulls utility NFTs) and LP tokens started on Feb 1, 2023. 5% (5,000,000) of REKT tokens are reserved for future in-game economy bootstrap. ### Who is the founder of RektSkulls? Dima Gladush - founder and artist. Switched to crypto full time in 2017 after almos","links":"https://rektskulls.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rektskulls/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8a7664e782860e856031d6c31eb3bde721bc362b"}}}