{"name":"Phore","id":"phore","symbol":"phr","description":"Grounded in sound technology, Phore is composed of a decentralized blockchain, a network of <a href=\"https://www.coingecko.com/en?category_id=41&view=market\">masternodes</a>, a self-governance system, and several other innovative technologies. In addition to hosting a decentralized marketplace, Phore offers crowdfunding, public and private blockchain services, decentralized applications, all with the help of its utility token, PHR. Phore is a new name in the cryptocurrency market. In fact, it did not have an ICO or pre-sale mining. However, the company has a well-stipulated roadmap for the future. Its most recent progress was the integration of the Phore Blockchain into the marketplace. One of the milestones for 2018 is the activation of Segregated Witness. Phore started out as KryptKoin back in 2014. KryptKoin’s lead developer had to stop the project due to a serious disease. The demise of KryptKoin was followed by the creation of Phore in 2017. Phore’s blockchain system operates on the Proof of Stake (PoS) protocol for the purpose of mining. Users are rewarded on the basis of their participation on the platform and the number of stakes they hold. The staking rate is 2.8 PHR per 60 seconds, which means users will receive 2.8 PHR for every block they own after every 60 seconds. The blockchain employs master nodes to fulfil the purpose of security on the Phore network. A minimum of 10,000 PHR is required to enable master node security. The set up process only requires a Virtual Private Server (VPS) and a PC. Masternodes serve additional security to the funds even when the wallet is offline. The targets for Q1 2018 include the development and release of web and Android wallets. The plan is to increase PHR accessibility with the help of wallets. The team plans to work on wallet and core upgrades the whole year long. They also intend to create an automated setup for master nodes. Phore has built an enthusiastic and dedicated community of users despite its new entry in the market. The variety of services that it offers with its innovative technological infrastructure indicates a positive future market growth and an expanding user base. With a team of expert individuals like Moonshot, the CTO with over 25 years of work experience in financial technology and young developers like Julian Meyer, Phore emerges as a promising investment opportunity.","links":"https://phore.io/","market_cap":77687,"market_cap_rank":3970,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/phore/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}