{"name":"ArtMeta","id":"artmeta_polygon-pos","symbol":"$mart","description":"ArtMeta provides ultimate access to the realm of fine art, connecting premier galleries and their artists with collectors in a visionary, beautifully rendered digital universe, providing a unique new paradigm for displaying and selling art. More than a metaverse, ArtMeta brings worlds together as a full service design and development platform, blockchain and NFT resource for the fine art world. Through ArtMeta's traditional ecosystem partners in fine art logistics, custody providers, insurance companies and banks, we are a trusted fine art resource for the crypto consumer. ArtMeta's $MART token utility unites the world of fine art with the blockchain, creating a viable digital economy to support artists in perpetuity. Art enthusiasts will be able to experience fine art in a new, immersive way, participate in ArtMeta hosted events and high end exhibitions, as well as purchase extremely rare NFT based artwork directly from world class art galleries and artists. Roger Haas is ArtMeta's Co-Founder and CEO. In 2005 Roger founded Haas & Fischer Gallery in Zurich. The gallery participated in the world’s leading art fairs: The Armory Show New York, FIAC Paris, Artissima Milano, and MACO Mexico. In 2020, Roger was also the acting director of the Art Stations Foundation in Switzerland. Jonathan Delachaux, a critically acclaimed and award winning artist who has shown at the world’s leading art fairs, is ArtMeta's Artistic Director. His hyper-realistic style of work is mainly focused on painting the everyday life of three imaginary characters and creating a world for them. Cem Kulac is ArtMeta's Co-Founder and COO. A serial entrepreneur and consultant with over 15 years of expertise in program management for digitization and agile transformation of entire organizations. Cem led the growth of the biggest Agile communities in Switzerland: Lean Agile Scrum Switzerland, and Agile HR Switzerland.","links":"https://www.artmeta.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/artmeta_polygon-pos/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xdcff29b7bd211aaef6e4a3989e4d3f732cf5b4b6","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xdcff29b7bd211aaef6e4a3989e4d3f732cf5b4b6"}},"is_native":false}