{"name":"GeoLeaf","id":"geoleaf-2","symbol":"glt","description":"Geoleaf, a unique and ambitious cryptocurrency project, aims to address the global water crisis by offering products, innovative technology, and monetary donations to registered charities and communities around the world. The project operates on the GroveCoin Network, a blockchain-based platform promoting sustainability and positive social impact through incentivizing eco-friendly practices. By using the GroveCoin blockchain, Geoleaf extends its environmental impact, allowing users to earn rewards for holding a token that benefits the environment through action, such as recycling, using renewable energy sources, or reducing carbon emissions. The Geoleaf project has a multichain launch on both the Binance Smart Chain and the Grove Blockchain, with plans to add more chains over time. It employs a tax system that remains constant at 10%, comprising 4% GroveCoin reflections, 3% marketing, 1% charity donations, 1% buy back and burn of GRV tokens, and 1% buy back and burn of GLT tokens. This tax structure encourages holders to hold and earn rewards, while also supporting the donation wallet, ensuring the project's success and growth. The project's utility lies in its 1% donation allocation, which will be used to fund various charitable efforts to combat the water crisis. Geoleaf is currently exploring innovative solutions such as 3D printing water filters and other products that can be donated. The project is in discussions with water charities and organizations to form strong partnerships, and plans to launch an online store where users can purchase products and merchandise. Geoleaf's social channels, including Twitter, Telegram, we Geoleaf differentiates itself from other projects launching on the Grove Blockchain through its high rewards in GroveCoin, its community-driven approach, and its commitment to addressing the global water crisis.","links":"https://GeoLeaf.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/geoleaf-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x7fdf0d77f9f906addc7f3b75a73df941ae65d7d6"}}}