{"name":"LitLab Games","id":"litlab-games","symbol":"litt","description":"What is the project about? LitLab Games is a AAA video game publisher focused in esports. The company is led by experts in the video game, esports and web3 industry with successes in previous startups. LitLab is the first Esports developer and publisher launching games backed by blockchain technology with a crypto-based economy. What makes your project unique? LitLab believes in the independent professional gamer. A player who will be able to monetize his dedication and skill without having to rely on streaming platforms or creating contents as the main way of income, which right now it only applies to a few of the elite influencers. History of your project. LitLab games was founded in early 2022 and started producing its first video game called CyberTitans. The alpha version was ready for September 2022 and Beta version on October 2022. The team went to DreamHack (one of the biggest Esport events in Europe) and since then new versions have been updated each 2 weeks, making CyberTitans one of the most played web3 games right now with a DAU over 650+. What’s next for your project? LitLab's roadmap is aiming now a profile 2.0 in order to integrate NFTs in-game and customizable assets. After that the mobile version will be available in Q4 of this coming year. Next milestone will be start creating a new video game, as the company aims to create 5 games in 5 years. What can your token be used for? The token will be the engine of the ecosystem in different ways; gamers will compete for LITT in different ways (quick games, tournaments, grand slams, Esports circuit…), to acquire NFTs in the future LitLab’s marketplace and unlock different characteristics, in order to have organization/guild licenses, farming pools or even purchasing tournament tickets.","links":"https://www.litlabgames.com","market_cap":327584,"market_cap_rank":4963,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/litlab-games/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xcebef3df1f3c5bfd90fde603e71f31a53b11944d"}}}