{"name":"Scarab DAO","id":"scarab-dao","symbol":"scarab","description":"Operating on the Ethereum blockchain, Scarab DAO was designed to facilitate transparent and community-driven decision-making processes. Scarab DAO's core asset is its native cryptocurrency, $SCARAB, an Ethereum-based ERC-20 token. This token plays a multifaceted role within the ecosystem. Firstly, it can be converted into $BARACS tokens to provide voting power to community members, ensuring that decisions are made in a democratic and inclusive manner. The more $BARACS tokens held by an individual, the greater their influence within the organization. Moreover, $SCARAB tokens offer entry into a realm of investment opportunities. Deities in Scarab DAO regularly presents proposals for investments, encompassing a wide range of projects and initiatives. Contributors, leveraging their $SCARAB tokens, can actively participate in these investments, potentially sharing in the resulting profits. Scarab DAO's revenue-sharing model ensures that earnings are distributed equitably among participants. In addition to this, Scarab DAO has a class of members known as Deities. Deities play a crucial role in shaping the organization's future and governance. To become a Deity, an individual must stake 0.4% of the total supply of $SCARAB tokens to mint 1 of 40 limited Deity NFTs, demonstrating their commitment to the DAO. Deities have the unique privilege of proposing investments or judgements within Scarab DAO. To bolster accountability and transparency, Scarab DAO implements a judgement mechanism. Scarab Deities possess the ability to initiate judgement proposals in cases of defaults or violations of DAO guidelines. The resolution of these proposals is determined by community voting, upholding the collective ethos of the organization.","links":"https://scarabdao.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/scarab-dao/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2cbbce628af16de2fcaad681a3c79ec25043f279"}}}