{"name":"SMPCOIN","id":"smpcoin","symbol":"smpc","description":"SMP Blockchain has issued SMPCOIN. SMPCOIN will fuel the SMP Blockchain ecosystem, used by customers, stakeholders, and third-party partners around the world. SMPCOIN is a publicly tradeable digital asset that will be used for each activity performed through our platform. Uses of SMPCOIN It is possible to pay for the use of various services, such as admission fees and usage fees, at immersive media art museums and affiliates directly managed worldwide. Producers, Distributors and Packagers use SMPCOIN to pay monthly subscriptions to the Producer mobile app. Distributors will use SMPCOIN to connect with producers who fulfill orders by paying a monthly fee for platform access. Carriers will use SMPCOIN to pay monthly membership fees to access energy distribution channels and grow their business. Retailers, retailers, and energy service customers pay a subscription fee for the customer service app and receive notifications about service availability. Feature of SMPCOIN • Immersive Media Art It is used for payment of immersive media art in Pattaya, Thailand, and creation and sale of NFTs. • Eco-friendly local currency As an alternative to local currency in Pattaya, Thailand, it is conveniently used in transportation, tourist attractions, and restaurants. • Eco-friendly energy smart service It is possible to raise the level of smartization of eco-friendly energy company work and provide a variety of smart value-increasing services. • Tracking of eco-friendly energy assets Not only product information such as brand, country of origin, and selling point, but also information related to the company such as corporate level and safety certification is available. It is also possible to search for information on import certificates, import cargo quarantine certificates, and customs declarations. • Ecosystem Profit Dividend The SMP ecosystem provides a diverse investment environment in which stable and long-term profits can be obtained by creating eco-friendly funds.","links":"https://www.smpccoin.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/smpcoin/logo.png","detail_platform":{"klay-token":{"decimal_place":12,"contract_address":"0x69906514ff850a8170352a4210ed778f235ae125"}}}