{"name":"BountyKinds YU","id":"bountykinds-yu_binance-smart-chain","symbol":"yu","description":"◆ What is the project about? The game itself will consist of multiple game genres such as all-time classics like board games, map adventure games, fan-favorites such as role-playing games (RPG) or in-demand games such as first-person shooting (FPS) games or battle royale MOBA games. These games and its areas will be determined by both you, the players and us developers, heavily putting emphasis on the “Play-to-Earn” aspect and “Co-production” aspects of the game. ◆ What makes your project unique? The BountyKinds universe is going to be dictated by this unique achievement system where all contributions to the game would be quantified and scaled to a number. This number will decide the intricate reward values that come with playing the game. The goal of BountyKinds lie in bringing gamers from various cultures together, regardless of whether they are in the real world or the metaverse. To have players aim for their highest achievable values in the hopes of creating a game with world building that affects even our real world in a positive way. ◆ What’s next for your project? With each phase, we will add new games to the world of Bountykinds. Game players will be able to be more strategic about which games they play and how they raise NFTs to fight in them. The special NFTs that will be dropped as rewards each season will be the voting rights for this in-game DAO, allowing players to make their own voices heard in the development of the game. ◆ What can your token be used for? The YU token is a BOUNTYKINDS utility token. YU tokens are used as YU points in the game as a 1:1 exchange ratio. YU point can be used as in-game currency to purchase NFTs or to scholarship NFTs. YU point will be distributed daily as a reward to players for every percentage of in-game points earned in BountyKinds.","links":"https://bountykinds.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bountykinds-yu_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x3e098c23dcfbbe0a3f468a6bed1cf1a59dc1770d","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x3e098c23dcfbbe0a3f468a6bed1cf1a59dc1770d"}},"is_native":false}