{"name":"Grin","id":"grin","symbol":"grin","description":"Grin coin is a private & lightweight open source project based on the mimblewimble blockchain implementation. MimbleWimble is a lightweight blockchain protocol proposed by anonymous author that goes by the name Tom Elvis Jedusor (inspired by Harry Potter) in July 2016. Since then, the proposal has gained a huge following among Bitcoin and privacy advocates. Unlike <a href=\"https://www.coingecko.com/en/coins/bitcoin\">bitcoin</a> or <a href=\"https://www.coingecko.com/en/coins/ethereum\">ethereum</a>, there are no addresses in Grin. In order to transact using Grin, both wallets must communicate with each other online with the results broadcasted to the network. Another key different is that transaction history (sender, receiver, amount) will not be recorded on the blockchain. Due to the removal of these information from the transaction, the data size remains small and that keeps the blockchain lightweight. New nodes can easily join the network without having to download a large blockchain. Grin coin was launched without an ICO, fundraising, or pre-mine. Developers around the world contribute openly with the goal to ensure the coin distribution remains as fair as possible. There are 2 popular wallets widely available to interact with the Grin network. Grin core wallet: https://www.coingecko.com/buzz/how-to-use-grin-wallet-to-send-receive-grin-coins Wallet713: https://www.coingecko.com/buzz/how-to-use-grin-wallet713-to-send-and-receive-grin-coin-step-by-step-guide The consensus algorithm used by Grin is the Cuckoo Cycle proof-of-work based. There are 2 hashing algorithms involved with Grin. Cuckoo-29 is meant for GPU mining while Cuckoo-31 is meant fo ASIC mining. This is a deliberate design to encourage miners to eventually move into ASIC mining for efficiency while keeping it fair at the beginning of the launch. Grin coin has launched its mainnet on 15th January 2019 and is now available for mining and trading.","links":"https://grin.mw/","market_cap":7069230,"market_cap_rank":2139,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/grin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}