{"name":"Renq Finance","id":"renq-finance_ethereum","symbol":"renq","description":"RenQ is a community-driven organization that is established to provide a one stop solution for all kind of traders under one platform in the DeFi world. We aim to empower our users with a comprehensive solution by providing them a platform that has benefits of a centralized exchange and beyond. RenQ's mission is to offer a comprehensive solution that is accessible to all types of traders, from novices to seasoned professionals. At the moment, new users are forced to use centralized exchanges because it is simpler for them to do so. However, with RenQ wallet, new users will be able to enjoy all of the benefits of centralized exchanges while using a decentralized solution. RenQ enables the creation of entirely new asset classes whose value is derived from blockchainbased assets. Financial products such as derivatives and margin trades enable investors to achieve superior portfolio risk management and open up new speculation avenues. In addition, they increase market efficiency for the underlying asset by facilitating price discovery and permitting individuals to express more nuanced opinions on price and volatility. RenQ offers advantages over conventional financial products by eliminating the need for a regulated central clearing house, providing global and equal access, and granting users permanent control over their funds. The derivatives market on existing financial infrastructure is vastly larger than any other market for financial assets. It is estimated to be greater than $1.2 quadrillion, or more than 10 times the global GDP. We believe that as decentralized platforms mature and begin to offer substantial advantages over traditional financial systems, a growing number of traditional assets will be listed on the blockchain. RenQ will provide a number of decentralized protocols that implement a variety of cryptoasset-based financial products.","links":"https://renq.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/renq-finance/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xff8c479134a18918059493243943150776cf8cf2","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xff8c479134a18918059493243943150776cf8cf2"}},"is_native":false}