{"name":"Artrade","id":"artrade","symbol":"atr","description":"The Artrade app provides NFT creators and NFT investors with a streamlined, user-friendly app that eliminates the high minting fees, exorbitant commissions, social disconnect, and environmental impact of the current NFT marketplace. Artrade is the first eco-responsible application dedicated to NFT. It allows its users to view, reference, keep, buy and create their own NFTs in the simplest and fastest possible way. In addition, many exclusive features such as NFT Live and NFT Real will be available, as well as a utility Token: the ATR offering many advantages on the platform (reduction ofcosts, participation in decisions, etc.). On Artrade users can: Make transactions: buy, sell, bid in fiat or in crypto; Create: with NFT Live, it is now possible to create an NFT directly from your smartphone; Display: in a personalized virtual gallery; Be rewarded: by sharing or displaying artist's works in galleries; Discover: love, share, follow, promote, discuss, display; Preserve: secure digital assets effortlessly. What makes Artrade unique : Artrade is different from other applications in that it is genuinely user-driven by: › Involving the community via utility and governance tokens; Making it possible to create NFTs Live via your smartphone; Reducing the energy footprint by using Solana; Offsetting carbon emissions with ClimatePartner; Contributing to charity projects via the Blockchain Charity Wallet. Who is Artrade for? The general public Users, enthusiasts, etc. They are involved in strategic decisions, can vote and can be rewarded. › Celebrities Public figures, entrepreneurs, etc. They can use their fame to support causes and nonprofit organizations for free. › Associations NGO, benefactors, etc. Thanks to the blockchain, Charity Wallet, funds donated are distributed among non-profit projects usefully and totally transparently. › Artists Digital and non-digital artists They can sell and/or create their works directly on the platform. Innovative features : NFT Live This is the most anticipated function: it makes it possible to create an NFT Live, and from a telephone or a connected mobile device. The latter can be immediately customized by adding effects (GIF, emoji, filters, etc.). Once on sale, it exists only as an NFT on the Artrade platform, making it unique. To make this feature enviable, only certain users can access it (+10K followers on Instagram and/or Twitter in particular). There is a patent pending for this feature. NFT Real In correlation with Artrade, a user will be able to make a sale of an NFT associated with a physical and real asset. Hence it will be possible to create a series of unique NFTs associated with real objects. For example, a painter could sell real certified paintings on Artrade thanks to NFT technology.","links":"https://www.artrade.app/","market_cap":14210865,"market_cap_rank":1560,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/artrade/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"ATRLuHph8dxnPny4WSNW7fxkhbeivBrtWbY6BfB4xpLj","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/ATRLuHph8dxnPny4WSNW7fxkhbeivBrtWbY6BfB4xpLj"}}}