{"name":"0xFriend","id":"0xfriend","symbol":"0xf","description":"Introducing 0xFriend: Empowering Social Share Trading on Telegram Welcome to 0xFriend, the cutting-edge trading bot built upon friend.tech that revolutionizes social share trading on Telegram. About Us With our innovative platform, you can seamlessly engage in complete trading, explore a vibrant marketplace, and discover trending pairs, all within the convenience of Telegram. Get ready to experience the next level of social share trading like never before. Complete Trading With 0xFriend, you have access to comprehensive trading capabilities. Seamlessly connect your friend.tech account to our bot and enjoy hassle-free trading of social shares. Execute buy and sell orders with ease, monitor your portfolio, and make informed trading decisions, all within the familiar Telegram interface. Trending Pairs Stay ahead of the game with our trending pairs feature. 0xFriend provides real-time data on the most popular and actively traded social share pairs. Identify trending assets, analyze their performance, and capitalize on market movements to enhance your trading strategy. Marketplace Explore a dynamic marketplace where users can buy and sell social shares. Discover a wide range of assets and find exciting investment opportunities. With our user-friendly marketplace interface, you can easily navigate through listings, analyze market trends, and make strategic investment choices. Powerful Servers and Custom Nodes Trust in the reliability and speed of 0xFriend. Our platform is hosted on powerful servers and custom nodes, providing lightning-fast execution speeds. Experience the best-in-class performance and enjoy a seamless trading experience unmatched in the market. Sniping Made Easy 0xFriend simplifies the process of sniping shares on friend.tech. Our seamless integration allows you to quickly and efficiently execute sniping transactions, ensuring you never miss out on lucrative opportunities. Take advantage of market fluctuations and secure shares at the most advantageous prices.","links":"https://0xfriend.live/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/0xfriend/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x570147337f1a2313fc35573f6a123ceb109eb901"}}}