{"name":"Muhdo Hub","id":"muhdo-hub","symbol":"dna","description":"Muhdo's AI-driven health ecosystem empowers you to stake, earn, and access tailored wellness products based on your unique genetic makeup. Why $DNA Token? Through the implementation of a Web3 based $DNA Token, the health and wellbeing services provided by Muhdo are dramatically enhanced. Muhdo is able to provide its own unique framework on the Web3 layer to create a secure and improved experience for Muhdo Hub users. Turn Health in to Wealth In addition to the health benefits that the $DNA Token provides through the user experience, the $DNA Token also provides opportunities for extended user rewards. Muhdo App users, at their discretion, are able to anonymously offer their individual data for research in exchange for $DNA Token rewards. This Data Mining feature further opens the pathway to revenue share. Muhdo Earn Muhdo Earn is an exciting feature that provides $DNA Token users the opportunity to earn a share of revenue generated by Muhdo through a staking pool. Muhdo users are able to stake their $DNA Tokens that they have earned to periodically receive even more $DNA Tokens for use in the Muhdo Ecosystem. The Muhdo User Experience A Muhdo user is onboarded through the Muhdo Hub and is encouraged to perform a DNA or epigenetic test to receive specific information about their own health and DNA. This unique data is utilized in the Muhdo Hub to make informed decisions to improve their health. By using the Muhdo App, rewards in the form of the $DNA Token can be earned and redeemed for health products recommended and provided by Muhdo based on the user's specific requirements.","links":"https://www.muhdohub.xyz/","market_cap":3006176,"market_cap_rank":2475,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/muhdo-hub/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7d3e4165fd7d8590fb2a415a550f7bdece5c4f52"},"solana":{"decimal_place":8,"contract_address":"Fnm6Jf4BtRHSjMcUt7jYk5cJksQhzuwhtgg94kG5XB59"}}}