{"name":"Safe SeaFood Coin","id":"safe-seafood-coin","symbol":"ssf","description":"Safe SeaFood ($SSF) coin's aim is to improve the existing ways in which global aquaculture, the hospitality industry and restaurants store the harvest and shipping information contained on industry standard Shellfish and Seafood Harvest Tags (SSHT) and the industry standard Parasite Destruction Records (PDR) by incorporating that information into the Safe SeaFood blockchain so local, state and federal regulators can track and retrieve that information in a secure, indisputable, tamper resistant, verifiable way using blockchain technology. The seafood supply chain moves 158 million metric tons of fish, shellfish and other bounty from the sea each year. It creates livelihoods for tens of millions of people and feeds billions by tapping the world’s last major source of wild protein. Realizing the potential of blockchain technology in Aquaculture and the hospitality industry, however, requires Aquaculture advocates to understand how seafood supply blockchains work, and that is where SSF blockchain comes in. We will work with Aquaculture advocates and Government Regulators/Inspectors to help them implement the use of SSF blockchain technology as a way to streamline the management and storage of the Shellfish and Seafood Harvest Tag and Parasite Destruction Records requirement and help improve overall Health and Safety standards governments and regulators demand of industry. Beginning January 1, 2018 the United States started to enforce its Seafood Import Monitoring Program (SIMP), guaranteed traceability of seafood is set to become even more important than it is now, so NOW is the time to act, and to implement use of SSF blockchain technology to meet new requirements coming to the industry standards. Our main goal is to keep the storage of SSHT/PDR information in a secure, tamper resistant way using blockchain technology as cost efficient as possible. That is why we choose a POW coin and not a ERC20 Token. ERC20 tokens are dependent on the Ethereum (ETH) blockchain. The ETH blockchain is congested and expensive therefore the cost of doing business on that chain is very high. We decided that we could keep the cost of storing SSHT/PDR data to a minimum by only charging a \"transaction fee\" for payment to the miners to keep a secure network. While using Safe SeaFood Coin ($SSF) to help satisfy the inspection, maintenance and record keeping requirements that many government's demand of harvesters, fisheries and restaurateurs (USDA,NSSP,CSSP, The EU's Commission’s Health and Food Audit and Analysis Directorate or any other national government's Shellfish Sanitation Program) you can cut the cost of inventory waste, inspection, storage, record maintenance and keeping requirements by using Blockchain Technology. Using the Safe SeaFood Coin ($SSF) Wallet to input the Shellfish and Seafood Harvest Tag and/or the Parasite Destruction Records information will help the seafood industry cut costs by eliminating product being returned unusable due to lost, ripped or removed Harvest Tags along with a efficient and verifiable way to store that information depending upon your particular requirements. Using the Safe Seafood Coin ($SSF) wallet to input the information contained on the Shellfish and Seafood Harvest Tag and/or Parasite Destruction Records will help the Restaurant industry fulfill the requirements of storage by local, state and federal regulations. Currently the tag must remain on the container until all shellfish in the container are sold or discarded. The tag must then be kept on file by the retailer for 90 days. By inputting that information on the SSF blockchain we are able to keep that information accessible to inspectors and health departments for an interminably amount of time and accessible from any computer terminal. Using the Safe SeaFood Coin ($SSF) explorer local, state and federal inspector's can retrieve and verify any and all information associated with a wallet address, transaction id and visually see the Shellfish and Seafood Harvest Tag and/or Parasite Destruction Record information.","links":"https://safeseafoodcoin.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/safe-seafood-coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}