{"name":"Stella Fantasy Token","id":"stella-fantasy-token_binance-smart-chain","symbol":"sfty","description":"What is the project about? Stella Fantasy is a high-quality Web3 ARPG built on Binance Smart Chain. The players can conquer Abyss Rifts, gather resources, craft gear, and battle in an Anime-inspired world. And the game offers intriguing features where players can trade their characters and weapons on the Marketplace or use them to tackle more challenging content, earning better rewards in return. In order to maintain the game's ecosystem, Stella Fantasy Token (SFTY) has been issued and this token plays a crucial role in awakening and crafting NFTs and purchasing high-grade items. What makes your project unique? Stella Fantasy Token (SFTY) is integral to our collectible RPG's character growth ecosystem, providing players with diverse uses. Our goal is to create a sustainable environment where players and token holders thrive, earning rewards through Burn to Earn mechanisms, such as clearing challenging content or excelling in PvP activities. This dynamic gaming experience is achieved through SFTY tokens, building a self-sustaining ecosystem that rewards skill and dedication. History of your project. Ring Games was founded in 2019 by Jooho YUN, CEO, and a team of developers who had previously worked together with him for the global hit mobile character collectible RPG ‘King’s Raid’ which recorded over 10 million global downloads Worldwide and grossed 200 million dollars sales in 2017. What’s next for your project? Our team aims to create immersive and engaging games by breaking free from outdated graphics and gameplay mechanics. We are committed to deliver a full-fledged action RPG that lasts for years. What can your token be used for? Stella Fanatsy tokens can be used in the following ways. [Reward] - SFTY Abyss Rift - Seasonal Boss Raid Contents - Asynchronous PvP Contents (Future Update) [Use] - Awakening Character NFT - Crafting High-grade Gear NFT - Purchasing High-grade Item - Crafting High-grade Rune NFT (Future Update)","links":"https://www.stellafantasy.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stella-fantasy-token_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe9d6d6d7cde5c7d45927f8c37460d932e612c902","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xe9d6d6d7cde5c7d45927f8c37460d932e612c902"}},"is_native":false}