{"name":"Opticash","id":"opticash","symbol":"opch","description":"What is the project about? Opticash is an all-in-one platform that simplifies money remittance across the world using crypto and blockchain technology. You can trade, invest, chat and transfer fiat to crypto and vice versa very conveniently. What makes your project unique? Opticash is majorly a crypto remittance fin-tech platform that provides banking, chat system, exchange, debit cards, mobile app, and multiple wallet feature, Unlike our competitors, our product/solution provides a Social interactive platform along with a decentralised banking and fast payment system around the world using Opticash (OPCH). History of your project. The founders of project are well places into finance industry and view cryptocurrency as a path to a more equitable financial system and want to empower everyone to have access to open and secure financial systems.Opticash is such a bridge that sets out an alternative vision for the future economy, Its innovative payment mechanism is fully compatible with programmability, composability, and tokenization to support faster, safer and cheaper payments and settlement, both within and across borders. What’s next for your project? Opticash Banking and Digital Payment Cards Token Staking and Yield Farming Mobile App for Ease and Access Cross-Chain Accessibility of Tokens What can your token be used for? $OPCH token is to support the ecosystem, it will be used to pay for transfers and trade fees and all the tokens collected as fee will be burnt to support quantity deflation and price inflation.","links":"https://opticash.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/opticash/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x4d4d883f920f7c0c36a1be71a02aa0cde2aa22d1"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4d4d883f920f7c0c36a1be71a02aa0cde2aa22d1"},"polygon-pos":{"decimal_place":18,"contract_address":"0x4d4d883f920f7c0c36a1be71a02aa0cde2aa22d1"}}}