{"name":"Unlock Maverick","id":"unlock-maverick","symbol":"unkmav","description":"What is the project about? Unlock is a natively cross-chain yield and govenance tool integrating with Maverick Protocol. Unlock combines quantitative optimization and machine learning to provide maximum yield for Maverick LP's segmented by risk tranche. Unlock also gives boosted veMAV voting power through Unlock Maverick. Users can deposit $MAV or any token to mint $unkMAV. A liquid wrapper for $veMAV, giving you all the benefits of $veMAV whilst being able to swap back to $MAV at 1:1 ratio. What makes your project unique? Security. from day 0 we integrated a group of ecosystem experts, with leading reputations and representatives from key protocols already building with Maverick. there are multiple partner protocols such as Maverick, Liquity, Tokemak, Pendle and unshETH. Enhanced risk-adjusted yield. Unlock utilizes back-tested algorithms to optimize deposits across maverick LP's and different risk profiles to give you the highest possible risk-adjusted yield. As well as boosted Yield for Maverick LP's, by routing deposits through Unlock's yield booster users get higher yield, reducesd gas costs and all the benefits of veMAV and active LP management without any of the costs. History of your project. The project launched in July 2023 and is live on Ethereum, zkSync and BNBChain. What’s next for your project? Boosted Maverick Pools Multiple incentivized positions on maverick to provide liquid markets for tokens that users can provide liquidity into to earn yield. Liquidity Multiple boosted maverick LP's to make locked tokens tradable through wrappers that may also be used as collateral for minting. 2nd Incentivized launch phase 'The Unlock Games stage 2' - A series of opportunities to learn about Unlock and contribute to the protocol whilst being rewarded for doing so! What can your token be used for? unkMAV can be used to get a liquid wrapper for veMAV, earn protocol fees as well as additional incentives from vote bounties and boosted Maverick LP's.","links":"https://unk.app","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/unlock-maverick/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x04506dddbf689714487f91ae1397047169afcf34"},"zksync":{"decimal_place":null,"contract_address":"0x81fe5d73a48336129888d71bf164209cf646540f"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1a57d349aa36e54e5a36fd99d93d27fd42f71491"}}}