{"name":"Mir Token","id":"mir-token","symbol":"mir","description":"Today, as in the past, financial transactions in the banking system face enormous difficulties, including systemic segmentation and isolation, high transfer fees, and the unavailability of liquidity in certain amounts and among banks. Even more so now, since Covid-19, it has become increasingly common to use digital transaction methods. Thus, the most digitalized banks are more and more solicited and efficient with three details: Transactions from one bank to another take a lot of time, they are costly and sometimes when they drag on, it is almost impossible to track the level of evolution of the transaction, both for the Sender and the Reciever. All this is even worse when it comes to Africa. One of the main difficulties, which central banks will face when they finally decide to start using it, is the progressive weighting of Blockchain over time. Indeed, it turns out that the more Blockchains are solicited, the heavier they become over time. This is the case of the Bitcoin blockchain, whose speed of issuance has been considerably reduced over the past ten years. Not to mention its mining costs, which have become increasingly insignificant, for increasingly complex algorithms. Also other Blockchain models have emerged, offering a total mining, but suffering quite quickly the same problem of weighting in the medium term. All this does not serve the banking sector any more at the moment when it decides to tackle it. MIR is a Token to fund the future of Blockchain, an optimization model of two types: Blockchains that will be able to carry billions of transactions per day without the constraint of reduced performance, thanks to new types of servers already in development. Algorithms that reverse the weighting of Blockchain, thanks to new types of encodings and language of micro compression of information on Blockchain.","links":"https://mir-token.com/","market_cap":32136,"market_cap_rank":8140,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mir-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x2134f3a7b18ae4161fbab6eccca7497e17a6777b","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x2134f3a7b18ae4161fbab6eccca7497e17a6777b"}}}