{"name":"Mentat","id":"mentat","symbol":"spice","description":"Mentat is a crypto intelligence engine built to power Web3 agentic frameworks and consumer applications. It empowers users and apps to effortlessly access blockchain data, supporting tasks ranging from basic insights to advanced research and complex multi-step analysis. Mentat combines agentic planning with comprehensive access to DeFi protocols, market data, and cross-chain services; our platform can autonomously synthesize large volumes of real-time information. It handles everything from granular tasks like parsing transaction histories and evaluating token distributions to more complex behaviors like running liquidity pool analyses. In the future, we will build out support for higher-level on-chain operations such as detecting security vulnerabilities in smart contracts, executing sophisticated DeFi activities, or coordinating and optimizing on-chain governance proposals. The result is a uniquely powerful system that democratizes advanced blockchain reasoning—empowering anyone, from casual investors to engineers, to make data-driven decisions and build the next generation of AI-enabled, decentralized applications without wrestling with technical complexity. The breakthrough we are introducing hinges on a new class of AI systems often referred to as reasoning models. These models—pioneered by major research labs and now rapidly adopted by the broader AI community—possess the ability to parse text instructions, translate them into executable commands, and intelligently chain multiple tools together to complete complex tasks. They move beyond simple “question and answer” interactions and can orchestrate entire workflows. This shift represents a generational leap from conventional language models to agentic AI systems capable of long-term planning and contextual tool usage. In essence, they do not just respond with “what” is needed; they also determine “how” to accomplish it by selecting and orchestrating the appropriate tools. Think of them as the brains behind the next wave of automation—capable of analyzing on-chain data, running calculations, generating visualizations, and conducting simulations in an adaptive, goal-oriented manner.","links":"https://mentat.xyz/","market_cap":13595.93,"market_cap_rank":9236,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mentat/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"4oz9DZabbYNeB7UGUA4HYZKYRb4Hwm3h2u2x4CrumbAr","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/4oz9DZabbYNeB7UGUA4HYZKYRb4Hwm3h2u2x4CrumbAr"}}}