{"name":"GeniuX","id":"geniux","symbol":"iux","description":"What is GeniuX (IUX)? The ecosystem is underpinned by GeniuX, a utility token based on the Polygon standard. It will be used to support the tokenization of real-world assets, with a wide range of sectors covered including real estate, transportation, sports, and arts. Who is the Founder of GeniuX (Genius Assets Marketplace)? Founded in 2018, we built the first and biggest, secure digital assets marketplace in the world. The project is owned by the company Genius Assets. It was founded by Claudiu Buda, and before that, in the last 13 years, his professional career has been focused on sales. Claudiu has built a large and immense community with more than 200.000 customers in 17 countries and sales of more than 75 million euros. Genius Assets was first launched in 2021 and had its Token Generation Event on June 18th, 2022, with the first real estate Fractional Ownership Project set to launch by the end of the year. It started from the main idea that each and every one of us can be a GENIUS itself and can make all our dreams come true. You just need to find your inside Genius and let it out for a higher purpose. Assets you can imagine from what they came from, but you don’t know the real reason. We wanted to combine the digital and real-world assets in a single marketplace, accessible for everyone, through GeniuX, which X marks the spot for a lifetime treasure. What makes GeniuX unique? Digital assets marketplace Genius Assets is a new project allowing decentralized investments in non-crypto assets. Through tokenization, Genius Assets will make it possible for ecosystem participants to hold digital shares in properties and other assets via fractional ownership and receive a corresponding percentage of the income those assets generate. The aim of the project is to make the token economy a viable option for long-term holders seeking regular revenue. While many of the investment opportunities available via the GeniuX token will be traditional, the possibility of participating in ICOs and NFT releases means the digital assets space will not be overlooked. A debit card, more real estate projects, an NFT marketplace, and further Defi integration will follow in 2023. The project founders ultimately hope to build the largest marketplace for high-value digital and physical assets on the blockchain. How many GeniuX (IUX) coins are there in circulation? The IUX economic model has a total supply of 1,000,000,000.00 IUX. IUX’s native token was first made available for purchase through a private sale of 2% and a pre-sale of 5%. Of the remaining, for public sale there is available 24%, for Advisors and strategic partners 5%, incentives and airdrops 3%, and a total of 15% for the Burn Program. Allocated to Founders and Core Team there is 6%, for community rewards and development is 40%. Also, for sustainable Marketing 5%, for liquidity and exchange listing we allocated 5%, and for Staking and Growth 30%. How is the GeniuX secured? There is a top3 IT & Blockchain company in East Europe that has developed the entire ecosystem, from scratch! A cyber security and stress testing on the platform are complete, using cutting edge technologies, creating a unique brand, with an inside blockchain developer who created the smart contract for the platform. The Smart Contract has been audited by Hacken, a platform that enables everyone to become an ethical hacker to protect Web 3.0 space by encouraging cybersecurity! Results of SC audit: 9.90/10 Audit report: https://hacken.io/audits/#geniusassets Medium article: https://medium.com/@geniusassets/genius-assets-x-hacken-d76bf6fc39fd","links":"https://genius-assets.com/","market_cap":10415.84,"market_cap_rank":7660,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/geniux/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x346404079b3792a6c548b072b9c4dddfb92948d5"}}}