{"name":"Rank","id":"rank-2","symbol":"ran","description":"Rank is a DeFi trading platform with AI tools specifically designed for advanced traders with or without coding experience. Like OpenSea for NFT, Rank is a marketplace for traders where the performance of each trader's strategy will be ranked according to return, with rankings innovatively displayed so that anyone can follow day-to-day performance. This in turn allows peers on Rank—even someone without any trading knowledge—to evaluate the rankings and invest in any trader's strategy that best suits their expectations in terms of risk and reward. Before deploying a strategy, traders can check past performance with our special forward-test AI tool. With this tool, a trader will be able to simulate how a strategy would have performed live, day after day, just by selecting a starting date in the past. This is much different from standard backtesting, where performances are calculated linearly from the current present back to the past, usually with a high tendency toward mathematical optimization of the results that does not reflect the daily strength of the performance. Rank enables anyone to build and deploy their own trading strategies by selecting from a list of main technical indicators and moving averages, which the platform then uses to automatically execute trades. This can be done with no prior programming experience. On Rank, the deployment of new no-code trading strategies (‘Strats’) is done easily via a step-based graphical interface, similar to an iPad app. Thus, Rank provides users with a platform for finding investors as well as investments. Rank offers a number of additional benefits, including: Enabling anyone owning crypto assets to effectively invest in DeFi, with or without prior DeFi knowledge Mitigating the risks inherent to DeFi that cannot easily be managed by a single passive investor Providing investment strategies for investors who do not have the time, knowledge, or experience to take full advantage of DeFi opportunities Enabling anyone to create and deploy an investment strategy and garner subsequent capital in the form of investments","links":"https://rank.trading","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rank-2/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}