{"name":"Blockscape","id":"blockscape","symbol":"blc","description":"What is the project about? Blockscape is a token on the Binance Smart Chain. Blockscape aims to build a blockchain and dApps that are focused on making it easier for developers to deploy smart contracts. The Blockscape test-net is live: https://explorer.blockscape.net/. Blockscape has a native launch pad currently live on Binance Smart Chain and available for developers to have tools on Binance Smart Chain and the Blockscape testnet: https://launchpad.blockscape.net/app/dashboard What makes your project unique? Blockscape has an audited smart contract. The BLC token will be used as a gas token on the future blockchain. Blockscape's launchpad currently allows for developers to deploy token contracts on Binance Smart Chain or Blockscape test-net. The Blockscape launch pad can also be used to mint new tokens with predefined conditions, lock liquidity, send airdrops or to stake and earn an APR from staking the native BLC token: https://stake.app-blockscape.org/. History of your project. Blockscape fair launched March 29th, 2023. Since launch, Blockscape has released a testnet for the upcoming blockchain https://explorer.blockscape.net/. Blockscape has garnered social media attention, and an active community on Telegram and Twitter. After the testnet was released, Blockscape released a launchpad so projects can have a simpler process deploying token smart contracts and locking liquidity both on the Blockscape test-net and Binance Smart Chain: https://launchpad.blockscape.net/app/dashboard. What’s next for your project? Blockscape aims to have the mainnet blockchain live, along with the native bridge for BLC holders to migrate from Binance Smart Chain to Blockscape Mainnet in Phase 4 of the road map, or quarter 3 of 2023. Blockscape is putting an emphasis on driving adoption and awareness to the BLC dApps and products on its current phase of the roadmap. What can your token be used for? Currently BLC can be used as an exchange of value.","links":"https://blockscape.net/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockscape/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x419264d79b92b8de3c710ab0cd3406cd11990e02"}}}