{"name":"Crypto Global United","id":"crypto-global-united_binance-smart-chain","symbol":"cgu","description":"Crypto Global United, CGU began as a platform for lending NFTs to blockchain gamers, helping them increase their earnings and access better opportunities on play-to-earn titles. Whilst still providing this on their platform, CGU has evolved to offer its community the ability to take part in a decentralised economy, generate sustainable income via play, learn and metaverse work opportunities, while learning new digital skills and engaging with an energised global community. CGU is the native currency of the CGU DAO, and takes the form of an ERC20 & BEP20 token with a total supply of 1 billion. Token Utility • Staking CGU for token rewards related to specific activities • Staking CGU to vote and participate in the DAO • Using CGU to pay for services within the CGU network • In the future, CGU tokens will also give community members access to exclusive metaverse properties, NFT assets and involvement in a range of digital asset opportunities in new and evolving blockchain game-based initiatives. What Makes Crypto Global United (CGU) Unique? CGU already has a large, active, and dispersed community of play-to-earn gamers, with almost 3000 active accounts since its launch in October 2021. Additionally, the project focuses on developing players through education and training, rewarding them with CGU tokens for completing certain milestones. All CGU holders own a proportional share of the DAO’s assets, and will be able to vote to shape the future direction and priorities of the organisation.","links":"https://www.cgu.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-global-united_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":8,"contract_address":"0x747d74db20cc422f39ab54edb2a3ce21f3c98af1","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x747d74db20cc422f39ab54edb2a3ce21f3c98af1"}},"is_native":false}