{"name":"Tomarket","id":"tomarket","symbol":"toma","description":"Tomarket is an on-chain asset trading platform within the Telegram ecosystem. Users can play games, earn tokens, and trade all in one place. Tomakret has previously received investments from Bitget Wallet and Foresight X, and is committed to attracting more Web2 users to understand and enter the Web3 world. Phase I: Game The gaming aspect is designed to attract users and increase Tomarket's Daily Active Users (DAU). Game Iteration: Continuously attract users by developing new game elements. Paid Items: Generate revenue by offering in-game paid items for purchase. Game Collaboration: Provide traffic services to other game parties and charge commission and upfront fees. Phase II: Earn - FarmingPool Tomarket serves as an intermediary platform, connecting a large number of users on one side and various Web3 project parties on the other. By obtaining airdrops and marketing budgets from Web3 projects, these airdrops are continuously distributed to active users on Tomarket. From the user's perspective, they will continuously receive new airdrop incentives, and Tomarket's referral network can also earn a certain percentage of the airdrop amount from the invited users, which will motivate users to invite more users to join Tomarket's network. From the perspective of Web3 projects, they will gain new users to experience their products and services. From Tomarket's perspective, on one hand, it can continuously attract users to use the Tomarket App, and on the other hand, it can continuously receive user referral fees from Web3 projects. Phase III: On-chain Exchange (In development) Tomarket will launch a multi-chain dex aggregator, while further expanding its business to become an on-chain exchange.","links":"https://tomarket.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tomarket/logo.png","detail_platform":{"aptos":{"decimal_place":6,"contract_address":"0x9d0595765a31f8d56e1d2aafc4d6c76f283c67a074ef8812d8c31bd8252ac2c3::asset::TOMA","geckoterminal_url":"https://www.geckoterminal.com/aptos/tokens/0x9d0595765a31f8d56e1d2aafc4d6c76f283c67a074ef8812d8c31bd8252ac2c3::asset::TOMA"}}}