{"name":"Handz of Gods","id":"handz-of-gods_ethereum","symbol":"handz","description":"What is the project about? Liquidity blackhole of revenue-sharing tokens and onchain exposure through tax and voting mechanism What makes your project unique? Imagine owning exposure to a diverse array of trending on-chain tokens without having to accumulate each one individually but instead only buy one. That is exactly what $HANDZ aims to build — a crypto treasury funded by our tax mechanism. Through our 5 % buy & 5% sale tax mechanism, we can change the buyback address token each time the community votes for a specific token. Depending on the volatility/volume of $HANDZ, this could be a rapid process. For instance, as of today, if our buyback token is UNICHAD, we would need approximately $1m volume to be part of the top 10 holders, a feasible target in the present market environment. History of your project. Taxation and benefits for holders On every transaction, we apply a tax: - BUY tax: 3% goes to buy back the dedicated token automatically, 2% goes to our LP - SELL tax: 3% goes to buy back the dedicated token automatically, 1% goes to our LP, 1% in ETH (the god tax for selling $HANDZ holders will receive all revenue generated of our treasury. Hopefully will be pretty significant long term as revenue/projects we bought grows The top 50 $HANDZ holders will have the power to choose which token we buy back, increase or decrease the tax, invest in OTC deals - The top 250 holders can suggest any project they favor and put it up for voting among the top 50 holders. What’s next for your project? Voting system implementation Rewards mechanism implementation What can your token be used for? Collecting rewards of the treasury","links":"https://handzofgods.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/handz-of-gods/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x9baa12a9e3b9dc355f162082762f95626367d087","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x9baa12a9e3b9dc355f162082762f95626367d087"}},"is_native":false}