{"name":"SafeBank BSC","id":"safebank-token","symbol":"sbank","description":"SafeBank is the initial cryptocurrency banking feature that we’re implementing for investors who want powerful tools that give them more finite control over their investment. It’s a new Dapp from SafeBitcoin. Our long term goal is to bring greater fundamental value to the SafeBTC token and ultimately shift the global mindset of potential investors in a direction that is centered on expansive passive income potential while giving them more control over their investment. While we continue to push for the goal of making SafeBitcoin one of the top cryptocurrencies in the world, we strive for introducing even more value through fundamentals. This is why the SafeBank branch of our ecosystem combines the immediate passive income of yield reflection from standard tokenomics with the long term high yield passive income of farming a new token with its own DeFi rewards. SafeBank is just the beginning of a larger roadmap. Future development will include SafeBank Lending, a SafeBitcoin mobile wallet, a specialized SafeBitcoin exchange app, and a SafeBitcoin Visa Card. All of these pieces encapsulate the essence of our vision to build a powerful ecosystem where investors safely and productively control their own passive income. We want SafeBank to be like a bank but with greater benefits that can only be possible with cryptocurrency for investors but more importantly, we want it to be a better “bank” than run-of-the-mill fiat banks. Fiat based banks around the world enforce long lock periods for money that is put into their savings accounts or CDs. While these do yield some interest, their annual percentage yield is often negligible. Comparatively, SafeBank brings similar yielded interest in the form of “farming” by staking SafeBTC LP but with exponentially higher APY. When any amount of SafeBTC LP is staked for the farming of SafeBank tokens, a significantly higher and stable APY is applied but without enforcing unnecessarily long locked durations. This means that investors can choose their own staking period and ultimately keep full control of their passive income. In addition to receiving SafeBank tokens as the SafeBTC LP farming rewards, each transaction of the SafeBank token on BEP-20 or ERC-20 will reward holders with a percentage of a stable USD coin as part of its own tokenomics model. The passive income potential of the SafeBitcoin ecosystem comes from three main sources: SafeBTC tokenomics, SafeBTC LP (farming SafeBank tokens), and SafeBank tokenomics. We’re serious about building a powerful ecosystem where investors think “passive earning”, “cryptocurrency banking”, and “high yield farming” when they hear or see the SafeBTC, SafeBitcoin, or SafeBank brand names.","links":"https://safebitcoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/safebank-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x43acedd39ba4b0bfccd92897fce617fb90a971d8"}}}