{"name":"Oasys","id":"oasys","symbol":"oas","description":"In the blockchain game, a huge number of transactions occur. However, many blockchains cannot handle so many Transactions, and nodes often crash. Oasys, as a game-specific blockchain, uses technology that is less likely to fail due to the increased number of transactions caused by games. Oasys is a multi-layered EVM-compatible PoS public blockchain that solves game developers’ struggles with other blockchains. The main competitors are blockchains trying to solve the problems of scalability, gas fees, and transaction speed of Ethereum. e.g) Flow, Avalanche, Polygon, Polkadot and so on. For gamers 1. Zero Gas Fees 2. High-speed Transactions 3. Scam Less For game developers. 1. Flexible Token Design with using vTokens and oTokens 2. Builders’ Own Verse 3. EVM-Compatible 4. Scam Resistance For IP holders 1. Easier to Protect IP 2. Eco Friendly 3. A verse limited to own IP 4. Scam Resistance And features of Oasys are three points as below. Firstly, Hub-Layer : High Scalability, High Data Availability, High Network Stability. The Hub-Layer is specialized for storing and exchanging data securely and in a stable manner, so it does not allow applications to run directly. The layer maintains high data availability as all data on Oasys is stored. Block time is set to every 15 seconds , the same level as Ethereum, to ensure stable data transmission to globally distributed nodes. With the same level of network stability as Ethereum, the Hub-Layer has enough resilience to operate with thousands of Verse-Layers connected. Secondly, Verse-Layer: Oasys Layer-2 Technology. The Verse-Layer is the layer 2 blockchain on Oasys. The layer can operate as a permissioned chain. While there are several layer 2 options, our solution is customized Optimistic rollups at this moment. Finally, Token Design: Three Types of FT/NFT. Fungible Token (FT) and Non-Fungible Token (NFT) are essential assets for tokenomics in the ecosystem.","links":"https://www.oasys.games/","market_cap":55112637,"market_cap_rank":755,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/oasys/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}