{"name":"UniPlay","id":"uniplay","symbol":"unp","description":"UniPlay Token is an ERC20 utility token developed by PlayPearls Ltd and a cluster of experienced iGaming experts. The primary function is to operate as a Play-To-Earn token in running social casinos within the PlayPearls umbrella, such as slotclash.com. In the social platform, the token is processed as a reward token; the player's journey tracks achievements, activity, game and tournament participation, wins, friends, levelling up, etc. In a nutshell, the more extended player plays, the more he potentially earns. Awarded tokens, players can either withdraw, use them on a buy-in for high-value slot tournaments, or even vest them on the platform. Outside of the social platform, players can use the token to deposit multiple different licenced gambling websites, and additionally, a day to day products will be added. Early NFTs will be based on the PlayPearls Ltd gaming universe and characters created on games and comic books. NFT's minting rights will be rewarded on high-value tournaments or swapped for other tokens. The Social Casino will reward tokens, NFTs, vouchers and cash. Without any deposit requested from the player. All players will have the same equal opportunity to level up and win. Naturally, as it's Social Casino, lady luck plays a part. The platform responds to issues and conditions within the gambling and iGaming industry. Roughly 90% of Gambling players never deposit any funds onto web two online casinos, yet they enjoy free spins and lucrative registration bonuses. Our data collected over the years on free-to-play models in web and app stores support that players love to play casino games. Particularly they enjoy social slot tournaments with real-life prizes. Often, players stop playing only due lack of funds. With the play-to-earn model, we can forecast excellent results, and our low CPA will ensure the flow of new players. It's essential to apprehend that even with the token, NFT and metaverse, UniPlay, this is an iGaming project. The co","links":"https://uniplaycoin.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/uniplay/logo.png"}