{"name":"Caacon","id":"caacon","symbol":"cc","description":"Caacon is a blockchain-based jackpot lottery token built on the Ethereum network. Players participate by purchasing Caacon tokens (CC) and hoping to win the jackpot prize. The rules of the game are straightforward and explained in detail in the \"Jackpot\" section. In addition to the Jackpot game, Caacon is also developing a range of 100% anonymous and secure casino games that are enjoyable for players. What makes Caacon unique? Caacon has a custom built jackpot telegram bot which has already paid out over 10 ETH to players starting from the launch of the project which was on Jun-19-2023. To participate, players need to purchase a minimum of $100 worth of Caacon tokens, which provides them with a chance to win. The more tokens they purchase, the higher their chances of winning the jackpot. Transactions that exceed $100 are automatically entered into the system, where the bot calculates the winning percentage for each transaction. For instance, a purchase worth $100 to $200 gives a player a one percent (1%) chance of winning, while a purchase worth $200 to $300 increases their chance to two percent (2%). The maximum chance of winning, which stands at ten percent (10%), is available to players who make a purchase of at least $1,000. In the event that the system selects a transaction as a winner, the payout transaction is automatically executed, providing a seamless and efficient payout process for the lucky winner. 100-200$ buy = 1% chance to win 200-300$ buy = 2% chance to win ... 1000$ and + buy = 10% chance to win (max) History of Caacon for now. Before the launch we developed the jackpot bot, built websites and set up social media. Right after launch we started working with Slotegrator (https://slotegrator.pro/) to set up our own casino slots onto website. Whats next? -Setting up our casino -Nfts with utility (free spins etc) -listing in a well known exchange -Staking -long term vision is custom built Caacon Casino with CC used as ingame currency","links":"https://www.caacon.vip/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/caacon/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x597981eac8a293054a1826c7b60cbf92972a36c1"}}}