{"name":"Bunny Zilla","id":"bunny-zilla","symbol":"bunnyzilla","description":"\"What Is Bunny Zilla (BUNNYZILLA)? Bunny Zilla is an autonomous yield and liquidity generation protocol. Bunny Zilla works by applying a 12% tax to each transaction. This tax is used as follows: 2% is instantly and gas-lessly distributed to the holders of BUNNYZILLA. There is no need to farm or claim, holders will simply see more BUNNYZILLA tokens in their wallet. 2% is paired with BNB and automatically added to liquidity, thereby constantly increasing the BUNNYZILLA price floor. And another 5% goes to marketing wallet that can make this token keep growing. BUNNYZILLA notes that for each transaction, the BUNNYZILLA protocol will automatically distribute the rewards to holders, as well as auto-locking the liquidity forever by continuously burning the BNB/BUNNYZILLA LP tokens. The team ensures that these daily burns are transparent and visible on the blockchain, and claims that this makes the token is “unruggable.” What Is Yield Farming? What is yield farming in cryptocurrency and decentralized applications? In short, it's a new way to gain passive income while at the same time supporting the development of the cryptocurrency world. Yield is a common term used in farming to measure the productivity of a farm. In cryptocurrency, yield usually refers to the annual interest payout a cryptocurrency a user can earn. Yield can be generated from holding tokens in a staking wallet or from master node rewards. Yield farming is the use of a cryptocurrency lending strategy that minimizes risk while generating interest on investments into cryptocurrency. What Is Binance Coin (BNB)? BUNNYZILLA users have 2% of their tokens paired with BNB, which stands for Binance Coin. Binance Coin is a token that allows users to receive a discount for any fees on the Binance platform, a pure cryptocurrency exchange that plans to create a decentralized exchange for blockchain assets. Additionally, BNB will provide users with access to special features and will be eligible for quarterly profits.\"","links":"https://bunnyzilla.site/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bunny-zilla/logo.png"}