{"name":"Stohn Coin","id":"stohn-coin","symbol":"soh","description":"What is the project about? Stohn Coin is a decentralized digital currency, without a central bank or single administrator. It can be sent from user to user on the peer-to-peer Stohn Coin network without the need for intermediaries. Transactions are verified by network nodes through cryptography and recorded in a public distributed ledger, known as a blockchain. Stohn Coin was created in 2021 by a group of enthusiasts passionate about cryptocurrency. Unlike Bitcoin, which has a capped supply of 21 million, Stohn Coin has a maximum supply of 40 million coins. Miners are currently rewarded with 100 coins for each block they mine, but this block reward will halve every 200,000 blocks, mimicking the deflationary model of Bitcoin. Each block is targeted to be mined every 5 minutes on average. For mining, Stohn Coin uses the Scrypt algorithm, a proof-of-work system that's memory-intensive, making it resistant to custom hardware like ASICs and potentially more accessible to individual miners. This combination of features positions Stohn Coin as a unique entrant in the world of digital currency. What makes the project unique? Stohn coin's unique characteristic is its implementation of the LWMA3 (Linearly Weighted Moving Average 3) hashrate difficulty calculation algorithm. This is a distinguishing factor as the difficulty adjustment algorithm is an essential aspect of any cryptocurrency, ensuring stability and fairness of the mining process. Most cryptocurrencies, like Bitcoin, use some version of a difficulty adjustment algorithm, but LWMA3 stands out due to its specific properties. LWMA3 aims to keep block times consistent by responding quickly to changes in hashrate, ensuring a more stable and predictable issuance of new coins. This can be particularly beneficial for a smaller or newer cryptocurrency like Stohn coin, which may experience more variability in mining power. History of the project. The genesis block of Stohn Coin was successfully mined by Jason Stanley","links":"https://stohncoin.org","market_cap":219994,"market_cap_rank":5375,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stohn-coin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}