{"name":"HYCHAIN","id":"hytopia","symbol":"topia","description":"## What is HYTOPIA HYTOPIA is a collaborative and independent video game built by various community members at the forefront of Minecraft's modding and third-party games ecosystem for the past decade. HYTOPIA centers around a Minecraft-like game engine and platform that modernizes player and creator experiences. HYTOPIA is developed from scratch in Rust for high performance and seamless play across platforms—PC, Mac, web browser, game consoles, and mobile devices. ## What makes HYTOPIA Unique HYTOPIA is free to play and brings a familiar experience for players through cosmetics, friends lists, chats, and play pages and provides an open development environment, flexible APIs, extensive support for custom content and backward compatibility with existing content, and ready-to-use monetization systems for creators. HYTOPIA is not associated with, endorsed by, or a partner of Minecraft, Mojang, or any related parties. ## History of HYTOPIA ArkDev and Temptranquil co-founded NFT Worlds in October 2021, introducing a blockchain layer to interconnect Minecraft servers. The innovative approach attracted ~100,000 active players in the first three months before Minecraft banned blockchain technology. NFT Worlds rebranded itself as HYTOPIA and is developing its Minecraft-like game engine. ## What's next for HYTOPIA HYTOPIA is nearing beta stages and laying the foundation to (1) support all modern Minecraft versions and protocols quickly, (2) make the onboarding and transition for players frictionless and ensure the lift to use existing creator content is next to nothing, and (3) progressively rollout HYTOPIA-specific features. ## What can $TOPIA be used for $TOPIA Token is the in-game currency for the HYTOPIA ecosystem. $TOPIA enables transactions and trades among players, Worlds, and other interactions and powers the HYTOPIA blockchain. With a limited supply of 5 billion tokens, it helps create a stable, incentive-driven platform for creators and players.","links":"https://www.hychain.com/","market_cap":18197814,"market_cap_rank":1403,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hytopia/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xccccb68e1a848cbdb5b60a974e07aae143ed40c3"}}}