{"name":"Monero-Classic","id":"monero-classic-xmc","symbol":"xmc","description":"Monero-Classic (XMC) is a hard fork of Monero (XMR), announced on 29th March. Part of Monero's development is that it hard-forks every 6 months, this is completely normal so not a surprise. After one of these scheduled hard-forks Monero retains the ticker symbol 'XMR' as well as the upgrades from the hard-fork; on the 6th April hard-fork it had changes including resistance to Cryptonight ASIC miners. If people disagree with these hard-forks, they can create their own versions of Monero. The strong financial incentives against this hard-fork, resulted in 4 different entities that each has created versions of Monero that still support ASIC miners, with their own new ticker symbols: Monero (XMR), the coin supported by the core Monero development team Monero Original (XMO), announced on 29th March Monero 0 (ZMR), shared on Reddit on 31st March 2018 MoneroClassic (XMC), first Tweet on 4th April 2018 Monero-Classic (XMC), first Tweet on 5th April 2018 On the project website, the person behind Monero-Classic identifies himself as “PZ, an early Bitcoin evangelist and blockchain eco builder”. PZ's message on the website: Hello, everyone! I'm PZ, an early Bitcoin evangelist and blockchain eco builder. Most of you know me because of my efforts and adherence to the ecological development of blockchain industry. In the past few years, I saw Bitcoin community and Litecoin community both fell apart for long time due to different ideas , and the development of main chains was unable to move forward. So I organized Litecoin International Round Table Forum and Bitcoin International Round Table Forum in 2017. The two meetings were very successful. The upgrade of Litecoin and Bitcoin also went on successfully. Recently, our team noticed that XMR (Monero), the world’s largest anonymous currency, is about to change the PoW algorithm, and plans to further change it twice within 1 year. As we all know, the reason for this algorithm change is that many companies (BITMAIN, PinIdea, etc.) have developed specialized mining machines for Monero. Actually, the emergence of specialized mining machine for a cryptocurrency is normal market economy phenomenon. In the 10 years since the cryptocurrency community was born, we have seen the birth of specialized mining machine for Bitcoin. Then there emerged Litecoin, which was expected to be against specialized ASIC mining machines, using script algorithm which was considered to be\"against ASIC\" at that time. While after only two years, there appeared specialized mining machine for Litecoin. We considered about whether to change algorithm to be against specialized ASIC mining machines or not. However, after prudent and serious discussion, we believe that for any kind of valuable algorithm, the emergence of mining machine is only a matter of time. Finally, we made our choice to accept the existence of professional mining machines. Now more and more high-value currencies (algorithms) have respondent specialized ASIC mining machines, which has become a common phenomenon in the industry. Is the existence of specialized mining machines completely useless? Obviously, this argument is unfair. The emergence of specialized mining machines will indeed accelerate the rise of problems such as centralization of computational power. But we should be reminded the fact that emergence of professional mining machines will also greatly improve network security. If there are professional mining machines, the events like “Monero was attacked by more than 500,000 botnets” could be avoided. We understand that Monero team expects to stick to the expectations and work of Monero's “against ASIC mining machine”. For a long time, due to the excellent work of Monero team, XMR and its community have achieved great development, providing much valuable contributions to the entire cryptocurrency community. In the community, many people agree with this hard fork of changing algorithms. However, I feel that there is still a part of people who want to maintain the original algorithm and accept the existence of mining machines. They should be heard and respected. We believe that the two ideas of \"embrace ASIC mining machines\" and \"against ASIC mining machines\" both have their own strengths and weakness. At present, the vigorous development of the global cryptocurrency ecology is precisely due to the emergence of various ideas of different people. The collision of different ideas has brought out the flourishing of various digital currencies. We always believe that the ecological diversity of cryptocurrency community is much conducive to the birth of a more secure, stable, prosperous and beautiful encrypted world. We can, and should, allow these minority of people, who are adhering to a different idea, be given equal opportunities with the majority, and the free market will make its own choices. Therefore, we believe that these two thoughts should be given equal opportunities for development. We will make our best efforts to maintain the Monero system before this algorithm change, thereby preserving the fire that gives the ecology more potential for development. At the same time, we also invite developers, mining machine manufacturers, trading platforms, miners, purses, and others in this ecological chain to join us, so that the network ecology can gain more possibilities! XMC wallet GUI for Windows: https://github.com/monero-classic/monero-gui/releases/download/v0.1.0.0/monero-classic-wallet-gui.zip MD5：e6dabd083bbaae95fdb87bc0d4aaf483","links":"https://monero-classic.org","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/monero-classic-xmc/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}