{"name":"HeroesTD CGC","id":"heroestd-cgc","symbol":"cgc","description":"About Cloudspire Gold Coin (CGC) HeroesTD CGC Token - a.k.a HeroesTD Cloudspire Gold Coin Token - is another token to be used for game activities and on Marketplace and DEX. HeroesTD will not sell CGC directly. Instead, CGC can only be created by players. CGC can be used to summon new NFT Heroes on DApp, or can be used as entrance fee for activities. What are the use cases of Cloudspire Gold Coin (CGC)? In HeroesTD, players can summon a new NFT Heroes by using two NFT Heroes. Each NFT Heroes can only be used to summon 7 times. After each time, the cost of using that Hero to summon a new Hero will increase. On the other hand, the chance of summoning a Hero with better equipment increases. The higher “Summon Count” a Hero is, the more valuable he can be. Details of the amount of CGC consumed for summoning can be found on HeroesTD's Docs on the whitepaper. CGC can also be used as the fee to participate in activities of the game such as Challenge, Tournament to earn extra CGC. Players can withdraw the CGC earned from the game to trade on exchanges. How to earn CGC? CGC can be earned through most ingame activities: PvP Arena, Coop-mode, Challenge, Tournament, abd Daily Quest. In each mode, there will be specific rules which players have to follow to be the winners. There are also special rewards for players who achieved a high ranking on the leaderboard as well. Each player will have a certain amount of Energy to fight in Battle activities in the game. CGC tokens can only be earned when players still have Energy. Players can still enter game modes after consuming all of the Energy but will no longer receive CGC. Who are the Founder of HeroesTD CGC? CGC is the second token of HeroesTD game's economy. The game HeroesTD is developed by CG Studio – a team with over 15 years of experience in the game industry. CG Studio team consists of a board of outstanding and experienced members, who have been working in developing mobile games and Blockchain technology for a long time. The team was founded in 2013 as VGames, developed many games for cross platforms, i.e: Android, iOS, Winphone, Html5, etc. Since 2021, they have focused on strategy games with attractive gameplay. Some popular game titles of the team include GunGun Online and Chess TD. As blockchain is integrated more and more into common life, the CG Studio team started to apply the technology into games, creating a new exciting and challenging worldwide market. HeroesTD is a product with unique attributes, roles, skills and an interesting story. Where can I buy CGC? CGC is currently listed on PancakeSwap.","links":"https://heroestd.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/heroestd-cgc/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x52f8d048ba279556dd981036e7fa0345b5a90c7a"}}}