{"name":"WiFi Map","id":"wifi_polygon-pos","symbol":"wifi","description":"WiFi Map is a super app with the core asset of a community-driven decentralized wireless network that incorporates a database of 4.5 billion WiFi hotspots. We have achieved great success in Web2 space, reaching 150,000,000 million users, MAU 3,000,000 million and DAU 300,000 users, and are now ready to revolutionize the Web3 space with the vision of becoming a global virtual network operator. We are a live product that is on the market already for 8 years. More details on the App: - $WIFI and in-app wallet. An ERC-20 token on the Polygon network and the currency underpinning the entire WiFi Map ecosystem. $WIFI will be stored on the proprietary in-app wallet as well as third-party wallets. There will be a 20%-40% discount available for redeeming services via the token inside the app, in addition to lockup and staking rewards. Furthermore, the tokenization of the platform will bring redeemable rewards for those who rise up through the ranks of the leaderboard and create further incentives for community members to contribute to the platform by adding hotspots, verifying credentials and running speed tests. - Participate-to-earn: earn tokens for adding hotspots, verifying credentials, and running speed tests - Beneficial terms for partner services: enjoy special terms when accessing partner services including power banks. - Tripping: leave $WIFI tokens as a gesture of thanks to the person who added your favorite hotspot. - eSIM cashback: when you purchase eSIM data, you’ll receive 3–5% instant cashback in $WIFI tokens. When you redeem $WIFI tokens for eSIM data, you’ll receive a 15–20% token cashback reward. - Hold-to-earn: hold $WIFI in your in-app wallet to earn eSIM data. - WiFi Map DAO: 10% of all redeemed $WIFI flows into a DAO, where the WiFi Map community can decide on the best way to grow the ecosystem.","links":"https://weconnectu.io/","market_cap":320783,"market_cap_rank":5218,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wifi/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xe238ecb42c424e877652ad82d8a939183a04c35f","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xe238ecb42c424e877652ad82d8a939183a04c35f"}},"is_native":false}