{"name":"Xera","id":"xera-2_ethereum","symbol":"xera","description":"The first zero-knowledge electronic cash for private P2P payments. Keep transactions belong only to you and those you choose to trust. Ecosystem The Xera ecosystem is powered by thousands of users, developers, and nodes — everything you need to become part of a truly private and verifiable financial network. Together, we maintain an open, decentralized, and privacy-preserving infrastructure for the world. Wallets Xerra Mobile Wallet Lightweight, secure, and supports full private transfers. Your digital cash, always with you. Nightleaf A privacy-first wallet offering fully encrypted transactions and a private contact system. ParticleVault A multi-signature wallet built for enterprises and developers, supporting API integration and automated settlements. Build xerad Node The core unit of the Xera network,validating transactions and maintaining the decentralized ledger. xera.js SDK Empowers developers to build privacy applications effortlessly.From wallet plugins to payment integrations, in just a few lines of code. GitHub All code is open-source and auditable. Developers can submit improvement proposals, optimize the protocol, or build their own tools. Network Network information, development roadmap, funding, and governance of the Xera protocol. A transparent governance model ensures long-term operation, continuous iteration, and community leadership. Network Info Provides real-time block height, transaction throughput, node distribution, and shielded pool usage. Network Statistics Tracks on-chain activity, anonymity set metrics, and system performance — open, transparent, and verifiable. Funding & Governance Managed by a community DAO, the self-funded treasury supports developers, researchers, and ecosystem partners. ZIP (Xera Improvement Proposals) Anyone can submit a ZIP to propose protocol upgrades, parameter changes, or new privacy mechanisms. Xera is Encrypted Electronic Cash The first cryptocurrency to bring zero-knowledge privacy into everyday peer-to-peer payments. Xera is supported by industry leaders, available in trusted wallets and exchanges around the world, making it the ideal choice for private everyday payments and long-term savings. Ecosystem & Partners Xera Foundation Exchanges Wallets Community Grants Features Fair & Open Accessible to anyone with an internet connection. Privacy Protection Xera employs end-to-end zero-knowledge encryption to secure your financial privacy. You’re in Control Xera is a decentralized protocol — your money is yours, not the bank’s. Secret Messages Attach private notes to your transactions. Fast & Low Fees Transactions are completed in seconds, with fees typically a fraction of a cent. Self-Funded Development A decentralized developer ecosystem continuously improves the protocol and user experience.","links":"https://xeratoken.xyz/","market_cap":11350.59,"market_cap_rank":10900,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xera-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd24c0f14142aaf45ff995bc84ebf6a06add01b8d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xd24c0f14142aaf45ff995bc84ebf6a06add01b8d"}},"is_native":false}