{"name":"Arbswap","id":"arbswap","symbol":"arbs","description":"What is the project about? Arbswap is an Arbitrum-native DEX, which means we exist on both Arbitrum One and Nova. Our goal is to deliver the best game-fi optimised DEX. We believe simplicity is key and this is how our suite of products are configured. At present, Arbswap offers liquidity farming with flexible or locked position on both Nova and One: we allow projects to host LP incentives on both flexible farming a la your classic DEX; and locked farming a la Curve: the longer locked the higher boost you get. What makes your project unique? Arbswap is the first Game-Fi optimized DEX native to Arbitrum, active on both the One and Nova networks: the true meaning of Arbitrum-native. There are no DEXs as such on Arbitrum. Being native to Arbitrum has many benefits, which makes us unique. Though EVM-compatible like other L1 chains, Arbitrum actually has two very distinct deployments making it stand out from the other chains. Arbitrum Nova: a high throughput chain optimized for gaming and social apps; Arbitrum One: a scalable rollup chain with a strong innovative DeFi ecosystem. So being an AMM on top of these has allowed Arbswap to have a few competitive edges i.e. low fees, fast transactions and also simplicity at the heart of it. History of your project. As an early builder in the Arbitrum ecosystem, the Arbswap team started to build in late 2021. All core members worked for top DEXs and CEXs. This means that we know better than anyone else how to run a DEX. Based on the experience we have had in the past, we believe we are capable of creating the best DEX on Arbitrum eco. What’s next for your project? CEX listings are currently undergoing respective exchanges due diligence process. Other features launching include concentrated liquidity, cross chain farming, integrating Gamma, upgrade MasterChef to support liquidity What can your token be used for? Liquidity Mining, Staking, Launchpad allocation, governance","links":"https://arbswap.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arbswap/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xf50874f8246776ca4b89eef471e718f70f38458f"}}}