{"name":"IKOLF","id":"ikolf","symbol":"ikolf","description":"ikolF is more than the brother of Floki. ikolF is an idea, a movement and a way of life. An idea can not be caught or forgotten for it is immortal. It will live on forever and can change the world. ikolF was wronged by his brother Floki. They come from a distant planet. ikolF understands that the world is messed up, the earth is sick, there is trouble all around, confusion and misinformation prevails. ikolF will lead by example, first by taking back what is truely his. Many call him the “Floki Killer”. He tells us all that we don’t have to live like we are forced to live… Be true to what you stand for. We will rise up with a greater readiness. We will stand with a greater determination. And let us move on in these powerful days, these days of challenge, to make the world what it ought to be. We have an opportunity to make the world a better place. Standing up for the best version of ourselves. ikolF will first list on multiple CEXs to spread the word. Then comes utility based NFTs that will shake up this space. Not to mention the swap and cross chain bridge. ikolF will recruit his followers to help his movement in the P2E game “ikolF Flip”. As we all know - ikolF is a little bit evil, a little bit fancy and a little bit better A bit more about the project and utility: - BSC token - Total Supply: 100,000,000,000 - Max Transaction: 1,000,000,000 (1%) - Max Wallet: 2,000,000,000 (2%) Our utility will rely first on a swap but not any other swap. We are taking the NFTs era to the next level when we introduce our own NFTs to the community. Each NFT holder will get a pass when swapping. Just A Swap Utility? Definitely not!! Holding NFTs is fun and its even more fun when you can earn with, right? We will develop a P2E game called (ikolF Flip) where you can wager your tokens to earn passive income.","links":"https://ikolf.org","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ikolf/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x49a516bd4406b2d4074c738a58de6db397d0abc9"}}}