{"name":"Tethereum","id":"tethereum","symbol":"t99","description":"*WHAT IS TETHEREUM?* Tethereum is a token and decentralized exchange native to BNBChain. In other words, Tethereum Exchange shares some similarities with established platforms like UniSwap, SushiSwap, or PancakeSwap, as users can swap their coins for other coins without the need for middleman services. The only difference is that Tethereum focuses on BEP20 tokens, which are a specific token standard developed by Binance. The BEP20 standard essentially provides a checklist of functions that enable new tokens to be compatible with the broader Binance ecosystem of dApps, wallets, and other services. *HOW DOES TETHEREUM WORK?* For those unfamiliar with decentralized exchanges, they use a special system known as an automated market maker (AMM), eliminating the need for order books or a single intermediary company to facilitate trading. In essence, there is no need for an order matching system since traders trade against liquidity pools instead of counterparties. A liquidity pool, in this context, refers to funds deposited by investors from around the world into smart contracts to provide liquidity to traders. With this system, buyers do not have to wait to be matched with sellers, and vice versa. Whenever someone wants to trade one token for another, they simply deposit the token they have into the pool and withdraw the other token they wish to receive, performing a kind of OTC swap. *THE TETHEREUM ECOSYSTEM:* The Tethereum ecosystem is a dynamic and innovative platform that encompasses various components designed to empower users and foster a thriving decentralized exchange environment. *TETHEREUM SWAP-DAPP:* At the heart of the ecosystem is the Tethereum Swap-Dapp, a decentralized application built to operate on the Binance blockchain. This Swap-Dapp provides users with a seamless and efficient way to swap their tokens. With increased capital efficiency and the ability to earn the highest fee earnings, liquidity providers can participate in the ecosystem while","links":"https://tethereum.exchange/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tethereum/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe9a5c635c51002fa5f377f956a8ce58573d63d91"}}}