{"name":"GoMeat","id":"gomeat","symbol":"gomt","description":"GoMeat is a blockchain based online ordering and delivery services catering to $1.8 trillion global (halal+ Kosher) market, already in operations since 2019 in United States with 900+ stores operating in 26 States with 10,000+ orders processed todate, generating a gross volume of $320K+ in 2021. GoMeat is solving a real-life problem of everyday consumers of halal and kosher, offering them traceability and transparency of the meat, food and groceries leveraging Hydra blockchain. They have already proved the concept and are in the process of expansion in the United States and globally as per their roadmap. GOMT is a utility token offering enormous value proposition to all their stakeholders, such as customers (convenience and reliability) stores (digitalization, increase in revenues and operational efficiencies) and token holders (Trade GOMT or use it on the GoMeat platform to avail discounts on their purchases.) Deflationary Tokenomics: GoMeat Token has an elaborate burning mechanism, increasing the token value with each burn. Key features are as follows: - 4% of the 2022 revenue is currently being burnt on a monthly basis (As of May 9, 16,378.473 GOMT have been burned already). - 5% of the 2023 revenue will be burnt on a quarterly basis. - Burning rate from 2024 onwards will be decided based on revenue amount, quarterly financial reports will be released to keep the community updated. - Once GoMeat hits $3 million in gross volume, then an additional 3% GoMeat revenue will be burnt every quarter. - Additional tokens for burning will be bought from exchanges if needed - Additional 3% will be burnt for every order placed using GOMT. GoMeat Blockchain Functions: GoMeat (GOMT) is a deflationary utility token with a limited supply of 5 million GOMT ever and about only 1.9 million GOMT in circulation. GoMeat Blockchain application will be based on the Hydra chain platform and will perform the following functions: - Collect all certificate information from Certificate data repository. - Establish a secure connection Certificate data repository provider and update Certificate info frequently. - Store all the retail owner’s information and certification info in our blockchain application. - Create a blockchain API to connect with GoMeat marketplace and display smart certification document in the app for customer view. - Share public key with 3rd party and Retail owners for each independent certificate - Retail owner certification validation. - Onboarded validation. - Certification cancellation or suspension validation: Monitor and control. - Certification renewal validation. GoMeat Features: The growing global specialty food industry has led to a high demand for specialty certification services by third party certification authorities. High demand for certification services in combination with a decentralized form of accreditation by Specialty Board and inability to support the specialty industry efficiently has shown cracks in the conventional specialty certification model, which has become costly, inefficient, fraudulent and risky. GoMeat phase 3 will introduce the following features: - Digital specialty meat certifications, integration with specialty certification authorities to create blockchain based smart contracts to validate certification validity for the stores. The smart contract validated certificates will be available inside the apps under each store for the customers to view. - Stores and certification authorities will be notified when a certificate is near expiration. - Customers will receive full transparency about a store’s certification status - Every step of the specialty meat supply chain will be tracked and documented on blockchain to provide full transparency and visibility about the animal’s origin, living conditions, health and slaughtering method. GoMeat Platform: Website: www.gomeat.io Customer App iOS https://apps.apple.com/us/app/gomeat/id1441921154 Android https://play.google.com/store/apps/details?id=com.gomeat.app&hl=en_US Driver App iOS https://apps.apple.com/us/app/gomeat-driver/id1479449038 Andriod https://play.google.com/store/apps/details?id=com.gomeat.driverapp GoPartner App (Stores) iOS https://apps.apple.com/us/app/gopartners/id1534134861","links":"https://gomeat.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gomeat/logo.png","detail_platform":{"hydra":{"decimal_place":null,"contract_address":"7b8dd012ec9e1f11e008376ef21d29ba4cc78e24"}}}