{"name":"Football at AlphaVerse","id":"football-at-alphaverse","symbol":"fav","description":"What is the project about? Football at AlphaVerse (FAV) is an AI-Powered 3D Interactive Entertainment Platform dedicated to Football, where fans can deeply engage with their favorite football clubs. It is open to everyone and free to play. Key pillars include accessibility, personalized experiences, digital rewards, and fan engagement. What makes your project unique? AlphaVerse is the first metaverse on the blockchain to move beyond a single-universe experience by combining many different universes. Each of them offers a different look and feel and a different experience for the user. It’s literally a universe of universes. Some universes are fully developed and operated by AlphaVerse. Others are developed and operated by third parties. Players can move seamlessly from one universe to another, using the same username and wallet. Partnership with Top Tier Clubs Real Bétis Balompié Sporting Clube de Braga Spezia Calcio São Paulo Futebol Clube Cardiff City FC Deportivo Cali and many more. History of your project. Founded in 2021 by Frederic Chesnais, we have been working on FAV for the past 2 years now. What’s next for your project? Continuous launch of different fanzone for football clubs, as well as a poker game, a metacoaster world, launch of HorYou world, raveage and many more What can your token be used for? Purchase of NFTs: access to special content Micro-transactions in Football at AlphaVerse DAO in FAV Island (decisions to open new worlds/clubs and minor decisions) Referral Program Mini Games Staking to compete in challenges","links":"https://alphaverse.com/blog/items/category/blog/fav/","market_cap":21007734,"market_cap_rank":935,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/football-at-alphaverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x1a076e4633fa139d7b908b88326de603fbe8c199"}}}