{"name":"SpartaDEX","id":"spartadex","symbol":"sparta","description":"SpartaDEX is a combination of real-time strategy game set in the realities of ancient Greece and a decentralized cryptocurrency exchange. We called it a gamified DEX. The main goal is to provide the exchange with user engagement known from video games, which builds loyalty and consistency in providing liquidity. By combining a decentralized exchange with a strategy game, we wanted to - Provide a more stable and deeper liquidity for projects, through the gamified yield that depends on the player’s progress in the game, additionally giving a chance to monetize this progress by encapsulating it in the form of tradable NFT; - Promote and facilitate the launch of new, promising projects - Build an exchange fully managed by the community, where the community decides which projects will be whitelisted and therefore providing liquidity for them will be additionally incentivized with EXP points and token rewards - Build a decentralized exchange with a user-friendly, intuitive and inviting interface - Build a loyal and valuable community of the decentralized exchange by implementing gaming layer - Provide SAS with the opportunity to earn Real Yield from the from the basic mechanics implemented in the game itself (microtransactions). This makes SpartaDEX a very competitive and distinctive compared to other exchanges - Reward liquidity providers of certain pools with the opportunity to receive tokens of other projects in the \"Dual Rewards\" program SpartaDEX is a multichain protocol that will initially operate on the Arbitrum blockchain. This chain was chosen for its modern approach to scalability, transaction fees, and speed of operation, which are particularly valuable for gaming projects that involve a substantial number of transactions made by players.","links":"https://spartadex.io/","market_cap":2448277,"market_cap_rank":3000,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spartadex/logo.png","detail_platform":{"linea":{"decimal_place":18,"contract_address":"0x11f98c7e42a367dab4f200d2fdc460fb445ce9a8"}}}