{"name":"Soaps Tech","id":"soaps-tech","symbol":"soaps","description":"What is the project about? Soaps.Tech revolutionizes the Web3 social landscape by focusing on Telegram, the heart of many online communities. Soaps.Tech offers users the opportunity to directly buy, sell, and trade shares on Telegram. Based on Telegram Channels, they can create their own shares. What makes your project unique? 1. Making Shares • Stars and shops make their special shares • Pick: Decide on how many and what these can do. 2. Market Moves • Shares are shown clearly with price tags and numbers. • Swap or sell anytime. 3. Cool Extras for Owners • Get special stuff and chats with the star. • Maybe vote like in big companies. • Get bonuses like stories, deals, or digital investments. History of your project. Development Stage Brainstorming ideas, assembling the team, and getting ready for the initial launch. What’s next for your project? Q4 2023: Upgrades & Collaborations Feedback Integration Collect and implement suggestions for enhancing the user experience. Educational Content Conduct workshops, webinars, and content creation for user education. Global Outreach Adapt the platform to cater to different cultural and regional needs. Revenue Diversification Investigate and activate new sources of income. Q1 2024: Forward-Thinking & Sustainability Industry Partnerships Forge alliances with key industry leaders to solidify $SOAPS' market standing. Eco-Conscious Initiatives Take steps to minimize the platform's environmental impact. Ongoing Refinement Continuous updates and modifications according to market shifts. User Advisory Board Set up a group of engaged community members to offer direct input on the platform's development. Technical Enhancements Incorporate more advanced tech options for a smoother user experience. Platform 2.0 Unveil Release an updated platform based on a year’s worth of feedback. What can your token be used for? Holders will receive renevue shares from our dapp Users can use tokens to buy key with discounted rate","links":"https://soaps.tech/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/soaps-tech/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xa2c798f6456e4928f1e029c971007a09416a3db0"}}}