{"name":"Trillioner","id":"trillioner","symbol":"tlc","description":"What is the project about? Trillioner Coin: One stop solution for Crypto Banking. The Trillioner crypto project aims to bridge the gap between traditional finance and the crypto world by offering financial services for both crypto projects and private users. This will include access to our products as well as traditional fiat banking and financial services for blockchain businesses and individuals. What makes your project unique? The Trillioner project is aiming to bring trust and security to the world of crypto by providing convenient and instant payment solutions. With the rise of digital currencies, it's important to have a reliable and secure payment method that users can trust. History of your project. This project is sister company of https://qfxmarkets.com/ QFX Trade Limited is a leading Forex Prime Broker that provides multiple trading options like crypto, currencies, stocks, commodities and indices among others. The company has been operating in more than 65 countries. They have more than 600K Active users in Qfx now they came into crypto. What’s next for your project? Crypto Banking Payment App VISA Debit Card Stake And Earn Trillioner DAO Brokerage (forex, stocks) Traditional financial markets remain relevant. For fast and reliable access to the securities, futures and forex markets, clients will have the opportunity to open brokerage accounts. What can your token be used for? Crypto Banking Payment App VISA Debit Card Stake And Earn Trillioner DAO Brokerage (forex, stocks) Traditional financial markets remain relevant. For fast and reliable access to the securities, futures and forex markets, clients will have the opportunity to open brokerage accounts.","links":"https://trillioner.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trillioner/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x29a5daf6e3fdf964def07706ea1abee7ec03d021"}}}