{"name":"Cypher","id":"cypher-2_base","symbol":"cypr","description":"Cypher: Redefining Global Rewards Cypher is a blockchain protocol built on Base Chain that lays the foundation for a global alternative to traditional credit card points and airline miles. Instead of closed loyalty systems, Cypher creates an open economic model that fuels a flywheel between brands/merchants, internet influencers, AI agents, and crypto card users. The $CYPR Token Utility: $CYPR is the core incentive token of the Cypher ecosystem. Staking & Locking: Users can lock $CYPR for up to 2 years to receive veCYPR NFTs, which represent voting power in the protocol. Governance & Voting: Every epoch (2 weeks), veCYPR holders vote for specific merchants. In return, they earn bribes and incentives funded by those merchants. This model is inspired by the Curve and Aerodrome Finance voting-escrow (ve) design, but applied to real-world merchant rewards and referrals. The Flywheel Effect Users & Referrals → Spend and earn $CYPR rewards, strengthening loyalty. veCYPR Holders → Direct voting power toward preferred merchants, amplifying influence. Merchants/Brands → Offer bribes/incentives to attract votes, gaining priority in user flows. Demand Dynamics → As merchants recognize the value of veCYPR voting power, they compete by buying and locking $CYPR, creating sustained buy pressure. Over time, this competition increases token scarcity, aligns incentives across all participants, and creates a compounding network effect similar to traditional loyalty programs—but global, open, and blockchain-native.","links":"https://cypherhq.io/cypr/","market_cap":4422678,"market_cap_rank":2178,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cypher-2_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xd262a4c7108c8139b2b189758e8d17c3dfc91a38","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xd262a4c7108c8139b2b189758e8d17c3dfc91a38"}},"is_native":false}