{"name":"Non-Playable Coin","id":"non-playable-coin","symbol":"npc","description":"What is the project about? Non-Playable Coin (NPC) is a meme coin and NFT-hybrid for all 8+ billion humans on Earth. \"I support the current coin\" is the motto, a homage to the meme that first gained in popularity in 2018. What makes your project unique? Inspired by the non-playable character meme, NPC leans into the joke by creating an ERC20 token whose supply is the total human population as recorded on July 26, 2023. Each token is also convertible into an NFT at a rate of 1:1. Hence, it is a token with JPEG metadata that is designed to be traded both on decentralized exchanges like Uniswap (as an ERC20) and on NFT marketplaces (as an ERC1155). This unique design—an NFT that can also be traded as an ERC20—is called a meme fungible token (MFT). An MFT like Non-Playable Coin (NPC) links two often-separated liquidity markets, while also allowing more people than ever to own a \"part of the culture\" as NFTs. On the home page, users can switch between the two formats using the dApp. Users can \"respawn\" as an NFT or \"transform\" into a meme coin. The most liquid form for trading, however, is as an ERC20. History of your project. The project started by playing with NFT AMMs like Sudoswap and realizing that ERC1155s were not being used to explore new avenues. We also felt that the 10k+ pfp NFT collection has hit a wall because it is limited both by exclusivity and gas cost. This project seeks to demonstrate that it is possible to scale communities to millions using the ERC1155 standard, and that it is possible to unlock liquidity for such tokens by making them fungible as an ERC20. What’s next for your project? Users will soon be able to accessorize their NPCs using a built-in customization tool and export their creations to be used as profile photos. Additionally, we are constructing new supporting infrastructure to better link the liquidity of ERC20 tokens with ERC1155 tokens, with NPC as the main showcase. What can your token be used for? At its core, it is purely a meme coin with no utility and is for entertainment purposes only.","links":"https://nonplayablecoin.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/non-playable-coin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8ed97a637a790be1feff5e888d43629dc05408f6"}}}