{"name":"Arable USD","id":"arable-usd","symbol":"arusd","description":"PLEASE NOTE that arUSD is ALREADY listed on a DEX called Curve Finance and you can check here https://avax.curve.fi/factory/86 . The Curve pool has more than double yesterday with a daily USD volume of $62K and a utilization rate of 33%. Arable Protocol offers synthetic multi-chain trading and synthetic farming, a first in DeFi! Our objective is to make multi-chain farming accessible, affordable, and simple for everyone. Both seasoned and novice farmers can easily stake in yield farms from various chains thanks to a user interface that is straightforward but effective. We have our very own over-collateralized stablecoin called the $arUSD which is used as a base currency to trade the synthetic asset on our dApp and we would like to know if it can be listed on CoinGecko. Ever since launching the $arUSD in July, the total collateral that has been deposited is $432,726 with a total of $151,701 $arUSD minted and you may check here https://mvp.arable.finance/#/mvp/synth . Arable Protocol is based around a synthetic ecosystem and its liquidity is created through the minting of the stable asset $arUSD which is Arable's native stablecoin which is pegged to the USD. Users can exchange between different LP tokens and synthetic cryptocurrencies using $arUSD, and they can farm on synthetic yield farms that follow the APR of their native chain counterparts. Minters play an essential role in the Arable protocol. They act as the suppliers of synthetic liquidity to facilitate the trading and farming of synthetic assets (synths) at Arable. They create this liquidity by minting $arUSD and mint $arUSD by first depositing supported collateral assets on the Arable dApp. The USD value of the provided collateral is called Collateral Value. This value can change if the market value of the collateral changes. More information on $arUSD is available here: https://about.arable.finance/protocol-overview/minting https://medium.com/@ArableProtocol/a-case-for-minting-at-arable-6107ed5272d6","links":"https://arable.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arable-usd/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x025ab35ff6abcca56d57475249baaeae08419039"}}}