{"name":"BURN","id":"shiba-doge-burn_ethereum","symbol":"burn","description":"The $BURN token is an extremely hyper-deflationary currency that is built to become more scarce with each transaction that takes place within the $BURN economy. Let it Burn! The concept is simple... Start with a large supply to give the community a chance to participate and secure their positions. Then let the insanely deflationary Tokenomics do its part in making the token supply more and more scarce. Holders get rewarded for simply doing just that! Holding! BurnDAO Token holders will be able to vote their owned tokens in a DAO that will allow the holders to determine the buy back and burns that will be represented in every project. In addition, DAO users holding a minimum number of tokens will have the ability to vote and submit proposals on the tokens that will be subject to vote each month. Each burn token represents a vote in the DAO. How it works Ingrained in the Tokenomics of the Burn Token is a tax that is directly attributed to 3 different buyback and burn wallets. These wallets accumulate funds through the taxes on transactions (buys/sells) and are used to buyback tokens on the open market. The purchased tokens are directly sent to the designated burn wallet or in the case of the $BURN token - completely removed from the blockchain. These burns can take place at any time, both in a manual and an automated fashion, and the intention is to deploy the accumulated funds at strategic times. BURNCARD NFT The BurnCard NFT is an exclusive non-fungible token in which the primary utility is to be burned at the discretion of the NFT owner. Once burned, the NFT is incinerated and removed from the blockchain, revealing a set number of BURN tokens that are automatically deposited into the same wallet that held your NFT. There are a total of 69 BurnCards that will be made available to the public. A single BurnCard NFT will be listed for 5 ETH, each containing a total of 10% of the .15% max wallet size.","links":"https://burn.realshibadoge.com/","market_cap":462389,"market_cap_rank":4700,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shiba-doge-burn/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa2fe5e51729be71261bcf42854012827bc44c044","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xa2fe5e51729be71261bcf42854012827bc44c044"}},"is_native":false}