{"name":"Rambox","id":"rambox","symbol":"ram","description":"What is the project about? Rambox will focus on exploring all aspects of AI commercialization in the digital technology domain, with the mission of building the world's strongest, most simplified stable investment income platform. Currently, it is concentrating on NFTfi, derivatives, public chain funds, and other liquidity service providers, leveraging AI-powered automated investment strategies. In the future, Rambox will prioritize the development of NFTfi and modular public chain infrastructure. What makes your project unique? The advantages of the Rambox platform include multi-chain yield aggregation, a unified liquidity bridge, access to top global ecosystems, and user-friendliness. It enables cross-chain communication, aggregates yield opportunities from multiple chains, employs AI to formulate strategic investment plans, provides a unified liquidity bridge, ensures the finality of source chains, and seamlessly integrates with top global ecosystems, enabling interoperability within the Web3 ecosystem. Additionally, the Rambox platform is designed to be user-friendly, offering a simpler and more convenient asset interaction and usage experience for both users and projects, aligning with the user-friendliness principles of Web3. History of your project. In Q1-Q3 2021, the Rambox project took significant strides in research and development as well as planning. During this period, we initiated the development of the Rambox Automated Yield Farming Pool, aimed at providing users with more investment options. Simultaneously, the development of the Rambox Aggregation Protocol was officially launched to create a more efficient and convenient digital asset trading ecosystem. Most importantly, we commenced the writing of the Rambox project whitepaper, laying a solid theoretical foundation for future development. In Q2 2022, we achieved a crucial milestone in core technology development, paving the way for the success of the Rambox project. Additionally, we initiated the development of the RAM NETWORK, which will offer more features and possibilities for our ecosystem. In Q3 2022, we further accelerated the project's preparations for market launch. We began designing the NFTfi and Gamefi Automated Yield Systems, aiming to provide unique experiences for gamers and investors. Furthermore, we also initiated the design of the RAM Commemorative NFT series, bringing more exciting content to our community. In Q4 2022, the Rambox platform officially went live, marking the culmination of our efforts. We introduced yield farming pool functionality, offering users more earning opportunities and investment choices. In Q1-2 2023, we entered a new phase of development, launching the Rambox Public Chain Yield Farming Strategic Development Plan to continuously strengthen our ecosystem. Simultaneously, we prepared for the exchange listing to provide users with a more convenient channel for digital asset trading. In Q3 2023, the Rambox project underwent a brand strategy upgrade, reaching new heights. We introduced new aggregation products supporting BRC20 and BRC721 asset trading. Meanwhile, the Rambox NFT series products officially went live, bringing users more exciting digital asset experiences. What’s next for your project? Moving forward into Q4 2023, the Rambox project is set to continue its progress with the planned launch of a unique Rambox wallet application product. This wallet application will provide users with a more secure and convenient way to store and manage digital assets. We will continue to innovate, striving to meet user needs and contributing to the ongoing development and possibilities within the Rambox ecosystem. What can your token be used for? RAM is the ecological governance token of Rambox. RAM serves not only as the driving force behind the RamBox ecosystem but also as the sole governance token. It can generate profits through Vault staking, NFT interactions, participation in the Rambox Network, and engagement in community governance, among other essential functions.","links":"https://rambox.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rambox/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x76d9a7c6164de3bc4d95ef0c011d3d22eb8b4d60"}}}