{"name":"Seedworld","id":"seedworld_avalanche","symbol":"sworld","description":"Description: Seedworld is a UGC (user-generated content) gaming platform that allows individuals to create, explore, and monetize their unique worlds and experiences. It provides easy-to-use tools for users to design games, lands, and assets, even without coding knowledge. In this ecosystem, players can craft their own economies, trade assets, and shape the future of the platform. Seedworld combines the creative freedom of user-generated content with a decentralized economy, where creators, players, and investors alike can thrive. What is the native utility of the $SWORLD Token? $SWORLD is the central token in the Seedworld ecosystem. $SWORLD can be used to purchase collections, lands and cosmetics $SWORLD is the only way to acquire Seedworld’s ingame currency Ame. Even if players use FIAT to purchase Ame, a portion of the funds is used to buyback and burn $SWORLD. $SWORLD is used for Lands and Seed Roots upgrades $SWORLD offers discounts for Battle Passes $SWORLD can be staked for rewards and to get free land & island NFTs $SWORLD can be farmed for rewards. Seedworld is focusing on several key verticals: Gaming: Providing players and creators with tools to build immersive games and experiences. User-Generated Content (UGC): Empowering players to craft and share their own assets, lands, and games. Virtual Economy: Creating an integrated economy where players can trade, monetize, and invest in NFTs and virtual goods. NFTs: Seedworld uses NFTs as the foundation for ownership of in-game assets, such as land, mounts, avatars, and items, giving creators control over their content. Cross-IP Collaboration: Offering a collaborative space where players and creators interact and co-develop experiences that can scale beyond traditional gaming. How many $SWORLD tokens are there in circulation? $SWORLD Token will launch on October 23, 2024, with a total of 2,187,422,513 tokens in circulation for a total supply of 20,000,000,000 tokens. The complete breakdown is: Tokenomics: https://docs.google.com/spreadsheets/d/1F0drPCmXc_Yu4ExRj5Iybi5RoCQcD96sW951-fENyyU/edit?usp=sharing Who are the backers of $SWORLD? Seedworld is backed by the leading Web3gaming Incubator Seedify Where can I buy $SWORLD? Starting October 23rd, $SWORLD will be available for purchase on a number of leading decentralized exchanges and chains: Ethereum: Uniswap Base: Aerodrom Solana: Raydium BSC: Pancakeswap Arbitrum: Camelot Avalanche: LFJ","links":"https://seedworld.io/landing","market_cap":495670,"market_cap_rank":4598,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/seedworld_avalanche/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x968be3f7bfef0f8edc3c1ad90232ebb0da0867aa","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0x968be3f7bfef0f8edc3c1ad90232ebb0da0867aa"}},"is_native":false}