{"name":"XAI Corp","id":"xai-corp","symbol":"xai","description":"X.AI is an ERC20 token, an emblematic convergence of meme culture and artificial intelligence (AI) dialogue, ingeniously drawing inspiration from Elon Musk's ground breaking vision. Where Elon Musk has disrupted both the automotive space (Tesla) and space exploration (Space X) sectors, he will soon become the dominant player in the AI industry. A narrative that is set to be the #1 topic for the human race over the next 3-5 years. The embodiment of this convergence is reflected in the token's dynamic mascot, \"Lil X.\" Lil X articulates a fascinating narrative of the amalgamation of AI, cryptocurrency, and social media narratives, thus cementing X. AI's distinctive position in the landscape of digital tokens. Where many AI memes display dark robotics, Lil X is a softer reflection of AI. A fun and intuitive character, Lil X is already gaining a lot of attention across Twitter. This project, which is primarily steered by a dedicated and innovative community, emerged like a phoenix from the ashes of a renounced token contract. This evolution is a testament to the community's unwavering commitment to fostering sustainable growth and the embodiment of participative blockchain technology. In contrast to traditional tokens, X.AI charts a unique path. It operates autonomously with a renounced contract and sans developer involvement, buy/sell taxes, or pre/private sales. This departure from typical token frameworks is a breath of fresh air in the realm of blockchain technology, offering a fresh perspective and challenging established norms. With a gaze firmly fixed on the future, X.AI is committed to achieving significant milestones that amplify its visibility and growth potential. Paramount among these milestones is a listing on CoinMarketCap. This listing will serve as a catalyst for enhancing the project's profile, thereby promoting its growth. While the X.AI token might initially be perceived as a meme, it carries substantial utility.","links":"https://xai-eth.net/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/xai-corp/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x0a13a5929e5f0ff0eaba4bd9e9512c91fce40280"}}}