{"name":"VERRA DNA","id":"verra-dna_solana","symbol":"vdna","description":"VERRA DNA ECONOMIC ECOSYSTEM (VDNA) Pioneering the World’s First Carbon Emission Token and Sustainable ESG Platform We issued the world’s first carbon emission token and built the VERRA DNA Economic Ecosystem (VDNA) to advance the United Nations Sustainable Development Goals and reshape how the world tackles climate change. The VDNA platform is a comprehensive solution for managing and supervising ESG (Environmental, Social, and Governance) performance across companies and institutions globally. By recording carbon credits as NFTs, VDNA ensures transparent, secure, and verifiable tracking. These credits are issued as STO-type VDNA tokens, unlocking global trading on the international carbon credit market and the world’s top 10 virtual currency exchanges. VDNA makes clean energy accessible to everyone. Through the VDNA Wallet’s PowerBuilds payment system, anyone can seamlessly purchase and use clean energy. Carbon credits produced can be reissued as VDNA tokens, which can then be used directly for clean energy payments—creating a closed-loop system that supports the transition to a low-carbon future. As an innovative solution for the energy transformation humanity must embrace, VDNA provides a fully integrated system to accelerate the adoption of clean energy technologies in the global power plant market. Our platform rigorously tracks, assesses, and records all carbon emissions and the corresponding carbon credits generated, ensuring transparent, proportional, and accountable environmental impact management. We are committed to expanding this ecosystem and driving a cleaner, more sustainable, and equitable future for all.","links":"https://verradna.com/","market_cap":254866,"market_cap_rank":5560,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/verra-dna_solana/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"AiqBwm3CpoCM6rmsR9BwM6zNXns4YVwjkvpXKNdCmoon","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/AiqBwm3CpoCM6rmsR9BwM6zNXns4YVwjkvpXKNdCmoon"}},"is_native":false}