{"name":"Arcade","id":"arcade-2_avalanche","symbol":"arc","description":"Arcade is the multi-chain GameFi platform that gives token holders the opportunity to earn meaningful rewards, from various Play-2-Earn games, without direct gameplay or asset ownership. Arcade, or our NFT Collector network, owns the assets and through the strategic infrastructure of guilds, players and game developers, in-game earnings are passed along via our revolutionary Mission Pools concept. This concept allows holders to participate in the revenue opportunity of P2E games without the necessity of owning the assets or playing the game. Mission Pools represent real, in-game, activities that produce rewards that are shared by ARC holders. Whereas many projects provide their holders with supply funded by emissions, Mission Pool rewards are funded by actual in-game earnings. Example: a ship mission in Star Atlas generates earnings in ATLAS. That is sold, and ARC is bought on the market, which funds the rewards for the Mission Pool. The same model applies to any game, on any blockchain. No technical integration required. Play-2-Earn exposure via one platform & one token. Holders can deposit ARC and get exposure to games on various blockchains. The in-game rewards are distributed as ARC, no need to exchange various tokens to participate in a game that is on a different chain. Mission Pools make it possible for Esport competitors and spectators of all levels to share in the Grand Prizes of Esports tournaments. Esports Arcade lowers the barrier to entry for competitors, and makes it possible for sponsors to support their favorite players in a rewarding way. Esports Arcade is higher risk, with higher reward. The rewards provided by the Mission Pools are actual earnings from P2E games, not based on an emission schedule from the project-held tokens. APY backed by real in-game economies and revenue!","links":"https://www.arcade2earn.io","market_cap":22232,"market_cap_rank":9572,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arcade-2_avalanche/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xfa7664f2385743b73369bdc9427cdb2a942af809","geckoterminal_url":"https://www.geckoterminal.com/avax/tokens/0xfa7664f2385743b73369bdc9427cdb2a942af809"}},"is_native":false}