{"name":"MELON","id":"melon-2","symbol":"melon","description":"What is MELON?: Melon is a specialized platform, protocol, and DAO focused on the growing MEME and Content NFTs sector. The Melon Ecosystem has been designed to create a seamless experience for creators across Web2 and Web3 to turn social media content into collectible Content NFTs in the most authenticated way, with full provenance. With user-friendly tools and features like direct integration with popular web2 social media platforms, simple minting interface, on-chain IP rights, splits, and more. About the $MELON token: $MELON is the native utility token for the Melon Ecosystem that is used for: - Governance and reward mechanism for contributions to the Melon Protocol and Ecosystem. - Other utilities include priority access, platform features, and discounts. Community Traction and milestones so far: Sold out Melon Pass NFT Collection (777 supply, 0.04 mint price, has since more than tripled): https://opensea.io/collection/melonpassnft Community Traction, since the start of the $MELON token campaign (1 month): - Twitter Growth to over 170K - https://twitter.com/melonooo_ - Discord Growth to over 250K - https://discord.gg/melonooo - Top Community on Zealy - https://zealy.io/c/melon/questboard - Token App Registered Users: 220K - https://melon.ooo/ - Website Active Users: 500K Melon Platform & Protocol launched July 2023: https://app.melon.ooo/ Multiple creators have signed up to drop on Melon already, including iconic meme creators, to drop season 1 meme NFTs, like \"Popeyes Kid\" and \"F*ck Around and Find Out\", along with established web3 musicians dropping music video NFTs. What is the maximum supply for $MELON?: 1,000,000,000 $MELON.","links":"https://melon.ooo/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/melon-2/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x37dba54fdc402aff647ce06c66972f5d662c326d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x37dba54fdc402aff647ce06c66972f5d662c326d"}}}