{"name":"OutPost","id":"outpost","symbol":"out","description":"OutPost is a decentralized platform with self-organizing protocols that help people all over the world build Web3 autonomous organizations. OutPost is a layer-2 protocol that acts as an organizational operating system built on the BNB Smartchain. Our decentralized platform provides a general-purpose framework for the creation, management, and operation of Web3 decentralized autonomous organizations. Our OutPosts exist to facilitate member collaboration and to guide collective efforts towards common goals. Some of the most essential tasks of the OutPost protocol include facilitating the effective division of labor, management incentive, and resource allocation. Practical, Easy-to-use, and Powerful Web3 Solutions. Outpost features: ECOSYSTEM Easily issue your BEP20 token, or plug in your existing token to give it governance powers in a matter of seconds. DOMAINS A domain is like a folder in a shared filesystem. You can think of domains as projects, departments, teams, circles, or whatever makes sense for your organization. Each domain can have its separate budget controlled by the contributors to that domain. REPUTATION Award influence in proportion to merit. Every time a contributor gets paid in your Outpost’s native token; they earn Reputation in the Domain they earned the payment from. That Reputation gives them the power to stake on Motions, and vote in disputes in the Domains in which they have a reputation. GOVERNANCE Decentralized governance without endless voting is essential to the rapid development of Web3 organizations. Use simple and timely voting mechanisms for frictionless decision-making abilities for your community. PRICING OutPosts are free to create, and there are no monthly subscription fees. Even your gas costs are covered. Only pay a small network fee via our native token $OUT used to support the OutPost launchpad.","links":"https://outpostdev.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/outpost/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x4b9fb6d85f1f51a9cc29aaf7127125737d94536e"}}}