{"name":"Draggin Karma Points","id":"draggin-karma-points","symbol":"dkp","description":"Dragginz is a free-to-play, 100% on-chain 3D MMO, funded by the sale of non-game-breaking in-game items and customisations. The player hatches and raises baby Dragginz to accompany them on adventures, harnessing the planet’s latent magic to explore, battle and master Trade Skills such as Alchemy, Gardening and Cooking. Dragginz also provides world-building facilities so that users can 'check out' part of the world to make changes or build entirely new locations. Changes are voted on by the Dragginz team and the community, and successful proposals are integrated into the live Dragginz universe. Dragginz runs and is hosted entirely on the Internet Computer; this includes the back-end data model, all static and dynamic gameplay data, all 3D, 2D audio and other game assets as well as all API endpoints and the Website. There is no Web2 technology employed anywhere in the Dragginz ecosystem. Player authentication is via Internet Identity, which provides a secure, trustless mechanism for authenticating user sessions without needing to collect any personally identifiable information; Dragginz has no sign-up form. Dragginz is a hybrid DAO with centralised creative control and decentralised community control facilitated by our SNS and governed by our native DKP (Draggin Karma Points) token. The community can influence the roadmap, game contents and features by raising and voting on proposals with their DKP. The Dragginz corporate entity is a Swiss-based Foundation (Dragginz Stiftung), which legally enshrines the founding principles that the project is not for profit and exists to promote the development of the Dragginz 3D MMO and its community of players.","links":"https://dragginz.io","market_cap":12578943,"market_cap_rank":1349,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/draggin-karma-points/logo.png","detail_platform":{"internet-computer":{"decimal_place":8,"contract_address":"zfcdd-tqaaa-aaaaq-aaaga-cai"}}}