{"name":"Zombie World Z","id":"zombie-world-z","symbol":"zwz","description":"Zombie World Z is an upgraded and developed game based on Zombie Idle Defense – a successful and established game in the market. The game publishers have adapted the upgrade by applying blockchain technology and metaverse into a new aspect of game mining with a token- and blockchain-based game economy on the Binance Smart Chain platform. From urban legends, Zombies have become one of the mainstays of movie or video game culture. It can be said that the post-apocalyptic setting with zombies has become the most popular in the horror game genre. Over the years, zombie games have been developed a lot, in different styles, with different storylines. It is important that the huge popularity of zombies does not bore gamers. This is still considered a popular game-making topic. The Zombie World Z team is building a unique virtual world where players can become real warriors fighting with Zombies to regain the land where they live and own and earn money from playing experience. their game using $ZWZ, the platform's main utility token. $ZWZ holders will also be able to participate in the management of the platform through a Decentralized Autonomous Organization (DAO), where they can exercise voting rights on important decisions of the Zombie World ecosystem. Zombie World Z aims to bring blockchain into the mainstream, attracting both crypto and non-crypto game enthusiasts by offering advantages of real ownership, digital scarcity, monetization and, interoperability In the crypto market, there are also many Metaverse games such as Decentraland, The Sandbox, ... In these games, you can create your own worlds, own property through NFT as well as trade them through Marketplace, ... The game is designed in a way that allows players to \"master the game\" by exercising power over the platform. Players also enjoy a democratic governance model based on democracy and inspirational real-world rules for DAO","links":"https://zombieworldz.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zombie-world-z/logo.png"}