{"name":"Minebase","id":"minebase","symbol":"mbase","description":"Minebase is a token that is created through fees There are 250 million Minebase tokens in total. Everyone who sends a Coin in the Crypto Network, has to pay transaction fees. These existing fees are used to create the Minebase token. 45 million of these tokens were distributed to users through a bonus program All other Minebase Tokens are only created by fees...No one has to invest anything. We call this process CTP Creative Token production. The starting CTP price of the token is $6.50 So there must be $6.50 in fees for the token to be created The token can only be created by CTP. Anyone can register their own wallet address with Minebase (maximum 5) the fees will be charged until 6.50 is reached to create a token. Furthermore, the user can deposit tokens in the Minebase wallet. From 10 tokens the user automatically receives a wallet to create the token. (Maximum 20 wallets with 550 tokens that have to be deposited. All fees that these wallet addresses have will be credited to the user. With an Algorithm the CTP price increase. Starts at $6.50 up to $793.000. The more tokens are created the higher the price will be. Period of time POT Is an advantage program. Anyone can use this program. We want to reach people who have not had any contact with cryptocurrencies. The user receives 26 cents an hour 4% of $6.50. After 25 hours he receives a Minebase token. Price stabilization If the price on the exchange falls more than 10%, 0.025% of the total volume of unissued tokens is burned. From the CTP price of $131 there is a reward program for all users. Every time the CTP price increases, users who own a silver gold or platinum wallet will receive free tokens. Minebase Ecosystem STAKING MINEBASE Partner Company streakk www.streakk.io INTERCONNECTED WALLET This upgrade gives you the possibility to dock to other users who have 20 wallet addresses. This means that you can participate in another 20 wallet addresses. It is possible to dock to a maximum of 5 users. Games / Burni","links":"https://minebase.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/minebase/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x291aa47c58558adfc2bcd6f060578fdae1f6570c"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x291aa47c58558adfc2bcd6f060578fdae1f6570c","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x291aa47c58558adfc2bcd6f060578fdae1f6570c"},"polygon-pos":{"decimal_place":18,"contract_address":"0x291aa47c58558adfc2bcd6f060578fdae1f6570c","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x291aa47c58558adfc2bcd6f060578fdae1f6570c"}}}