{"name":"Open Meta Trade","id":"open-meta-trade","symbol":"omt","description":"What is the project about? Open Meta Trade is a decentralized and transparent Futures exchange built on three networks: Arbitrum, ONUS Chain, and BNB Chain offering the lowest trading fees in the market. At Open Meta Trade, users can trade in derivatives from a wide range of blue chip crypto assets such as BTC, ETH, and top coins to stocks and indices with up to 250x leverage, with distinctive advantages: - 0.04% Opening/closing fees - High-quality price feeds from Oracle - No slippage and funding rate - Fully transparent decentralized mechanism - 100% profit sharing What is OMT Token used for? OMT is the governance and utility token of Open Meta Trade, with a total supply of 2,000,000 OMT. Holders are incentivized to stay in for the long run, with many rewards that will quickly accumulate, including: - Escrowed OMT (esOMT): Has the same values as OMT. EsOMT can be used to stake and receive rewards similar to OMT or vest to get OMT back within one year. - Multiplier Points (MP): Reward long term OMT and esOMT holders without inflation. - 30% of the system fee - USDCr Who Are the Founders of Open Meta Trade? Open Meta Trade's founding team are programmers with extensive experience in finance and blockchain and have developed many decentralized products. They are anonymous and focus only on developing the platform instead of needing a personal reputation. Although they have completed a Know Your Customer (KYC) process with SolidProof, along with the contract audit. While some of our team members are publicly doxxed, but we want to stay anonymous. We have completed a Know Your Customer (KYC) process with SolidProof.","links":"https://omt.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/open-meta-trade/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x547c669cbbf746652e19f4686716763c8dba703f"},"onus":{"decimal_place":18,"contract_address":"0x38776725eb870b9cb076eca9fadcb837f3805d51"}}}