{"name":"Hectagon","id":"hectagon","symbol":"hecta","description":"What is Hectagon (HECTA)? Hectagon is the world’s first DAO-governed Web3 VC funding platform. It is a financial platform with no entry barriers to entry: Anyone can join the Hectagon network, invest, and contribute value to projects that Hectagon invests with. Value contribution in Hectagon’s protocol is recognized through $HECTA token rewards. Who Are the Founders of Hectagon? The CEO and Founder at Hectagon is Linh Han who is honored on the Forbes Asia 30 Under 30 list (2020) with 10 years of proven track records in Investment, Finance, and Startups Development. He’s also the co-founder at VSV Capital, first Vietnam’s Accelerator and early-stage VC. In addition, VSV Capital was ranked #1 as the most active investor in Vietnam in 2022 by TechinAsia. Over the last 8 years, VSV has made over 80 investment deals from Pre-Seed to Series B into 70 startups with founders from 9 countries, such as Loship, Base.vn, Modmo, Ship60, Nerman, Loop, and Vibeji, with a total valuation of over $300 million. Hectagon has also received investments from a lot of experienced organizations and investors in the blockchain and crypto industry such as Mistletoe, founded by the Japanese Billionaire Taizo Son. What Makes Hectagon Unique? The Hectagon Model and Investment DAOs & Launchpads: Hectagon innovates from Investment DAOs & Launchpads as there is zero barrier to entry. Users of both Investment DAO & Launchpad have to buy its governance token as a form of club membership. In that, the more tokens buy and hold, the better chance at winning a lottery ticket to invest in deals that come along. Hectagon allows users to gain exposure to seed and private investment as soon as they hold $Hecta tokens regardless of the amount. $Hecta token provides a double layer of protection. Not only does it serve as the membership and governance vote but $Hecta can be exchanged for every other token in Hectagon’s treasury. Therefore, even when $Hecta falls in price, users are still protected by the oth","links":"https://www.hectagon.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hectagon/logo.png"}