{"name":"Unity Network","id":"unity-network","symbol":"unt","description":"Unity Network is a user-centric, software development company and the creator of EveCom. We leverage blockchain technology to build a better NFT-based event management and ticket system that solves major pain points and challenges with traditional ticketing systems. Our mission is to create an inclusive platform that empowers users of all backgrounds and levels of technical ability to take advantage of this new generation of ﬁnancial technology. As blockchain technology rapidly becomes more integrated with our ﬁnancial lives, we believe no one should be left behind. EveCom - Your Event Companion: EveCom is an NFT-based ticketing service accessible to everyone. It enables both private and professional event organizers to create, promote and sell NFT-based tickets for any event, physical and virtual - worldwide. EveCom is built to be secure, transparent and to reduce costs. Tickets should have no master: The traditional ticketing system lacks imagination and transparency. EveCom is changing that with its integrated Web3 technology and a user centric design philosophy. You have the power to fully create, sell and manage your own events through our advanced event management dashboard. Unity Network is passionate about the decentralized world and providing a platform for everyone to create, market and optimize their event with full transparency. There are no hidden fees or small print - Everything is as clear as it can be. EveCom is first and foremost built to give power back to the people, both organizers and guests. Where a centralized ticketing system falls short, the decentralized NFT event platform shines!","links":"https://unitynetwork.app/","market_cap":110449,"market_cap_rank":3854,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/unity-network/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8d610e20481f4c4f3acb87bba9c46bef7795fdfe"}}}