{"name":"SpiceUSD","id":"spiceusd","symbol":"usds","description":"The core thesis of the Spice Trade protocol is that, there's a massive need for a decentralized, on-chain, open-source, value-stable, scalable, modular, cross-chain, and capital-efficient system for trade among people of the world. Furthermore, such a system should have deep, long-term, and protocol-owned liquidity to reduce friction and maintain tight pegs. It is our belief that creating such a system brings us one step closer to creating a more peaceful and prosperous future for mankind. The first step in building such a system is to re-think 'money' based on the following principles: On-chain and decentralized: Reduce custodial risk. This stands in direct contrast to centralized stable coins that may have significant custodial risk. Value-stable: Frictionless trade requires using money whose value does not significantly fluctuate. Value stable is a relative term. For example, depending on the use case, the best money should be designed to be stable relative to national currencies (Such as USD or Euro), a basket of currencies, an inflation adjusted currency, in-game virtual currencies, reward points (imagine a stable coin that traces a hotel or airline point system on chain) etc. The Spice Trade platform allows building appropriate on-chain decentralized money for all these use cases. Scalable: Money is a tool of trade. The last thing a successful trade network needs is friction in scaling its monetary system. Modular: As we will demonstrate in the rest of this whitepaper, the Spice Trade protocol is fully modular to accommodate both immediately predicted needs as well future unknown use cases. Open-Source: Creating an open-source ecosystem where anyone with a good idea can contribute and build on top of the Spice Trade protocol is one of our core values Capital-Efficient: While over-collateralized on-chain stable coins pioneered the non-custodial money movement, we believe they will play a relatively smaller role in the future of money. Let us present the following hypothetical scenario in the real-world economy to demonstrate the point: Imagine we remove all the currencies in the world. Then, in order to generate any new fiat dollar (so that trade can resume), someone has to take a mortgage against their physical assets, and only then money is generated to enter the circulation. This would create such a tight monetary system that any real world economy would come to a screeching halt and collapse. And recent market trends reflects the above reasoning as well. Over-collateralized on-chain stable coins are falling further behind in market cap rankings relative to both centralized and on-chain algo-stable stable coins due to capital inefficiency. Cross-Chain: History has shown that technology continuously evolves and improves upon itself. And any product, community, or nation that does not evolve with it will ultimately get left behind. As such, we strongly believe that any successful decentralized product that wants to withstand the test of time needs to be a meta concept that stays above any particular blockchain (or blockchain technology) and can easily be extended and expanded from one chain to another. For example, while Proof-of-Stake seems to be the current king of consensus-building algorithms, who knows what the future might bring. Why build a chain based on today's technology and trap your protocol in it, when we know that the blockchain of the future may look significantly different than that of today? Protocol-Owned Liquidity based on Starfish Topology: As discussed in future sections, the Spice Trade protocol is designed to have significant liquidity with practically zero cost by building on the concept of Starfish Topology (pioneered by RadioShack: https://docs.radioshack.org/radioshack-defi/terms/disclaimer) Spice Trade is the first protocol to encapsulate all of the above principles into a suite of value-stable products.","links":"https://www.spicetrade.ai/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/spiceusd/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xab05b04743e0aeaf9d2ca81e5d3b8385e4bf961e"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xde7d1ce109236b12809c45b23d22f30dba0ef424"},"ethereum":{"decimal_place":18,"contract_address":"0x45fdb1b92a649fb6a64ef1511d3ba5bf60044838"},"polygon-pos":{"decimal_place":18,"contract_address":"0x2f1b1662a895c6ba01a99dcaf56778e7d77e5609"}}}