{"name":"KRYLL","id":"kryll","symbol":"krl","description":"At its core, Kryll features innovative technology that unifies data access and thought flow, skillfully combining Web3 data with AI capabilities. This enables Kryll³ to offer comprehensive coverage of crypto markets and projects, along with advanced analysis and decision-making tools, simplifying the complex ecosystem. The KRL token is essential to the Kryll³ ecosystem, unlocking exclusive features, serving as a payment method, and enabling participation in governance decisions. Key tools include SmartFolio, an AI-powered portfolio manager that tracks and analyzes digital assets across multiple blockchains, providing real-time insights for optimized investments. X-Ray is a market analysis tool using AI to evaluate tokens, offering details on smart contracts, on-chain data, social activity, and financial indicators. Gem Detector identifies emerging high-potential tokens through multi-chain surveillance and deep learning algorithms. Harpoon monitors top traders' strategies and transactions, offering insights into smart money movements. News Hub centralizes dozens of information sources into a unified, queryable platform for news and updates, enhancing decision-making processes. Kryll³ also offers its partners a revolutionary tool: Agent K. K is a conversational agent integrated into Web3 platforms and media sites, enabling natural language interaction with content. It makes complex concepts accessible to a wider audience, which is particularly beneficial for beginners.","links":"https://kryll.io/","market_cap":13821013,"market_cap_rank":1579,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kryll/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x464ebe77c293e473b48cfe96ddcf88fcf7bfdac0","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x464ebe77c293e473b48cfe96ddcf88fcf7bfdac0"},"base":{"decimal_place":18,"contract_address":"0xdae49c25fad3a62a8e8bfb6da12c46be611f9f7a","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xdae49c25fad3a62a8e8bfb6da12c46be611f9f7a"},"optimistic-ethereum":{"decimal_place":18,"contract_address":"0x2ed6222cb75e353b8789bec7bb443b7ec9022021","geckoterminal_url":"https://www.geckoterminal.com/optimism/tokens/0x2ed6222cb75e353b8789bec7bb443b7ec9022021"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xf75ee6d319741057a82a88eeff1dbafab7307b69","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0xf75ee6d319741057a82a88eeff1dbafab7307b69"}}}