{"name":"Squid Game 2.0","id":"squid-game-2-0","symbol":"squid2","description":"What is the project about? Squid2.0 is a real Squid Game. The tax wallet and the bot are the casualties. Both wallets have been blacklisted, and the contracts have been renounced. The private key of the tax wallet has been publicly disclosed. Squid's founder made significant mistakes in the past, resulting in the disintegration of the Squid community. The community regained its spirit with the assistance of influential figures in the blockchain space. Squid2.0 learned from Squid's lessons, transforming into a fully community-driven project. 100% of the tokens were injected into the liquidity pool and locked for the long term. What makes your project unique? What sets SQUID2 apart is its emphasis on community-driven participation and engagement. We believe in the power of collective decision-making and actively involve our community in shaping the direction of the project. Additionally, our integration of entertaining and interactive features, inspired by the Squid Game, adds a distinctive and enjoyable element to the crypto landscape. History of your project. SQUID2 originated from the lessons learned in the earlier SQUID project. The founding team recognized the importance of community involvement and made it the core principle of SQUID2. After facing challenges in the past, the project underwent a revitalization with the support of influential figures in the blockchain industry. This led to the emergence of SQUID2 as a community-driven project, with a renewed focus on transparency, innovation, and long-term sustainability. What’s next for your project? We have an exciting roadmap ahead for SQUID2. Our next steps involve further expanding our community, fostering partnerships with like-minded projects, and introducing new features and applications to enhance the user experience. We are committed to continuous development, ensuring that SQUID2 remains at the forefront of innovation and offers unique opportunities for our community. What can your token be used fo","links":"https://www.squid2.wtf","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/squid-game-2-0/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2c056f9402a0627bc0e580365bb12979fc011e2c"}}}