{"name":"Cumulus Encrypted Storage System","id":"cumulus-encrypted-storage-system","symbol":"cess","description":"Cumulus Encrypted Storage System (CESS) is a decentralized cloud storage network and content delivery network (CDN) optimized for processing high-frequency dynamic data while safeguarding users' data ownership, privacy, and asset protection. With its innovative technologies and architecture design, CESS offers a full-stack decentralized storage solution for large-scale enterprises and commercial-grade applications. Our mission is to provide a completely trustless and highly scalable infrastructure for Web3 development. CESS has created an uncompromisingly secure, user-friendly, architecturally robust and diversified ecosystem. CESS is dedicated to establishing the first decentralized cloud storage network that supports large-scale commercial applications and addresses industry pain points. To achieve this, CESS has many innovative core technologies. Some of these include a new consensus mechanism, Random Rotational Selection (R²S), and smart cloud space management technology to coordinate and schedule network resources. CESS ensures data integrity, security, traceability, and privacy through mechanisms such as Proof of Data Reduplication and Recovery (PoDR²), Multi-format Data Rights Confirmation (MDRC), and Proxy Re-encryption. CESS also has products and services, such as Decentralized Object Storage Service (DeOSS) which provides a decentralized object-based storage solution that offers low-cost, secure, and scalable distributed data storage services for Web3. Cumulus Encrypted Storage System (CESS) is committed to addressing several pain points in the decentralized storage market such as high data loss rate, inefficient storage space utilisation, slow data retrieval speeds, lack of data privacy and limited support for large-scale commercial applications.","links":"https://www.cess.cloud/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cumulus-encrypted-storage-system/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}