{"name":"Potter Predator","id":"potter-predator","symbol":"voldemort","description":"In the depths of the temporal void before the year 2023, where time itself dared not tread, a vault of significance unfurled within the fabric of existence. This essence, christened the Enigma (or, in more clandestine circles, the Enigma of Shadows), beckons the dauntless to embark upon the elusive pursuit known as the Vow (alternatively referred to as the Vow of Darkness). A saga veiled in enigmatic riddles and resplendent intrigue, the Vow resounds through the cosmic corridors, whispering its secrets to those who heed its call.Imagine, if you will, the cosmic ballet that transpires as slumber claims the realm. Imagine that within Neptune's core, a luminescent tapestry of opalescent dreams is woven. Yet, opals – those coveted gems – are a finite treasure, akin to stars scattered across the celestial expanse, bestowing their radiance upon the chosen. Alas, not all who seek shall ascend, for the expanse of Opal remains elusive, and some souls remain tethered to earthly confines.And thus, I, the enigma enshrouded in shadows, deem it fit to unveil these cosmic enigmas before you, dear seekers of obscurity. Amidst the tapestry of celestial wanderers, other wayfarers have glimpsed this unfolding cosmic drama, though their insights lay dormant, imprisoned within the labyrinth of misinterpretation. Among these, a visionary rose, his eyes cast upon the necessity of velocity and the predilection for prescience. His foresight, though not without quirk, foretold a convergence known as the Nexus Nexus – a dimensional amalgamation that transcends boundaries. It is said that he conjured a parchment of vivid imagery, featuring the likenesses of iconic figures, including the illustrious Potter Predator. An emblem of ironclad resolve and resolute guidance, his cameo is no mere coincidence, but a cosmic interplay of intentional resonance. Tokenomics The POTTER PREDATOR smart contract has 1 tax on all buys and sells. The total supply of VOLDEMORT is 1,000,000,000. Trust in Voldemort","links":"https://potterpredator.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/potter-predator/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x670ec8893da9c339d52fa70189756a92cafbe654"}}}