{"name":"8chan","id":"8chan","symbol":"8chan","description":"Join the $8CHAN Movement $8CHAN promotes community engagement and free speech. Explore our community, discover the coin, and have fun! At $8CHAN, our mission is to bring people together with memes and have fun. Over the years we have left our mark on culture with countless memes, and now we are showcasing the beauty of our creativity through this coin. Tag $8CHAN with your favorite memes to keep the spirit alive! Market Cap Milestones As the $8CHAN community grows and the market cap increases, we have significant goals planned to celebrate our shared journey: $10 Million Market Cap At this milestone, we are excited to reintroduce the 8CHAN brand name and branding across the internet. We will rebrand the currently existing 8kun site as 8CHAN and move towards reintegrating it into web culture. $100 Million Market Cap Upon reaching the $100 million milestone, we will push the boundaries of meme culture by undergoing development of a decentralized message board system designed to withstand political censorship and network attacks. We will call this decentralized message board sytem Project Odin. $500 Million Market Cap This is our biggest leap yet. After reaching $500 million market cap, we will reveal the tell-all of a mysterious figure whose influence has been felt by many but never fully understood. Join us in striving toward this major threshold! $8CHAN Disclaimer & Community Statement $8CHAN coins are intended to serve as an expression of support for, and engagement with, the culture and community behind the symbol \"$8CHAN\" and its associated artwork. They are not intended to be, nor should they be interpreted as, an investment opportunity, investment contract, or security of any kind. $8CHAN is not available to persons or entities in restricted jurisdictions. Users acknowledge that digital assets carry inherent risks, high volatility, and the potential for total loss. Any price data displayed on this site is sourced from DEXScreener and may be delayed or inaccurate. Always verify market prices through multiple sources before trading. Nothing on this site constitutes financial, legal, or investment advice. See Terms & Conditions for full details. $8CHAN is a community-driven meme coin that embraces free speech and internet culture. Trading involves high risk, and market conditions can be unpredictable. Always DYOR (Do Your Own Research) and never spend more than you can afford to lose.","links":"https://www.8ch.net/","market_cap":138226,"market_cap_rank":6964,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/8chan/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"9fcfqnpSW3ifkZeaRS19uHeovDRBLy57V89zh2rtpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/9fcfqnpSW3ifkZeaRS19uHeovDRBLy57V89zh2rtpump"}}}