{"name":"Magic Square","id":"magic-square_binance-smart-chain","symbol":"sqr","description":"## What is Magic Square (SQR)? Magic Square is an immersive Discovery & Engagement Platform for the Web3 Crypto Ecosystem, empowering users to explore a wide array of community-vetted apps and games. Discover exciting rewards, engaging giveaways, and unlock incredible use-to-earn opportunities within our platform. The native utility token SQR is hosted on BNB Smart Chain. SQR powers all aspects of the Magic Square ecosystem and allows for the seamless integration of users, developers, and validators. ## What Makes Magic Square Unique? Magic Square is a vibrant community-driven app store for web3 applications, providing crypto users with a seamless and intuitive interface. Our primary objective is to foster widespread adoption of cryptocurrencies and decentralized apps by attracting new users to the ecosystem. With our user-friendly platform and diverse app selection, we simplify web3 interaction, empowering individuals to navigate the crypto world with ease. Checkout the Magic Store [here](https://magic.store/). At Magic Square, we go beyond just offering an app store. We provide a range of exciting features designed to enhance the community experience. These include Magic Boost, an affiliate platform that rewards users for spreading the word; Hot Offers, which provide exclusive web3 deals; a Referral Program that encourages users to invite others to join; Karma Rewards, recognizing and incentivizing active community participation; Project Validation, allowing users to have a say in shaping the platform. Join us in shaping the future of decentralized technologies. Together, we can unlock the true potential of web3 and create a more inclusive and accessible digital landscape. Magic Square is backed by World-Class Investors and Partners: Binance Labs, Republic Capital, Kucoin Labs, Gate.io, Huobi Ventures, IQ Protocol, GSR, Dao Maker, AlphaGrep, Crypto.com, Forty two, Gravity Ventures ##Who Are the Founders of SQR Protocol? Magic Square is the visionary creation of Andrey Nayman, a renowned Ph.D. and former Managing Director at Radical Ventures. With over 15 years of expertise in FinTech and a profound understanding of blockchain development, Nayman has played a pivotal role in shaping the industry. Notably, he was an active participant in the Ethereum ICO, witnessing firsthand the transformative power of decentralized technologies. Under Nayman's guidance, Magic Square has evolved into a formidable project supported by a team of accomplished product developers and project managers. Together, they bring a wealth of experience and expertise to drive the success of this groundbreaking venture. ##Where can you buy Magic Square? This information will be disclosed with the launch of the Public Sale, which is set for 2023. To learn more about this project check https://linktr.ee/MagicSquare.","links":"https://magicsquare.io/","market_cap":446395,"market_cap_rank":4740,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/magic-square/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":8,"contract_address":"0x2b72867c32cf673f7b02d208b26889fed353b1f8","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x2b72867c32cf673f7b02d208b26889fed353b1f8"}},"is_native":false}