{"name":"UCONetwork","id":"uconetwork","symbol":"ucoil","description":"UCO Network provides Used Cooking Oil traceability solutions, focusing on automatic compliance with European Union’s Renewable Energy Directive II. We use a combination of Blockchain and IoT technologies to mitigate the risk of used cooking oil supply chain fraud. UCO Network technologies help our partners and customers to comply with existing and future regulations. UCO Network partners with software application makers and gives access to a global used cooking oil marketplace, where our customers can enhance their deals and business. The lack of transparency and traceability in the UCO supply chain leads to many opportunities for fraud. UCO market prices are higher than virgin oil due to RED II’s double counting policy. A high demand combined with limited supply is a challenge for BioFuels producers and also requires strong rules and regulations. Current rules and regulations lead to a non-transparent certification process for the sustainability of the used cooking oil. UCO Network solves the lack of Trust, Transparency and Traceability issues. It has created a compliant, reliable, and trustless way for Biofuel Producers and Waste Management & Collection companies operating their used cooking oil business. Auditors, Certification Entities and Regulators also have now tools that can facilitate the achievement of their mission goals. With every single used cooking oil collection, the protocol mints an NFT that our customers use as proof of ownership and sustainability, while adding incremental market value to the resource that has been collected. Biofuel Producers have now a solution that brings the trust needed to produce sustainable fuel. The solution is fully backed by IoT technology that enhances fraud risk mitigation, while also gives access to a global used cooking oil commodity marketplace.","links":"https://uco.network","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/uconetwork/logo.png"}