{"name":"Melo","id":"melo-token","symbol":"melo","description":"Melo Token is the token of appreciation, tipping, giving and gifting. It's the token of spreading love and humanity. Extending a gratuity in addition to an agreed-upon payment has been the de facto method for showing appreciation for centuries. Money is a form of information that signals value within the economy, and offering a gratuity clearly demonstrates the value of a person's work. Currently, this process is disjointed, manual, and confusing. There are many situations where custom dictates that a purchaser extends a gratuity. Other situations dictate that a gratuity is not welcome. There is currently no unified platform that subtly informs users of which financial transactions entail a customary gratuity. Many individuals around the world survive solely from monetary tips and do not take home a formal wage. A large portion of the economy is still informal, meaning that any inefficiencies in the gratuity process negatively impact the finances of the people most in need. To solve these existing issues, Melo Token has launched a decentralized gratuity token on the Tron network. The Melo Token platform allows for the seamless transfer of wealth from one entity to another without the need for manual interaction. The Melo Token platform assists users in identifying financial transactions that customarily require gratuity to the individual extending the service. This feature assists users in understanding the importance of their financial contribution. Additionally, this information helps the gratuity recipient as it is otherwise socially difficult to ask for payment directly. Melo Token makes the gratuity process seamless for both sender and payee. As the first distributed platform for gratuity, Melo Token is revolutionizing how the world expresses financial gratitude.","links":"https://melotoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/melo-token/logo.png"}