{"name":"Theopetra","id":"theopetra","symbol":"theo","description":"What is the project about? Theopetra is a fully public real estate network. Residents pay rent with minimal rent increases and earn ownership in their homes over time. The top 4000 Premium Members receive Ethereum ($ETH) rebates from residents for stabilizing liquidity within the network. What makes your project unique? Theopetra is building the first fully open real estate network onboarding residential real world assets within the decentralized finance ecosystem. Anyone in the world would be able to participate within this ecosystem. History of your project. The Theopetra project was initially conceived in 2020. Theopetra is an automatic real estate network that would buy & manage assets via automated decision making software. Theopetra's goal is to streamline every process while reducing costs for residents by transferring ownership back to residents who pay on time. What’s next for your project? Theopetra will transition into becoming the first fully decentralized real estate network fully ran by open-source liquidity and automated decision making software to buy, manage and onboard real world assets. Theopetra is building the first case study to analyze the efficiency of the housing within it’s network compared to traditional affordable housing provided by governments. What can your token be used for? Theopetra ($THEO) is the native token that powers the Theopetra Real Estate Network and is used to gain priority within the network to become a resident. Theopetra is a fully open & public real estate network. Residents pay rent with minimal rent increases and earn ownership in their homes over time. The top 4000 Premium Members receive Ethereum ($ETH) rebates from residents for stabilizing liquidity within the network.","links":"https://app.theopetralabs.com/","market_cap":4221121,"market_cap_rank":1903,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/theopetra/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xfac0403a24229d7e2edd994d50f5940624cbeac2"}}}