{"name":"MnICorp","id":"mnicorp","symbol":"mni","description":"What is the project about ? MnI is a multi-faceted tradable Utility Token giving the community a true Decentralized Finance Principled experience that brings “real world” commercial businesses with land-backed assets within reach of the crypto sphere for everyone to access institutional-like participation, interaction and direction within a multi trillion dollar industry. What makes your project unique? Real world returns from real world assets. History of your project? MnI is a multi-faceted tradable Utility Token giving the community a true Decentralized Finance Principled experience that brings “real world” commercial businesses with land-backed assets within reach of the crypto sphere for everyone to access institutional-like participation, interaction and direction within a multi trillion dollar industry. Giving you not only access but also directional control of the entity through a Decentralized Autonomous Organization. Global expansion using Governance oversight with a DAO and unique smart contract. What can your token be used for? 1.MnI Utility MnI is a community-enhanced ecosystem smart contract token that is tradable on Centralized and Decentralized Exchanges. A DAO token with community involvement and interactions from inviting new participants to submitting opinions. 2.Smart Contract Unique transparent proxy based smart contract built on Democratized Finance principals for all holder's benefit. DAO is able to set/change parameters and percentages to smart contract. 3.Governance (DAO) SELF GOVERNANCE in the DAO is achieved by activating your MNI Token within the DAO to create your governance token, giving you full participation in the direction and governance of the DAO. 4.NFE & Staking Optional Staking of NFE allows participation for APR which is pegged to dollar revenues. 6. AI Asset Risk Management and Business Application Processing","links":"https://mnicorp.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mnicorp/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x1c5ea1a050633dd9136e42ce675211116f465692"}}}