{"name":"LOCG","id":"locgame","symbol":"locg","description":"What Is LOCGame (LegendsOfCrypto)? LegendsOfCrypto (also known as LOCGame) is a simple and exciting play-to-earn NFT collectible card game. It pays tribute to figures who have helped build the blockchain industry as it stands today. LOCGame is the first collectible and strategy card game that documents the historical triumph of cryptocurrencies and educates players about the value and future of this industry in a fun, lucrative way. LegendsOfCrypto players and community are rewarded for their time and important contributions towards achieving Satoshi’s dream. These rewards are given as unique NFTs, Legendary Coins (LCs) in-game and $LOCG, the ecosystem’s native utility token. About $LOCG At the core of the LOCGame ecosystem is the platform's native $LOCG utility token. $LOCG is part of the Kucoin’s Metaverse Pool and is used for: Indirect rewards in play-to-earn mechanics NFT & in-game payments Access to communities, discounts and perks Staking DAO governance Where Can I Buy LOCG ? LOCG is available for trading on a number of exchanges including Kucoin, Gate.io, Uniswap and Hotbit. LOCGame Ecosystem includes: Native NFT marketplace connected to third parties on Polygon and ETH: marketplace.locgame.io Collectible Strategy Card Game with play-to-earn GameFi features In-game reward token (LC) that can be used to purchase playing cards, stake to earn $LOCG and other rewards. $LOCG native utility token NFT collectible & trading cards that are fully dedicated to the crypto industry's famous characters. Upcoming games that are complementary to LOCGame. Charity and social responsibility - 10% of the NFT sales go to a good cause via the Little Phil organisation. How Many LOCG tokens Are There in Circulation? LOCGame launched on April 28, 2021, in the Netherlands with 150 million LOCG tokens created at genesis. Already, 2 million tokens were burnt making the total circulating supply as of January 2023 to 50,209,206 LOCG.","links":"https://www.locgame.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/locgame/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x60eb57d085c59932d5faa6c6026268a4386927d0"}}}