{"name":"UPDOG","id":"updog-apt","symbol":"updog","description":"Aptos has always been lacking a strong, recognizable dog meme to lead the meme space, which is a huge part of what drives community engagement and excitement in the crypto world. Memes have been an essential element in the growth of popular cryptocurrencies, helping to build communities and generate widespread attention. However, Aptos has not had a mascot or meme that could capture this kind of enthusiasm—until now. Introducing Updog, the dog meme that only goes up, and it’s set to become the biggest and most beloved dog on the Aptos chain! Updog is not just another meme; it's a movement. The concept behind Updog is to bring a sense of fun, joy, and community spirit to the crypto space. It aims to be the next \"Doge\" of Aptos by creating a fun and cult-like movement that resonates with people from all walks of life. Just like how Dogecoin became a phenomenon, Updog strives to establish itself as the go-to dog meme on Aptos by building a passionate community that embraces positivity, humor, and the spirit of inclusivity. Updog's mission goes beyond just being a meme; it aims to spread kindness throughout the crypto community. In a space that can sometimes be highly competitive and cutthroat, Updog wants to remind everyone that there’s always room for positivity and goodwill. By encouraging a supportive and friendly environment, Updog will work to foster a sense of belonging and togetherness among its supporters, which is key to the success of any meme coin. After all, the power of memes lies in their ability to bring people together, make them smile, and create a sense of shared identity.","links":"https://updogapt.xyz/","market_cap":8507.51,"market_cap_rank":9728,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/updog-apt/logo.png","detail_platform":{"aptos":{"decimal_place":6,"contract_address":"0x55c833f3c668dd863d3848d306e426a33eac615bb93be03fe3a2f721701fec1::UPDOG::UPDOG","geckoterminal_url":"https://www.geckoterminal.com/aptos/tokens/0x55c833f3c668dd863d3848d306e426a33eac615bb93be03fe3a2f721701fec1::UPDOG::UPDOG"}}}