{"name":"Artery","id":"artery","symbol":"artr","description":"Artery Network is a project launched on its own blockchain (Artery Blockchain) on October 18, 2020. Its main task is to provide the market with tools to improve the data safety on the Internet. So, for example, at the project start a mobile application with the same name was released with Artery Storage and Artery VPN products.Their work is ensured by members of the Artery Network, who allocate resources such as disk space and Internet connection in the same application, in the Artery Node product. Network participants who provide the resources of their devices receive a reward in ARTR project coins depending on the amount of allocated resources. There exists also the Artery Network computer application, which was originally intended for block validation. Finally, from early 2021 the team of developers began to implement the Artery Storage and Artery VPN products, as well as the ability to allocate the resources of personal computers to increase the volume of decentralized storage and the bandwidth of Artery VPN. As of June 2021, products for computer application have successfully passed testing and are ready for release. The ultimate goal of the products is, in addition to providing them to private users, also adapting them for B2B sector. This will result in B2B sector using all the resources of the network, thus providing network members with constant rewards. The total issue of coins is 4.000.000.000 ARTR. The issue term is approximately 10 years. Coins are mined by means of delegating them. Delegation helps to ensure the coin with liquidity, as well as to support other network participants in becoming validators, thus strengthening the Artery Blockchain. So, for example, as of June 2021, 93% of ARTRs are in delegation. This shows that almost all coins are frozen and not traded on the stock exchange, thus strengthening the coin's rate. Depending on the number of frozen (delegated) coins, a reward is paid to the user, in that way new coins appear on the market. Delegation fees are listed in the WhitePaper of the project. In order to avoid inflation, periods of decreasing remuneration to delegators were undertaken, the first of which took place on April 18, 2021. During the first 7 months of the project, the ARTR rate increased 14 times from $ 0.11 to $ 1.4 (as of June 5, 2021). The key objective of the project is to win the leading position in providing decentralized solutions for both individual users and B2B market.","links":"https://arterynetwork.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/artery/logo.png"}