{"name":"Evadore","id":"evadore","symbol":"eva","description":"# What is the project about? Evadore is a Regenarative Finance (ReFi) project created to leave the world in the best way for future generations and to find solutions to environmental problems around the world. To learn more about Evadore, go and read our detailed whitepaper: https://docs.evadore.io/ Evadore was established in May 2023 by a team based in Turkey, with the objective of developing a blockchain technology aimed at achieving carbon neutrality, in response to the pressing global climate issue. A significant portion of the energy consumed by current blockchain technology and mining operations is derived from non-renewable fossil fuel sources, hence exacerbating the ongoing climate problem. The provision of assistance to renewable energy sources assumes a significant role in the mitigation of fossil fuel usage. The Evadore foundation is now engaged in the use of renewable energies and endeavours to exemplify the initial steps that humanity can do in order to contribute towards global betterment. # What makes your project unique? Compared to other blockchains, Evadore aims at achieving carbon neutrality. This is done by applying regenerative finance principles to blockchain technology, we can create a financial system that is more sustainable, equitable, and transparent. This can help promote sustainable development, reduce inequality, and support the well-being of people and the planet # History of the project? Since the project's inception on May 24th, 2023, we have been working hard to expand its ecosystem. We have also built a large team of more than 20 people who are dedicated to making the Evadore project a success. The features within our current ecosystem: - Evalabs - Eva Chain - GreenWallet - EvaPay - EvaForest - EvaStore - CarbonEva More information about these features of the Evadore ecosystem can be found on the website: https://evadore.io/ecosystem.html # What is next for Evadore? Today (September 15th, 2023) Evadore has had its IEO on four different exchanges: LBANK: https://www.lbank.com/en-US/trade/evadore_usdt/ XT.COM: https://www.xt.com/en/trade/eva_usdt P2PB2B: https://p2pb2b.com/trade/EVA_USDT/ BITMART: https://www.bitmart.com/trade/en-US?layout=pro&theme=dark&symbol=EVA_USDT After reaching this important milestone, we continue to create additional strategic alliances to expand our network and, consequently, our ecosystem. The marketing campaigns are intended to reach potential investors and developers who wish to build on our chain. More information about what is next for Evadore can be found here: https://docs.evadore.io/roadmap/the-future-of-evadore-updates-and-roadmap # What can the EVA token be used for? The EVA token is used within our ecosystem. The more Evadore users and developers there are in our ecosystem, the more valuable the native token will become. EVA token can be compared to the utility of BNB, ETH, and other major blockchain native coins. Please feel free to email us at info@evadore.io if you require any additional information.","links":"https://evadore.io/","market_cap":26667,"market_cap_rank":8394,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/evadore/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}