{"name":"Burn Kenny","id":"burn-kenny","symbol":"kenny","description":"What is the project about? Burn Kenny ($KENNY) is a humor-filled, super deflationary meme token inspired by the much-beloved South Park character, Kenny McCormick. The token was designed with a twist: just like poor Kenny, our tokens are destined for a swift and fiery end. It's a part of the tokenomics designed to bring a fun and unique dimension to the world of crypto investments. What makes your project unique? Kenny might die a lot, but he's not a complete idiot. We're offering a generous 40% of the total token supply to those brave (or foolish) souls willing to invest in our pre-launch. It's like betting on Kenny surviving an episode - not likely, but wouldn't it be a hoot? Another 30% will be thrown into the murky, unpredictable waters of the Uniswap pool. This liquidity will be locked for 3 months, much like Kenny's fate is locked in every episode. Remember, liquidity lock-up is like Kenny’s parka—essential for his survival... or rather, essential for the token's survival. History of your project. Burn Kenny Tokens are Hotter Than Cartman's Temper! Ready to jump in on the madcap fun? Grab your Burn Kenny tokens today! But remember, unlike Kenny, not everyone can come back to life after a poor investment decision. So only invest what you can afford to lose! Get ready to ride the wildest, most hilarious crypto ride this side of Colorado. With Burn Kenny, the more we burn, the hotter your tokens can get. It's a comedy and financial festival, all rolled into one! What’s next for your project? We believe in total transparency, just like the running gag of Kenny's multiple demises. Our smart contracts are public, our motives are clear (making money while having a laugh) and our team is ready to answer any questions you throw at us, be it about our token or the latest South Park episode. What can your token be used for? Every time you hear \"Oh my God! They burned Kenny!\" don't just laugh, do a victory dance, because it means we've burned some more.","links":"https://burnkenny.vip/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/burn-kenny/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf5f38b0ad4163a1981c7b960bcd8c242e0038e72"}}}