{"name":"The Standard Token","id":"standard-token","symbol":"tst","description":"The Standard Protocol is an EVM-based stablecoin and lending protocol allowing users to lock up assets and mint stablecoins at 0% interest. TheStandard is currently on Ethereum L1 but will be one of the first major projects to launch on the ZK-EVM that polygon is releasing in Q1 2023. The first stablecoin launched using The Standard is sEURO https://www.coingecko.com/en/coins/standard-euro with sUSD, sINR, GBP and many more rolling later 2023. TST is a membership token for governance and rewards, and can also be used to buy undervalued assets. The protocol has issued sEURO and plans to introduce other fiat-pegged stablecoins in 2023. TST's maximum supply is 1 billion. TheStandard.io's co-founders are Joshua Scigala, Philip Scigala, and Ana Valdes. The team also created Vaultoro.com, the first bitcoin/gold exchange, and developed the glass books protocol and lightning network exchange implementation. For more information, visit https://TheStandard.io. **What makes The Standard Protocol unique?** The Standard Protocol focuses on releasing a stablecoin for every major fiat currency. The first stablecoin to be released is sEURO which will be released using an initial bonding curve (IBCO) mechanism. The Standard will launch its full suite of smart contracts on the ZK-EVM but its current MVP is running on L1 Ethereum. * Lock up assets and borrow at 0% interest with no pay off time limit. * Sell your debt as an NFT if you can not afford to pay off your loan but need liquidity. * Trade locked-up assets within the smart vault. This means if you have borrowed against locked Ethereum and you think LINK will pump then you can swap the eth for an equal amount of LINK. * you hold your keys, no third party can touch your assets unless you fall under collateral. * TheStandard will be one of the first dapps running on the polygon ZK-EVM when it launches its main net. * Smart contracts are fully audited by Zokyo labs.","links":"https://thestandard.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/standard-token/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xf5a27e55c748bcddbfea5477cb9ae924f0f7fd2e"}}}