{"name":"Portal Network Token","id":"portal-network-token","symbol":"poe","description":"In simple words the aim of the project can be formulated as follows: to create an effective business model for the development of charging infrastructure for electric vehicles in Russia and other countries, to form a community and to make profit together. Today our team is one of the best in Russia in terms of production, installation, and operation of charging stations. We have developed a whole line of our own products that implement all the main protocols, and we also have our own application. Our stations are certified by the Ministry of Industry and Trade and are installed throughout the territory of Russia. Our specialists also participate in the work of the relevant ministries as consultants. Many years of experience in this industry have allowed us to develop a very clear understanding of the specifics of the charging stations market in Russia and acquire the necessary competencies for further work. To realize the technical part of the project, we use a token in the TON network. The token emission is tied to the installation of charging stations. Additionally, the token can be \"mined\" when the station connects to the Portal Network hub. Thus, the charging stations become the objects of extended functionality, performing the primary function of charging electric vehicles and the additional function of mining tokens, which organically allows for multi-level work that contributes to the development of the project as a whole. All the income from the sale of electricity (general network plus mining) is distributed among liquidity holders on DEX.","links":"https://portalnetwork.tech/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/portal-network-token/logo.png","detail_platform":{"the-open-network":{"decimal_place":9,"contract_address":"EQBB7RWO0qzo6JhikXLjmKJc81IS4JR0cyc5bPAL_h0GGmxW","geckoterminal_url":"https://www.geckoterminal.com/ton/tokens/EQBB7RWO0qzo6JhikXLjmKJc81IS4JR0cyc5bPAL_h0GGmxW"}}}