{"name":"Kadena","id":"kadena","symbol":"kda","description":"Kadena is launching one of the world’s first true scalable blockchains ready for applications. Kadena’s public blockchain is a braided, high-throughput Proof of Work system that runs Chainweb, a protocol that delivers security and throughput. The Kadena network will unite public applications, private blockchains, and other interoperable chains in one place, driving traffic to the high-bandwidth computer at the heart of the Kadena public chain. Kadena enterprise software is in use today by major companies in finance, healthcare, and insurance while allowing builders with a vision to skip straight from idea to product. With the launch of Kadena’s public chain, this system will support blockchain application development, from private to public and everywhere in between. Kadena is solving the problems of Ethereum and is delivering features today that other blockchains have only begun to include on their roadmaps, including Formal Verification, interoperability, scalability, and more. Kadena is live and ready for immediate deployment of production blockchain applications. The Kadena token (KDA) is a digital currency that is used to pay for computation on the Kadena public chain. Similar to ETH on Ethereum, KDA on Kadena is the token in which miners are compensated for mining blocks on the network and is the transaction fee that users pay in order to have their transactions included in a block. Applications processing volumes of transactions on the high-throughput, scalable Kadena network will execute their smart contract code using the native Kadena token. As more applications join or interoperate with the Kadena network, the number of smart contracts executed grows, as does the utility of the Kadena token.","links":"http://kadena.io","market_cap":115367451,"market_cap_rank":297,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kadena/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}