{"name":"ShibElon","id":"shibelon","symbol":"shibelon","description":"In the year 1955, a young Shibelon was born onto the far far away planet called Neptune. Technology is too advanced on Neptune but humans could not reach this far to see all the innovations that it has to bring, therefore Shibelon studied astronomy and saw that there was a very high population on earth with very limited resources to reach advanced technology. On September 28th 1971, Shibelon sent his first electromagnetic signal into South Africa which changed the world as we know it. This signal influenced an unborn child who will carry a prodigy that will revolutionise the monetary system. On June 28th 1971, that child was born, but he wasn’t a normal child, he was born a genius. And his lovely mother named him Elon Musk. Shibelon then took his time to develop intergalactic travel and on August 18th 2008, he transferred a source code to planet earth and deployed a monetary online currency which is referred to as Bitcoin to see what the humans could do with it. He was thrilled when he found out that people started transacting with it as he intended and on May 22nd 2010 he saw a thread from a student in California who wanted to buy a pizza for 10,000 Bitcoins and decided to approve that transactions to help facilitate the adoption. Which it did! He watched over Earth for years now and has almost completed his Super Rocket which is set to take course to earth on November 10th 2021 to help create the greatest wealth transfer in the history of the universe. As time draws near and travel gets boring alone, he will be entertaining himself on the journey by creating and developing a roadmap to his own token on the Binance Smart Chain assisted by his best friend, Adam King, who will bring only the latest never seen before technological advances to the Blockchain. Aside from the solidity contract he has created to be shared with Humans, his Roadmap involves Advanced Staking, Super Swaps, 3D NFTs, Play 2 Earn Gaming and many more that he will be sharing on his way to Earth. Expect him. He’s coming. He’s the Future.","links":"https://shibelon.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shibelon/logo.png"}