{"name":"TruthChain","id":"truthchain_solana","symbol":"truth","description":"The TruthChain token serves as the backbone of the ecosystem, enabling seamless operations and incentivizing community participation. It has multiple use cases that make it essential to the network’s success and functionality: 1. Validator Rewards: Validators are the nodes hosting neutral and untampered LLMs in the TruthChain network. They play a critical role in maintaining the network’s decentralization and reliability. Tokens are used to reward these validators for their contributions, ensuring the network remains active, secure, and efficient. 2. Transaction Fees: Users querying the TruthChain network for data verification or consensus will pay small transaction fees in tokens. These fees help sustain the ecosystem by compensating validators for their computational efforts. 3. Staking: Tokens can be staked by both validators and users to support the network’s operations. Validators may stake tokens to secure their roles in the ecosystem, while users can stake to earn rewards and participate in securing the network. Staking also acts as a safeguard, discouraging malicious actors from attempting to disrupt the network. 4. Governance: TruthChain is a community-driven project, and the token empowers holders to take part in governance decisions. Token holders can propose and vote on key network upgrades, policy changes, or the inclusion of new LLMs. This ensures that the network evolves according to the collective interest of its community. 5. Access to Services: The token will also act as a medium of exchange for accessing premium features within the ecosystem. Users can use tokens for API calls, advanced verification tools, or other services that require computational resources. These utility-focused applications make the token integral to TruthChain, ensuring it supports decentralization, incentivizes participation, and sustains the ecosystem financially. By aligning incentives with the network’s goals, the token helps establish a reliable, transparent, and censorship-resistant solution for verifying factual data.","links":"https://www.verafy.ai","market_cap":40210,"market_cap_rank":8548,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/truthchain_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"2GmUPhpe93kcTJZrC7NJ2keeDZRT5dBveUgegb13pump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/2GmUPhpe93kcTJZrC7NJ2keeDZRT5dBveUgegb13pump"}},"is_native":false}