{"name":"Marmara Credit Loops","id":"marmara-credit-loops","symbol":"mcl","description":"Marmara Credit Loops (MCL) is a pioneering DeFi system, uniquely designed to operate within the real economy. As the world's first of its kind, MCL revolutionizes traditional credit mechanisms, offering a decentralized alternative rooted in the principles of post-dated checks and promissory notes. The platform's innovative 'Credit Loop' system allows users to issue, endorse, and settle credit with unmatched transparency and security, mirroring real-world financial interactions in a digital realm. MCL operates as an independent smart chain, featuring a coin that is 25% mineable and 75% stakeable, integrated with two distinct DeFi protocols. The platform's staking model is unique; coins can be locked in two funds: 'Activated' and 'Locked in Credit Loop' (LCL). Notably, coins in the LCL fund enable 3x staking rewards for both credit issuers and holders, a feature unparalleled in other staking systems. This dynamic staking mechanism allows coins to remain in circulation, even while locked in credit loops, ensuring liquidity and utility in the real economy. MCL's integration with real-world applications, such as the zero-commission chain market, showcases its potential to transform both digital and traditional marketplaces. The MCL Coin, serving as the native collateralization asset on the Marmara Chain, addresses the nonredemption problem prevalent in traditional credit systems. It acts as a distributed insurance mechanism against defaults, adding another layer of security and trust to the ecosystem. In essence, Marmara Credit Loops is not just a financial platform but a comprehensive ecosystem that bridges the gap between traditional finance and the digital economy, offering a secure, transparent, and efficient system for credit transactions and staking rewards.","links":"https://marmara.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/marmara-credit-loops/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}