{"name":"Gomining Token","id":"gmt-token","symbol":"gomining","description":"What is Gomining Protocol? GoMining is a Liquid Bitcoin Hashrate protocol. Gomining allows users to own Bitcoin hashrate digitally as an NFT asset on the Ethereum/BNB chains and the Bitcoin blockchain (ordinals) without the necessity to own or maintain their physical mining infrastructure. It simplifies Bitcoin mining for millions of users and unlocks the huge potential of Bitcoin hashrate to be used as RWA (Real World Asset) in Defi. The hashrate NFT position continuously generates Bitcoins and can be traded or used as collateral in Defi like any other asset. To make this possible, Gomining created and developed the Liquid Bitcoin Hashrate (LBH) concept: while the physical mining equipment and the corresponding hashrate operate in the data center, the user owns an NFT that represents the hashrate position. The LBH tokens can be used in Defi like Ethereum-based LSTs (liquid staking tokens) : they generate income on behalf of their owner, can be traded, and can be used in Defi protocols for borrowing/lending purposes. For example, LBH tokens can be used as collateral for borrowing stablecoins for farming strategies and providing additional income to the LBH token owner. In addition to using NFTs for bitcoin mining or Defi-related activities, NFT owners can participate in play-to-earn mechanics that enrich the NFT-based mining experience, engage the community, and provide additional income to NFT owners. Gomining actively develops GameFi elements that allow users to generate additional income in NFTs on top of primary BTC mining proceeds. What is the Gomining token? The design of GoMining token combines a Discount token, a modified version of the burn and mint equilibrium (BME) [2] [3], and ve Token (voter escrowed) governance model [4]. The GOMINING token has the following functions within the Gomining ecosystem: Discount token for electricity payments. NFT hashrate owners are required to pay electricity and maintenance costs, which are deducted from BTC mining revenue. By using the Gomining token for power/maintenance payments, users receive a 10% discount and continuously mine more bitcoins. Protocol governance. Users participating in Gomining governance can vote on proposals, influence protocol management, and most importantly - Gomining rewards distribution to the community of NFT owners and GameFi activities. Participation in governance requires locking tokens into a veGMT contract, which works identically to the well-known veCRV (vote-escrowed Curve contract). Users who lock Gomining tokens in a vote-escrow (ve) contract receive (1) votes and (2) stake rewards. The longer the lock, the greater the number of votes and shares in the reward distribution for a given number of locked Gomining tokens. In addition to the Discount Token Utility and Governance Utility, token holders can upgrade the hashrate and energy efficiency of their Liquid Bitcoin Hashrate positions using Gomining tokens. How Liquid Bitcoin Hashrate NFTs are issued? Liquid Bitcoin Hasrate NFTs are issued by Service Providers using Gomining. The requirements for Service Providers include: (1)to have public hashrate proof in known BTC mining pools (2) membership in reputable mining organizations such as the Bitcoin Mining Council. In the future, Gomining aims to launch its own BTC mining pool and require Service Providers to use it for even more transparency. How Gomining community rewards are allocated? The Gomining community distributes rewards via weekly voting, which requires locking Gomining tokens into a vote-escrow contract (veGMT) to receive votes. How to buy and use hashrate NFT for BTC mining? Users can buy NFTs on the Gomining website or NFT marketplaces like OpenSea. When the NFT is in the wallet balance, the user should visit the Gomining website, connect the wallet, and provide the BTC wallet address to receive the mining proceeds. The more efficient mining strategy involves using GMT tokens to pay for electricity and maintenance costs. GMT tokens can be purchased on various CEX exchanges, Uniswap (Ethereum), PancakeSwap (the BNB chain), or on the Gomining website that integrates all purchase options on one page. Gomining token circulation mechanics. The Gomining token uses the burn-and-mint equilibrium model (BME) to circulate within the ecosystem. It works as follows: all tokens paid by users for electricity/maintenance costs and some other activities are burned, and immediately, new Gomining tokens are minted by a smart contract. The burning and minting process is based on epochs and minting coefficients. Each epoch has a number of tokens to be burned and minted according to a certain mining coefficient that increases from epoch to epoch. The total number of Epochs is 20, here we share some highlights: Epoch 0: 10,000,000 tokens burnt, 8,000,000 tokens minted, 0.80 coefficient Epoch 1: 20,000,000 tokens burnt, 16,200,000 tokens minted, 0.81 coefficient Epoch 2: 30,000,000 tokens burnt, 24,600,000 tokens minted, 0.82 coefficient Epoch 17: 750,000,000 tokens burnt, 727,500,000 tokens minted, 0.97 coefficient Epoch 18: 1,345,762,000 tokens burnt, 1,318,846,760 tokens minted, 0.97 coefficient Epoch 19 (the Final Epoch): the infinite number of tokens can be burned and minted with a 0.99 coefficient The minted tokens are distributed to: Service Providers (hashrate NFT issuers) for compensating their electricity/maintenance costs (65%) Governance stakers (20%) Rewards and incentives for the NFT owners and GameFi activities (10%) The team (5%)","links":"https://gmt.io/","market_cap":118599303,"market_cap_rank":289,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gmt-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7ddc52c4de30e94be3a6a0a2b259b2850f421989"},"the-open-network":{"decimal_place":18,"contract_address":"EQD0laik0FgHV8aNfRhebi8GDG2rpDyKGXem0MBfya_Ew1-8"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7ddc52c4de30e94be3a6a0a2b259b2850f421989"}}}