{"name":"GoMining Token","id":"gmt-token","symbol":"gomining","description":"What is GoMining? GoMining is a digital mining platform that offers multiple ways to earn Bitcoin and leverage exposure to it via a user-friendly ecosystem powered by the GOMINING utility token. This ecosystem’s key offerings include digital miner collectibles linked to real Bitcoin mining power and a competitive GameFi mining experience in the Miner Wars game. What are Digital Miners? Digital Miners are GoMining’s flagship product, offering an easy and efficient way to mine Bitcoin. Backed by real-world datacenter hashrate and cutting-edge mining hardware, these digital assets work similarly to a call option in finance: users pay the cost to mine Bitcoin (the ‘strike price’) and keep any profits if Bitcoin’s value exceeds this cost. Thanks to access to advanced equipment and wholesale electricity rates—further reducible by up to 20% with the GOMINING token—production costs rival those of large-scale industrial miners. This accessibility and efficiency make GoMining’s Digital Miners a reliable, scalable, and globally available method to leverage long-term Bitcoin potential. What is Miner Wars? Miner Wars is a GameFi, blockchain-based game launched by GoMining in September 2024, offering players an engaging and competitive way to compete for Bitcoin (BTC) and GOMINING payouts. GoMinig mimics how blocks are being solved on the actual blockchain, where ‘Clans’ (groups of players pooling their digital miners’ power) compete to solve blocks. Adding to the strategic depth, players can use Boosts to enhance their scores during each round. ##**What is the GOMINING token?** GOMINING is a utility token that powers the GoMining ecosystem. Directly tied to real mining operations, it also offers a way to leverage Bitcoin. GOMINNG provides up to 20% off digital miner maintenance fees for GoMining users, which boosts token demand as our community grows (currently owning over 1% of global BTC hashrate). With a deflationary model that permanently burns part of maintenance fees paid in GOMINING each week, and over 30% of the supply locked in governance for an average of two years, GOMINING’s scarcity and value are positioned to steadily increase. This makes GOMINING a Bitcoin derivative designed to amplify Bitcoin’s growth within its dynamic ecosystem. GoMining’s suite of innovative Bitcoin leverage products offers a unique way for both experienced crypto users and newcomers to benefit from Bitcoin’s growth, helping to drive its mainstream adoption.","links":"https://gomining.com/","market_cap":211304880,"market_cap_rank":327,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gmt-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7ddc52c4de30e94be3a6a0a2b259b2850f421989","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x7ddc52c4de30e94be3a6a0a2b259b2850f421989"},"solana":{"decimal_place":9,"contract_address":"3KzAE8dPyJRgZ36Eh81v7WPwi6dm7bDhdMb8EAus2RAf","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/3KzAE8dPyJRgZ36Eh81v7WPwi6dm7bDhdMb8EAus2RAf"},"the-open-network":{"decimal_place":18,"contract_address":"EQD0laik0FgHV8aNfRhebi8GDG2rpDyKGXem0MBfya_Ew1-8","geckoterminal_url":"https://www.geckoterminal.com/ton/tokens/EQD0laik0FgHV8aNfRhebi8GDG2rpDyKGXem0MBfya_Ew1-8"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7ddc52c4de30e94be3a6a0a2b259b2850f421989","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x7ddc52c4de30e94be3a6a0a2b259b2850f421989"}}}