{"name":"Doge Universe","id":"doge-universe","symbol":"spacexdoge","description":"Doge Universe #SPACExDOGE all about. Max Supply: 100,000,000,000. Public Pre-Sale: 20% (20,000,000,000). Public Pre-Sale Price: $1 USD per 20,000 tokens. Fees: 8% fee on all transactions. 4.5% will be to generate liquidity. 1.5% will go towards token burning. The remaining 2% will be distributed amongst all holder. Staking Transition: This taxation system will be removed once 50% of the max supply has been burned, and we will transition to staking. Growth. Problem.& Solution: With billions of dollars entering the meme-coin market and millions of new investors looking for the next 1000x opportunity, There is one significant issue: FRAUD. Rug-pulls and exit scams have become a significant problem in the cryptocurrency market. The platform developed by Doge-Universe. (DogeUniverse.Finance) will significantly reduce the likelihood of these events occurring. The rug war has begun! NFTs. New Method To EnhanceThe Value: The NFT market has grown to be a multibillion-dollar enterprise. It is simple to create an NFT and circulate it. Our new method of creating and distributing NFTs via gamers who act as miners will increase the rarity and value of our beloved NFTs. A new ecosystem has entered the conversation, one that will enable gamers and all content creators to profit from their valuable work and art while also increasing the market's value. Gaming. Virtual-Gaming Decentra-Land. UniversalExplorations: We will revolutionize the future of gaming by implementing blockchains, non-volatile memory, decentralized universes, and, eventually, quantum computing, which will exponentially improve the overall quality of gaming to an unfathomable level. Graphics, memory, and gameplay quality will be light years ahead of what we currently have. By connecting computers to our brains, we will be able to duplicate universes and engage in simulations. Doge-Universe will advance the research and development necessary to make these dreams a reality. A New Social-Ecosystem: Our De-Fi platforms will foster the growth of new crypto ecosystems. A more sophisticated platform for user interaction. Crypto freelancers will be able to accept work via the platform from other projects or from anyone in need of crypto-related services such as smart contract development, web development, marketing, and graphic design. Decentralized Governing Community: Providing an improved and decentralization governance community. The original purpose of cryptocurrencies is a decentralized currency in which no single entity has central authority over the currency.","links":"https://dogeuniverse.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doge-universe/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x01af9fc6130aeddbd2cdb6e684262f5b605471cc"}}}