{"name":"Theory of Gravity","id":"the-theory-of-gravity","symbol":"thog","description":"Our vision at Theory of Gravity is to ascend to the upper echelons of the meme token realm, establishing ourselves as a dominant force and claiming the throne of frog-related meme tokens. Rising from humble beginnings, we're driven by an unwavering commitment to community and a relentless pursuit of excellence. We refuse to rest on our laurels, continuously pushing the boundaries of what's possible as a united force. Together, we embrace the mantra of \"keep the cheeks clenched,\" symbolizing our determination to persevere through every challenge and obstacle. With boundless enthusiasm and collective effort, we're poised to shape the future of meme tokens and leave an indelible mark on the crypto landscape. Our vision at Theory of Gravity is to ascend to the upper echelons of the meme token realm, establishing ourselves as a dominant force and claiming the throne of frog-related meme tokens. Rising from humble beginnings, we're driven by an unwavering commitment to community and a relentless pursuit of excellence. We refuse to rest on our laurels, continuously pushing the boundaries of what's possible as a united force. Together, we embrace the mantra of \"keep the cheeks clenched,\" symbolizing our determination to persevere through every challenge and obstacle. With boundless enthusiasm and collective effort, we're poised to shape the future of meme tokens and leave an indelible mark on the crypto landscape. Our vision at Theory of Gravity is to ascend to the upper echelons of the meme token realm, establishing ourselves as a dominant force and claiming the throne of frog-related meme tokens. Rising from humble beginnings, we're driven by an unwavering commitment to community and a relentless pursuit of excellence. We refuse to rest on our laurels, continuously pushing the boundaries of what's possible as a united force. Together, we embrace the mantra of \"keep the cheeks clenched,\" symbolizing our determination to persevere through every challenge and obstacle. Wit","links":"https://www.thogonsol.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the-theory-of-gravity/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"5CqfXex1knfRiozwDtgFFNaiGR9TsmSUcWDNUTUGZQru"}}}