{"name":"Minted","id":"minted","symbol":"mtd","description":"Minted.network is a decentralised NFT platform that aspires to be the digital bazaar of wonders for everyone to discover, trade, and find NFT gems, native to Ethereum and Cronos. Aiming to bring more tools for collection owners to design, curate, and offer utilities to their communities, all without the technical complexities that riddle many aspiring collection owners. Minted™ provide these key functions: 1. Self-Custodial Trading - users maintain full control of their NFTs. 2. Multi-chain Support - supports both Ethereum and Cronos. 3. Native $MTD token - $MTD is Minted™’s native token on Cronos designed to incentivize the long term supporters of the platform. 4. Security First - Minted™ smart contracts are fully audited by Blocksec. Minted offers below main features: - Launchpad - Rewards: 1. Listing: earn rewards by listing eligible NFTs with less than 2x floor price, and boost the reward by listing under 1.1x of the floor price. Rewards are distributed daily (via $MTD) and available for claiming anytime 2. Staking: by depositing your $MTD at Minted™ Vaults, you can earn platform rewards and $MTD rewards Tokenomics $MTD is Minted’s native token built on the Cronos chain, which will be used to reward users for various activities at platform participation. In the future, $MTD may also be used for governance of the platform. There will be a total of 1,000,000,000 (1 billion) $MTD tokens Business Development Reserve 35.0% (Unlocked at Token Generation Event (TGE)) Liquidity and Staking Management 28.4%(Staking Incentives distributed over 48 Months; Liquidity Management unlocked at TGE) Team 16.5% (24 month linear monthly vesting) Treasury 15% (Unlocked at TGE) Platform Rewards 5% (Distributed over 48 months) Public Launch 0.1% (40% immediate unlock; 60% linear monthly vesting at 10% per month) Read more: https://minted.network/about/litepaper.pdf - Minted just concluded its public sale on Aug 10th, 2022 - $MTD is now available for trading on VVS Finance","links":"https://minted.network/","market_cap":4490126,"market_cap_rank":2436,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/minted/logo.png","detail_platform":{"cronos":{"decimal_place":18,"contract_address":"0x0224010ba2d567ffa014222ed960d1fa43b8c8e1"},"ethereum":{"decimal_place":18,"contract_address":"0x809e130e10e787139c54e1d12d3d1971b7a675bf"}}}