{"name":"Buying.com","id":"buying","symbol":"buy","description":"BUY token is the utility coin in the Buying.com network. Buying.com is a next-generation decentralized e-commerce hyper local delivery network, offering micro distribution channels powered by decentralized delivery networks. We enable smaller retailers who do not have the access to vertically integrated technology and logistic services, to access multiple delivery channels and failure monitoring, and hence, pose a serious threat to larger retailers by offering a fully integrated peer-peer delivery network with a top class delivery service. Our solution offers the most competitive delivery system which can result in 10-30% cost reduction compared to current expenses and expand the business's geographical reach to help increase its revenue. Current scope of the project focuses on restaurants and food-delivery businesses. The BUY token’s maiden use case is in rewarding loyalty of participating restaurants of it's fulfillment operations in the food service sector where the platform aggregates the orders and deliveries from popular food-ordering apps such as Doordash, GrubHub, Uber Eats, and Postmates. All order details are stored on the Buying.com platform and a final reward calculation is carried out at the end of the day, based on the number of orders. At the end of a month, when the final settlement between the business and Buying.com takes place, the business can redeem the BUY token against their bill. The adjustments will be made based on the average market price of BUY tokens on the many listed exchanges. Current reward system, which solely has the number of orders as the contributing metric for reward issuance, will be replaced by a more advanced and improved version, by virtue of a reputation score. Users will be able to rate and review the restaurants, and their services, which will contribute to a restaurant's reputation score. The reward scale will be tilted in favor of restaurants providing better services, incentivising better conduct from the restaurant's end and improving the end consumer's experience. Going forward, we intend on accepting the BUY token for placing orders, paying delivery personnels, providing restaurant and end-user rewards etc. New mechanisms are being devised to have “premium benefits” such as priority deliveries, best rated drivers and cashbacks, based on the amount of BUY tokens staked by the users and restaurants.","links":"https://buying.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/buying/logo.png","detail_platform":{"algorand":{"decimal_place":2,"contract_address":"137020565"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x40225c6277b29bf9056b4acb7ee1512cbff11671"},"ethereum":{"decimal_place":2,"contract_address":"0x396ec402b42066864c406d1ac3bc86b575003ed8"}}}