{"name":"Dacxi","id":"dacxi_ethereum","symbol":"dxi","description":"What is Dacxi Coin? Dacxi Coin is the engine that powers the Dacxi Chain; the world’s first global tokenized crowdfunding system. Harnessing blockchain technology and tokenization, the Dacxi Chain creates digital versions of company shares that can be easily bought and sold by anyone, anywhere, at any time. In doing so, it aims to solve the fundamental flaws that have held crowdfunding back from the trillion-dollar industry that leading companies such as IBM believe it could (and should) be. First launched in 2017, Dacxi Coin is the Dacxi Chain’s native cryptocurrency. As such, it plays a vital role in the Dacxi Chain’s operation. Dacxi Coin is responsible for facilitating global investment transfers, paying fees on the Dacxi Chain blockchain, node staking, and as the currency for the Dacxi Chain’s global crowdfunding network. The Dacxi Chain aims to unleash innovation around the world, by seamlessly connecting entrepreneurs with everyday investors who can offer the funding they need to succeed. When the Dacxi Chain is fully up and running, demand for Dacxi Coin is projected to reach billions. This makes Dacxi Coin one to closely watch. What makes Dacxi Coin Unique? As the native crypto of the Dacxi Chain, Dacxi Coin has a strong and sound use case – using blockchain technology to solve real-world problem. The early stage funding crisis is sealing the fate of thousands of world-changing products and ideas each year. Crowdfunding as we know it today has failed to reach the heights it promised – held back by limitations like geographical borders, lack of scale, and lack of buzz. In delivering the world’s first global tokenized crowdfunding system, the Dacxi Chain will break down these barriers. Opening the door for everyday investors to fund exciting new projects. Connecting entrepreneurs with the capital they need to grow their businesses. And unleashing the world’s innovation potential.","links":"https://dacxicoin.io/","market_cap":31131861,"market_cap_rank":865,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dacxi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x5e29cf3e3fed4df50acab95f8268e9ee26ea36f2","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x5e29cf3e3fed4df50acab95f8268e9ee26ea36f2"}},"is_native":false}