{"name":"Bangkit","id":"bangkit","symbol":"bkit","description":"Bangkit ($BKIT) is the inaugural token launched by Meme Blind Box, a groundbreaking AI agent designed to autonomously create meme tokens on the Base blockchain, with a unique twist—it’s driven by community sentiment and trends. This innovative approach marks a significant evolution in the world of meme tokens, merging artificial intelligence with the power of decentralized, community-driven creativity. The result is a dynamic ecosystem where the voice of the community directly shapes the narrative, style, and success of the tokens. The story of $BKIT began at Devcon 2024 in Bangkok during a live demonstration that captivated audiences with its potential to revolutionize how meme tokens are conceived and adopted. This milestone marked the birth of a new era where tokens are not only AI-generated but also community-owned, creating a symbiotic relationship between technology and its supporters. By harnessing the power of collective input, $BKIT exemplifies a spirit of inclusivity, creativity, and shared ownership. Bangkit is more than a token; it represents a movement—an invitation to join the Bangkit Litter 🐱, a growing community of enthusiasts who embrace the limitless possibilities of AI-crafted tokens. Together, they are redefining the meme token landscape, pushing boundaries, and unleashing the collective imagination to create something truly extraordinary. Whether you're a blockchain enthusiast, a creative mind, or a meme lover, $BKIT offers an opportunity to be part of a vibrant, collaborative journey into the future of tokenomics. Jump in today and explore the exciting world of $BKIT—where AI innovation meets human ingenuity.","links":"https://bangkit.meme/","market_cap":863708,"market_cap_rank":4000,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bangkit/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x262a9f4e84efa2816d87a68606bb4c1ea3874bf1"}}}