{"name":"Dog shit going nowhere","id":"dog-shit-going-nowhere","symbol":"dogshit2","description":"Dog Shit Going Nowhere (DOGSHIT2) is more than just a provocative name; it's a symbol of rebellion against the established norms of the cryptocurrency world. This project was born from the desire to create a token that represents the unfiltered, sometimes absurd, reality of the crypto space – a space where groundbreaking innovation often coexists with fleeting trends and meme-driven narratives. DOGSHIT2 is a direct, honest reflection of the often turbulent and unpredictable nature of the markets, providing a platform for those who identify with the struggle, the underdog mentality, and the raw, unfiltered side of the digital asset revolution. We call it \"the trenches vs. the suits.\" DOGSHIT2 is designed to resonate with those who feel left behind by the polished presentations and institutional hype. It's for the everyday crypto participant who has navigated the ups and downs, the pump and dumps, and the endless cycle of promises and disappointments. This token embraces the messy, authentic side of crypto, offering a shared space for those who aren't afraid to acknowledge the sometimes-chaotic nature of this world. Beyond its symbolic representation, DOGSHIT2 also aims to cultivate a strong, engaged community. By providing a transparent and relatable platform, we want to foster a space where individuals can connect and engage in a token that resonates with their own experiences. We believe in the power of shared narratives and intend to build a project where community participation is the driving force behind its evolution. DOGSHIT2 is designed to be a token for the people, by the people. This is a movement, not just a coin. Our intention is not to be another derivative project seeking to emulate the hype; rather, we want to provide a unique perspective and token, one that embodies the spirit of the true crypto believer. DOGSHIT2 is a call for authenticity in a world increasingly dominated by carefully crafted facades. We believe it's time to acknowledge the reality of the trenches and to build a token that acknowledges the struggle. The ticker symbol DOGSHIT2 represents the project's core ethos: it's bold, it's brash, and it doesn't apologize for being what it is. We are fully aware of the unconventional nature of the name, and it is entirely deliberate. We intend to use the moniker to showcase the project's uniqueness. DOGSHIT2 has a max supply and total supply of 1,000,000,000 tokens, aiming for a decentralized and inclusive token distribution. The contract address for DOGSHIT2 is BXebtR4k2WiaZ1HJmxcZkoCdxSBx1g1xnEpVra9Ppump. This contract is public and auditable for transparency.","links":"https://pump.fun/coin/BXebtR4k2WiaZ1HJmxcZkoCdxSBx1g1xnEpVra9Ppump","market_cap":268524,"market_cap_rank":5994,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dog-shit-going-nowhere/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"BXebtR4k2WiaZ1HJmxcZkoCdxSBx1g1xnEpVra9Ppump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/BXebtR4k2WiaZ1HJmxcZkoCdxSBx1g1xnEpVra9Ppump"}}}