{"name":"RealFevr","id":"realfevr","symbol":"fevr","description":"RealFevr is a company established in 2015 in the fantasy markets with a football fantasy leagues game that currently has over 2 Million downloads on iOS and Android. With the fantasy leagues concept proven, RealFevr is now working towards being one of the NFT industry leaders by having the first-ever fully licensed Football Video NFTs Marketplace. Its NFTs will also be integrated into the FEVR Battle Arena, a new trading moments game (Play and Earn) that’s currently in its alpha testing stage. RealFevr currently has 3 important ecosystem pillars: 💰 NFT Marketplace - where you can buy and sell sports video digital collectibles www.realfevr.com/marketplace 🎮 FEVR Battle Arena - upcoming Play-and-Earn NFT game. 📱 Fantasy Leagues - our fantasy football app with over 2.5M+ downloads Download it on App Store or Google Play, invite your friends and start playing! $FEVR is the token that unlocks all incentives within our ecosystem. The main goal of the FEVR token is to open the door to web3, where you, the user, are the centerpiece of the network and the main beneficiary of RealFevr's products. What's coming in the near future: - FEVR Battle Arena Game - Marketplace Challenges & Achievements - Public User Profiles & Leaderboards - Marketplace V3, Multitoken (FEVR on the marketplace) - NFT Bidding and User Notifications - Experience (LVL) System in-game and in-marketplace - NFT Fusion (By burning NFTs) - New Litepaper - New Sports Related Partnerships (Clubs, Leagues and Athletes) - New Web3 Partnerships (Ex CEXs and other projects) - Blockchain integration into Fantasy Leagues - New Ecosystem Products (Currently we have 3, but we already have concepts of 2 more) - Mass Marketing","links":"https://www.realfevr.com/fevr/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/realfevr/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x82030cdbd9e4b7c5bb0b811a61da6360d69449cc"},"ethereum":{"decimal_place":18,"contract_address":"0x9fb83c0635de2e815fd1c21b3a292277540c2e8d"},"polygon-pos":{"decimal_place":18,"contract_address":"0xe6b9d092223f39013656702a40dbe6b7decc5746"},"avalanche":{"decimal_place":18,"contract_address":"0x73178fceb736a9d6c1a9ef1fe413f09cba2d4a68"}}}