{"name":"SUPAH","id":"supah_base","symbol":"suph","description":"SUPAH is an agentic AI platform—your ruthless rug‑slayer and degen bodyguard—built to empower Base chain users with real-time alpha, security insights, and community engagement.Supporting holders with instant notifications, insights, and humor. Functionality & Utility: Fresh‑on‑Base Scanner: SUPAH scans every Base block in real-time via a proprietary database to detect newly deployed contracts. It fetches contract status (renounced/verified), LP info, holder count, and more. Alpha Calls: Generates high-conviction signals for newly launched tokens with solid on‑chain metrics and low risk — enabling early entry to potential gems. Security & Opportunity Scoring: AI-driven risk modeling flags dangerous or scammy contracts, helping users avoid rugs. Token‑Gated Access: Exclusive tools, alerts, and tiers (Fanboy → Champion) are unlocked for $SUPH stakers. Community-Driven Persona: SUPAH interacts in degen channels with playful, edgy energy—deployed across Telegram, X, and Creator.bid to boost morale and amplify the “Agents of Change” movement. Differentiators: Aggressive Lexical Persona: SUPAH isn’t just functional—it’s got DEGEN swagger, humor, and a narrative-driven identity. Creator.bid Ecosystem: SUPAH launched via a bonding curve on Creator.bid, ensuring fair token distribution. It’s among the top 50 agents and earns $BID emissions through endorsements. No Vested Team Tokens: 21 million tokens are circulating, all distribution transparent—no insider allocations or vesting schedule. Integrated Analytics: Beyond detection, SUPAH is building analytics dashboards both on Creator.bid and its own interface to quantify project insights and performance.","links":"https://supah.ai/","market_cap":9815.89,"market_cap_rank":11220,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/supah_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x40ba93835789b9958ed588308c299fa27ddc5838","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x40ba93835789b9958ed588308c299fa27ddc5838"}},"is_native":false}