{"name":"Ape Fun","id":"ape-fun-token","symbol":"aft","description":"The AFT is the main token powering Ape Fun Gaming's 3 developing projects: The AFG Guild, The Banana Kingdom RTSMMO Game and The Ape Fun Arcade — which have been quietly in development since the summer of 2021. A brief overview: GUILD: The AFG Guild - governed by the Guildmaster DAO - is a 100 person strong micro-dao building up a portfolio of blockchain game assets that'll power the Ape Fun Arcade's game-NFT rental app in 2024. The Guild is also in charge of adding liquidity to the AFT over a 20 month period starting in Q3, 2022. To join the Guild's governing body you must own one of our 100 Guildmaster NFTs. To join the larger guild, and get early access to the assets before the launch of the rental app, you'll need to own an Ape Fun Gaming All Access Pass. GAME: The Banana Kingdom is a an upcoming RTSMMO blockchain game where players use 5 different base element tokens to craft the weapon-and-gear NFTs they’ll need to battle for the top spot in the game. Play solo as a nomadic Wanderer of the Kingdoms 4 regions or battle for land and status as part of a regional tribe. In the Banana Kingdom, your crafting materials and battle earnings are tokens, your weapons, gear, tool sets, rank, tribes regional status-class and Kingdom lands are all NFTs that give you different avenues to earn and expand your tribe and turf. Our pre-game app the \"\"Kong Quest\"\" was completed in Q2 2022 and is currently the only way to buy and win the Banana Kingdom's non-land NFT assets. You can also stake & farm tokens and NFTs in the app. The Ape Fun Token will be paired with the Banana Kingdom's base element tokens (see whitepaper) in a proprietary swap built into the game. AFT will also be the only currency accepted as payment in the games crafted-item NFT marketplace. ARCADE: The Ape Fun Arcade isn't a retro arcade per se, although that would be cool. Instead it'll be a place to discover and rent high quality blockchain game assets that would otherwise be too expensive for players to own. Players who want exposure to a game's higher quality play-to-earn functions - without spending thousands of dollars on a game's NFTs - will be able to rent a games NFTs straight from our rental app. Rentable game assets will be filterable by a game's genre, by team rating & review, and by user rating & review. The Ape Fun Token will be the Arcades main payment token.","links":"https://ape.fun","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ape-fun-token/logo.png"}