{"name":"Shepherd Inu","id":"shepherd-inu","symbol":"sinu","description":"Shepherd Inu is the first token based on the German Shepherd in Bsc. The team shares their love to a German Shepherd. This project means everything for the owner, and he will never give up. The team from Shepherd is great, and they wont give up either. One of the things where Shepherd Inu stands for, is saving Shepherd Dogs. We are sponsoring German Shepherds in shelters, so they can have a better life. Our goal is to save all Shepherd dogs, and all dogs in general. Our team is 100% safe. The dev is fully doxxed in VC, KYC'd and even shared his passport the first day, but we deleted that cuz of safety reasons. We've completed an Audit/press release too. We are live on dex-trade and did huge marketing plans and will do more and more to be known all over the world. We've got a roadmap / whitepaper too. We've got a website made the first day, and our website V2 is up already. This website does have more pages, we added the audit, roadmap, whitepaper and the sponsored dogs. We hope to attract more people with our new Website.The project also does have utilities. We've got a swap ready received from Kraitorslounge as a gift. This swap has much features. Next utilities planned are Shepherd Casino and NFT's / Staking. Shepherd Casino is an online casino where people can wager their tokens, or bet their tokens. Its still in an early stage, we're working on it currently. We haven't started on the NFT's yet. We'll design them first, make a minting website and connect it with Staking with NFT Staking. For our marketing campaign we had some telegram / twitter calls yet, and had some influencers shouting us out. We've got great things planned, such as Youtube, Tiktok, Facebook, Instagram and on all social media. The owner already started Local marketing in his country with an aim to make lots of friendships and discuss about shepherd, in his opinion it’s the best way to get legit and real investors to invest in shepherd. We're listed on our first CEX, Dextrade and more to come.","links":"https://shepherdinu.tech/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shepherd-inu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":6,"contract_address":"0x5efe9c3e5b43580328104da18a091ce6a3d40651"}}}