{"name":"Medoo","id":"medoo","symbol":"medoo","description":"Medoo - Decentralized education ecosystem. It's a dynamic network designed to transform the way we share learning materials and outcomes globally. Our mission is clear: to construct an innovative edtech infrastructure and an education blockchain, fostering seamless collaboration on a worldwide scale. Organizations around the globe utilize the Medoo SDK to tap into a vast repository of knowledge, with the Medoo coin serving as the primary currency for transactions and services. As we usher in the era of the Medoo blockchain and education nodes, the landscape of global education is poised for a monumental shift, with prominent education entities joining forces. At the heart of the Medoo ecosystem lie two pivotal layers: the Education blockchain and the education nodes. Whether it's an organization, school, university, or governmental body, each can establish and operate an education node underpinned by the Medoo blockchain. These education nodes serve as conduits for sharing educational materials and learning outcomes, leveraging the power of the Medoo Chain. By participating in the consensus of education nodes, we maximize the potential for content discovery and dissemination. Noteworthy platforms like Udemy, Coursera, Khan Academy, and content hubs like Go1 are encouraged to integrate with Medoo as education nodes, enabling them to amplify their reach and cross-sell content through our innovative blockchain network. Moreover, the Medoo Aplication and Medoo Aplication Medoo SDK and Medoo Application provide a comprehensive suite of teaching and learning tools, encompassing classroom management and content marketplaces. This accessibility ensures that organizations and individuals alike can seamlessly engage in the operation of a new education node, driving forward the collective advancement of education.","links":"http://medoo.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/medoo/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}