{"name":"ScamFari","id":"scamfari","symbol":"scm","description":"What is the project about? Scamfari is a crowd-sourcing platform by the HAPI Foundation, dedicated to making the blockchain safer. It addresses the rising threat of fraud in the cryptocurrency space by empowering users to report scams, phishing sites, and malicious projects. Through a user-friendly website, individuals can submit evidence-backed reports, which are meticulously validated using real-time tools and authoritative data sources. Valid reports are rewarded, fostering a community-driven effort against fraud. Scamfari integrates blockchain technology and smart contracts for transparency, privacy, and secure rewards. By uniting users and technology, Scamfari aims to create a more reliable and trustworthy blockchain ecosystem. What makes your project unique? Scamfari's distinctiveness stems from: - Community Vigilance: Harnessing user reports for a safer ecosystem. - Multi-Layered Verification: Collaboration with experts and data providers. - Blockchain Backbone: Transparency, integrity, and automated rewards. - Web3 Alignment: Transparency, privacy, and user-centricity. - Varied Scam Categories: Covering diverse malicious activities. - Privacy Focus: Secure reporting via wallets and blockchain. - Adaptive Improvement: Evolving verification methods. - Foundation Expertise: Backed by renowned cybersecurity authority. In summary, Scamfari's uniqueness arises from community-driven security, advanced verification, blockchain innovation, and a commitment to a safer blockchain landscape. History of your project. Around 1 Year Ago: HAPI team initiates Scamfari to combat fraud in the crypto space. Goal: Engage community in reporting fraudulent wallets and counter terrorist financing. Months Leading Up to Launch: Scamfari's user-friendly platform is developed, integrating blockchain and smart contracts. Rigorous testing ensures security and functionality. Launch: Scamfari goes live, empowering users to report scams and fraud. Community involvement grows rapidly. Post-Launch: Platform refines verification processes based on user feedback. Reward system encourages active participation. Public Impact: Scamfari gains recognition for exposing scams and malicious projects. Contributes to reducing fraud in the blockchain ecosystem. Ongoing Development: HAPI team continuously improves Scamfari, adapting to emerging fraud tactics and enhancing user experience. https://www.coindesk.com/consensus-magazine/2023/03/21/ukraine-crypto-hapi/?outputType=amp https://www.coindesk.com/consensus-magazine/2023/02/13/pro-war-russians-raise-millions-in-crypto-ukrainians-block-their-wallets-coindesk/?outputType=amp https://news.bitcoin.com/most-crypto-sent-from-wallets-sponsoring-russia-in-ukraine-war-reaches-cexs-binance-research-shows What’s next for your project? Expanding Engagement: Growing the user community for more impactful reporting. Advanced Verification: Enhancing verification methods with advanced technologies. Diverse Scam Coverage: Adding new scam categories to address evolving threats. Blockchain Integration: Exploring deeper integration with blockchain capabilities. Partnerships: Collaborating with cybersecurity firms and regulatory bodies. Educational Outreach: Creating resources to raise awareness about scams. Enhanced Rewards: Improving incentives to encourage participation. User Experience: Continuously refining the platform's usability. Data Insights: Offering analytics on reported scam trends. Regulatory Compliance: Ensuring adherence to relevant regulations. What can your token be used for? - Rank Payments: The token can be used to make rank payments, potentially allowing users to increase their rewards. This suggests that users can use tokens to enhance their status within the community and potentially earn higher incentives for reporting scams accurately. - Task Assignment and Commission: The token can be utilized for creating research tasks for researchers on the platform. Additionally, a portion (10%) of the tokens used for tasks is collected by the platform and utilized for token burning, potentially contributing to token scarcity and value. - Ecosystem Rewards: The token can serve as a reward mechanism from partner ecosystems. Other ecosystems can allocate rewards in the form of Scamfari tokens to individuals who uncover scammers within their networks, fostering collaboration and promoting wider adoption of the platform. In summary, the Scamfari token has utility for enhancing rewards through rank payments, facilitating task assignments and commission payments, and receiving rewards from partner ecosystems. It appears to play a central role in incentivizing participation, rewarding contributions, and aligning the interests of various stakeholders within the Scamfari platform and its partner networks.","links":"https://scamfari.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/scamfari/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x8353b92201f19b4812eee32efd325f7ede123718"},"linea":{"decimal_place":18,"contract_address":"0x13a7f090d46c74acba98c51786a5c46ed9a474f0"}}}