{"name":"Kindly","id":"kindly","symbol":"kind","description":"Kindly is a humanitarian-based blockchain project building an ecosystem that brings accountability, transparency, and trust to the multi-billion dollar charitable giving market. Kindly is creating, and aspires to own the social impact supply chain which will enable them to be the leader in tracking and generating social impact. Kindly was co-founded by one of the largest food relief charity programs in the world, Food For Life Global (FFLG). The US-based non-profit’s network of over 250 affiliate projects provides food relief in over 65 countries and serves over 1 million freshly cooked plant-based meals daily. To date, the charity has served over 8 billion meals since its inception and has been endorsed by notable celebrities, including Sir Paul McCartney and the late Nelson Mandela. Why Kindly? Kindly is building an ecosystem of products and services using blockchain and Web3 technologies to generate, track, and streamline the processing of measurable social impact. Unlike other crypto projects, at Kindly, we are purpose-driven–we have a soul. Kindly is first launching the KIND token, which will serve as the “vehicle” to transport and track social impact on the blockchain and will soon be followed by the following applications: • Kindly Staking - to incentivize users to participate in the operation and support of the network. • Kindly Social Impact Platform - to process and verify secure social impact transactions. • Kindly Social Impact Marketplace: to enable anyone to purchase and generate measurable social impact easily • Kindly Blockchain Explorer - to search, verify and confirm the status of transactions (i.e. track the social impact life cycle) • Kindly Non-Fungible Tokens (NFTs) - to create personalized assets that can generate measurable social impact and also be used inside social media platforms, games, and metaverses.","links":"https://www.kindlycoin.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kindly/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x999e2e604f48de45480f97b5037a70aa2a78b488"}}}