{"name":"Metal Dollar","id":"metal-dollar","symbol":"xmd","description":"What is the project about? The Metal Dollar (XMD) represents an innovative approach to stablecoins, operating on the Proton Blockchain. Its design brings increased stability, transparency, and efficiency to digital transactions. Uniquely, XMD is backed by an array of established, non-algorithmic bank reserve-backed stablecoins, including USDC, USDT, and PAX, a method intended to mitigate risks associated with single-issuer or algorithmic stablecoins and enhance stability. What makes your project unique? The Metal Dollar distinguishes itself from traditional stablecoins by pegging its value to a selection of established stablecoins, providing an innovative approach to stability and governance. It utilizes the Proton Blockchain's features to enable secure, efficient transactions with swift confirmation times, high throughput, and low fees. The project is also characterized by a decentralized governance model supported by the Metal DAO (XMT) token. XMT token holders can propose and vote on crucial decisions concerning the Metal Dollar protocol, facilitating a democratic and inclusive management over the protocol's direction. History of your project. The Metal Dollar project came into existence in 2022 as a response to the growing demand for stability and reliability in the crypto market. It aims to combine the benefits of non-algorithmic bank reserve-backed stablecoins with the transparency, security, and efficiency offered by the Proton Blockchain. What’s next for your project? Plans for XMD include collaborations with industry stakeholders to increase its reach and enhance functionality. Future developments envision interoperability with other blockchain networks and increased integration with DApps. What can your token be used for? XMD, as a stablecoin, facilitates transactions on ProtonDEX.com. The process to mint XMD involves bridging supported stablecoins onto Proton Blockchain. The value of XMD is pegged to the basket of these supported stablecoins.","links":"https://metaldollar.com/mint","market_cap":841610,"market_cap_rank":2876,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metal-dollar/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}