{"name":"FUUUUUUUUUUUUUU","id":"fuuuuuuuuuuuuuu_solana","symbol":"fuuu","description":"$FUUU is a Solana-based memecoin that was launched on http://Pump.fun in March 2024. The project is themed around the Rage Guy character, a figure that originated in the rage comic era of the late 2000s and became widely recognized across internet culture. Following the launch, the original developer discontinued involvement with the token. At that point, the CTO team assumed responsibility for coordinating ongoing community efforts around the project. The stated purpose of $FUUU is cultural rather than financial. It is designed as a “culture coin” that highlights Rage Guy as a symbolic and relatable figure. The character’s expression of frustration, commonly represented by the text “FFFFUUUU,” reflects emotions that are often tied to both cryptocurrency markets and everyday experiences. By building a token around this meme, the project aims to preserve a recognizable piece of internet history within a blockchain context. Unlike projects that emphasize detailed roadmaps, technical milestones, or defined utility, $FUUU positions itself as a lighthearted and entertainment-driven token. There are no team allocations, no taxes, and no embedded promises of profit or financial return. The coin is intended solely for cultural engagement, community participation, and meme creation. Holders and community members are encouraged to contribute through content, discussion, and the continued use of Rage Guy imagery, but there are no obligations or formal expectations tied to the token. The CTO team provides organizational support, and back end support such as hiring an artist and creatin websites, the community drives activity associated with the project. This includes creating and sharing memes, maintaining discussion channels, and ensuring the Rage Guy character remains present in contemporary internet culture. The project does not claim utility beyond its role as a culture coin, and its sustainability depends entirely on voluntary participation and ongoing community interest. From a transparency standpoint, the on-chain parameters of the token are publicly visible. These include the mint authority status, freeze authority, liquidity details (whether burned or locked), and circulating supply information. Any locked or burn addresses are disclosed for the purpose of supporting accurate supply tracking on external platforms. Rage Guy ($FUUU) should not be viewed as an investment. The token has no intrinsic value and provides no rights, revenue, or guarantees to holders. As with all cryptoassets, trading is highly risky, and participants are advised to conduct their own research and fully understand the risks involved. The project’s focus remains cultural preservation and community expression rather than financial","links":"https://fuuucoincto.com/","market_cap":7653.22,"market_cap_rank":11678,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fuuuuuuuuuuuuuu/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"9v9gJt4EymZh9iHLpGGGgX5eXQFMsmg7GKR9Z2xfVeix","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/9v9gJt4EymZh9iHLpGGGgX5eXQFMsmg7GKR9Z2xfVeix"}},"is_native":false}