{"name":"ChangeNOW","id":"changenow_ethereum","symbol":"now","description":"What is ChangeNOW Token? NOW is the native digital asset introduced by ChangeNOW, a non-custodial instant crypto exchange platform. It serves as an internal utility token across the ChangeNOW ecosystem. NOW can be used for asset listing fees, staking via ChangeNOW Pro, and is also distributed as cashback for swaps on ChangeNOW Pro. Users can also earn NOW through airdrops, community challenges, and social media campaigns run by ChangeNOW. What Makes ChangeNOW Token Unique? NOW tokens fuel all the products within the NOW product ecosystem. You can get NOW Token as cashback at ChangeNOW or NOW Wallet. Also, you can get up to 6.25% APY yearly by staking it! Token’s use area is constantly widening for individuals and businesses to add new possibilities. Meanwhile, regular quarter burns increase the value of each token. Where ChangeNOW Tokens can be used? NOW tokens power a wide range of features across the ChangeNOW product suite. They can be staked via ChangeNOW Pro to earn passive rewards, used to receive cashback on crypto swaps, and serve as a payment option for services like NOWPayments and NOW Nodes. Additionally, NOW can be used to pay for AML checks, unlock exclusive access to partner perks, and participate in future product-level utilities. With its expanding use cases and direct integration into live products, NOW is more than just a token — it’s a gateway into the full utility of the ChangeNOW ecosystem. Staking ChangeNOW Tokens NOW Token holders have the opportunity to stake their funds by 6,25 % APY via ChangeNOW Pro! Rewards are granted weekly and accumulated in a staking pool. You can redeem or restake them partially or fully as desired. How Is the ChangeNOW Network Secured? NOW is supported by the reliable Binance Chain and Ethereum networks for consensus. This token contracts are thoroughly audited, with no extra minting or admin features, ensuring full decentralization and security. Where can you buy ChangeNOW? NOW tokens are available on several decentralized platforms, including Uniswap V3 (Ethereum), where the NOW/WETH pair shows the highest activity, as well as Uniswap V2 and PancakeSwap V3 (BSC). You can also purchase NOW directly on ChangeNOW.io using over 1400 supported assets without registration, or inside NOW Wallet — an all-in-one crypto app where you can buy, swap, hold, and stake $NOW with ease.","links":"https://changenow.io/","market_cap":47783751,"market_cap_rank":666,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/changenow/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0xe9a95d175a5f4c9369f3b74222402eb1b837693b","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xe9a95d175a5f4c9369f3b74222402eb1b837693b"}},"is_native":false}