{"name":"Mollector","id":"mollector","symbol":"mol","description":"\"Mollector is an NFT collectible auto-combat card game, built from scratch for Blockchain on Blockchain. The game offers an immersive experience that’s based on deckbuilding, strategy, and the Play-to-Earn approach, pushing the boundaries towards Play to Enjoy-Earn-Explore. Inspired by the Hearthstone and Dungeons & Dragons world, Mollector takes place in a fantasy universe full of wonder and also fraught with chaos, hosting a seemingly infinite amount of worlds all striving for supremacy and sometimes, for mere existence. You are the Molectors, the mysterious and mythical forces that drive, shape and challenge the realities in the game through the creation and control of the Genesis Molecules while fueling life over the many worlds with the power of Radiations. You will be what you have to be, to raise heroes or forge demons, to dominate worlds or liberate them, to realize your true power. In the first release of the game, players a.k.a Mollectors travel around an expanding game map called the New Galaxy, discovering new worlds, collect, trade, consume and upgrade heroes cards from Six Factions to compete against each other, defeat the World Bosses and save the universe. On top of that, each Hero Card in a player’s collection can be personalized with NFT arts of their own or purchased from Mollector’s marketplace. In terms of game content, Mollector aims to celebrate the world's culture and creativity by infusing world heritage, mythologies, epics, folk tales and legends into the game’s stories, lores and designs. Mollector actively seeks out artists of different creeds and cultures to collaborate and generate multiple options of character concepts as well as designs, in which each artist will bring their own personal flairs and heritage into the game world. This is the strategy that can help you truly personalize the game experience and fully appreciate the unique values of Mollector NFTs. Mollector is developed with a long term vision in mind, years of technical research and development combined with creative incubation was aimed to deliver a value chain of a sustainable economy, a highly personalized blockchain experience, an unending evolution of creativity and content, a robust and secured ecosystem, to ensure a strong and continuously growing community where developers, creators, players, collectors and investors can collaborate fairly and transparently to enjoy common growth and passions for the ever-evolving game media.\"","links":"https://mollector.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mollector/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x06597ffafd82e66eced9209d539032571abd50d9"}}}