{"name":"Momentum","id":"momentum-2","symbol":"mass","description":"What is Momentum? The Momentum Project ($MASS) is a token ecosystem that pays dividends, and also algorithmically increases in price over time. How does this work? $MASS is a reflection token at heart that pays out dividends to holders based on trading activity, and also uses unique stabilizer technology (TMM) to maintain token price and increase it consistently. This solves two main issues with existing reflection tokens - low liquidity, and they have to sell into the chart to pay dividends. Most charts often reach a point of constant sell pressure as people exit their positions. This causes the price to go down, and low liquidity accentuates price movement on these sells. Momentum has solved this, and given our holders the opportunity to invest into a protocol that allows you to buy $MASS off the chart, or bond it through the dApp completely tax free. The bonding allows you to immediately earn a 15% ROI, not including the price increase that occurs over the vesting period. We even offer a 14 day bond that emits 125% of your purchase, resulting in immediate profit. Holding $MASS earns you dividends for passive income in BUSD while you let your tokens appreciate in value as TMM (The Momentum Mechanism) does its job. When it's time for you to take your profits and exit a position, the LP will be strong enough to allow your sell and not decrease the token price. Bonds & taxes allow us to quickly bolster our LP compared to marketcap to provide stable trading and enough liquidity to maintain price even during large sells. Nobody wants to own a currency perpetually decreasing in value with decreasing liquidity. Momentum focuses on liquidity health first, with a sustainable price increase second.","links":"https://www.momentumproject.finance/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/momentum-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe81a79e9d951759aef3fccef17022276b3a0c7e5"}}}