{"name":"BCH Club CASH","id":"bch-club-cash","symbol":"cash","description":"What is the project about? CASH is a digital token developed on the Bitcoin Cash (BCH) network, taking advantage of the recent Cashtokens upgrade to further extend the capabilities of BCH's blockchain. Designed as a versatile token with both fungible and non-fungible (NFT) properties, CASH aims to foster peer-to-peer transactions within a decentralized ecosystem, without the need for intermediaries. What makes your project unique? CASH stands out as one of the first tokens to fully embrace the capabilities of the Cashtokens upgrade on the Bitcoin Cash (BCH) network. Unlike other tokens, CASH not only operates as a digital asset but also demonstrates the expanded functionalities that BCH can offer beyond being a simple peer-to-peer cash system. By using the CRC20 protocol, CASH becomes a trailblazer in showing how BCH can support complex smart contracts and decentralized applications, broadening the scope and utility of the BCH blockchain. History of your project. CRC20 protocol started shortly after the Bitcoin Cash network underwent a major upgrade on May 15, 2023, enabling smart contracts and other advanced features through the use of unspent transaction outputs (UTXOs). Since then, the project has seen significant community involvement, with donations and active participation shaping its development. What’s next for your project? CASH is focused on stimulating innovation and widening the scope of what's possible on the BCH network. As a community-driven initiative, CASH aims to be the sandbox for emerging decentralized applications. Through these initiatives, CASH seeks to not only demonstrate the capabilities of BCH beyond peer-to-peer transactions but also to catalyze community-led development. The ultimate goal is to further integrate CASH into the BCH ecosystem, making it a hub for developers and a showcase for the new CRC20 protocol. What can your token be used for? CASH can be used for a variety of functions within the BCH ecosystem. The fungible aspect of CASH is aimed at general transactions, remittances, and settlements. This allows for a myriad of use-cases, including but not limited to Defi.","links":"https://www.bchclub.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bch-club-cash/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}