{"name":"Convertible JPY Token","id":"convertible-jpy-token","symbol":"cjpy","description":"What is the project about? CJPY represents a collateral debt position issued on Yamato Protocol, a decentralized and non-custodial platform on Ethereum developed by DeFiGeek Community Japan. CJPY serves as an ETH overcollateralized stablecoin designed to maintain a peg to the Japanese Yen. In the future, the Yamato protocol will expand to encompass various tokens as collateral, and a diverse range of fiat stablecoins will be introduced, initially including USD and EUR pegs. What makes your project unique? Yamato Protocol distinguishes itself through 5 attributes as a decentralized and non-custodial crypto overcollateralized stablecoin: 1. High Collateral Factor: The protocol permits a minimum health rate of 130%, ensuring efficient use of collateral. 2. Absence of Accrued Interest: Users are subject solely to a one-time issuance fee upon generating CJPY. 3. Non-Forced Liquidation: No penalty for liquidation. Debt positions with health rates below 130% can be redeemed by any users via CJPY acquired from the market. 4. Redemption by protocol: Accrued CJPY fees on protocol can be used to redeem debt position under threshold. 5. Subrogation Mechanism: The protocol employs the accumulated CJPY fees to subrogate debt positions falling below the 100% health rate threshold. History of your project. January 2021: The DeFiGeek Community Japan embarked on the development of Yamato Protocol, a decentralized and non-custodial crypto overcollateralized stablecoin pegged to JPY. The community has functioned with an inclusive approach, welcoming all developers and contributors who are eager to take part in the enhancement of DeFi applications and tools that drive the advancement of Web3 technology. Milestones of Yamato Protocol: November 2021: The alpha testing phase commenced on the Rinkeby testnet. January 2022: The beta testing phase debuted on the Rinkeby testnet. May 2022: The second beta testing phase transpired on the Rinkeby testnet. June 2023: Successful completion of the initial audit. July 2023: Launch of version 1 on the Ethereum mainnet. What’s next for your project? At present, Yamato Protocol stands at version 1.0 without a utility token. Anticipated milestones include: Version 1.5 (2023): Introduction of the DAO utility token and the implementation of ve(vote-escrowed) governance. Version 2.0 (Late 2023): Enabling issuance of additional stablecoins like CEUR (convertible EUR) and CUSD (convertible USD). What can your token be used for? CJPY represents a decentralized JPY-pegged token on the Ethereum blockchain, offering versatility to users and other protocols. Its anticipated adoption spans various DeFi Dapps, encompassing DEX and lending protocols. Given its decentralized and non-custodial nature, CJPY holds the potential for widespread adoption as a payment medium within the Japanese crypto business ecosystem.","links":"https://app.yamato.fi/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/convertible-jpy-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x1cfa5641c01406ab8ac350ded7d735ec41298372"}}}