{"name":"DOS Chain","id":"dos-chain","symbol":"dos","description":"What is DOS Chain (DOS) DOS Chain is the fast, zero gas fee and three-steps onboarding blockchain network developed by DOS Labs in partnership with Avalanche using their Subnet technology. DOS Chain is supported by more than 10 game studios and a game developer community with 20K+ members. The DOS Subnet aims to bring billions of Web2 players into Web3 gaming. The goal is to provide the players with a smooth and fun gaming experience of Web2 together with the ownership, decentralization and transparency of Web3. DOS Labs has spent 8 months to customize the subnet, add the zero gas fee feature and build the whole ecosystem for DOS such as a user-friendly wallet, NFT Marketplace, etc. Who Are the Founders of DOS Chain? DOS Chain was launched by DOS Labs, founded by University of Gloucestershire MBA’s Anh “JOY” Le and Quang Nguyen. Anh, who is the current COO, is a veteran in the game industry with more than 15 years experience and more than 50 published game titles. Anh used to work in Gameloft, and other game studios, including his own 2 ones Quang, who is the CEO of DOS Labs, has more than 10 years in game publishing. Quang used to be the CEO of Gamota, one of the top game publishers in Southeast Asia. The duo worked together on MetaDOS, a Web3 battle royale game. Then they found a lot of bad user experience for the players when they work with the current popular blockchain. Anh and Quang decided to start working on DOS Chain to solve the current user experience problem of Web3 gaming. Other members of the DOS Labs team are also the game developers or blockchain experts from different game studios and blockchain companies. What Makes DOS Unique? DOS Chain attempts to solve the Web3 user experience problems, which are slow, complicated and require too many steps to onboard the users. To solve this problem, DOS utilizes Avalanche Subnet together with its complete ecosystem: Zero Gas Fee: With this unique feature from DOS, the whitelisted smart contract functions wi","links":"https://doschain.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dos-chain/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}