{"name":"CoreDaoSwap","id":"coredaoswap","symbol":"cdao","description":"What is the project about? CoreDAO Swap is a DEX that integrates multiple functional sections. Its characteristic is the whitelist transaction mode What makes your What can your token be used for? CoreDAO Swap is a DEX that integrates multiple functional sections. Its characteristic is the whitelist transaction mode. Through the review of projects by the community and CoreDAO Swap risk control department, special certification is given to third-party projects to distinguish high-quality projects and minimize the user’s troubles. investment risk. project unique? The mission of the CoreDAO Swap platform is to provide consumers with access to cryptocurrency-based financial services, enabling them to exchange or \"swap\" a variety of digital assets within their CoreDAO wallets. The benefits of this design can be attributed to the high level of security inherent in the decentralized model of asset storage and protection. In response to the advanced development of decentralized financial protocols (DeFi) and the growing maturity of markets such as lending, exchanges, derivatives, NFT, and Gamefi, the CoreDAO Swap platform protocol cooperates with related decentralized wallet software to provide one-stop aggregation and exchange Provides a platform for consumers and provides developers with access to an open, distributed, unlimited and secure transaction environment. History of your project. CoreDAO was established in Singapore in 2019, and we work tirelessly to contribute to advancing the field of professional development of crypto wallets. Since its establishment, we have continued to learn and grow, and what was once a small team has grown into a far-reaching and diverse group; currently, our team members come from almost every continent, and CoreDAO Labs is committed to using blocks for more than 40 countries around the world Chain users, providing professional digital asset management tools and services. W t’s next for your project? IDO PLATFOME","links":"https://www.coredaoswap.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/coredaoswap/logo.png","detail_platform":{"core":{"decimal_place":18,"contract_address":"0xb555a396446570ac2f4a62fffb64b4b0d43f5b74"}}}