{"name":"Meta Launcher","id":"meta-launcher_binance-smart-chain","symbol":"mtla","description":"What is the project about? Meta Launcher is an upcoming platform that will reshape how firms and organizations across the world leverage metaverse. Thanks to its innovative approach, Meta Launcher enables practical use cases for all kinds of businesses, crypto related or not. What makes your project unique? With Meta Launcher, your company or personal brand can step into the alternate reality of the metaverse and experience it's full potential. Our flagship products, MetaMall & MetaStores provide a wide range of possibilities for all your desires. History of your project. We have made significant progress on our roadmap thus far, including the development of our project idea, formation of our core team, creation of our UX/UI design, and completion of our basic whitepaper. Additionally, we successfully launched our social media channels and completed a thorough audit of our token contract, followed by successful deployment of the token. Currently, we are focused on two major tasks: the first being our ongoing Airdrop Campaign, and the second being the continued development of our core platform. We are making great strides on both fronts and are excited about what's to come. Looking ahead, we have plans to launch a user-frie What’s next for your project? Q2 2023 - MTLA Public sale - Sale distribution - Airdrop 1 distribution - Contract audit (staking & chest) - Staking pool - MetaChest launch - Marketing phase 1 Q3 2023 - Airdrop campaign 2 - DEX listing - Detailed whitepaper - Contract audit (launchapd) - MetaPad launch - First MetaStore reveal - Community engagement activities Q4 2023 - Contract audit (marketplace) - MetaMarket launch - Continuous app upgrades - Mainstreem CEX listing - MetaMall 1st floor opening - Roadmap for 2024 reveal What can your token be used for? The MTLA token is used for various services and activities, such as staking, IDO participation, MetaChest mini game, as currency in MetaMall and MetaStore and other future activities.","links":"https://www.metalauncher.io/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/meta-launcher_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x36f84ee7f720312443c02389a08185e3ecf0ebed","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x36f84ee7f720312443c02389a08185e3ecf0ebed"}},"is_native":false}