{"name":"Kalijo","id":"kalijo","symbol":"seed","description":"Kalijo is a yield-backed, deflationary digital asset developed on the Zilliqa blockchain. It operates with a monthly buy-back mechanism, funded by yield generated through farming activities on multiple blockchain networks. Additionally, 50% of the yield is distributed to stakers, providing further incentives for participation. This cross-chain approach enhances asset sustainability and yield opportunities beyond the Zilliqa ecosystem. Purpose: Kalijo is a project that features a deflationary cryptocurrency token called SEED, designed to create sustainable value for its holders by leveraging a unique economic model. Function: Built on the Zilliqa blockchain, Kalijo functions as a tokenized investment fund that utilizes proceeds to invest in yield farming protocols across multiple blockchains, including Sui, Arbitrum, Solana, and Optimism. This strategic investment approach generates returns that are reinvested into the Zilliqa ecosystem by buying back and burning $SEED. Utility: In addition to the yield generation process, Kalijo offers a staking mechanism where holders can earn additional SEED tokens and kUSD as rewards for participating in the network. The returns generated from yield farming are used to execute a systematic buyback of SEED tokens. Each buyback allocates 50% of the funds to purchase and burn tokens, effectively removing them from circulation and decreasing the overall supply. The remaining 50% is distributed as kUSD dividends to stakers. This cyclical process of yield generation, staking rewards, and token burning is designed to enhance the long-term value of our SEED token. In addition to the yield generation process, Kalijo offers a staking mechanism where holders can earn additional Kalijo tokens and kUSD as rewards for participating in the network. Additionally, Kalijo includes a functioning launchpad, where a portion of the funds raised from projects launched on the platform is allocated to buy and burn SEED tokens. This initiative further supports the token's deflationary mechanism, enhancing its value over time.","links":"https://kalijo.io/","market_cap":229707,"market_cap_rank":5513,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kalijo/logo.png","detail_platform":{"zilliqa":{"decimal_place":18,"contract_address":"zil1lgj5uykg9lmzjecctjc5fkehdrghd7a9enmwg9"},"zilliqa-evm":{"decimal_place":6,"contract_address":"0xe64ca52ef34fdd7e20c0c7fb2e392cc9b4f6d049","geckoterminal_url":"https://www.geckoterminal.com/zilliqa-evm/tokens/0xe64ca52ef34fdd7e20c0c7fb2e392cc9b4f6d049"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9158df7da69b048a296636d5de7a3d9a7fb25e88","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9158df7da69b048a296636d5de7a3d9a7fb25e88"}}}