{"name":"NeoCortexAI","id":"neocortexai","symbol":"corai","description":"What is the project about? NeoCortexAi is a platform that links blockchain technology and artificial intelligence. The platform has an AI-Launchpad for AI-based projects, A Multi-AI-Index Pool with DCA AI bots, AI-Swap, and AI-Brain Center for AI and Crypto related updates, making the platform a one-stop-gateway to the latest developments and trends in AI and blockchain technology. What makes your project unique? NeoCortexAI is an AI-centric project that provides a platform for AI-based crypto projects to launch and for users to explore the AI-based crypto token and invest. The AI Launchpad is a tier-less launchpad that functions on a First Come First Served (FCFS) entry system which requires no staking or farming, making it accessible for a small fee. The AI Index Fund can help investors to gain greater exposure to AI crypto tokens. The AI swap can exchange AI index pool NFTs, launchpad tokens, platform tokens, and other AI-based tokens. The AI Brain Center offers timely and insightful coverage of the latest trends, innovations, and news from the world of AI and blockchain. History of your project. NeoCortexAI came out of stealth mode on early February 2023, and started its IDO from March 13th till March 20th. The TGE was done on pancake swap and was live on 21st March. The IDO was done on various platforms such as Kommunitas, Spores Network, DuckStarter, BSCLaunch and MoonStarter. what’s next for your project? NeoCortexAI will be launching AI-based Crypto tokens, start the AI index pool for AI promising projects, AI swap for AI crypto tokens, and AI- brain center as a hub for AI and blockchain updates. What can your token be used for? The CORAI token is the native BEP-20 token of NeoCortexAI platform. Holding CORAI allows users to benefits within the ecosystem, including access to the IAiO launchpad to invest in AI projects. CORAI will be included in the AI index fund, DAO Governance will allow holders of CORAI to vote, Staking and Farming for CORAI","links":"https://www.neocortexai.xyz/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/neocortexai/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x17c8c198c06f16a8db68148d9ac460f5aed029d8"}}}