{"name":"Luxo","id":"luxo","symbol":"luxo","description":"Luxochain is a Swiss company, based in Lugano, with world-class expertise on product certification. Our mission is to deliver sustainability, reputation and authenticity into the Luxury market, tracing goods on the blockchain, from raw material up to the distribution chain, providing Certificates of Authenticity and Passports of goods, to protect Brands and Customers, guaranteeing purchases of authentic goods. We combine products with their own unique NFTs, such as Digital Certificates of Authenticity, registered on the Blockchain, secure, readable, and transferable by any smartphone. The product’s NFT becomes its authenticity passport, with a guarantee of non-duplicability thanks to the underlying technology. Luxochain offers a service to end consumers, protecting them in the purchase of their products. At the same time, Luxochain works alongside the luxury brand, providing them a transparency, loyalty, and couponing system towards their customers. LUXO is the token on which Luxochain ecosystem is based. Luxochain allows you to safely create, receive, storage and send Digital Certificates of Authenticity and Ownership of your Luxury goods. Using our services, which can be purchased with the Luxo tokens, Brands can certify sustainability, traceability, ad authenticity of their products, improving their reputation. Application industries we are serving are Luxury & Fashion, Art, Public Institutions, Media & Press Agencies, Medical, Pharmaceutical, Food, Automotive, Valuable goods. Luxochain combats the counterfeit of Luxury goods, guaranteeing the purchase of authentic products though the blockchain, ensure ownership of real products certified on the blockchain and guaranteed by luxury goods companies. During this process, a shopper can see the details of a product, such as its general description, video of usage, e-commerce links, colors, materials, history, manufacturing details, and all previous property transfers.","links":"https://luxo.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/luxo/logo.png"}