{"name":"Sky","id":"sky_ethereum","symbol":"sky","description":"SKY is a governance token, which is like a digital voting share, for Sky Protocol. This system launched in 2024 as a rebrand and upgrade of the older Maker Protocol. Sky Protocol’s main value lies in giving users a simple, secure way to trade, save, and earn rewards without ever giving up control of their funds. It is built around a stablecoin called USDS, which is always worth one US dollar, but it is completely decentralized. The protocol is run by automated agreements called smart contracts, so there’s no middleman controlling users' money. The system uses two main tokens: USDS for stable savings, and SKY for community governance. users can help secure the network and earn rewards by staking their SKY tokens in the Staking Engine, which is like locking them in an interest-bearing account to help the system run. The protocol also uses SkyLink to seamlessly connect users' funds across different blockchains for faster and cheaper transactions. The Sky Protocol is unique because it has no single CEO or traditional core team of investors; instead, it is managed entirely by its global community of SKY token holders. This decentralized setup means that SKY is primarily used for two core utilities: it grants essential voting power to decide on all major system changes, and it can be staked in the Staking Engine to help secure the network and earn rewards. Staking also provides holders with the ability to borrow the USDS stablecoin, making SKY the essential key for both governance and income generation within the ecosystem.","links":"https://sky.money/","market_cap":1454736322,"market_cap_rank":73,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/sky_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x56072c95faa701256059aa122697b133aded9279","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x56072c95faa701256059aa122697b133aded9279"}},"is_native":false}