{"name":"Shaun Inu","id":"shaun-inu","symbol":"shaun","description":"What is the project about? Shaun Inu is a meme-based cryptocurrency that aims to provide a fun and engaging community-driven experience for its holders. Shaun Inu name is a nod to the popular \"Shaun the Sheep\" animated series, and its token symbol is a cute and recognizable depiction of a cartoon sheep. Shaun Inu's mission is to create a safe and fair environment for its community members while promoting charitable causes What makes your project unique? Shaun Inu distinguishes itself from other meme-based cryptocurrencies through its focus on charitable giving and community involvement. A portion of the project's transaction fees is set aside for charitable donations, with the community having a say in which causes to support. History of your project. Shaun Inu name and token symbol pay homage to the popular \"Shaun the Sheep\" animated series, which has a dedicated fan base worldwide. Team is made up of experienced developers and marketers, Shaun Inu has gained a significant following on social media platforms, with the project's Telegram group and Twitter account rapidly growing in size. What’s next for your project? Shaun Inu next steps include the launch of centralized exchange, which will enable users to trade Shaun Inu tokens. Team is working on creating a mobile app and a merchandise store to increase engagement and brand awareness. Shaun Inu also plans to establish partnerships with other projects in the cryptocurrency space to further expand its reach and impact. What can your token be used for? Holding Shaun Inu tokens enables users to participate in the project's governance system, where they can vote on proposals and help shape the future direction of the project. Users can stake their Shaun Inu tokens to earn rewards through the project's staking program.","links":"https://shauninu.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/shaun-inu/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x05f816b53a4c7b6b3bfbe1f759da7fe188689c5b"}}}