{"name":"Greenart Coin","id":"greenart-coin","symbol":"gac","description":"Introducing Green Art Coin: let’s revolutionise the Ecosystem with crypto ethic. Join to the brand new movement for a sustainable future with Green Art Coin, the first ethical ecosystem based on cryptocurrency, a franchising network of shop branded “Cryptopoint“, Digital Banking, Game P2E and NFT Marketplace, and, above all the technological ties, to charities world. Thanks to our innovative solutions, we are giving artists, collectors and investors the power to start a transforming path like no other before, based on development and incentive of projects to safeguard the planet; all within the financial cycle of cryptocurrency. Inside Green Art Coin world we recognise and incentivate the huge potential of blockchain technology and its impact on art industry. Our NFT Marketplace is drawn to exhibit digitalised artworks globally known and certified, arising form prestigious private collections and art galleries, but also from emerging artists. As art platform that enhances transparency, authenticity and creativity, we are re-defining the way art is appreciated, collected and monetised, but above all finalised to generate resources for humanitarian projects in favour of no-profits among the most reliable in the world. And that’s not all. We are proud to declare that 50% of our commissions are directly devolved to sustain ten charity projects, through our automatic charity wallet (managed by an algorithm that cannot be modified by humans). Investing in Green Art Coin you not only empowers your financial growth, but you even contributes to commendable causes that push up communities, let them grow up and creates permanent changes. Why choose GreenArt Coin? • A safe and centralised ecosystem powered by blockchain technology and marked to an ethical vision of finance. • Access to artworks globally recognised and certified, closing the gap between art and technology, and among those who love art, make it, safeguard it or develop it in unexplored","links":"https://www.greenartcoin.eu/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/greenart-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xde4addcc213f6750faabdad59c00a2eb57352737"}}}