{"name":"MOOI Network","id":"mooi-network","symbol":"mooi","description":"MOOI Network is a side-chain of the Klaytn Network and is designed to provide a metaverse service that is easy and fun for all. MOOI Network is an expanding Web3 environment that offers a variety of high-quality dapps and games. Its primary objective is to become a leading ecosystem exclusively designed for gaming, with the intention of enticing more Web2 users to migrate to the Web3 realm. MOOI Network processes at a high speed of 4,000TPS as a side-chain of Klaytn Network. Therefore, it can avert the user inconveniences in delayed processing, even when the network scales up. The gas fee of the MOOI Network is charged at a very low rate. MOOI is used as the governance token of the MOOI Network and the key currency of the ecosystem, NFT marketplace and DEX. It can be swapped with other utility tokens of various services that will join MOOI Network. MOOI Network was devised and developed by POST VOYAGER. POST VOYAGER is a blockchain-specialized company and a subsidiary of the IP giant, Cocone (stylized as cocone), headquartered in Japan as a leading mobile gaming publisher. POST VOYAGER was established to support the creation of GameFi tailored blockchain infrastructure and has been exercising its expertise since 2019. With this goal in mind, POST VOYAGER has created MOOI Network to host the games from Cocone and create a metaverse world for new and upcoming projects. At the heart of the MOOI Network’s economy is Jellyme, an NFT marketplace for blockchain-based games. Currently, users can trade NFTs of collections related to 4 unique titles released on the MOOI Network: MetaLivly (https://metalivly.com/), PKCL Twins(https://www.pkcltwins.com/), Clawkiss (https://clawkiss.com/), and JANKEN(https://janken.game/). There will be over 10 new projects released on the network, including blockchain versions of popular Cocone titles, the ecosystem will also expand with a launchpad and improved interoperability.","links":"https://mooinetwork.io/mooinetwork","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mooi-network/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}