{"name":"ReduX","id":"redux","symbol":"redux","description":"Energy crises, pollution, and climate change are among the world’s significant challenges today. The production of sustainable and affordable energy is crucial. This is where ReduX Technologies AG, a Swiss hi-tech company, comes into the picture! With its unique molecular technology, ReduX is changing the energy industry and combating climate change and harmful emissions. OUR MISSION REDUCE CARBON FOOTPRINTS & HARMFUL EMISSIONS SAVE RESOURCES & REDUCE FUEL CONSUMPTION PROVIDE ALTERNATIVE ENERGY – SUSTAINABLE & PROFITABLE With ground-breaking innovations in the field of molecular technology, ReduX helps to protect our environment, fights climate change, and saves our resources. REDUX CHANGES THE WAY ENERGY IS USED AND PRODUCED. ReduX demonstrates the power of molecules with its innovations that are: 1) REDUX CONVERTER 2) MORF-REFRACTOR MORE ABOUT OUR TECHNOLOGIES REDUX CONVERTER: ReduX Converter has been fully developed and patented by ReduX Technologies AG, it has been tested many times and over long periods of time, and can be used immediately today for all fossil combustion engines. ReduX can instantly improve the ecological and economic balance of all current combustion systems. Applications in the field of cars, trucks, locomotives, ships, aircraft, generators, etc. have already been successfully tested for several years. MORF-REFRACTOR: Another world-class innovation by ReduX Technologies AG is MORF-REFRACTOR. MORF-REFRACTOR uses the power of molecules to produce synthetic fuels and energy! A MORF-Refractor is a unique hi-tech fuel production system, capable of generating high-quality synthetic fuels such as fuels, such as Jet-Fuel, Diesel, Gasoline, or Heating oil, all based on hundreds of residual materials like sludges, biomass, wood, plastic waste, tires, or many other biological or industrial wastes. No oil wells or gas fields are needed! MORF provides independent energy and fuel production anywhere!","links":"https://redux-technologies.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/redux/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xa2954b5734a9136bf648dce5bd2f9d2062551faa"}}}