{"name":"CVI","id":"govi","symbol":"govi","description":"CVI is a full-scale decentralized ecosystem that brings the sophisticated “market fear index” into the crypto market. Built on Ethereum and Polygon, it consists of an index that tracks the 30-day implied volatility of Bitcoin and Ethereum. The index ranges between 0 and 200 and is produced based on a Black-Scholes option pricing model, which computes the implied volatility of cryptocurrency option prices together with analyzing the market’s expectation of future volatility. The Index is live and running, presenting data that can be explored here: https://cvi.finance/ Using the index, people can have the same insights of the market that people looking into traditional markets have using the VIX, such as: Understanding the expected Volatility of the market, developing trading strategies for short-term gains, and hedging their portfolio against price fluctuations. CVI operates a permissionless and open-source protocol so any user can participate in the development of the network. The GOVI token is the governance token of the platform, and by staking their GOVI tokens, GOVI holders can also share fees from the CVI platform distributed as rewards.","links":"https://cvi.finance/","market_cap":153239,"market_cap_rank":6041,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/govi/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xeeaa40b28a2d1b0b08f6f97bb1dd4b75316c6107","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xeeaa40b28a2d1b0b08f6f97bb1dd4b75316c6107"},"zksync":{"decimal_place":8,"contract_address":"0xd63ef5e9c628c8a0e8984cdfb7444aee44b09044","geckoterminal_url":"https://www.geckoterminal.com/zksync/tokens/0xd63ef5e9c628c8a0e8984cdfb7444aee44b09044"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x07e49d5de43dda6162fa28d24d5935c151875283","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x07e49d5de43dda6162fa28d24d5935c151875283"},"polygon-pos":{"decimal_place":18,"contract_address":"0x43df9c0a1156c96cea98737b511ac89d0e2a1f46","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0x43df9c0a1156c96cea98737b511ac89d0e2a1f46"}}}