{"name":"Pinkie Inu","id":"pinkie-inu","symbol":"pinkie","description":"## What is Pinkie Inu? Pinkie Inu was established by a group of young female entrepreneurs with unique visions. Pinkie strives to be the female equivalent of SHIBA INU by maintaining the creative and entertaining vision of the precedent project and also adding the crucial layer of female inclusion in the blockchain space. Pinkie began as a decentralized meme token, but it has since grown into a distinctive metafi ecosystem for beauty and fashion ## Pinkie Inu's ambition and utility: We have high expectations for our initiative because PINKIE's long-term objective is to establish itself as a global brand with as many practical applications as is feasible. We will achieve this by working with the biggest companies in various industries and combining the many perspectives that result from the wide range of experiences of our partners. We now have a distinct plan in place for the development of Pinkie. Building a strong global community by working with allfemale influencers around the world is the first and most crucial step. The utility will then be built on top of it. ## How many PINKIE are there in circulation? On the 29th of September, Pinkie Inu will launch its token $PINKIE on the Binance Smart Chain. The total supply of the tokens will be 10 trillion. However, at launch, 25% of the supply will be burned immediately, resulting in a circulating supply of 7.5 trillion $PINKIE tokens. ### Who are the founders of Pinkie Inu? PINKIE was established by a group of young female entrepreneurs with unique visions. In essence, Pinkie aims to be the female counterpart of SHIBA INU, by preserving the innovative and entertaining vision of the precedent project, while also adding the necessary layer of female inclusion in the blockchain realm. Even though our project started out as a decentralized meme token, it evolved into a unique Beauty and Fashion Metafi Ecosystem.","links":"https://pinkieinu.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pinkie-inu/logo.png"}