{"name":"i dont know","id":"i-dont-know_solana","symbol":"idk","description":"IDK is a one-of-a-kind meme project on the Solana blockchain, embracing the unpredictable and whimsical nature of the crypto world. With a straightforward philosophy of \"just buy this shit and trust the process. or don’t. idk.,\" IDK invites users to join the fun and explore the possibilities of meme-based crypto assets. Key Features: Meme Tokens: IDK introduces a series of meme tokens on the Solana blockchain, each with its own unique characteristics, quirks, and personalities. From rare collectibles to hilarious parodies, IDK meme tokens offer a wide range of options for users to explore and engage with. Solana Integration: Built on the Solana blockchain, IDK leverages the speed, scalability, and low transaction fees offered by Solana to provide users with a seamless and efficient trading experience. With Solana's cutting-edge technology, users can buy, sell, and trade IDK meme tokens with ease. Community-driven Development: IDK thrives on community participation and engagement. The project encourages users to contribute ideas, memes, and feedback to shape the future direction of the project. Through community-driven development, IDK aims to create a vibrant and inclusive ecosystem for meme enthusiasts. Limited Edition Drops: IDK periodically releases limited edition meme tokens through special drops and events. These exclusive tokens are highly sought after by collectors and often feature unique designs, collaborations, or references to popular memes and internet culture. Memetic NFTs: In addition to meme tokens, IDK also offers memetic non-fungible tokens (NFTs) that capture iconic moments, images, and memes from the crypto world. These NFTs serve as digital collectibles and artifacts, commemorating the rich history and culture of the meme community.","links":"https://idk.sucks/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/i-dont-know_solana/logo.png","detail_platform":{"solana":{"decimal_place":3,"contract_address":"CymqTrLSVZ97v87Z4W3dkF4ipZE1kYyeasmN2VckUL4J","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/CymqTrLSVZ97v87Z4W3dkF4ipZE1kYyeasmN2VckUL4J"}},"is_native":false}