{"name":"Unibot","id":"unibot","symbol":"unibot","description":"What is the project about? Introducing Unibot, the fastest Telegram Uniswap sniper that facilitates lightning-fast swaps and snipers, accessible to all users with a 1% transaction fee. Unibot stands out from its competitors primarily due to its exceptional speed, driven by advanced algorithms and robust infrastructure. This includes private nodes for snipers, a private transaction option for buying and selling tokens, wallet monitoring, and a token tracker. What makes your project unique? Among the UNIBOT tools available are: * A fast Buy and Sell platform. * Mirror Sniper, enabling users to copy the trades of other wallets. * A token launch channel providing real-time information on newly deployed tokens. * Method Sniper, allowing users to input up to 3 token addresses for sniping at launch. * Wallet management and PNL analysis of token values held by the user. History of your project. Unibot was launched on the Ethereum mainnet on May 17, 2023, with 1 million UNIBOT tokens created at genesis. Liquidity of 100% was added during the launch, and the token burn rate is set at 0.1% per day. Unibot is owned by Ayden and his partner. Ayden previously worked at Apple, while his partner contributed to an end-to-end machine learning startup based in the Bay Area, California. Together, they develop a user-friendly trading platform with smart trading analysis. What’s next for your project? Unibot has been live for 1 day and has been grown organically to $2M market ca with >800 Twitter members and >700 Telegram users. The team continues to deliver additional utilities such as wallet token value monitor with quick sell and Autosniper that snipes all decent launches. What can your token be used for? UNIBOT token holders enjoy various benefits, including: * Reduced fees for utilizing the platform's utilities. * Access to additional perks, such as reserved premium nodes, leading to faster transactions. * Advanced algorithms like MEV protection and private transactions.","links":"https://unibot.app/","market_cap":5962135,"market_cap_rank":1480,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/unibot/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf819d9cb1c2a819fd991781a822de3ca8607c3c9"}}}