{"name":"Wrapped FIO","id":"wrapped-fio","symbol":"wfio","description":"FIO Protocol (FIO) is a decentralized, open-source usability solution that enables easier cryptocurrency transactions on all blockchains by replacing complex wallet addresses with a single, customizable, and human-readable Crypto Handle in the format of username@domain. FIO Crypto Handles can be used to send, receive, request, and sign any type of cryptocurrency transaction as easily as sending an email. FIO Protocol’s mission is to make cryptocurrency easy to use across every type of token and coin by removing the opportunity for human error when transacting with long-string wallet addresses on different blockchains and network types. FIO integrates into any type of decentralized application and has a growing partner ecosystem of more than 75 wallets, exchanges, marketplaces, payment processors, and gaming platforms – including its own homebuilt application, FIO Dashboard. Key FIO Protocol highlights include: FIO ($FIO) is the native utility token used for transaction fees and governance on FIO Protocol's native DPoS blockchain, FIO Chain. Wrapped FIO ($WFIO) is a tokenized version of the native FIO token that runs on the Ethereum blockchain. $WFIO is supported by $FIO at a 1:1 ratio and allows users to transfer liquidity between the FIO and ETH networks in a decentralized and autonomous manner. $WFIO is compliant with ERC-20 standards and can be fully integrated into the Ethereum ecosystem. FIO Crypto Handles are human-readable wallet names (username@domain) that can be mapped to multiple public wallet addresses and used to replace those public wallet addresses when sending, receiving, requesting, or signing any type of cryptocurrency. FIO Crypto Handles are nested NFTs secured by private keys on FIO Chain, with ownership and mapping abilities controlled by the private key holder. They have no renewal fee and come with an initial bundle of 100 transactions. FIO Domains allow users to fully customize their FIO Crypto Handle with a unique @domain ending (usern","links":"https://fioprotocol.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-fio/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xbea269038eb75bdab47a9c04d0f5c572d94b93d5"}}}