{"name":"Smart Valor","id":"smart-valor","symbol":"valor","description":"VALOR token VALOR token is legal, transparent and accessible. Every VALOR can be traced back to its origin and each VALOR fund has its own public address. With its transparency, SMART VALOR is best-in-the-industry for token governance. Slash your transaction fees by 30% when you pay with VALOR on the SMART VALOR exchange and earn up to 7% per annual staking VALOR on the SMART VALOR exchange. Development Fund 2030 Purpose of the fund – to help SMART VALOR marketplaces succeed. To be gradually released over the next 10 years. Deployment of the fund is decided by the votes of VALOR holders. Liquidity Fund Since VALOR was first listed in April 2019, the Liquidity Fund has been used to improve VALOR liquidity on platforms and exchanges. This fund is still in use and may be increased in the future. Growth Fund 2017 The fund was set up in 2017 to support network growth through campaigns, bounties and airdrops. This fund is still not completely deployed and can be used in the future. Team Fund 2027 Set up in 2017 to attract and hire the best talent for the decade to come, this fund is used conservatively. Only 12% of the fund has been allocated to employees, contributors and advisors so far. This way, the interests of the team and other token holders are fully aligned. About Smart Valor SMART VALOR is a Switzerland-based technology fintech company founded in 2017. It has the distinction of launching the first fully regulated digital asset exchange out of Switzerland and Liechtenstein back in 2019, being and becoming the first European digital asset exchange to be listed on Nasdaq First North. Through its subsidiary in Germany, SMART VALOR Services GmbH, the company specialises in providing IT development services at the intersection of WEB 3 and AI. It serves business customers with a variety of technical solutions. These include API platform for exchange transactions such as e.g. Bitcoin purchases on the ticket machine network of Swiss national railways and white-label trading platform for banks and fintechs. With a proven track record of delivering robust financial solutions, never experiencing any type of security breach during the seven years since its inception, the company has established itself as a trusted gateway to Web3 technology.","links":"https://smartvalor.com/","market_cap":5538385,"market_cap_rank":1812,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/smart-valor/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x297e4e5e59ad72b1b0a2fd446929e76117be0e0a"}}}