{"name":"Superstate Short Duration U.S. Government Securities Fund (USTB)","id":"superstate-short-duration-us-government-securities-fund-ustb","symbol":"ustb","description":"USTB’s innovative structure and partnership with established service providers breaks new ground in the private funds space. The fund invests in short duration U.S. Treasury and U.S. Agency securities, targeting the federal funds rate, with a 0.15% management fee.1 Accepted U.S. Qualified Purchasers are able to subscribe to and redeem from the Fund using USDC2 at a daily NAV which is calculated by NAV Consulting. USTB’s Ethereum-based Allowlist enables on-chain ownership, transfer, and compliance. Additionally in the future, it is likely that peer-to-peer transactions will be possible, subject to applicable restrictions. The Fund’s flexibility carries through to custody; investors can self-custody USTB in the on-chain addresses of their choice, such as an EOA, multi-sig, or MPC wallet. Additionally, investors can choose to utilize Anchorage Digital Bank National Association, a custodian and federally chartered bank, or BitGo, a qualified custodian and New York state chartered trust. Superstate, an Exempt Reporting Adviser, serves as the Fund’s investment manager, with Federated Hermes serving as the Fund’s sub-advisor. USTB is a series of a Delaware Trust, which is legally separate from Superstate. For more Fund details, please consult the USTB information page. USTB marks the start of our mission to tokenize the world’s assets. We’re committed to developing regulated, modern investing products that enhance investment opportunities for institutions, and, ultimately, all investors.","links":"https://superstate.co/","market_cap":383469370,"market_cap_rank":220,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/superstate-short-duration-us-government-securities-fund-ustb/logo.png","detail_platform":{"ethereum":{"decimal_place":6,"contract_address":"0x43415eb6ff9db7e26a15b704e7a3edce97d31c4e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x43415eb6ff9db7e26a15b704e7a3edce97d31c4e"},"plume-network":{"decimal_place":6,"contract_address":"0xe4fa682f94610ccd170680cc3b045d77d9e528a8","geckoterminal_url":"https://www.geckoterminal.com/plume-network/tokens/0xe4fa682f94610ccd170680cc3b045d77d9e528a8"}}}