{"name":"Denet File Token","id":"denet-file-token","symbol":"de","description":"1. DeNet is a multichain ecosystem with products based on the DeNet Storage Protocol, providing a Web3 alternative to traditional cloud storage in the Sharing Economy concept. Its smart contracts, including Proof-of-Storage, run on EVM-supported networks and manage the file system, versioning, and node-proof processing. 2. DeNet is a decentralized storage protocol with an EVM-compatible and user-friendly UX/UI. It operates on Open Economy 3.0, promoting direct interaction among ecosystem participants, minimizing intermediaries and costs. Datakeepers earn rewards for providing excess storage, and the tokenomics ensure a self-stabilizing storage price for optimal benefits to datakeepers and users. 3. DeNet launched in July 2017, focusing on utilizing existing storage capacities in a decentralized manner. Within three months, they released an MVP. In May 2018, DeNet BOX was launched for the corporate sector, tested in international companies. In June 2021, DeNet introduced DeNet Node and DeNet Storage for the B2C market. Within three months of launching iOS and Android versions, they became the largest in the decentralized mobile storage market. 4. DeNet is constantly improving its third version of the protocol and enhancing its client features for user interaction. The latest release aims to attract dedicated Datakeepers for network stability and security. They are expanding globally with a user-friendly Web3 storage app, focusing on making DeNet Storage accessible to individuals unfamiliar with Web3, cryptocurrency, or blockchain. 5. DeNet operates on a dual token system: TBY and DE. TBY is a utility token for 1TB of data storage for a year, facilitating automatic payments through Proof-of-Storage smart contracts. DE token enables TBY issuance, ecosystem services usage, Storage Protocol settings management, and Consensus voting participation. Also tokens need to launch datakeeper for eanr as node. Voting: consensus.denet.app Issue TBY gastoken: pay.denet.app","links":"https://denet.pro","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/denet-file-token/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x081ec4c0e30159c8259bad8f4887f83010a681dc"}}}