{"name":"Bitnet","id":"bitnet","symbol":"btn","description":"What is the project about? Bitnet is a peer-to-peer network that enables the creation of programmable money, financial systems, and can also be used for cloud computing. It is decentralized like Bitcoin but powerful like Ethereum. It needs no central authority or banks to operate, and can be used by anyone, anywhere. Bitnet code is open source, nobody owns or controls Bitnet, and everyone can participate in the network. Its technology allows for the creation of complete financial systems for both sovereign and private money, as well as the tokenization of value on the internet. What makes your project unique? The unique proposition of Bitnet comes from its built-in monetary policy, the smart contracts capability, and the true concept of decentralization it entails. History of your project. Bitnet originates from the premise that Ethereum, despite greatly innovative and powerful, is not decentralized for a range of reasons further elaborated in the project’s white paper, and that Bitcoin, despite truly decentralized and an excellent store of value asset, fails to host enough technology and have in place the correct monetary policy to serve as an actual currency. Bases on those premises, I have written an released a white paper on the Bitcoin Talk forum on the 14th of July 2023, which served as the catalyst for the beginning of what Binet has become so far. What’s next for your project? Success for Bitnet means broad adoption of Bitnet as a form of currency, where the mild inflationary policy will incentivize people to use it as a currency on the day-to-day basis, and the programmability built-in will allow for the existence of private and sovereign money on a truly unstoppable and secure network, inherently offering interoperability, accountability, and transparency to such other currencies. To achieve that, Bitnet has to further develop its scalability technology without giving away proof-of-work (ideally to be as fast as most PoS networks, but without compromising in decentralization and security), foster the growth of a community willing to bridge the gap between Bitnet and fiat money and to use BTN as currency, creating a deeply liquid market so it can more easily incentivize the adoption of Bitnet by merchants across different jurisdictions, and there’s also the need to incentivize the creation of new money in the Bitnet’s ecosystem.Success for Bitnet means broad adoption of Bitnet as a form of currency, where the mild inflationary policy will incentivize people to use it as a currency on the day-to-day basis, and the programmability built-in will allow for the existence of private and sovereign money on a truly unstoppable and secure network, inherently offering interoperability, accountability, and transparency to such other currencies. To achieve that, Bitnet has to further develop its scalability technology without giving away proof-of-work (ideally to be as fast as most PoS networks, but without compromising in decentralization and security), foster the growth of a community willing to bridge the gap between Bitnet and fiat money and to use BTN as currency, creating a deeply liquid market so it can more easily incentivize the adoption of Bitnet by merchants across different jurisdictions, and there’s also the need to incentivize the creation of new money in the Bitnet’s ecosystem.Success for Bitnet means broad adoption of Bitnet as a form of currency, where the mild inflationary policy will incentivize people to use it as a currency on the day-to-day basis, and the programmability built-in will allow for the existence of private and sovereign money on a truly unstoppable and secure network, inherently offering interoperability, accountability, and transparency to such other currencies. To achieve that, Bitnet has to further develop its scalability technology without giving away proof-of-work (ideally to be as fast as most PoS networks, but without compromising in decentralization and security), foster the growth of a community willing to bridge the gap between Bitnet and fiat money and to use BTN as currency, creating a deeply liquid market so it can more easily incentivize the adoption of Bitnet by merchants across different jurisdictions, and there’s also the need to incentivize the creation of new money in the Bitnet’s ecosystem. What can your token be used for? For Individuals: https://bitnet.money/individuals/ For Businesses: https://bitnet.money/businesses/ For Developers: https://bitnet.money/developers/","links":"https://bitnet.money/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitnet/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}