{"name":"BLOCX.","id":"blocx-2_ethereum","symbol":"blocx","description":"What is the project about? BLOCX was conceptualized as an all-in-one computer manager that offers a seamless and integrated solution to address the identified challenges. The platform combines various features and services under a unified interface, providing users with a comprehensive, secure and efficient computing experience. BLOCX offers a range of features designed to simplify and secure your digital life: Malware Protection Cloud Services & Protection Internet Security Drivers Scanner & Update Keys & Password Vault Remote Access System Tune Up Secured Wallet What makes your project unique? You no longer need to rely on multiple software solutions to manage and protect your digital life. We aim becoming one-stop solution, offering a comprehensive range of features and services to simplify and secure your computing experience. History of your project. Started as an idea 2022. Implementation of idea started early 2023 and Coin publicly launched 20 of July 2023 What’s next for your project? The initial phase focuses on launching the BLOCX platform, achieving network stability, and establishing a strong user base. The platform's core features, including malware protection, cloud services, and internet security, will be thoroughly tested and refined during this stage In Phase 2, BLOCX will expand its service offerings to include GPU and CPU rental, cloud storage rental, and premium security features. The BLOCX coin will be integrated into all aspects of the ecosystem, promoting its utility and use. What can your token be used for? Collateral for Masternodes: BLOCX coin can be used as collateral to operate a masternode in the BLOCX network. By staking a 100 000 BLOCX coins as collateral, masternode operators contribute to network security and governance while earning rewards. Collateral for BLOCX Premium Security and System Features: BLOCX coin will also serve as collateral to access premium security and system features offered by the BLOCX platform. These features may include enhanced malware protection, advanced cloud services, internet security upgrades. By holding specific amount of coins or staking BLOCX coins, users gain access to these premium features, ensuring a secure and optimized computing experience. Payment for GPU and CPU Rental: BLOCX coin will serve as the primary payment method for renting GPUs and CPUs through the BLOCX platform. Users will be able to leverage their BLOCX coins to rent out their idle computing power to other users who require additional processing their capacity. This enables users to monetize their hardware while supporting the BLOCX network. Cloud Storage Rental: BLOCX will be also used for cloud storage rental within the ecosystem. Users will be able to pool together their available devices and hard drives to create their own personalized cloud storage infrastructure. They can then rent out their storage space to other users through the marketplace by earning BLOCX coins as compensation.","links":"https://blocx.tech/","market_cap":41877,"market_cap_rank":8487,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blocx-2_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x4ff57e25eeb7affbbb060e0bad2e1759efc8bec4","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x4ff57e25eeb7affbbb060e0bad2e1759efc8bec4"}},"is_native":false}