{"name":"Autentica","id":"autentica","symbol":"aut","description":"## What Is Autentica (AUT)? Autentica is a technology company committed to empowering and safeguarding the creators of the world. The company provides proprietary authentication technology, enabling digital creators to transform their artworks into authentic NFTs without exposing themselves to fraudulent use or duplicates. Autentica has created a 3-dimensional ecosystem to help users create, buy and sell NFTs. ### PROPRIETARY AUTHENTICATION TECHNOLOGY Enables artists to transform their artworks into authentic NFTs without exposing themselves to fraudulent use or duplicates. ### AUTENTICA TOKEN As the official payment protocol, the Autentica (AUT) token is driving the entire ecosystem by supporting monetization for creators and community members. ### MARKETPLACE A digital art universe, where creators, collectors and traders can access, authenticate and validate their digital assets. ## How Many Autentica (AUT) Coins Are There in Circulation? The Autentica token ($AUT) has a fixed supply of one billion (1,000,000,000), and it will be released in stages over the course of 60 months following the Token Generation Event (TGE). From the total of one billion Autentica tokens, only 27,200,000 will be in circulation at listing. The full tokenomics of the AUT token can be viewed on [the official website](https://www.autentica.io/token) or in the [whitepaper](https://docs.autentica.io/whitepaper/tokenomics/overview). ## Who Are the Founders of Autentica? **Artur Grigor / Co-founder & CEO** LinkedIn: https://www.linkedin.com/in/arturgrigor Artur is the co-founder and CEO of Autentica, a Swiss technology startup pioneering blockchain technology to solve authenticity issues in the NFT industry. He comes from a technical background as a software engineer and has a demonstrated history of working in the computer software industry, working for US startups and Fortune 500 companies. His passion for NFTs quickly evolved to setting up Autentica with the motivation to r","links":"https://www.autentica.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/autentica/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x214feebda3ae6bb842bd17d91a0f346eebcd7898"}}}