{"name":"Wisdomise AI","id":"wisdomise","symbol":"wsdm","description":"Wisdomise, established in 2021 by a team of MIT and McKinsey alumni, is a Swiss-regulated company aiming to make investments across the DeFi and CeFi spaces more accessible and profitable through a one-stop-shop AI-powered platform for investors and traders. At the very core of the offerings, “Wisdomise Brain” is an advanced multi-layer AI architecture that enhances financial decision-making by analyzing vast amounts of data, forecasting market trends, and executing trades with precision. The company operates from 4 offices globally: Switzerland, UAE, Estonia, and Taiwan, with relevant licenses across all these jurisdictions. Key Highlights: Unique Founding Team: Co-founded by Dr. Fardad Zand (CEO) with a postdoc from MIT in Information Econometrics, former McKinsey Engagement Manager, and ex-Head of Strategy at Careem (Uber-acquired) & AJ (CMO) a serial entrepreneur rooted in Silicon Valley, having founded x3 multi-million dollar ventures and served ultra-tier1 brands in the MENA region over the past 16 years. Stellar Advisory Board: current/former members from MIT, Stanford, McKinsey, Goldman Sachs, Morgan Stanley, BlackRock, and Uber with their research impact ranking in the top 2% of all scientists. Marshall Van Alstyne, Wisdomise Chief Scientist has received more than 27,000 citations, includes a top 50 all-time article for Harvard Business Review, and was recognized by Thinkers 50 as among the most important management contributions globally. Research impact ranks in the top two percent of all scientists. Exceptional Engineering Talent: over half of the company’s engineers are internationally awarded programmers, cryptographers, and/or mathematicians. Strong Funding & Track Record since 2021: $9.5M total fundings. $6.5M in equity + $3M in private token rounds. Unique Team: 40% PhDs, 100% Masters, 30% gold/silver medals in international olympiads.","links":"https://wisdomise.com/en","market_cap":4575812,"market_cap_rank":2419,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wisdomise/logo.png","detail_platform":{"polygon-pos":{"decimal_place":6,"contract_address":"0x5f2f8818002dc64753daedf4a6cb2ccb757cd220"}}}