{"name":"BullionFX","id":"bullionfx","symbol":"bull","description":"$BULL is the utility token of the BullionFX ecosystem launched in mid-2021 is an ERC-20 token operating on the Ethereum blockchain. $Bull represents the Bullion ecosystem and is purchased and destroyed with transactional fees generated within the ecosystem; and provides Higher returns by staking in yield pools including Exclusive DeFi access and benefit. $Bull also provides Increased value via the burn mechanism within our reserve wallet. The BFX ecosystem actively reduces risk in yield pools by diversifying risk across various pools and providing single touch access. BFX plans to launch its first yield product in Q2, for more information, visit www.bullionfx.com/demi The ecosystem will initially launch a platform as a mobile and web application, allowing for the exchange of major currencies into decentralised currencies including $GOLD. $GOLD is a ERC-20 & BSC token that has no minimum or maximum issuance and will always be equal to the amount of physical gold. BullionFX is partnered with StoneX www.stonex.com providing absolute Buy/Sell value with no spreads with an ability to save privately, send, trade on and 3rd party marketplace (inc. UniSwap) i.e. ability to swap back to Gold). Gold is held in Brinks Vaults Globally https://us.brinks.com; BullionFx provides the physical Gold withdrawal options to its users. $GOLD has been designed to provide the upside of paper gold, physical gold, and digital money by offering a world's first institutional grade product backed by gold bars and audited by institutional grade auditors BDO https://www.bdo.com.au. Through the application of Liquid (Goldbackbone) in BullionFx Ecosystem users have the ability to directly exchange cryptocurrencies with institutional grade gold (through ETHg, BTCg, Xg) and utilise the underlying liquidity to operate De-Fi, Yield, Synthetics, and future blockchain protocols. Acting as a gold backbone, Liquid is the world’s first viable alternative to Tether, allowing the entire blockchain industry to grow without the need for a stablecoin intrinsically linked to the centralised world of FIAT via the US Dollar","links":"https://www.bullionfx.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bullionfx/logo.png"}