{"name":"KRAUSE","id":"krause","symbol":"$krause","description":"Krause House wants to empower fans to purchase & operate an NBA Team. Owners, media, players, and fans each play critical roles to make the business of professional sports go and flourish. While fans are arguably the single most indispensable party to this equation, they are the lowest on the totem pole when it comes to ownership by an order of magnitude or higher.Web3 changes all that by consumerizing ownership. With web3, consumers finally have the capability to collectively own and coordinate at scale. Roadmap Phase 1: Shootaround Phase 2: Scrimmage Phase 3: Gametime Phase 1: Shootaround Ticket Holders will include contributors, fans, patrons, influencers, and athletes, each with different skills and wants. Thus, we are creating a “choose your own adventure” model where different types of participation earn NFTs. These NFTs will form collections that unlock additional benefits. Building, hanging out, attending events, buying merch, and competitions will each offer their own NFTs. These could include jerseys, trophies, kicks, or headbands. Earned NFTs will have unique perks and designs, and different seasons offer limited editions. Perks could include merch drops, NBA tickets, and lessons with elite coaches. Phase 2: Scrimmage Rushing to place a bid on an NBA team without success running other organizations as a DAO will likely force decision making to centralize and sideline the community. Thus, we need to demonstrate success operating as a collective intelligence. Our strategy is two-pronged. One, pursue teams to run franchises in parallel. We plan to launch bids on multiple smaller franchises to learn by doing and demonstrate success. This will likely involve ventures into multiple sports in multiple countries (we’ve had plenty of excitement from football fans). This allows us to experiment in our approach and learn, without a single point of failure. Note, we will not necessarily need to purchase a majority (or even a minority) stake in these teams, as we can act (and have been approached) as a service DAO. We also want to collaborate with non-Krause House individuals and DAOs looking to buy a team as well in an effort to learn and share knowledge. Two, empower these teams with the tooling, network, and knowledge they need. DAO framework and decision making tooling is rapidly progressing; however, we can both fund and contribute to tooling that we will need to govern franchises. We view this effort as inevitably collaborative with other DAOs, given the common limitations faced. Phase 3: Gametime With demonstrated success running a portfolio of smaller cap franchises, we believe that the NBA will approve our bid to officially acquire a majority position in an NBA team. We will raise additional capital to put forth either a bid on an NBA team. The legal structures and rights of token holders will be determined based on NBA regulations at that time. Yet, our journey is not over post-ownership. We have many championship banners to raise in the Krause House. At this point, we have the option to burn IRL trophies and mint them as NFTs, which can be decided collectively","links":"https://krausehouse.club/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/krause/logo.png"}