{"name":"Ithaca Protocol","id":"ithaca-protocol","symbol":"ithaca","description":"Ithaca is a non-custodial, composable, option, option strategies and structured products (and soon) protocol on Arbitrum (and soon on Base and Solana) underpinned by a provably optimal, auction-based matching engine. Current Rankings Ithaca already ranks consistently between #1 and #4 option protocols in terms of volumes and premia on DefiLlama, having been live for few months and liquidity ramping up. Vision Ithaca will be the no1 option protocol across chains Why options? Option market is huge everywhere; never a ‘demand for options‘ challenge, always ‘liquidity’; Ithaca solved this. 'It is easy to build a perp product when you have an option market. It is very hard to build an option market when you just got perps.' Ithaca will be the 'Uniswap of Options' Similar to how a protocol would seed an AMM pool to generate liquidity on spot trading of their token, Ithaca has built innovative modular infrastructure that allows for instant spin up of complete liquid option / option strategy / structured product markets on any underlying. Market Traction Ithaca already is showing traction with knowledgeable power users that can access for the first time ( not only in DeFi, but also in CeFi and TradFi ) Product Offerings - Fully composable linear combinations of vanillas and digitals - Collateral Optimization - Innovative margin lending (launching soon) Ithaca has put together infrastructure that encompasses as special cases all vault and structured product offerings. A listing will create the hype for every user that has tried inferior products to access a superior offering - Vanilla + Digital Options - Stories (Bets, Earn, Bonus, Twin-Win, Barriers, Contingent Premium Calls / Puts, Accumulators) - Principal Protected Strategies - Ithaca Option Bot Telegram App (First self contained telegram native option bot; opening up options to 1bln TG users; TG mini-app game coming soon) While the Ithaca Matching Engine frequent batch auction framework levels the playing field for users protecting from high frequency traders and MEV extractors. IthacaGPT allow non sophisticated users to translate nuanced views into, potentially complicated, option strategies. Perps can’t compete; no other protocol (TradFi / CeFi) can compete with Ithaca. Team Most experienced trading and BD team in the market across go to market verticals; professionals; institutional, traditional retail, Degens; principals have traded for decades in Tradfi option markets and ran a successful crypto vol proprietary trading business. Market Making Infrastructure Alongside the organic liquidity generation inherent in the building block decomposition methodology, a supporting vol market-making infrastructure is getting launched Airdrop A liquidity-supportive point system has supported strong community growth since the emergence from stealth. Ithaca Airdrop Season One: https://blog.ithacaprotocol.io/blog/ithaca-airdrop-season-one Funding Pre-seed round 1 year ago led by Cumberland and Wintermute.","links":"https://www.ithacaprotocol.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ithaca-protocol/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x49f1d4db3ea1a64390e990c6debeac88eac007ca"}}}