{"name":"Redemption Token","id":"redemption-token","symbol":"rdtn","description":"What is the project about? Project: Redemption - Revolutionizing DeFi with Passive Income Opportunities Redemption is a “community-owned income generation De-Fi project” where token holders contribute their funds to a collectively owned and governed treasury that manages and invests the pooled funds to generate profits and distribute them among RDTN holders. Holders of RDTN tokens can not only benefit from potential token price appreciation but also passively earn dividends, making it an enticing proposition for long-term investors. Additionally, Redemption offers multiple earning models to earn passive income and win Prizes with crypto-powered: On-Chain Puttable Bonds Staking Lottery What makes your project unique? Unique Selling Points: a) Secure and Stable Earning: Redemption Bonds are 100% backed by the assets in Redemption Treasury, ensuring the security of principal investments. b) Diverse Passive Income Options: Investors can choose between Redemption Bonds, Staking, or participating in the Lottery, providing various avenues for earning passive income. c) Democratic Governance: Redemption is a revolutionary DeFi project owned and operated by a DAO, paving the way for a fairer financial system. d) Flexible Bond Functionality: Bonds can be redeemed anytime before maturity at their face value with added puttable functionality. e) Token Utility: RDTN tokens provide voting and governance rights, as well as proportionate quarterly dividends from the project earnings. f) Dividends: Redemption DAO makes investments and provides dividends to token holders from the earnings, proportional to their holdings. History of your project. Redemption was founded by a group of like-minded individuals from around the world who shared a vision of creating a fairer financial system through DeFi. The project has been under development and has gained significant traction in the crypto community due to its unique passive income opportunities. What’s next for your project? a) Expansion and Adoption: We aim to expand our user base and increase the adoption of Redemption's passive income options, targeting a wider audience globally. b) Integration with New Chains: We plan to explore integration with additional blockchain networks to provide more flexibility and accessibility to users. c) Enhanced Features: We are continuously working on enhancing our platform, adding new features, and improving the user experience based on community feedback. d) Offering Loans: Phase 2 of Redemption protocol will also offer Loans through a decentralized loan platform based on Aave protocol. Funds collected through Bonds will be utilized for Cash supply against loan requests. e) NFT Marketplace: Phase 3 of Redemption Protocol will sell NFTs through a Redemption marketplace. Marketplace will sell NFTs minted by Redemption and will charge fees from independent sellers and buyers. What can your token be used for? a) Governance and Voting: The RDTN token provides voting rights within the Redemption DAO, allowing token holders to actively participate in decision-making processes. b) Dividends and Rewards: Holding RDTN tokens provides proportionate quarterly dividends from the project's earnings, rewarding token holders for their participation. c) Lottery Participation: RDTN tokens can be used to participate in the decentralized and automatic Lottery feature, offering the chance to win significant prizes. d) Staking Rewards: By staking RDTN tokens, investors can earn higher APR (Annual Percentage Rate) and increase their governance and dividend rights within the Redemption Treasury. e) Bonds: RDTN are used to back the Redemption Bonds by locking an equal amount of tokens in the treasury, providing security to the Bondholder that their investment is 100% secure","links":"https://redemptiontoken.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/redemption-token/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}