{"name":"Nirvana ANA","id":"nirvana-ana-2_solana","symbol":"ana","description":"Nirvana is a financial structure that enables assets with permanent value, using verifiable math and immutable code. In Nirvana, value is not arbitrary; it’s programmed. Its native token, ANA, is backed by protocol-owned USDC reserves. This gives ANA a mathematically assured floor price that can rise but never fall. The immutable exit liquidity is hardcoded into the smart contract itself, removing the need for external market makers. The result is a system for trustless and permanent value storage. ANA is powered by an Assured Value Machine (AVM), a programmatic market maker which ensures that every token in circulation can always be redeemed for at least its floor price, verifying that the floor price is cryptographically and economically impenetrable. Because its minimum value is mathematically verifiable, staked ANA can be used as collateral for loans with zero liquidation risk. ANA stakers also earn a share of protocol revenue, which means loans are effectively self-repaying. Nirvana's expansion, Samsara, is the home of datTokens—on-chain Digital Asset Treasuries. datTokens work similarly to DAT companies such as MicroStrategy, but they’re on-chain, fair, and have built-in price protection. Each datToken has redeemable value from its underlying reserve, and offers structural price asymmetry against its reserve asset: magnified upside potential and mathematically limited downside risk. datTokens also offer inerest-free loans with no liquidation risk.","links":"https://www.nirvana.finance/","market_cap":36232804,"market_cap_rank":786,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nirvana-ana-2_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"5DkzT65YJvCsZcot9L6qwkJnsBCPmKHjJz3QU7t7QeRW","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/5DkzT65YJvCsZcot9L6qwkJnsBCPmKHjJz3QU7t7QeRW"}},"is_native":false}