{"name":"SatelStar","id":"satelstar","symbol":"stsr","description":"This is what Satellite Star means. As a compound word of satellite and star, it has the meaning of becoming like a star, which is in the spotlight in the satellite market. Although it is a latecomer, we will improve communication security, data exchange transparency, irreversible information security, and cost efficiency by combining high-quality technology, business model and block chain in the commercial satellite market. As a result, we aim to gain a competitive edge over existing market players and gain market dominance in the commercial satellite market. We plan to develop satellites by establishing an effective cost system in cooperation with an aerospace research institute with open source-based open technology and high technology. In addition, by maximizing the security of information and data management through blockchain, we will increase the attractiveness of the product itself. By having such high marketability and security, it is possible to secure a long-term profit model through contracts with global sports leagues and broadcasters. Also, by listing coins on global exchanges, it is possible to sign contracts with rocket launchers and to launch and operate satellites. During the primary estimated life of the satellite, a new revenue source can be obtained by purchasing sports broadcasting rights, providing satellite image transmission services, providing corporate data services, and supplying meteorological data through commercial satellites capable of operating in low orbit at a small scale. In addition, using accumulated capital, it is possible to develop secondary, tertiary, and quaternary satellites, and finally, we plan to operate up to mid-orbit satellites to establish ourselves as a leader in the private satellite revenue business.","links":"http://satelstar.io/index_eng.html","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/satelstar/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd13432fdd2ae4eed84c3a0233d6c5265087c96c3"}}}