{"name":"THE9","id":"the9","symbol":"the9","description":"What is the project about? > The 9 Company's smart order payment platform business, which has ownership and operating rights for the entire kiosk and kiosk operating system, is a smart order payment system for store owners and consumers. In addition, it can provide convenient services such as various payment, mileage, and online gift certificates, and can secure big data through operation. What makes your project unique? > The blockchain token payment in the kiosk linked to the The 9 Company's kiosk platform provides a very strong foundation for ecosystem construction. The currently developed token payment system provides a payment process that is 5 seconds faster than credit card payment and applies a very convenient payment method. In addition, integrated mileage and mobile gift certificates using tokens provide convenience to customers and new sales expansion channels for store owners. As such, THE9 Token was built based on the efficiency of the ecosystem. In particular, THE9 token, which is operated with the value of the product as collateral, is very excellent in stability and effectiveness. History of your project. > Started Business as CK GROOVE.co.,LTD in 2007. Changed Name from CK GROOVE.co.,LTD to THE9COMPANY in 2018. For more information, please check our official medium page. (https://medium.com/@the9com/the9-what-is-the9company-10f520c07c21) What’s next for your project? > For yr 2023, - Cumulative operation 60,000units - Mileage linkage with Chinese tourist destination platforms - 5,000 units of kiosks in the US - Operation of kiosk linkage with KT serving robots and other robots - KT big data and AI joint venture - Entry into Indonesia / Japan / Thailand of the kiosk platform business - Listed on major exchanges in Indonesia / Japan / Thailand 2024, - Cumulative operation 100,000units - Started big data analysis business through kiosk operation - Entered Eastern Europe for kiosk platform business - XR payment platform “Order Seventeen” launched","links":"http://www.the9company.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/the9/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xefd113cea2f656fe7899a25a06243a6e40406e08"}}}