{"name":"Ash Token","id":"ash-token_binance-smart-chain","symbol":"ash","description":"\"There are between 2 million and 10 million living species on our planet today. Between 10,000 and 100,000 are becoming extinct each year, mostly due to human-induced changes to the environment. The area of primary forest worldwide has decreased by over 80 million hectares since 1990, a surface with the approximate combined area of Germany and France. 91% of the world’s human and animal population is exposed to unhealthy levels of pollution. If the rate of global warming, primarily caused by human-induced emissions of heat-trapping gasses, continues to rise along its current trajectory by the end of the century, we could very well be struggling to survive in a world raked by intense hurricanes, alternating droughts and floods, and cut-throat competition for food, water, and natural resources. The ASH Token is a platform for funding sustainable business initiatives that aim to eliminate pollution from the global environment and drive the adoption of cleaner energy sources. It is a governance and utility token that empowers holders to decide how the funds raised from the token sale and transaction fees are used to fund environmentally conscious companies and technologies that have a global impact. The ASH Token is owned by the entity called the Ash Environmental DAO, which is registered in the State of Wyoming, USA with ID number 2021-001064366. The DAO is a network of ASH Token holders with no central governing body, but a set of rules encoded on the blockchain. Companies with green technologies which get funded by the ASH Token will be required to distribute 10-20% of their net profit to the token holders by buying back equivalent amounts of tokens and holding for 5-years\"","links":"https://www.ashtoken.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ash-token_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0xe3c1bdeec4db91cd90c336776332fae2e00fddd9","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xe3c1bdeec4db91cd90c336776332fae2e00fddd9"}},"is_native":false}