{"name":"Lavita","id":"lavita","symbol":"lavita","description":"1. What is the project about? The Lavita project aims to create a privacy-preserving healthcare data marketplace powered by AI and blockchain technologies. It aims to address key challenges in the healthcare industry by providing individuals with control over their health data and enabling them to contribute it securely for research and analysis purposes. 2. What makes your project unique? Lavita project uniquely integrates AI, blockchain, and privacy-preserving technologies to provide personalized clinical advice and enhance research capabilities. By leveraging blockchain, it ensures secure data management and user control over healthcare data. This innovative solution empowers individuals, fosters trust, and drives advancements in the healthcare industry. 3. History of your project. '22-12-21 Launched the First Health Data Marketplace Powered by Theta Metachain '23-02-27 Advisory Council - Dr. Jaegul Choo, Associate Professor at the AI Graduate School of KAIST Korea '23-04-12 Selected into Microsoft for Startups Founders Hub program '23-05-09 Advisory Council - Dr. Tim Miller, Assistant Professor at the Harvard Medical School '23-05-10 LAVITA TNT-20 tokens launched on May 10 on Theta Subchain '23-05-15 Lavita AI Raises $5M equity financing 4. What’s next for your project? Lavita's key initiatives include the development of an AI-based Q&A engine for personalized healthcare information and an ecosystem for training AI models with healthcare data, rewarding users with LAVITA tokens. By leveraging AI, Lavita facilitates advanced data analysis and personalized clinical advice, for improved healthcare outcomes. 5. What can your token be used for? At the core of Lavita is the LAVITA token, serving as a utility and governance token. Data contributors are rewarded with tokens for sharing their health data, while storage and AI computation providers also receive incentives. This token economy fosters collaboration and innovation in the healthcare industry.","links":"https://www.lavita.ai/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/lavita/logo.png","detail_platform":{"theta":{"decimal_place":18,"contract_address":"0x46fbf4487fa1b9c70d35bd761c51c360df9459ed"}}}