{"name":"Quint","id":"quint","symbol":"quint","description":"QUINT has been commissioned by a team of investors who have strived to build a legacy ecosystem that reflects their accomplishments in life. While catering to the needs of like-minded connoisseurs through bringing to them a Boutique NFT Marketplace, Team Quint also wanted to give a taste of luxury to QUINT’s worldwide token holders through its revolutionary super-staking platform. At Quint, we like to do things differently! That's why apart from the regular staking options, we are bringing to you Super-staking Pools. These pools will yield real-world incentives such as complimentary stays in your dream destinations, supercar experiences, discounts on property purchases, hotel bookings, restaurants, spas and much more while also offering breathtaking prizes through our Luxury Raffle Pools. QUINT's boutique NFT Marketplace will allow connoisseurs from across the globe to not just get their tailor-made NFTs designed by creative minds with an inherent eye for luxury but also get those freshly minted NFTs installed into Token Frames and delivered to their doorsteps. While building on the token's 'Super-staking Pools' concept, QUINT aims to add unique real-world collectibles to its treasury, the future upside of which will be distributed amongst the Super-staking Pool stakers. Another one of QUINT's key future goals is to develop luxury physical real estate and make the QUINT investors fractional owners in proportion of their investment in the Quint's DeFi ecosystem. These will be first of their kind DeFi usages in the crypto world and would ensure that the TVL of the Project has hard assets to boast of; not just borrowed tokens from a partner DeFi protocol","links":"https://quint.io/","market_cap":70832,"market_cap_rank":7990,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/quint/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x64619f611248256f7f4b72fe83872f89d5d60d64","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x64619f611248256f7f4b72fe83872f89d5d60d64"}}}