{"name":"Tanssi","id":"tanssi_ethereum","symbol":"tanssi","description":"Tanssi is a decentralized infrastructure protocol that allows teams to launch sovereign appchains in minutes instead of months—combining the fast deployment of rollups with the control and decentralization of a Layer 1. Each chain has its own execution environment, governance, and infrastructure stack, without relying on centralized sequencers or external coordination. Tanssi runs as a standalone Layer 1 that offers infrastructure-as-a-service: appchains gain access to decentralized sequencing, Ethereum-backed security via Symbiotic, and built-in tools like RPCs, indexers, explorers, wallets, and bridging. Everything is provisioned by default—removing the need for DevOps or external vendors. This model is particularly suited for real-world asset (RWA) and PayFi use cases that require auditable infrastructure, fast finality, and institutional-grade security. Unlike rollups and RaaS platforms, Tanssi enables fully sovereign deployments with transparent upgrade paths, compliance-ready governance, and deterministic finality built into the base protocol. Tanssi is already onboarding high-impact projects across RWA, fintech, and payments, including: Wirex – building a non-custodial debit rail on Tanssi BRX – interoperable Brazilian credit markets AmFi – tokenized debt and structured credit BlockBR – tokenization platform for private assets Bluegreen – infrastructure for on-chain environmental finance These projects are live on Tanssi’s testnet today, and will migrate to mainnet later this year, supporting real users, real value, and real on-chain activity.","links":"https://www.tanssi.network/","market_cap":3659599,"market_cap_rank":2349,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tanssi_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":12,"contract_address":"0x553f4cb7256d8fc038e91d36cb63fa7c13b624ab","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x553f4cb7256d8fc038e91d36cb63fa7c13b624ab"}},"is_native":false}