{"name":"NFTY DeFi Protocol","id":"nifty-token","symbol":"nfty","description":"\"NFTY is a DeFi utility token used to create a reputation layer for NFT auctions, employing gamified staking and \"farming\" activities to crowdsource reputation data. The process uses economic incentives and rewards funded from 7.5% of the final payout of any auction which uses the NIFTY protocol. The reward is distributed to a pool of “endorsers” or “advocates” in proportion to each token holder's respective endorsement allocation amount, in NFTY tokens, to auctions on NFT exchanges which support the protocol. This incentive gives the participants the challenge of defining the best strategy to “endorse” auctions based on their ability to close the sale, possible amount of the final payout, quality of the NFT being auctioned, and the number of other advocates currently endorsing the auction. The reward is distributed proportionally to the social power of all advocates: i.e. if Person A allocates 10 NFTY to an auction and Person B allocates 20 NFTY to it, Person A gets 1/3 of the 7.5% advocacy reward. During an auction's bidding period, allocated NFTY tokens are locked and unable to be unstaked until after that auction is completed and the NFT is sold, at which point allocated NFTY tokens are unlocked for reallocation or unstaking. This creates a multitude of possible strategies without incentivizing the endorsement of non-sellable, low-quality, or fraudulent products and spammy content as doing so is not economically viable. Overall, this acts as a filter and data analytics platform where a user can determine the degree of desirability and expected sale and potential value of an NFT. The token supply has no cap, but can only be increased through staking which yields a 13.579% APR. Staking is required to enable the endorsement/advocacy mechanisms.\"","links":"https://www.nftytoken.app/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nifty-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3085154623f51b00dedfc6ceeb5197277a66b17b"}}}