{"name":"Beldex","id":"beldex","symbol":"bdx","description":"What is Beldex (BDX)? Beldex (BDX) is a privacy-focused coin, giving power and control to its holders to perform confidential transactions. The Beldex project is dedicated to enhancing online data protection and user confidentiality. BDX, the ecosystem's coin, powers private transactions. With a mission to create a secure and privacy-enhanced environment for data exchange, Beldex prioritizes user safety and true data protection. Through systematic research, the project ensures that individual transactions remain confidential, safeguarding users and their assets. BDX operates on the decentralized Beldex blockchain, enabling secure and anonymous peer-to-peer (P2P) transactions. The Beldex ecosystem supports a range of confidential dApps, including BChat, BelNet, Beldex Browser, the Beldex protocol, and the Beldex bridge. Originally built on a PoW architecture, Beldex transitioned to a PoS consensus model to enhance scalability, lower fees, and reduce transaction times. Where can you buy Beldex? BDX tokens can be traded on centralized crypto exchanges. The most popular exchange to buy and trade Beldex is MEXC, where the most active trading pair BDX/BTC has a trading volume of $2,805,182 in the last 24 hours. Other popular options include KuCoin and Gate.io. What is the daily trading volume of Beldex (BDX)? The trading volume of Beldex (BDX) is $11,086,507 in the last 24 hours, representing a -2.90% decrease from one day ago and signaling a recent fall in market activity. What is the all-time high for Beldex (BDX)? The highest price paid for Beldex (BDX) is $0.4508, which was recorded on Dec 17, 2018 (almost 6 years). Comparatively, the current price is 88.00% lower than the all-time high price. What is the all-time low for Beldex (BDX)? The lowest price paid for Beldex (BDX) is $0.0002752, which was recorded on Nov 01, 2019 (almost 5 years). Comparatively, the current price is 19,553.82% higher than the all-time low price. What is the market cap of Beldex (BDX)? Market capitalization of Beldex (BDX) is $361,337,447 and is ranked #180 on CoinGecko today. Market cap is measured by multiplying token price with the circulating supply of BDX tokens (6.7 Billion tokens are tradable on the market today). What is the fully diluted valuation of Beldex (BDX)? The fully diluted valuation (FDV) of Beldex (BDX) is $537,022,145. This is a statistical representation of the maximum market cap, assuming a total number of 9.9 Billion ETH tokens are in circulation today. How does the price performance of Beldex compare against its peers? With a price increase of 0.20% in the last 7 days, Beldex (BDX) is underperforming the global cryptocurrency market which is up 4.20%, while underperforming when compared to similar Proof of Work (PoW) cryptocurrencies which are up 9.00%.","links":"https://beldex.io/","market_cap":508190815,"market_cap_rank":155,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/beldex/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}