{"name":"Voucher DOT","id":"voucher-dot_arbitrum-one","symbol":"vdot","description":"vDOT (voucher DOT) is a liquid staking derivative (LSD) of staked DOT, with fully underlying DOT reserve and yield-bearing feature of DOT staking reward. Users can deposit DOT into Bifrost SLP protocol and get vDOT as return, vDOT can be traded in the open market or be redeemed back to DOT. Holding vDOT equals to holding the DOT staking position, staking rewards appriciate the exchange price of vDOT. Why vDOT? 1. Liquid Staking The product allows users to stake DOT for liquid vToken, (vDOT). vDOT will keep receiving staking rewards and can continue to be used in Bifrost and Polkadot-based DeFi for additional rewards. 2. Automatically Staking rewards capturing without scenario limitations SLP will issue Staking rewards to vDOT by adjusting the price of vDOT / DOT upwards. vDOT Rate = SLP Staking DOT (SUM) / vDOT Total Issuance. 3. Floating redemption period, vDOT redemption ≤ 28 days While Polkadot’s original chain Staking has a fixed 28-day redemption period, Bifrost SLP helps users to realize the possibility of early vDOT redemption by matching the real-time vDOT minting quantity with the redemption quantity at the protocol layer in the form of a queue. Theoretically, it can achieve second-level redemption. 4. Higher Staking Yield In the SLP protocol, the protocol screens more than 10 verified nodes through governance (subsequently increasing with the overall staking volume) and adds multiple filters such as the number of nominees, commission ratio, and history of blocks out to maximize the return of this verifier portfolio while ensuring that none of the nodes have experienced slashes. 5. Multi-environment Compatibility vDOT is one of Substrate assets in Bifrost parachain, by using the HRMP channels between Bifrost and others, it can be easily utilized in EVM, WASM and Substarte competiable parachains.","links":"https://app.bifrost.io/vstaking/vDOT","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/voucher-dot/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xbc33b4d48f76d17a1800afcb730e8a6aaada7fe5","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0xbc33b4d48f76d17a1800afcb730e8a6aaada7fe5"}},"is_native":false}