{"name":"Beoble","id":"beoble","symbol":"bbl","description":"demo video: https://youtu.be/EAzkZuOAUZg beoble is a revolutionary Web3 social platform, designed to provide enhanced decentralised wallet-to-wallet communication. With a suite of innovative features such as earn, follow, discover and a rewards-based model tailored for the web3 community, beoble prioritizes user privacy, security, and contribution. As web3 people are at the core of every messaging product, we are putting user experience first and foremost: - beoble is community-owned. - beoble delivers Web3 communication capabilities with Web2 user experience. - beoble do not compromise on privacy and data security. BBL token allows innovative circulation of chatroom economy. beoble lets users earn points from interactions, with users accumulating shares in chatrooms based on their active contributions. The more they engage, the more their chatroom share increases, ensuring that any revenue the chatroom generates, including entrance fees, is equitably distributed among members. BBL generated from engagement and participation in activities can then be redeemed for purchasing utilities, access to premium features, playing games, or donated to other users to foster a sense of community and reward. beoble provides messaging & social modules with APIs and SDKs for Web 3.0. With beoble, Web 3.0 services can easily integrate messaging and social profile functionalities into their services in 5 minutes. beoble's core features as an infrastructure include: - modularized wallet-to-wallet messaging - modularized social profile and DID - modularized CS tool (web3 Zendesk / Intercom) beoble offers seamless integration with any native dApps with our API/SDK modules with the following benefits: - effortless UI integration with our API/SDK modules with native social features and improved user experience - adds in-app organic engagement to native dApps, which improves user retention & user acquisition","links":"https://beoble.io","market_cap":1823661,"market_cap_rank":3350,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/beoble/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd979c468a68062e7bdff4ba6df7842dfd3492e0f"}}}