{"name":"ALLPAYCOIN","id":"allpaycoin","symbol":"apcg","description":"The ALLPAY platform is a new payment method based on blockchain By introducing services and cryptocurrencies, we build an intermediary-free P2P payment platform. Through this, the AllPay platform provides a low-cost fee and quick payment service to sellers, and a new concept payment service that can be conveniently used in real life to users, establishing a virtuous cycle ecosystem where all platform participants coexist, ultimately creating a future market. We aim to become a leading payment platform that leads The core competitiveness of AllPay Coin (APCG) is that it is operated by integrating with the existing PG service provided by the AllPay ecosystem and applied to various fields in the real world. Establish an APCG token economy system that swaps electronic prepaid cards and AllPay so that APCG can be used at all affiliated stores, and spread this APCG payment function to all currently operating business offices and franchisees. The AllPay platform activates personal-to-person transactions through P2P Transaction Technology. AllPay's P2P transactions can be carried out simply and quickly by using a PIN number and NFC, and above all, it blocks the possibility of a wrong remittance that may occur due to the user's negligence. The on/off mini app is equipped with a two-way payment module so that users who purchase products can receive simple payment through APCG, and users who sell products can receive secure payment. As the number of users and sellers participating in these platforms increases, the scope and usage of APCG will continue to increase, and AllPay will grow into a major payment system in the cryptocurrency economy. This differentiated technology of the AllPay platform composes the unit business modules within the AllPay ecosystem, connects modules, and enables complementary operations, ultimately allowing the AllPay ecosystem to continue in a virtuous cycle. The circularity created by AllPay's technological differentiation is the biggest advantage o","links":"https://www.allpaycoin.io/kr/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/allpaycoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x434cb4fc4b952872967914d430878eee53ebd502"}}}