{"name":"HTMLCOIN","id":"htmlcoin","symbol":"html","description":"HTMLCOIN is the base coin and gas that powers the Althash hybrid blockchain. The HTMLCOIN environment describes itself as a decentralized Proof-of-Work/Proof-of-Stake hybrid blockchain with fast and secure transactions. While it uses the hashing function and the base layer of Bitcoin to create a secure blockchain and irreversible address mapping, it integrates Ethereum EVM, aka HVM, to run multiple Dapps/programs as a worldwide decentralised, failsafe and secure computer system, additionally making the creation of Ethereum based Smart Contracts possible. The Althash blockchain allows one to effectively build ecosystems on its platform and to power them through HTMLCOIN, meaning Althash/HTMLCOIN can have its own ecosystem of various tokens from HRC20 (ERC20) simple fungible tokens, HRC721 (ERC721), used for instance with NFTs, up to dedicated complex programs allowing the minting of adjustable new tokens, which will be instantly rolled out on the mainnet according to specific needs. The HTMLCOIN devs team highlights that a usual transaction (Tx) costs 0.004 HTMLCOIN in relay fees. In short, an independant ERC20-based project can deploy on the Althash blockchain using the same ABI and object code as Ethereum, offering a less expensive alternative to gasfees. To secure its network, HTMLCOIN uses a Double SHA-256 algorithm, effectively making it much more difficult to break than SHA-256. For instance, partial attacks (lowering brute force resistance) may rise in frequency in the coming decades. In this case, SHA256 would become somewhat vulnerable whereas Double SHA256 would not. The network has real-time 51% attack checkpoints. It employs an external set of parties that securely run an assisting service which guarantees the ledger’s properties and can be relied upon at times when the invested hashing power is low. The Althash blockchain implements an extendable design that can add more virtual machines (VM) if a project requires it. Miners and stakers earn rewards through the desktop wallet while a mobile-ready lightweight Althash wallet is also available. Althash developments and affiliated projects based on the Althash blockchain, like CodeX, are currently offering not only BaaS (Blockchain as a Service) but also compatible applications such as Cody (@CodexWalletBot). Cody is a wallet providing the ability to tip, airdrop, send or receive various tokens globally or room specific within the telegram messenger on mobiles or PC independent operating systems and Althash based project groups. The provision of Cody's private key can be used by all other Althash wallet implementations to reach a maximum failsafe, even on implementation layer distributed ecosystems, synergizing these groups’ efforts and solutions into an efficient ecosystem of sound cooperation leading to effective results. HTMLCOIN was founded by Amando Boncales , PhD(c), who saw in blockchain science the opportunity to create disruptive technologies which could help everyone to free themselves from a centralized system/economy. It was conceptualized in early 2013 and launched on March 8, 2014 as a Proof of Work/Proof of Stake cryptocurrency based on the Bitcoin Core algorithm under the name of HTML and then HTML5 in 2015. In 2017, a new algorithm for the coin was implemented and a coin swap was initiated in November of the same year where the HTMLCOIN name was chosen for the rebrand. Enabled through an Account Abstraction Layer, the updated HTMLCOIN environment allowed an account-based VM to function on a Bitcoin UTXO based blockchain, expended with attributes of QTUM and ARK. On top of this, a certification program is currently run by the Althash University, which provides online courses related to Blockchain Technologies and Software Development, preparing future professionals to face the upcoming challenges the cryptospace will encounter in the next decade.","links":"https://htmlcoin.com/","market_cap":188553,"market_cap_rank":3934,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/htmlcoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}