{"name":"Numi Shards","id":"numi-shards","symbol":"numi","description":"What is the project about? The Numi Ecosystem is a web3-ready platform revolutionizing gaming and entertainment, comprising Numiverse, Numi Stories, Numi Club, and Numi R. The platform offers a comprehensive solution for gamers, creators, and investors by combining web2 and web3 benefits, serving as a streaming service, NFT marketplace, and crowdfunding platform. What makes your project unique? Numi focuses on quality metaverse interactions, using the Unreal Engine for an enhanced gaming experience. The platform retains users through immersive lore, streaming service, ongoing activities, and a content-driven economy. Blockchain technology ensures security and transparency, while integrated features enable creative collaboration. History of your project. Numi Ecosystem is an upcoming project set to revolutionize the gaming and entertainment industry with its innovative platform and projects. What’s next for your project? The team is developing Numi Stories, a storytelling platform, Numi R, a VR game where players customize apartments and participate in streaming activities, and Numi Club, a project that facilitates investment in content creators. The project is in the testnet stage, preparing for the ICO and mainnet launch, involving testing, auditing, and optimizing the platform's blockchain infrastructure. What can your token be used for? The Numi economy enables participant interaction through content creation, investment, gameplay mechanics, and in-game or custom (NFT) inventory transactions. There are two token types: NUMI Shards and CF tokens. NUMI Shard is a utility token on Venom Blockchain with a maximum supply of 1,000,000,000 tokens, used in Numi Club for investing in content creators, distributing profits, and trading NFT assets, lands, and apartments. CF tokens determine the investor's revenue share when selling NFTs created during crowdfunding projects and are a modified TIP-3 standard with added revenue share logic.","links":"https://club.numi.net","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/numi-shards/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}