{"name":"Fat Cat Killer","id":"fat-cat-killer","symbol":"killer","description":"Fat Cat Killer, ticker: $KILLER, is designed specifically for use in Crypto Payment Systems and NFT platforms globally. $KILLER is also known for its involvement in Sponsoring extreme sporting events and its Multimedia branding. For example, $KILLER has already produced 3 songs from various artists from Colombia and the United States. MERCHANT PROCESSING PARTNERS Currently, $KILLER is partnered with four different Crypto Payment Systems, and more will be added periodically. $KILLER also offers a “tokens back” reward system for its customers in order to achieve its status as a preferred token of payment. BURN = 99% Fat Cat Killer launched with an initial 900 trillion-tokens supply and is executing an unprecedented, rapid burn to reduce total supply to 9 trillion tokens. The 99% burn is the highest of any token/coin in history, engineered to rapidly increase token valuation. Seven percent (7%) of token transactions will be burned. In addition, periodic Manual Burn events supercharge the burn rate. This feature (7%) is embedded into smart contracts, and can not be changed. NFT PLATFORM PARTNERS Fat Cat Killer’s catchy and creative brand lends itself for seamless integration into the NFT space. $KILLER is destined for heavy involvement in the NFT sphere using its own in-house production as well as our partnership with the Startup, [Duh!Art] As part of our marketing strategy, it will select the best of the NFT’s produced by our fat cat killer community and reward its most creative artists. Its partnership with [Duh!Art] utilizes the best platform to share its members’ creativity with the world. ALL proceeds received from [Duh!Art] will be given to the artist(s) responsible for its creation. [Duh!Art]also agreed to use $KILLER as the preferred digital currency for their platform. CHARITY Fat Cat Killer has a robust charitable mission. Although $KILLER is not a charity Token, it’s testing the hypothesis that crypto can give opportunity to those afflicted by income inequality. To do this, it partnered with [Global Empowerment Mission], a 501(c)(3) non-profit organization founded in 2011 that has supported 295 missions in 28 countries, all 50 US states, and territories including the Caribbean. $KILLER chose [Global Empowerment Mission]as a third party administrator and auditor of its donation fund for many reasons, one of which is that they have [Guidestar] Platinum Seal of Transparency. Crypto investors can feel confident their donations are held accountable to fulfill their charitable mission(s). STAKING / LOTTERY $KILLER’s version of staking is its lottery system where investors can win a variety of coveted prizes. From an iPad to a luxury watch to increasingly luxurious items, nothing is off the table. Investors must lock their tokens for a short period of time to be eligible and winners are chosen randomly via its verified smart contract algorithm. SPONSORING & MULTIMEDIA BRANDING Fat Cat Killer has been on the forefront of extreme sports by sponsoring multiple events like the Carolina Ski Race and more. $KILLER’s Colombian roots gives it access to uses to integrate its own homegrown variety of Artists into its Multimedia brand. For example, Fat Cat Killer made a unique Music Video in Medellin, which is available on its YouTube channel. More songs from other various artists will be added periodically. Multiple artists from around the world already have embraced the Fat Cat Killer brand, such as legendary Grammy Award winning musician NeYo and TV personality & DJ Blake Horstmann as you can see on YouTube Fat Cat Killer Channel.","links":"https://fatcatkiller.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fat-cat-killer/logo.png"}