{"name":"Wagie Bot","id":"wagie-bot","symbol":"wagiebot","description":"What is the project about? Bringing Multichain Sniping, Tracking, Trading, Copy Trading and Much More directly to Telegram & Discord. Wagiebot is a versatile DeFi bot operating on its own proprietary private nodes on ETH, BSC and Arbitrum with a 1ms response time, making it one of the fastest, if not the fastest, tools available on the market. Currently, we offer the following features: • Instant fetching (fastest on TG) • Anti-Mev • No cache on re-fetch • Multichain (ETH, ARB, BSC) • Contract Sniping • Liquidity Sniping • Method Sniping • Copytrading • Take Profit, Stoploss, Trailing Stoploss • A built-in Honeypot checker • Trading fees under 0.8% (0.7% under referral) • Simulation Engine What makes your project unique? WagieBot is a passion project between our private group who initially used it for personal trading but careful consideration decided to take it to the public and produce the fastest most feature rich sniper bot on the market! History of your project. We have been in development since Febuary and in Private Beta since April, with our launch to Public Beta being 10/07/2023. What’s next for your project? We will continue to push updates to add new features to our bot whilst polishing and optimizing the overall user experience, this is a passion project for us as traders so there's always something ahead! What can your token be used for? Our token provides holders a discount to fee's using a 4 tier system ranging from 500 - 2000 tokens held giving our users trading fee discounts ranging from 0.80% down to 0.40/0.30%! In addition to Copy Trade, Tracked Trades, Active Snipes, Tracking Time and Premium Group perks.","links":"https://wagiebot.com","market_cap":126666,"market_cap_rank":5901,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wagie-bot/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xd2c869382c7ac9f87ff73548d029d67c0f9dee31"}}}