{"name":"Ardor","id":"ardor","symbol":"ardr","description":"Ardor is the latest in the growing field of contenders for blockchain as a service (BaaS) providers. Ardor provides the blockchain infrastructure for businesses and institutions to leverage the strengths of blockchain technology without having to invest in developing custom blockchain solutions. Instead, Ardor offers a main chain that handles blockchain security and decentralization plus customizable child chains that come ready to use, right out of the box, for various business applications. Ardor goes beyond Nxt to solve critical issues of blockchain bloat, scalability, and customization. Nxt is a well respected, verified, and established blockchain technology with a comparatively long history and an experienced development team. However, as blockchain usage increases over the coming years Nxt, and other blockchain technologies, will face some fundamental problems with payments, scalability, and customization. The first and most straightforward problem is the use of native tokens for transaction fees. Nxt uses a forging proof of stake system, meaning that the total token supply has already been created and new tokens aren’t created with each block. Instead, the forgers that verify the blocks receive a portion of the transaction fees paid on the network. As such, the transaction fees need to be paid in NXT, even if you’ve created a new currency that’s independent of Nxt, you’ll still need to own NXT in order to pay miners, diluting the value of your own currency. To test Ardor’s capabilities and serve as an example of an operating child chain, the Ardor developers have created Ignis. Ignis will implement all of the customizable features that come from the Nxt code base. Essentially, Ignis will be a proof of concept and could be the first of many more child chains on the Ardor platform. The <a href=\"https://www.coingecko.com/en/coins/ignis\">Ignis</a> ICO recently raised $15 million in funding for development. In the future, Ardor child chains could be used to create equity trading platforms, digital file transfer services, private enterprise blockchain applications, and many more use cases. Ardor’s strengths are quick time to setup and wide customizability, making it a great option for companies looking to leverage blockchain without the resources to dedicate to custom development. Ardor has many architectural advantages. One of them and perhaps the most influential one is that it has been created using Java; one of the most widespread programming languages in the world today. This is definitely a step in the right direction seeing as it becomes ten times easier for a commercial application to succeed if the development language is one which most programmers can relate to.","links":"https://www.ardorplatform.org/","market_cap":106569313,"market_cap_rank":593,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ardor/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}