{"name":"Green God Candle","id":"green-god-candle","symbol":"ggc","description":"The Green God Candle is the first project by Delfi Labs Who & What is Delfi Labs? At DelFi Labs, we're not just another name in the crypto space; we're your fellow enthusiasts, the ones who've been captivated by the transformative power of blockchain from the beginning. Born from a collective passion for crypto, we've evolved into a dynamic force driving the crypto revolution forward. By the Community, For the Community We are the embodiment of the crypto ethos. Our team comprises seasoned crypto veterans and passionate newcomers alike, united by a shared vision: to empower the community with groundbreaking innovations, valuable insights, and genuine opportunities for growth. Innovation at the Forefront Our commitment to innovation is unwavering. We've crafted a next-gen hybrid dex that combines the best of centralized and decentralized systems, redefining the standards for efficient and transparent trading. But that's just the beginning. $GGC: A Token of the People $GGC isn't just a meme coin; it's a symbol of community-driven creativity and resilience. Designed by the people, for the people, $GGC embodies the spirit of inclusivity and collective ambition that fuels our journey. NFT Collections: More Than Just Art Our two exclusive NFT collections are more than just digital art; they're a celebration of crypto culture. Each piece is imbued with rich lore and symbolism, offering not just aesthetic value but also a unique narrative that resonates with the crypto community. Our Mission: Together We Grow As we navigate the dynamic and ever-changing landscape of the digital realm, our mission remains steadfast: to build, to innovate, and to achieve success collectively. We're here for the long haul, committed to creating lasting value and opportunities for everyone involved. Join us as we ride the waves of innovation, embrace the challenges, and seize the opportunities that lie ahead. Together, we'll build a brighter future for crypto, one innovation at a time.","links":"https://www.greengodcandle.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/green-god-candle/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x4045b33f339a3027af80013fb5451fdbb01a4492"}}}