{"name":"Stackswap","id":"stackswap","symbol":"stsw","description":"Stackswap (STSW) is the utility token across Stackswap products and networks. Built on Bitcoin via Stacks, Stackswap is the only permissionless DEX that allows users to launch their tokenized Web 3.0 projects on Bitcoin. Products like Group Farming to allow projects to reward their users, and cross-chain swaps to directly swap from USDC, Bitcoin, and Ethereum to tokens listed on Stackswap. With a founding team that led cutting-edge artificial intelligence research, Stackswap aims to use its expertise to allow AI to have greater input in Stackswap’s DAO system, and enhancing the success and activity for all those involved in the platform. .Stackswap allows for the permissionless and code-free creation of SIP-010 tokens, which are the native tokens on Stacks. These tokens can be used for access to various products such as the Stackswap Launchpad, as well as the Stackswap market prediction that is in development with AI. Stackswap was created in 2021, as part of the Stacks Accelerator’s first cohort. The whitepaper was published a few months later. Since, more products were introduced such as Group Farming and Cross-chain swaps. Currently, it has the most token pairs on Stacks. 4.In order to further encapsulate crypto ideals of permissionlessness and interoperability, Stackswap aims to bring its permissionless products to multiple chains. The ERC-20 STSW token was created in 2023 to support this move, opening up the Ethereum and Polygon chains. The platform will further develop its AI capabilities for future DAO use, and will create a full fully on-chain orderbook DEX system, in contrast to the popular hybrid on- and off-chain systems commonly in use. 5. STSW can be used to launch tokens on the token Launchpad, stake for governance power, gain early access to new projects on Stackswap, and more, including the market prediction AI algorithm that is currently in development.","links":"https://app.stackswap.org/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/stackswap/logo.png","detail_platform":{"stacks":{"decimal_place":6,"contract_address":"SP1Z92MPDQEWZXW36VX71Q25HKF5K2EPCJ304F275.stsw-token-v4a"},"polygon-pos":{"decimal_place":6,"contract_address":"0xfc77cc32e570baec16f69dded556a35811b5a6ce"},"ethereum":{"decimal_place":6,"contract_address":"0x1c98b54d673c026c8286badca3e840aaf72931a3"}}}