{"name":"1900Rugrat","id":"1900rugrat","symbol":"rugrat","description":"$RUGRAT is the official token representing the burgeoning music career of 1900Rugrat, a rising star in the hip-hop scene. More than just a meme coin, $RUGRAT provides a unique opportunity to invest in the future of a talented artist and become part of a vibrant, growing community. This isn’t just about capitalizing on a trend; it's about supporting an artist and connecting with a passionate fan base. The $RUGRAT token serves as a symbol of this burgeoning movement. Holding $RUGRAT isn't just about financial returns; it's about being part of something bigger, connecting directly with 1900Rugrat's creative journey. We’re fostering a dynamic community where fans can engage with exclusive content, participate in exciting events, and directly support the growth of the artist and his music. Our roadmap is built around providing ongoing value to holders and deepening engagement with the community. This includes [Insert 2-3 specific roadmap milestones here, e.g., Exclusive merchandise drops for token holders, VIP access to 1900Rugrat's performances and events, a portion of token profits allocated towards the artist’s music production and promotion]. These initiatives are designed to build long-term value for $RUGRAT and reinforce the token's position as an integral part of the 1900Rugrat ecosystem. The $RUGRAT token operates on a he artist and the community. For optimal trading, please ensure you set sufficient slippage on exchanges. $RUGRAT is more than just a financial investment. It's a chance to support a rising talent while experiencing the unique opportunities of the Web3 community. Join the movement, be a part of the journey, and become a Rugrat today. [Insert links to your website, Telegram, Twitter, etc.]","links":"https://pump.fun/coin/B9PtgXYe548T3nBnEJwpz1QbJmmyiuLJgkUbDiLjpump","market_cap":8859.13,"market_cap_rank":7728,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/1900rugrat/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"B9PtgXYe548T3nBnEJwpz1QbJmmyiuLJgkUbDiLjpump"}}}