{"name":"Black Hole Coin","id":"black-hole-coin","symbol":"bhc","description":"Black Hole Coin community BHC Black Hole Coin Community See More  Win up to 5M impressions! Join Now Log in and post Top Latest avatar frame Guncel Kripto @GuncelKriptoCom 路 May 19 BTC$BTC The next big move on #Bitcoin is still yet to come. Historical volatility is at all time lows... image 34 1.1K 10 8 9 47 46 avatar frame First1Bitcoin @First1Bitcoin 路 6h  ACCIDENTAL #BITCOIN TRANSFER  An accidental transfer has pushed Satoshi Nakamoto's Genesis wallet over 100 BTC$BTC ! Stay tuned for more updates on this intriguing development! Follow us on Telegram: t.me/first1bitcoin/1091 ...Read all image 18 139 4 Trader Tardigrade @TATrader_Alan 路 May 19 In late 2023, #Bitcoin surged from $26k to $73k while #DXY was giving us a Double Top Signal. NOW Double Top Signal is seen again in #DXY and DXY$DXY is trending down  This could bring BTC$BTC from $60k to $120k  ...Read all image 854 5 17 20 32 avatar frame Crypto Patel @CryptoPatel 路 20h #Bitcoin 12% Up t.me/OfficialCryptoPatel/13560 BTC$BTC image 334 5 7 Show more Black Hole Coin Markets All pairs Showing 1 - 1 out of 1 Disclaimer: This page may contain affiliate links. CoinMarketCap may be compensated if you visit any affiliate links and you take certain actions such as signing up and transacting with these affiliate platforms. Please refer to Affiliate Disclosure Black Hole Coin news More news updates are on the way... Stay tuned! About Black Hole Coin BHC (Black Hole Coin) is a brand-new token issuance protocol, initiated by the Black Hole leader BOME community and 666 medal shareholders. Its pioneering Black Hole copy order dividend protocol is unprecedented in the primary market, with an ultra-high-speed dual burning dividend deflation mode. The minimum transfer of 1 million BHC tokens into the black hole address, participating in the USDT dividend compounding, actively destroying the coin price, and the pot automatically burns and reduces deflation every day.","links":"https://blackholecoin.top/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/black-hole-coin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb12186584f74195eedc7f5e3c274c6784a000000"}}}