{"name":"LuckyBird","id":"luckybird","symbol":"bird","description":"LuckyBird is an exciting and unique addition to the world of NFTs, offering collectors a rare and valuable piece of artwork with additional utility in the metaverse ecosystem. Their original design, rarity, limited edition releases, and accessible pricing make them highly desirable to collectors and enthusiasts. LuckyBird is a metaverse project created by the Singapore-based WEMI Foundation. Lucky Bird focuses on infrastructure, economic models, and cross-game layouts. In the future, Lucky Bird NFTs may connect various different metaverse products, creating a “public chain” for the NFT world. We predict that by 2025, through BIRD, Lucky Bird will become a truly decentralized organization, with less centralized ownership of the Lucky Bird team over time. Development route The first stage • LuckyBird Metaverse Framework Building • LuckyBird Incubation Play Design • LuckyBird Dapp design • LuckyBird has entered the open beta phase • LuckyBird Social Media Build, Build Brand • LuckyBird Economy Token BIRD Incubation Output The second stage • LuckyBird NFT product design • LuckyBird NFT contact with official Binance NFT market • LuckyBird NFT for public sell • LuckyBird NFT list on the official Binance NFT market • The development of LuckyBird's metaverse has entered the second phase • LuckyBird NFT Test SDK Interface in Metaverse Ecology The third stage • LuckyBird Metaverse Guild System Development • Metaverse development • LuckyBird Metaverse System Enters Internal Testing Phase • LuckyBird Metaverse System VR Game Version • Metaverse Development API • Metaverse Project Docking LuckyBird's core team are experts from various fields such as computer, information security, communication, mathematics, finance, DeFi, NFT, Metaverse, GameFi, web development and high-frequency algorithmic trading. Based on the ecological application value of LuckyBird, we issued tokens: BIRD is an in the game token: Players buy NFT characters or upgrade items through BIRD as well as governance tokens with DAO voting rights.","links":"https://www.luckybirdus.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/luckybird/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x9f7277778c798ef0bc1debf28994eaec1af7ba24","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x9f7277778c798ef0bc1debf28994eaec1af7ba24"}}}