{"name":"Final Frontier","id":"final-frontier","symbol":"frnt","description":"Final Frontier is the largest organically grown gaming guild for the upcoming invest-to-earn, AAA quality, crypto game of Star Atlas. Star Atlas is a play-to-earn game on the Solana blockchain where players can earn NFT rewards and the $ATLAS crypto token while playing the game. It is currently in development to take full advantage of Unreal Engine 5. While they build the full game, Star Atlas released a minigame called SCORE in December 2021, where players are able to send out their NFT ships on missions to earn rewards and crypto income. Final Frontier is a professional gamers guild operating as a DAO within the Star Atlas metaverse. They are focused on digital industrial development, business relations, logistical needs, and operational security within the metaverse. On their website, you will be able to learn more about them, view their whitepapers, partnerships, and team. The organization’s mission is to generate opportunities through existing protocols for the blockchain gaming community by creating additional asset utilization through integration of the FRNT token to the rapidly growing virtual economy, whilst sharing its rewards with Final Frontier members, investors, and partners. FRNT is the native governance token of the Final Frontier DAO, with many utilities such as DAO voting and community rewards and contests. On the Final Frontier website, viewers can read up on the distribution of funds and instructions on how to participate in the coming IDO. They have a detailed 31-page economics whitepaper that goes in-depth on the Tokenomics of FRNT, including Final Frontier's road map and business model. All founders and team members who received FRNT have already had their allocation of FRNT tokens locked up in a verifiable smart contract for two years, then vested afterwards for an additional two years.","links":"https://finalfrontiersa.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/final-frontier/logo.png"}