{"name":"Nuon","id":"nuon","symbol":"nuon","description":"What is the project about? Nuon is about safety and transparency and creating a solution for actually hedging against inflation. It’s also about taking advantage of arbitrage opportunities. And we do that by using unbiased inflation metrics and creating a coin capable of holding its value during periods of inflation. Ultimately, our goal is to turn Nuon into the best purchasing power shield in the world. What makes your project unique? The Nuon protocol is home to the first flatcoin and the only place Nuon can be minted and burned. The uniqueness comes from being the first of its kind and solving a pressing market issue: purchasing power affected by inflation. Nuon is different because we gave up using outdated methods to determine the inflation index. Instead, we use the Truflation index of real, unbiased, authentic, and daily inflation data. To get an idea of how accurate and transparent this method is - Truflation is built on over 10+ million data points, and indices are updated daily. This is a major change compared to the way government inflation metrics gather data. Nuon is unique because it’s not pegged to any fiat, and that means neither inflation nor regulations can affect it. That’s what makes it better than the rest of the stablecoins, which are pegged to fiat, and thus vulnerable. History of your project. It all started in June 2021, when the idea of a decentralized inflation-proof flatcoin was born. In August of that same year, we started working on the design once we had the concept. First, we built out the main elements of Nuon, including the Collateral Hub, Boardroom Governance, and Treasury. Then, in September – December 2022, our testnet was live. So we handled smart contract testing and modeling using historical price data. Also, in September 2022, we passed another essential threshold – the Coinfabrik audit. All that led to where we are now – the Nuon flatcoin mainnet having been launched What’s next for your project? We have ac","links":"https://nuon.fi/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/nuon/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0xfb9fed8cb962548a11fe7f6f282949061395c7f5"}}}