{"name":"Ulord","id":"ulord","symbol":"ut","description":"Ulord is a peer-to-peer value transfer public blockchain. Through building its blockchain underlying architecture and digital resource distribution protocols, it enables third-party developers to explore their own applications over open-source agreements to form a complete ecology of blockchain technology and applications. Based on various rules and protocols created by Ulord, it loads various types of digital resource application scenarios including text, pictures, music, video and software, providing a direct docking platform for information creators and consumers. Ulord Foundation, registered in Singapore, is the main operator of the Ulord project. It is determined to use the blockchain technology to create a new digital resource interaction platform. Ulord Foundation will standardize and manage the technology development, application docking, promotion and other related work of the Ulord Project. Ulord team brings together a large number of high-level R & D personnel led by more than 10 PhDs, with comprehensive blockchain technology application development capabilities. More than 50 excellent programmers and algorithm engineers in the technology development team have backgrounds in areas such as blockchain, cryptography, Internet information security, big data, cloud computing, artificial intelligence, finance, and management. There are senior scientists in cryptography and blockchain, and specialized blockchain project investors. In addition, Ulord team also maintains close cooperation with research institutes such as Windsor University in Canada, National University of Defense Technology, Wuhan University, Beihang University, Chinese Academy of Sciences and South China University of Technology, etc.","links":"https://ulord.one/","market_cap":297262,"market_cap_rank":4138,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ulord/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}