{"name":"PengyOS","id":"pengyos","symbol":"pos","description":"PengyOS is a meme community on Solana, and their website represents the culture they take great pride in, it simulates an operating system. Initially, their founder, who is also an amateur developer, built the website with the help of ChatGPT and based on open-source project from GitHub, aiming to satirize meme coins that have no real utility. The project was fair-launched on Pump.fun on March 20, 2024. This is a purely community-driven project. When the founder started it, he only had $65 left in his pocket, far from enough to normally launch a meme coin. That’s when he found Pump.fun and fair-launched the project, without any team members. He never expected so many people to resonate with the project and its story. As more community volunteers joined, the project stood out and gradually grew into what we see today. Now, they’ve evolved into a diverse meme community. Whether you're new to crypto, a seasoned trader and investor, or a gaming addict, they aim to be your all-in-one hub for a smooth and enjoyable experience. In PengyOS, users can access various dApps, fun apps, browse crypto news, check out memes, play games, and even listen to their rap album. Yes, you read that right, they have a rap album, and it’s available on platforms like Apple Music, Spotify, and YouTube Music. They’ve also created their own decentralized chat service called PengyChat, which adds even more character to PengyOS. They were also invited by Solana Mobile to develop the PengyOS mobile app for their SAGA and Seeker phones, and it’s already live on the Solana Mobile app store, more collaborations with Solana Mobile are coming soon. But have to say that their desktop version offers a better experience for now. This project is full of narrative, their founder isn’t a professional developer, coding is just a hobby for him. Without GitHub open-source projects, ChatGPT, and Pump.fun, PengyOS wouldn’t exist. Thanks to the growing support of community volunteers, the project has reached new heights. Of course, it hasn’t been without its challenges, there were some fake volunteers who tried to mess things up for them, but they overcame those obstacles one by one. A story wouldn’t be interesting without some hurdles, right? Through all the ups and downs, the founder is still here, the OG volunteer team is still here, and the story continues, just like the song from their album - Road to Billions.","links":"https://pengy.fun","market_cap":78357,"market_cap_rank":6287,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pengyos/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"B8vV6An7xFF3bARB1cmU7TMfKNjjes2WvY7jWqiRc6K6"}}}