{"name":"Squid Game","id":"squid-game","symbol":"squid","description":"What is the project about? SQUID Game (SQUID) originally started as a meme coin on the Binance Smart Chain, but is now following in the footsteps of prominent coins such as Bitcoin ($BTC), Dogecoin ($DOGE), and Shiba Inu ($SHIB). A token with no founder team, it is fully driven by its communities. Squid Game V2 Token (SQUID), evolving from a BNB Smart Chain meme token to an innovative OFTV2-powered coin, is now community-owned and leaderless. United by passion, our volunteers have revitalized SQUID, promising a future of secure cross-chain interoperability and growth. The transition from SQUID V1 to SQUID Game V2 (SQUID) marks a pivotal shift towards heightened security and trust. The SQUID V1's proxy contract presented vulnerabilities that we've decisively addressed with SQUID V2. Unlike its predecessor, SQUID V2 is built with non-upgradeable contracts, eliminating the central point of control and making unauthorized alterations impossible. This fundamental change, combined with the innovative cross-chain capabilities provided by LayerZero, fortifies our ecosystem against the past vulnerabilities. History of your project. The original SQUID token experienced a dramatic and unfortunate start, leading to significant losses for early adopters and casting a shadow over the project’s future. Recognizing the potential for redemption, the community rallied together, proposing a migration to a new token — SQUID V2. This migration was not merely a technical update but a complete reimagining of the token’s purpose and potential, integrating OFTV2 technology for seamless cross-chain interoperability. Most importantly, this migration of the SQUID token to a new, more secure smart contract on the BNB Smart Chain (BSC) is essential for addressing the security risks associated with the current proxy contract. This strategic move aims to eliminate vulnerabilities, prevent potential manipulations, and ensure alignment with the highest standards of token security.","links":"https://squidgameholders.club","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/squid-game/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xfafb7581a65a1f554616bf780fc8a8acd2ab8c9b"},"base":{"decimal_place":18,"contract_address":"0xfafb7581a65a1f554616bf780fc8a8acd2ab8c9b"}}}