{"name":"Squid Game","id":"squid-game","symbol":"squid","description":"What is the project about? SQUID Game (SQUID) originally started as a meme coin on the Binance Smart Chain, but is now following in the footsteps of prominent coins such as Bitcoin ($BTC), Dogecoin ($DOGE), and Shiba Inu ($SHIB). A token with no founder team, it is fully driven by its communities. What makes your project unique? History of your project. The advent of blockchain technology has revolutionized the way we perceive value and trust. While this technological evolution continues to unravel exciting possibilities, it's also come with challenges - including scams, which can leave investors with significant losses. One such unfortunate event was the rug-pull incident involving SQUID Game (SQUID) on the Binance Smart Chain (BSC) in November 2021. A passionate and committed team of community volunteers has breathed new life into the SQUID project, rescuing it from its unfortunate past and steering it towards a promising future. They're launching the expansion of SQUID Token on the Ethereum Mainnet, and it's packed with some seriously impressive features. This is a genuine resurrection and a redemption story like no other! What’s next for your project? SQUID is expanding to the Ethereum Mainnet. SQUID ETH Mainnet is a revolutionary step forward in the SQUID journey. This development aims to offer a wider range of possibilities for its holders by opening up new ecosystems and opportunities. The expansion of SQUID to the Ethereum Mainnet is designed to enhance the value and usage of SQUID, without causing any dilution to the SQUID on the Binance Smart Chain. The token's smart contract is designed to be rug-free, with a unique safety mechanism reflecting our collective experiences as past victims of scams. A total of 488 million SQUID tokens have been minted on the Ethereum Mainnet, catering to various strategic requirements and utilities. We have approximated this value to the blacklisted wallet addresses SQUID amount. What can your token be used for?","links":"https://squidgameholders.club","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/squid-game/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x87230146e138d3f296a9a77e497a2a83012e9bc5"},"base":{"decimal_place":18,"contract_address":"0x430c67ed118f0637ffe74c98e9b90919c93b7233"},"ethereum":{"decimal_place":18,"contract_address":"0xf823fd9ac0abb8d779076a41daa049844299f6ed"}}}