{"name":"Waygate","id":"waygate","symbol":"way","description":"The Waygate is a comprehensive platform that combines advanced 3D scanning technology, artificial intelligence, and blockchain integration to enable users to effortlessly create unique 3D models of real-world objects and transform them into exceptional 3D NFTs. The Waygate is a revolutionary platform that seamlessly integrates cutting-edge 3D scanning technology, artificial intelligence, and blockchain integration to empower users in creating stunning 3D models of real-life objects. With the convenience of a smartphone and the support of an advanced cloud-based 3D rendering engine, users can effortlessly capture and process up to 200 images, guided by an intuitive progress bar and the option of automatic or manual camera capturing modes. The platform offers a range of customizable options, allowing users to fine-tune their models based on preferences such as model quality, texture quality, and a selection of popular 3D file formats. Additionally, the integration of artificial intelligence object masking technology ensures accurate identification of the primary subject, removing background noise for enhanced results. Enhanced by the power of blockchain technology, The Waygate provides a dynamic web-based multichain social marketplace platform synchronized with mobile applications. This ecosystem fosters a social environment where creators can showcase their talent through personalized profiles and engage with the community through real-time notifications, likes, comments, and sharing. The platform supports the creation of truly unique and exceptional 3D NFTs, offering two token standards: ERC-721 for one-of-a-kind digital assets and ERC-1155 for fractional ownership. With The Waygate, creators have the ability to mint their meticulously scanned 3D models as distinct tokens, unlocking unparalleled exclusivity and opening up new possibilities in the world of digital art and collectibles.","links":"https://www.thewaygate.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/waygate/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xfdedd42a446bf6c5a883727cda6ff557511e3e1e"}}}