{"name":"Illuvium","id":"illuvium_ethereum","symbol":"ilv","description":"Illuvium is a decentralized franchise of interconnected, high-quality games built on the Ethereum network. Its main value proposition is to merge high-production-value gaming with verifiable digital asset ownership, known as the play-to-earn model. The project is an open-world fantasy role-playing game where players capture collectible creatures called Illuvials, which are represented as non-fungible tokens (NFTs). The project's economic model mandates that 100% of the game’s generated revenue is distributed back to those who stake the project's native token. Illuvium achieves scalability and efficiency by processing the majority of its transactions, including NFT minting and trading, on Immutable X. This is a Layer 2 scaling solution that utilizes Zero-Knowledge Rollups (zk-Rollups), a technology that bundles hundreds of transactions off-chain and sends a cryptographic proof of their validity back to Ethereum. This method allows the game to achieve high speeds and eliminates gas fees for players while maintaining Ethereum's core security. Key features include an interoperable game universe where digital assets are designed to be used across multiple titles, as well as the ability for players to trade assets on the IlluviDex marketplace with zero transaction fees. The ILV token serves as the primary utility and governance token, allowing holders to participate in the project's Decentralized Autonomous Organization (DAO) to vote on future development and economic policies. Token holders can stake ILV to earn rewards funded by in-game revenue, and a synthetic version of the token is used as in-game currency. The project was co-founded by brothers Kieran and Aaron Warwick, with development backed by early venture capital firms like Delphi Digital and IOSG Ventures. Key partnerships are in place with Immutable X for its core Layer 2 infrastructure and Chainlink for a decentralized oracle used to ensure fair randomization in gameplay.","links":"https://illuvium.io/","market_cap":55633054,"market_cap_rank":599,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/illuvium_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x767fe9edc9e0df98e07454847909b5e959d7ca0e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x767fe9edc9e0df98e07454847909b5e959d7ca0e"}},"is_native":false}