{"name":"loner","id":"loner","symbol":"loner","description":"LONER is a meme token centered around a peaceful, guitar-playing frog character that resonates with introvert culture and solitary moments. The project's core theme revolves around \"need peace\" and celebrates chosen solitude rather than forced isolation. Through minimalist art and relatable meme content, LONER captures universal experiences of seeking quiet spaces and finding comfort in alone time. The token's identity is built on simple, non-confrontational visuals that feature the frog character in various peaceful settings - from late-night coffee runs to quiet reading nooks. This creates a unique position in the meme token space by focusing on calm, introspective moments rather than high-energy or aggressive themes. LONER's community approach emphasizes authentic engagement over hype, bringing together individuals who relate to introvert experiences. The project has developed a successful meme format that combines gentle humor with universal situations like avoiding social interactions, finding peaceful spots, and embracing solo activities. The project's visual content strategy includes simple sketched backgrounds, peaceful locations, and solo moments that resonate with the community. Content themes range from everyday scenarios like mobile-ordering coffee to avoid small talk, to more existential moments like finding peace in solitude. This approach has proven successful by tapping into shared experiences while maintaining a unique, peaceful identity that sets LONER apart in the meme token landscape. LONER ironically brings loners together through shared experiences and relatable content, creating a community that understands and celebrates the value of chosen solitude. The token has established itself by maintaining consistent peaceful vibes while delivering content that connects with both casual introverts and dedicated solitude seekers.","links":"https://lonersol.xyz","market_cap":62834,"market_cap_rank":8166,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/loner/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"EGMuM8qhWTzTEa9P75DuT3G4DNVsexWww7fp1vo8pump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/EGMuM8qhWTzTEa9P75DuT3G4DNVsexWww7fp1vo8pump"}}}