{"name":"DePhyneAI","id":"dephyneai_solana","symbol":"dphyai","description":"DePhyneAI is a decentralized physical AI infrastructure enabling autonomous devices such as drones, robots, and edge sensors to perform intelligent tasks while earning rewards in the native token, $DPHY. The network is permissionless, community-owned, and designed to bring scalable, secure AI computation to the edge of the real world. 1. Introduction Artificial Intelligence has historically been confined to centralized cloud platforms. However, as physical devices grow more capable, the future lies in enabling intelligence directly on the edge - embedded in the real world. DePhyneAI empowers a decentralized network of autonomous agents to train, infer, and collaborate - creating a self-sustaining AI ecosystem governed by a native token economy. What is DePhyneAI? DePhyneAI is an open, decentralized network where physical devices act as nodes. Each device contributes compute, data, or services and is rewarded in $DPHY tokens. The network supports: Federated learning and on-device AI inference Secure blockchain-based coordination Real-time decision-making in physical environments Use Cases DePhyneAI supports diverse real-world applications: Logistics: AI-enabled autonomous drone deliveries Agriculture: Monitoring soil, crop health, irrigation using robotic systems Smart Cities: Surveillance, traffic analysis, energy optimization Disaster Response: Real-time aerial monitoring and situational AI Why $DPHY Matters The $DPHY token is the lifeblood of the DePhyneAI network. It serves multiple purposes: Rewards: Earned by node operators who run AI tasks Access: Used to access AI models, data feeds, and services Governance: Voting and proposal mechanisms Staking: Ensures quality and uptime guarantees","links":"https://dephyneai.xyz/","market_cap":2953.14,"market_cap_rank":12920,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dephyneai_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"8K7RyMz4tqtFN9HyXv7imjGGpC9aXbXjarBWSmbNpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/8K7RyMz4tqtFN9HyXv7imjGGpC9aXbXjarBWSmbNpump"}},"is_native":false}