{"name":"Katana Inu","id":"katana-inu","symbol":"kata","description":"Katana Inu is a play2earn metaverse NFT-Game in an interactive openworld - All skins and weapons are NFTs. A project that focuses on driving Gaming & NFT crypto innovation through its innovative game offerings with auto staking in in-game reward method. In our game the players can fight for NFTs wich will be airdroped in the game, and can be sold at the marketplace or the player can wear it in the game. The best players in the game per round will earn rewards. Katana Inu is one of its own kind project using Defi protocols to provide its users with the best gaming experience in the blockchain space with its PC-Graphics game which is an open world Battle royal with NFTs. Katana Inu game, all in-game items will be NFTs it will be, play2earn with free2play for all in an open world map team vs team or 1 vs all to increase the awareness of the NFTs around the world. Katana Inu also Provide its user's an NFT-marketplace on layer 2 solutions on Eth which allows artist from around the world to mint their NFTs with 0% of the Gas fee. Katana Inu will also allow other games to integrate with its NFT-Marketplace and use NFTs as their in-game items. Katana Inu also use Defi protocols to allow its users with high Apy with its staking mainnet.","links":"https://katanainu.com/","market_cap":6470281,"market_cap_rank":2153,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/katana-inu/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2e85ae1c47602f7927bcabc2ff99c40aa222ae15","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2e85ae1c47602f7927bcabc2ff99c40aa222ae15"},"base":{"decimal_place":18,"contract_address":"0x02454a97a8372f3a760a033dbb39e67d73bd6d87","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x02454a97a8372f3a760a033dbb39e67d73bd6d87"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0x6d6ba21e4c4b29ca7bfa1c344ba1e35b8dae7205","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x6d6ba21e4c4b29ca7bfa1c344ba1e35b8dae7205"}}}