{"name":"blockbank","id":"blockbank","symbol":"bbank","description":"What is blockbank ($BBANK)? Blockbank is the ultimate all-in-one financial management platform providing investors with seamless access to centralized finance, decentralized finance, and neo-banking. This \"banking 3.0\" platform gives users a crypto-friendly bank account, allowing them to easily manage and transact in both fiat and cryptocurrency, providing them with the freedom to move their money as they see fit. With a wide range of features, a user-friendly interface, and the convenience of having everything in one place, blockbank is the new standard for modern financial management. blockbank has been at the forefront of innovative financial management since 2018, regularly updating and improving its platform to meet the needs of its growing user base. The latest version of the platform is no exception, boasting new security measures in partnership with Fireblocks and expanded trading options across multiple networks such as Ethereum, Binance, Tron, Cardano and Avalanche. The user-friendly interface allows for easy access and management of a diverse range of assets, making blockbank the go-to choice for forward-thinking investors. blockbank is dedicated to providing its users with the latest and most innovative financial products and services. One way it achieves this is through continuous cultivation of partnerships with leading crypto projects. These partnerships allow blockbank to stay ahead of the curve in the digital currency industry and offer its users access to cutting-edge financial solutions. Beyond a user-friendly interface and secure platform for managing assets, blockbank's focus on building strong partnerships is a key element in its commitment to delivering the best possible experience for its users. In short, blockbank is sophisticated made simple. Its powerful ecosystem is carefully balanced with a simple interface making it easy for both experienced and novice investors to grow and manage their finances. blockbank is the ultimate tool for m","links":"https://blockbank.ai/","market_cap":531565,"market_cap_rank":3101,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/blockbank/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xf4b5470523ccd314c6b9da041076e7d79e0df267"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf4b5470523ccd314c6b9da041076e7d79e0df267"}}}