{"name":"Multiport","id":"multiport","symbol":"port","description":"Seamless cross chain trading in your pocket: Bridging blockchains Unlocking Boundless Possibilities: Bridging Blockchains seamlessly through Multiports Telegram Bot. What is Multi Port , and how does it work? Multi Port is a cutting-edge platform that allows users to seamlessly exchange digital assets across multiple blockchain networks. It operates as an intermediary, connecting different blockchains and utilizing the liquidity from centralized exchanges (CEXes) to facilitate asset swaps to the desired blockchain. Users interact with the bot via Telegram, selecting input and output tokens and chains to initiate an exchange. Which blockchain networks are supported by Multi Port? Multi Port supports a wide range of blockchain networks, including Ethereum, Binance Smart Chain (BSC), Polygon (MATIC), Solana, and more. The platform is continually expanding its supported networks to enhance accessibility and interoperability, ensuring users have access to a diverse set of options for their transactions. Is there a revenue share? Starting from today, all Multiport token holders will receive a percentage of the platform's revenue generated through transaction fees. This revenue share program aims to reward our loyal community members and incentivize long-term participation in the Multiport ecosystem. How much can you earn? The revenue share will range between 0.4% to 0.5% of the total fees collected on the Multiport platform. This means that the more Multiport tokens you hold, the higher your potential earnings! How to participate in revenue sharing? To benefit from the revenue sharing program, simply ensure you hold Multiport tokens in your wallet. There is no additional action required or minimum token threshold to qualify. Rest assured, our smart contract will automatically distribute the revenue share to eligible token holders on a regular basis.","links":"https://www.multiport.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/multiport/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3eef95e483b0a013d34b9482c6f4afcbd4d38146"}}}