{"name":"DEEPSPACE","id":"deepspace","symbol":"dps","description":"DEEPSPACE is a Play-to-Earn space multiverse exploration strategy game Earn passive income from holding $DPS, trading proprietary, upgradeable, smart NFTs, and taking risks as you explore DEEPSPACE with your fleet of ships! Prepare to explore, harvest, and fight your way through the DEEPSPACE universe! DEEPSPACE - Outpost One of the crown jewels of the DEEPSPACE Metaverse is the Outpost. The Outpost is a decentralized exchange hub where you can buy, sell, and trade your ships, cores, and other upgradeable Smart NFTs with fellow explorers. You can use the marketplace to build limited edition ships and acquire other valuable collectible assets. Build up your fleet to explore, harvest, and fight your way through the DEEPSPACE universe! Players buy and sell land, weapons, spacecraft and other items to help them in exploring the platform in the marketplace. Players can gain value as they advance in the game and grow their ship fleet. The custom decentralized app (dapp) marketplace is integrated with the rest of the DEEPSPACE (DPS) platform to allow for quick connection players looking for items to trade to help further their progress in the metaverse game. Ship modifications, whether temporary or permanent, can all be transacted on the marketplace. DEEPSPACE - Game Game assets such as ships and equipment are blockchain NFTs, allowing gamers to have full ownership over all of their in-game assets. Players can mint their own starships or purchase from the proprietary NFT marketplace, and choose up to 4 ships from their fleet to the start of the game to explore, engage and discover planets, places and players within the 3D space-based metaverse. Four starship archetypes allow you to explore the universe openly, engage in combat, or mine resources: Fighters - Ships with state of the art weapon technology Tank - Ships designed for managing enemy engagements, longevity, and withstanding damage. Mining - Ships specially engineered for efficient resource collection Support - A ship focused on utility and boosting the capabilities of your other ships. Each ship has their own benefits in the form of 8 different stats: attack, special attack, shields, special defense, speed, luck, mining, and health. Players can apply permanent and temporary modifications as they play. Modifications allow for many added battle benefits, situational adaptability and other stats. Temporary modifications give players single use bonuses during gameplay with specific use and unique outcomes. Resource mining allows players to gather raw materials, like ore, for ship or property add-ons and modifications. Mined materials will allow you to customize your ships, creating a unique experience for anyone who plays. Battles occur frequently within the game, battles can take one of two forms: Player vs Player (PvP) - PvP will allow others to battle against each other for prizes, leaderboard placement, and bragging rights. Player-vs-Enemy (PvE) - PvE involves battling Non-Playable Characters (NPCs; i.e. game-based Artificial intelligence (AI) players) throughout the game as a mechanism for winning rewards that can yield profits for earnings.","links":"https://deepspace.game/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/deepspace/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xb7b1570e26315baad369b8ea0a943b7f140db9eb"},"binance-smart-chain":{"decimal_place":9,"contract_address":"0xf275e1ac303a4c9d987a2c48b8e555a77fec3f1c"}}}