{"name":"Acorn Protocol","id":"acorn-protocol","symbol":"acn","description":"1. What is the project about? Acorn Protocol is a decentralized, trustless and automated solution for organizing large-scale labor forces based on a Decentralized Autonomous Organization (DAO) model, with the goal of creating a global labor market, enabling seamless collaboration regardless of location or time. 2. What makes your project unique? Acorn Protocol stands apart with its strategic blockchain application, fostering global collaboration. It has demonstrated a broad range of task handling capabilities, engaging in various tasks such as autonomous driving-related data processing/collection/classification, target recognition, CAPTCHA, and project promotion. 3. History of your project Since early 2019, Acorn Protocol has made significant strides, launching Acorn Box - a wallet designed for data collection and annotation. The platform has consistently enhanced its features and functionalities. In 2021, the protocol introduced ByteBridge, a SaaS connected to the ecosystem. By 2023, it reached a significant milestone, with over 126 million tasks completed through Acorn Box by an impressive user base of approximately 451K participants. 4. What’s next for your project? Acorn Protocol plans to improve existing solutions while exploring new blockchain applications. Key upcoming developments include the launch of Acorn DAO and Governance Token, integration of Generative AI technology, and unveiling of the Open Labor Marketplace, reinforcing its commitment to a global, decentralized labor market. 5. What can your token be used for? The Acorn Protocol token is a reward for users contributing to tasks. The token can be used within the ecosystem to access data or partake in projects, fostering active user participation and contributing to the overall success of the protocol.","links":"https://acorn.eco/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/acorn-protocol/logo.png","detail_platform":{"":{"decimal_place":18,"contract_address":"0xae029c56741d9500c04400489c47d144bcc50e39"}}}