{"name":"8Bit Chain","id":"8bit-chain","symbol":"w8bit","description":"What is the 8Bit Chain? The 8Bit Chain Project is a layer 1 blockchain protocol and a comprehensive DeFi ecosystem. It encompasses its launchpad, DeFi exchange, deflationary NFTs, NFT marketplace, KYC/audit protocol, DAO governance, and more. All these components have already been rolled out as part of the project. What makes 8Bit Chain unique? Our project stands out as the first DeFi initiative that offers a complete range of DeFi products and services, all operational from day one on BSC, ETH, and our dedicated blockchain. History of 8Bit Chain. The project has a rich history, involving the development of numerous platforms over the last two and a half years. Following this period, we successfully launched our BSC and ETH pairs. What’s next for 8Bit Chain? With our testnet and over 8 Dapps already rolled out, along with our active BSC and ETH pairs, the next steps for our project include the launch of our mainnet and native coin. Additionally, we have exciting events planned and will introduce more upgrades to enhance all our live products. What can 8Bit Chain be used for? Our token holds versatile utility within our ecosystem. It can be utilized for purchasing NFTs on our marketplace, raising funds through our launchpad, serving as liquidity in our chain, acting as a listing fee on ProPAD, ProTrackers, and ProDEX, as well as for audit/KYC fees on ProAssure. Additionally, it can be used for promotional activities in collaboration with our partner lounges and more.","links":"https://8bitchain.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/8bit-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xbc6378faae98fb2207bb6c35c0f8ce5846fd4c6c"},"ethereum":{"decimal_place":18,"contract_address":"0xbc6378faae98fb2207bb6c35c0f8ce5846fd4c6c"},"solana":{"decimal_place":9,"contract_address":"GPs2XbyDcqobdupeXpKaB2ECwgkF5ev4x8GsSr9EMRRp"}}}