{"name":"Veloce","id":"veloce-vext","symbol":"vext","description":"WHAT IS VEXT? VEXT is an ERC-20 governance and utility token that allows its holders to interact with various GameFi products within VEXTVERSE dApp (Veloce ecosystem). Holders can also transact across games and live sports features, receiving rewards like tokens, merchandise, tickets to real-world events and more. The dApp, powered by VEXT, developed in conjunction with Veloce partners, completes the brand transformation into a decentralised community and offers additional utility to onboard users and rewards early adopters. WHAT IS VELOCE MEDIA GROUP? Veloce Media Group is the world's leading digital racing media network. It has entered the Web3 space with the launch of its dApp (VEXTVERSE) and governance & utility token (VEXT). The dApp utilises the token which empowers the Veloce community to influence and govern key decentralised assets within the Veloce brand, which includes Veloce Esports (a top gaming and racing platform) and Veloce Racing (the Extreme E championship team). With the largest digital racing audience globally, reaching 37+ million subscribers and 650M+ monthly views, Veloce is leveraging its extensive reach and credibility to promote mass adoption within Web3. WHAT MAKES VEXT UNIQUE? VEXT is built on top of an existing gaming and sports media company that has been operating for 6+ years as a business, with an established audience, Intellectual Property (IP) and real-world sporting assets. VEXT is one of the first examples of disrupting the ownership model of traditional sporting and entertainment media groups. In today’s world sport plays a pivotal role in society. Sports contains the largest and most passionate fanbase in the world. However, as the industry has evolved, teams have become more centralised, leaving fans left on the side. We want to empower the next generation of fandom amongst gamers and motorsport enthusiasts, and VEXT allows us to do just that!","links":"https://www.velocemediagroup.com/","market_cap":8464663,"market_cap_rank":1512,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/veloce-vext/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x27842334c55c01ddfe81bf687425f906816c5141"},"ethereum":{"decimal_place":18,"contract_address":"0xb2492e97a68a6e4b9e9a11b99f6c42e5accd38c7"}}}