{"name":"Exactly Wrapped Ether","id":"exactly-weth_optimistic-ethereum","symbol":"exaweth","description":"What is the project about? Exactly is a decentralized and open-source DeFi protocol that allows users to exchange the value of their crypto assets through deposits easily and borrows with variable and fixed interest rates. What makes your project unique? Unlike other fixed rate protocols that determine fixed rates based on the price of various maturity tokens, Exactly Protocol is the first to determine fixed rates based on the utilization rate of pools with different maturity dates. This means the protocol does not need a custom AMM to trade maturity tokens; it only needs a variable rate pool that consistently provides liquidity to the different fixed rate pools. History of your project: Exactly Protocol was started in July 2021, launched to Ethereum Mainnet in November 2022, and to Optimism in March 2023 by a team of stakeholders with software, economics, finance, and math expertise. Exactly was funded by long-term capital partners with a track record of alignment with Web2 and Web3 ecosystems. Some of our current investors are Kazsek, BairesDAO, NXTP, Newtopia, Kain Warwick (Co-Founder of Synthetix), Esteban Ordano (Co-Founder of Decentraland), Matias Woloski (Co-Founder of Auth0), Daedalus among others. What’s next for your project? Continue growing following Optimism’s Superchain approach and partner with web3 projects and web2 fintech in the long term to bring the benefits of Defi to the end-user. What can your token be used for? exaWETH is an exa-voucher. Users can supply their assets and increase the liquidity of the Variable Rate Pool, which will, in turn, provide liquidity to all the different Fixed Rate Pools as needed. Each deposit will mint an \"Exactly Voucher\" (exaVoucher) that uses the ERC-4626 standard, which will be provided to the user as a voucher for the deposited amount. These exaVouchers will periodically accrue variable earnings by increasing their value when withdrawing and exchanging back for the underlying assets.","links":"https://exact.ly/","market_cap":1187179,"market_cap_rank":3548,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/exactly-weth/logo.png","detail_platform":{"optimistic-ethereum":{"decimal_place":18,"contract_address":"0xc4d4500326981eacd020e20a81b1c479c161c7ef","geckoterminal_url":"https://www.geckoterminal.com/optimism/tokens/0xc4d4500326981eacd020e20a81b1c479c161c7ef"}},"is_native":false}