{"name":"Bliffy","id":"bliffy_solana","symbol":"bliffy","description":"BLIFFY is a community-driven meme coin launched on the Solana blockchain, serving as the playful yet purposeful entry point into the BLIFE Protocol's expansive Bitcoin-based Web3 ecosystem. Bliffy was created by the team behind Blife, a \"Proof of Valuable Work\" protocol backed by Animoca Brands that is driving Bitcoin innovation as a foundational Web3 ecosystem.The core team is composed of blockchain engineers, gaming experts, and community builders in the crypto space for the past decade. What Makes Bliffy Unique? Bliffy is more than just another meme coin. While it embraces humor and community culture, it’s helping users learn, earn, and engage with Web3 — especially experiences built in the Bitcoin Ecosystem. Bliffy’s uniqueness lies in: AI Agent Personality: An interactive AI mascot, acting as a playful guide to the BTC and the Blife ecosystem. Coinhunt & Gamified Engagement: Through Challenges, storytelling, and meme-driven tasks the community can earn rewards and learn about the story of BLIFFY, the robot that got lost in the city of Pumpopolis and is trying to go home to Bitcoin with scrambled memories. A burn-to-earn mechanism will soon allow $BLIFFY holders to convert their tokens into $BLIFE the token of the BLIFE protocol. Launched on the 9th of April 2025 with close to 80 % of the supply to the community, Bliffy is here to reward active participants in the Blife ecosystem (users having minted a Blife ID and on the leaderboard of the platform) were eligible to claim as well as partner communities. Coin Hunt details: To join, one must hold at least 42k $BLIFFY tokens throughout the entire event! During 5 weeks, players will have the opportunity to solve 5 enigmas and earn a share of rewards. Reward breakdown – 42M $BLIFE total rewards 1st enigma: All participants who solved it share 5% of the pool 2nd enigma: First 5,000 to solve it share 10% 3rd enigma: First 5,000 to solve it share 15% 4th enigma: First 5,000 to solve it share 20% 5th enigma: First 5,000 to solve it share 20% For the grand prize lottery 100 winners will share 30% of the pool. The more enigmas you solve, the more rewards you win! Solve enigmas, find tokens, and earn rewards in this interactive on-chain adventure! For more info: https://bliffy.ai/coin-hunt As of launch, BLIFFY is available on decentralized exchanges on the Solana blockchain, such as Jupiter and Raydium. Listings on centralized exchanges are planned as the ecosystem and community expand. $BLIFFY is a meme but also a game, a movement, and a financial experiment to see if we can use crypto, storytelling, and trust-building to create real value. Website: https://bliffy.ai/ - Learn the story of Bliffy Telegram: http://t.me/Bliffy_By_Blife","links":"https://bliffy.ai/","market_cap":33559,"market_cap_rank":8827,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bliffy_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"BLiFF7FoZrs9AMnZnn8dXn89wybGiFgQtpRDqMsdLQF","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/BLiFF7FoZrs9AMnZnn8dXn89wybGiFgQtpRDqMsdLQF"}},"is_native":false}