{"name":"7Pixels","id":"7pixels","symbol":"7pxs","description":"## What Is 7Pixels and their mission? 7Pixels is an NFT marketplace. 7 Pixels will be a new frontier of a truly democratized NFT metaverse economy. It\"s fulfilling this vision through a variety of different ways , such as redefining the value of NFTs to enhancing user’s experience and ultimately creating value for all stakeholders. The mission of 7Pixels is to open up the vast potential within the Metaverse and NFT niche to maximize value for every user. To also be a frontier of a decentralized metaverse economy by redefining the value of NFTs, enhancing the metaverse experience, and enabling value-creation for all participants. ## How Many 7PXS Coins Are There in Circulation? 7Pixels is launching with 300 Million 7PXS tokens created on BSC blockchain. ### Where Can I Buy 7Pixels tokens (7PXS) ? 7PXS is available for trading on Lbank exchange. ### What is the utility of the 7Pixels tokens (7PXS)? 7Pixels' native token will be used for governance, carrying out NFT transactions, and will be instrumental in accessing the platform's services and products. Staking Rewards: Lock $7Pixels tokens to unlock staking rewards Holders can lock 7Pixels tokens in the platform's staking program and earn passive income and staking rewards for contributing to various liquidity pools. DAO Governance: Decide the future and direction of 7Pixels 7Pixels' goal is to become a completely decentralized, community-driven NFT marketplace. Holders of $7Pixels will have voting rights and the power to leverage their token holdings to debate, propose, and vote on all modifications to the platform. Liquidity Pool: Benefit from DeFi solutions 7Pixels token holders will also be able to stake on their favorite NFTs in the 7Pixels liquidity pool. Fees: Access the 7Pixels experience with exclusive events #### What Makes 7Pixels Unique? 1. Community-driven NFT-Metaverse ecosystem 7Pixels allows wider community participation in the NFT-Metaverse ecosystem by enabling the role of endorsers in a","links":"https://7pixels.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/7pixels/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x82bec5483dbab4305f32b191d76dc6cb020ae76d"}}}