{"name":"Real Estate Token","id":"real-estate-token","symbol":"r3t","description":"R3 Token (R3T) is a blockchain-based initiative that seeks to empower individuals worldwide to take part in the real estate market with minimal effort through Web 3.0 technology. R3T is a blockchain-based project that has introduced a two-token ecosystem, consisting of the $R3T token and the Ranch Token. This ecosystem has been designed to offer benefits to token holders and to make the token economy more dynamic. The $R3T token is a freely tradeable token that acts as the backbone of the ecosystem. This token is meant to be used as a means of exchange, allowing users to trade in a secure and fast manner. The $R3T token also provides an opportunity for token holders to participate in the growth of the project and to benefit from the company's success. The Ranch Token, on the other hand, is not tradeable but provides additional benefits to token holders. Ranch Token holders are eligible to receive a steady payout in R3T and will also have voting rights to help guide the direction of the project. They may also receive airdrops, which are additional tokens given out to token holders as a reward. The R3T ecosystem is designed to be flexible and adaptable, allowing for new benefits and rewards to be added in the future. This ecosystem provides an opportunity for token holders to not only participate in the growth of the project, but also to benefit from the rewards and benefits associated with it. In conclusion, the R3T ecosystem is a approach to tokenization that offers a way for token holders to participate in the growth of a project and to benefit from its performance. The system has been designed to be flexible, adaptable, and to offer benefits to token holders over time.","links":"https://www.r3-token.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/real-estate-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf97c30f0b31aee9b1ab087f8ccf5b14bf354d29f"}}}