{"name":"Qrolli","id":"qrolli","symbol":"qr","description":"What is the project about? Qrolli is a Web3 social platform built on the Polygon Proof-of-Stake blockchain that empowers creators to own and control the links between themselves and their community. The platform features a modular architecture that allows for new features and fixes to be added while ensuring immutable user-owned content and social relationships. What makes your project unique? Qrolli differentiates itself from other social networks by offering a user-owned, open social ecosystem that any application can plug into. This user-centric approach ensures that creators have control over their content, audience, and livelihood, without being at the mercy of individual platform algorithms and policies. Additionally, Qrolli features a reputation system, customizable posts, and dynamic NFTs for profiles and posts, allowing creators to establish their brand on the decentralized web. History of your project. Qrolli was founded in 2023. The team recognized the need for a user-owned social platform that could offer creators complete control over their content and audience. They launched the Qrolli Protocol, a modular, user-owned social graph on the Polygon Network, followed by the Qrolli Social Platform, a decentralized content creation and curation platform that connects creators with their audience. What’s next for your project? The Qrolli team is focused on expanding the Qrolli ecosystem by adding new features and applications to the Qrolli Protocol. They are also exploring partnerships and collaborations to bring the benefits of the Qrolli ecosystem to a wider audience. What can your token be used for? The Qrolli token has multiple utilities, including earning rewards, accessing premium features, content creation and monetization, advertising, marketplace transactions, social impact, gaming, and tipping other users. With these capabilities, the token helps incentivize engagement and facilitates transactions within the Qrolli platform.","links":"https://qrolli.com","market_cap":1249868,"market_cap_rank":2611,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/qrolli/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0xccdb064a41afcd432bcea6f6d0d1e7c371d0b002"}}}