{"name":"NEKO","id":"neko-3_ethereum","symbol":"neko","description":"community leader of $NEKO, I’m here to guide this project toward its destiny: transforming a diamond in the dirt into a blue-chip meme token that dominates the space. This isn’t about me—it’s about the strength of $NEKO and the power of our community coming together to build something extraordinary. To show my commitment to this vision, 8% of the total supply has been locked, with unlocks scheduled for mid-March 2026 and late June 2027. Additionally I will lock another 70 Million tokens until 2030 bringing the total circulating supply to $500 Million Tokens. These tokens will remain untouched, ensuring that you, our valued buyers and investors, have the first opportunity to benefit from $NEKO’s growth. When the time comes, only a small portion will be used to sustain a year of essentials, with the rest relocked to support the project’s long-term stability. $NEKO is a project built on trust, transparency, and resilience. After hearing the community’s concerns, decisive steps were taken to create an unruggable token that stands apart. The contract is fully verified and renounced, ensuring no single party can alter its foundation. A 25% burn of the total supply has been executed, permanently removing those tokens from circulation to enhance scarcity and value. Significant portions of the remaining supply are locked for a year, with the first major unlock of 50 million tokens set for December 2025—marking the anniversary of our launch. These funds will be used to secure listings on top 30 centralized exchanges (CEXs), driving visibility and growth, with any unused portion relocked for another year. The next unlock of 50 million tokens in March 2026 will target listings on top 10 CEXs, with unspent funds relocked again. This cycle ensures sustained credibility and resilience, with each unlock fueling listings, marketing, and growth for the benefit of the entire community. $ETH is undervalued, and the timing is perfect! With Trump’s rumored $500M $ETH bag and his stablecoin on Ethereum, we’re on the cusp of MOON TIME. $NEKO is already up 10x, a locked, unruggable 1000x gem. Over the next 90 days, as $ETH and altcoins break out, $NEKO will ride the wave to new heights. Jeets are out, bulls are in—this is your chance to join a project designed to thrive. I invite you to do your own research (DYOR) and explore $NEKO’s potential at www.nekoethreborn.com and comparemarketcap.com/coin/neko-eth. Together, we’re building a token that endures, delivering stability, growth, and mainstream adoption. Join the movement with #ETH, #NEKOETH, and #TrumpPump—let’s make history! Pledge from Your Community","links":"https://nekoethreborn.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/neko-3/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x74697d4fd0536c6885334b11d5c6dbf58729369f","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x74697d4fd0536c6885334b11d5c6dbf58729369f"}},"is_native":false}