{"name":"EmerCoin","id":"emercoin","symbol":"emc","description":"Emercoin (EMC) is an open-source cryptocurrency which originated from Bitcoin, Peercoin and Namecoin. Other than being a cryptocurrency, it is also a platform for secure distributed blockchain business services. The EMC coin is used for accessing the blockchain-based services provided by Emercoin. Emercoin inherits the reliability and security of <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a>, while at the same time adding more features to its own blockchain by leveraging several innovative technologies. The Emercoin blockchain has been specially designed to provide businesses with the secure blockchain services and also allow them to create their own decentralized apps. Emercoin was founded in the year 2013 by Eugene Shumilov who also serves as the chief executive officer of Emercoin. The Emercoin team also consists chief technical officer Oleg Khovayko, a cryptocurrency & financial expert and Stan Polozov a Blockchain Implementation Specialist. Emercoin is also backed by a decentralized team of nine advisors from across the world. Emercoin has been in the market since 2014, and its past trend in the cryptocurrency market shows that it has followed a steady and stable growth. Emercoin has scored many partnerships. Two of its major partners are Coca Cola and Microsoft. Some other partners are RedHat, LLoyd’s, Bitfury, Aspanta, Deloitte, Authorizers, Foundico, Anteko, etc. Emercoin has also been featured on some prominent media platforms such as Forbes, Digital Trends, Engadget, The Business Times, Aljazeera, Gadgets Now and others. With the sheer variety of services that the Emercoin platform makes available to its users, it would not be surprising to see this currency be viewed as a lucrative investment option by many novice as well as experienced investors in the near future. With the currency’s value currently hitting new highs, it can be said that many people are now beginning to see the true power and potential of this emerging blockchain. However, as is the case with all crypto assets, past performance should not be used to predict the future value of EMC.","links":"http://emercoin.com","market_cap":388463,"market_cap_rank":3231,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/emercoin/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}