{"name":"Genesys","id":"genesys","symbol":"gsys","description":"What is the project about? Genesys Network, the ecosystem where all Blockchain services are unified on a single platform. Our platform combines DeFi-Blockchain technology with community-driven solutions to create the fastest, most scalable, and low-consumption products and services for cryptocurrency transactions and NFT’s. We're committed to providing a seamless user experience for our customers, offering a comprehensive suite of decentralized features and functionalities that will take their crypto market experience to the next level. What makes your project unique? The combinations of affordable Dapps and platforms tailored to the community, all services under a single network, Genesys Ecosystem combines applications like: Genesys View app which is a coinwatch, launchpad, P2P exchange and analysis platform, Genesis of Blue NFT Marketplace where artist and creators property rights are protected, BlueHosting web, domain, AI and hosting services, Genesys POA blockchain and Genesys web wallet History of your project. Project has been under development since 2021, has achieve great success among the community organic growth among social media and other platforms like discord and telegram. the Ecosystem is complete and ready. What’s next for your project? next will be the launch of our different platforms like Genesys View app, BlueHosting, BlueLotusDAO our dex, Marketing campaigns for branding recognition, hackathon to attract developers and participation in different conferences, we are also developing our Medical consulting app, bridge integration with Chainlink CCIP. What can your token be used for? GSYS COIN is the native cryptocurrency, which will run on GChain, in the exact the same way that ETH runs on Ethereum, this means that GSYS can be used to: • Pay gas to implement or invoke a smart contracts. • Perform cross-chain operations, such as transferring token/coin transfering via Gchain to different networks, protect the network by staking or delegating.","links":"https://genesys.network/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/genesys/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}