{"name":"Floyx","id":"floyx-new","symbol":"floyx","description":"What is the project about? Floyx is a decentralized social media that works with both web2 and web3 technologies. Using blockchain technology and web3 assumptions, we want to create a secure, uncensored space for every internet user, where the user is the sole owner of published data and information. What makes your project unique? Floyx enables the creation of an indelible digital identity for every Internet user around the world. Providing a secure wallet-like application that creates a decentralized connection to the platform. All content is stored on the user's side. The platform offers a wide range of opportunities to monetize creativity by writing articles, adding videos, podcasts, NFTs and much more. The Floyx network also offers the ability to generate tokens and smart contracts, without having to hire blockchain developers. History of your project. The Floyx project was founded in 2018 as a vision for censorship-free social media. In 2020, we created dedicated profiles for the crypto industry to protect the community and investors from fraud attempts. In 2022, we decided to move to decentralized solutions using web3 and blockchain assumptions. This year, the idea of a token is being developed, which will power the entire ecosystem of the platform and be included in the monetization system. In 2023, Floyx begins work on the world's first decentralized web3 application, created based on a wallet in which all content published will be stored. What’s next for your project? In 2023, Floyx begins building its own chain to facilitate maximum crypto adoption worldwide. At the same time creating a Floyx deflationary token through an automatic algorithm to burn 50% gas fee. In 2024, the chain should be put into service for incumbent projects and new business founders. What can your token be used for? Establishing a decentralized connection in web3. Payment option for marketing, access to other users' paid content, limited NFTs and more.","links":"https://www.floyx.com/","market_cap":61471,"market_cap_rank":6507,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/floyx-new/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x7067bebfa1720132dfb9373d65b522afbe3a201e"}}}