{"name":"Wrapped Ordichains","id":"wrapped-ordichains","symbol":"woich","description":"What is the project about? OrdiChains is the first cross-chain protocol that supports BRC20 tokens, bringing BRC20 tokens into the Ethereum ecosystem. It aims to enhance the BRC20 token ecosystem by incorporating decentralized finance (DeFi) attributes such as DEX, lending, farming, on-chain contracts, and algorithmic stablecoins. What makes your project unique? OrdiChains is the first cross-chain protocol that supports BRC20 tokens, bringing BRC20 tokens into the Ethereum ecosystem. It is the first real application project on BRC20 What’s next for your project? OrdiChains 1.0: Implement BRC-20 peer-to-peer cross-chain bridge to the Ethereum network. Enhance BRC-20 token with DeFi financial attributes. Launch Farm and Lend functionalities. Conduct the initial token sale for the OICH platform token. OrdiChains 2.0: Expand to support multi-chain bridge transfers and increase the variety of supported cross-chain connections. Promote cross-chain integration of more ecosystems using the Ordinals protocol. Enable cross-chain functionality for Ordinals NFTs. Introduce DeFi financial attributes for Ordinals NFTs. Launch the Launch feature to facilitate the release of high-quality projects. OrdiChains 3.0: Become a bridge connecting various public blockchains. Support a wider range of public chains and digital assets. Establish industry standards for cross-chain integration based on the Ordinals protocol. Enable cross-chain functionality for more protocol token types, such as BRC-20, ORC-20, SRC-20. What can your token be used for? Token utility: OICH tokens are practical and can be used for paying cross-chain transaction fees at a discounted rate (adjusted daily), participating in governance voting, and listing projects. Token allocation: 10% for core developers, 40% for the community, and 50% for the ecosystem. Launchpad participation: As an OICH token holder, you will have the opportunity to participate in the project's Launchpad. The Launchpad serves as a plat","links":"https://www.ordichains.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wrapped-ordichains/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x915ea4a94b61b138b568169122903ed707a8e704"}}}