{"name":"Rabbit Wallet","id":"rabbit-wallet","symbol":"rab","description":"What is the project about? Rabbit Wallet is a multi-utility decentralized wallet application (Defi Wallet) that facilitates the storage and management of crypto-assets for users, granting them complete control over their assets. containing security characters In addition, the Rabbit wallet allows users to connect DApps, and the wallet's integrated utilities help users experience and earn money in the Defi world. What makes your project unique? Rabbit Wallet is designed to be the next generation of decentralized multi-utility wallet applications. And designed to provide users with an excellent experience, with a simple and intuitive interface that is user-friendly. Utilities designed to provide users with everything they require: *Storage of assets using private keys ensures a high level of security and reputation. *Easy accessibility and anonymity for transactions anytime, anywhere. *Trade over one million tokens across fourteen leading blockchains. * Automatically switch preferred Blockchain without user input. *Connect to a number of DApps. *Passive Income through Betting * Daily breaking news and market strategies *Track real-time charts and prices for each token. *Participate in Airdrops and IDOs from the leading projects. *Purchase Tokens directly through Visa and Mastercard. *Rewards from an affiliate referral program. History of your project. NA What’s next for your project? NA What can your token be used for? The Rabbit wallet project's utility and governance token is the RABBIT ($RAB) token. - Projects use $RAB Token to pay 30% of Airdrop and Launchpad service fees. - $RAB holders are eligible to participate in Airdrop and Launchpad programs from Rabbit's partner projects. - Users must hold $RAB in order to submit proposals, cast votes, and manage projects within the Rabbit ecosystem. - Users hold $RAB in order to generate passive income via Staking RABBIT - Users who hold $RAB in the future will receive a trading discount on DEX RABBIT","links":"https://therabbit.io","market_cap":126456,"market_cap_rank":4165,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rabbit-wallet/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x24ef78c7092d255ed14a0281ac1800c359af3afe"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x24ef78c7092d255ed14a0281ac1800c359af3afe"}}}