{"name":"FLUUS","id":"fluus","symbol":"fluus","description":"What is the project about? A layer of developer and consumer-facing solutions that connect the dots between crypto services, evolving the world's access to web3. FLUUS SDK combines global crypto ramping, swapping, and decentralized trading services, with in-house FLUUS Pay network, a cash and mobile money ramping service. FLUUS Auth facilitates wallet creation and web2 user onboarding using SSO and MPC and TSS technologies. What makes your project unique? We have created a collateralized FLUUS pay network that enables crypto ramping using cash and mobile money by partnering with Fintech operators, money transfer networks, and mobile money operators. We have also developed a user-friendly sign-up process and web 3.0 onboarding through traditional SSO. FLUUS has successfully off-ramped >$1 million in aid services for an I-NGO in Ukraine. History of your project. FLUUS is a startup that was founded in March 2022 with the aim of evolving the world's access to web3. They recognized the importance of cryptocurrency and blockchain in developing countries but found it difficult to transact, unsafe, and inaccessible. FLUUS aims to connect the world to better economic opportunities by building global solutions for these markets and providing reliable tools for developers. What’s next for your project? FLUUS will expand its FLUUS Pay network into more markets to offer crypto ramping with cash and mobile money. They will also add a swapping aggregator to allow users to swap between tokens and cryptocurrencies. Additionally, FLUUS will launch its FLUUS Auth solution to create a wallet using traditional logins. What can your token be used for? FLUUS offers fee reductions for developers integrating its solution, serves as collateral for on and off-ramp partners to protect against disputes or fraud, rewards retail users for providing liquidity and beneficial actions, and acts as a governance token for the FLUUS DAO.","links":"https://www.fluus.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fluus/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0xdbabd6c54d43361e457a06d677341049ac23efac"}}}