{"name":"BurnsDeFi","id":"burnsdefi","symbol":"burns","description":"What Is BurnsDeFi ($BURNS)? $Burns is a decentralized rune token launched using a fair minting method. $Burns was automatically launched after 150,000 mints with zero human intervention. It is the first triple-burn mechanism token on the BSC chain. Buy/Sell tax: 1.2% -Passive Burning of 0.5%/hour (12%/day) - 1% of tax goes to a reward pool where investors can burn tokens to get BNB - Investors get back double the amount they burnt in BNB - 0.2% of tax gets directly burnt - 20% referral incentive for referring friends to burn their $Burns (1st tier) - 5% referral incentive for referring friends to burn their $Burns (2nd tier) How Many $Burns tokens Are There in Circulation? Total supply: 21,000,000 Total in circulation will constantly decrease over time as there are 3 constantly burning mechanisms. 1. Passive Burning of 0.5%/hour (12%/day) 2. 1% of trading volume will be burnt by investors to get BNB rewards 3. 0.2 % of trading volume will be burnt directly Who Are the Founders of $Burns? Founders of $Burns are from Singapore. John, the founder, has a Singapore team behind him. His Twitter(X) account is https://twitter.com/burnedfi Why is $Burns Unique and attractive? - Fully decentralized - Ownership renounced - All users collectively retain control - 100% fair as every single token is minted or bought (no bots) - Strong active community - Everything is transparent Transactions are permanently recorded and viewable to anyone - First triple-burn mechanism token in the BSC chain - Ever-growing upward trend Where Can You Buy $Burns Investors can currently buy $Burns at the Pancake Swap. https://pancakeswap.finance/swap?outputCurrency=0x91f1d3C7ddB8d5E290e71f893baD45F16E8Bd7BA","links":"https://burnsdefi.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/burnsdefi/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x91f1d3c7ddb8d5e290e71f893bad45f16e8bd7ba"}}}