{"name":"KIRO","id":"kirobo","symbol":"kiro","description":"Kirobo has developed a new critical infrastructure that aims to make the development of Web3 solutions more streamlined, cost-effective, and democratized. Future Conditional Transactions (FCT) is a new on-chain mini-scripting language at the transaction level for general-purpose feature development use cases. Simple FCTs can be created by utilizing the drop-and-drag UI. While more complex operations can be created with the SDK. it's a new way to interact with and build on the blockchain, providing developers with a new and innovative tool. Before FCTs, developers would only have two options when it came to the development and upgrading of DeFi protocols…namely Smart Contracts or Bots. Smart Contracts are costly, time-consuming, and expensive. They are also highly inflexible as, once deployed, they cannot be upgraded. Bots are flexible, but they are not secure. Developers lack a tool that is flexible, easy, and secure. FCTs are secure, flexible, upgradable, and thus scalable, adding to the developer's web3 toolbox. An FCT is an on-chain scripting language with built-in IFTTT logic that can be coded in any Web2 language. Starting with the visual builder, which utilizes a drop-and-drag UI, developers will be able to create products and services that are able to utilize currently deployed products such as Aave or Uniswap. Creating DeFi legos that can operate based on future conditions or execute immediately. Additionally, developers have access to the FCT SDK to develop any DeFi product that they can imagine without the need to know solidity or how to code a smart contract. Currently, FCTs operate on Ethereum. The roadmap envisages adding additional blockchains in the future.","links":"https://kirobo.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kirobo/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xb1191f691a355b43542bea9b8847bc73e7abb137"},"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf83c0f6d3a5665bd7cfdd5831a856d85942bc060"},"polygon-pos":{"decimal_place":18,"contract_address":"0xb382c1cfa622795a534e5bd56fac93d59bac8b0d"}}}