{"name":"Grave","id":"grave","symbol":"grve","description":"\"$GRVE is CRC-20 governance and utility token for the Croskull Metaverse ecosystem. Utility: Game Governance Currency The following uses $GRVE as a currency in the CroSkull Metaverse Ecosystem - Buying Season Eggs to mint your own combat pets. - Write your personal story directly in your NFT. - Purchasing in-game assets such as consumables (Weapons, Crystals, Gems, Miscellaneous). * - Vote proposal (DAO). - Staking in the Bank to increase yield. (Yield Farm). Governance The Croskull team is planning to adopt a governance system to allow Croskull NFT to become a decentralized autonomous organization. $GRVE will be the governance token for the community to do proposal votings. The Croskull team will start with a centralized operation first, and gradually pivot to a decentralized project to ensure the project starts off strong basis. Tokenomics Total Supply: 45,990,000 GRAVE Distribution STAKING 22.995.000 50% Will be released gradually based on our staking season system. BANK FARM 11.497.500 25% Will be released gradually based on our season system. TEAM 5.748.750 12.5% Will be locked up for 18 months from TGE and then 10% will be released per month over 10 months. MARKETING 2.759.400 6% Will be used for marketing whenever it is needed. EVENT 2.759.400 6% Will be used for events whenever it is needed. LIQUIDITY POOL 229.950 0,5% Will be used for adding starting liquidity to DEX $GRVE Earning per season In total there are 6,666 Croskull + 333 Evoskull and a distribution of: 22,995 $GRAVE per day, for a total of 2,299,500 MAX $GRAVE per season (100 days). The $GRAVE not redeemed during the Season (CroSkull and EvoSkull not staked) will be Burned. SEASONS There are currently 10 Seasons of 100 days each. Each season has available: 2.299.500 $GRAVE for staking and 1.149.750 $GRVE for the Bank the $GRVE not redeemed by the CroSkull and EvoSkull holder will be burned at the end of the season. Any purchase made in the CroSkull ecosystem with the $GRAVE will burn the token, to decrease its circulation and increase its value to the Hodlers. After 10 Seasons (1000 DAYS) The distribution of all Grave will be completed, the token will become in effect a Governance Token for our DAO and the management will be in the hands of the Hodlers, they will have a say in all aspects regarding the CroSkull Metaverse. The adventures will continue generating more Souls and other rewards in NFT, also the Hodlers of $Grave will have more benefits on rewards. \"","links":"https://www.croskull.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/grave/logo.png"}