{"name":"Satoshi Monsters","id":"satoshi-monsters","symbol":"ssm","description":"\"SatoshiMonsters is a tower defense game (PLAY TO EARN) on Binance Smart Chain. As almost every Defense game, the objective is to prevent all hordes from being able to advance on the map, and not destroy your base. Each map is composed of more than 150 locations and 70 minions with different lots. In Farm mode, towers are simplified, each tower has its cadence of fire, its own fuel and its recovery time. The project comes with incredible gameplay and the powerful Blockchain technology. ## How many SSM Coins Are There in Circulation? SSM launched on Nov 18, 2021 with a fixed supply of 300 million SSM tokens created at genesis. 4% of those tokens were sold as part of the launch private sale and another 1,5% added as initial liquidity. The circulating supply is increased through farming and staking on trusted platforms. At the time of this writing there are 18.074.000,00 million tokens in circulation. ### Who Are the Founders of Satoshi Monsters? Satoshi monsters is the brainchild of developer Carlos Alberto, who have extensive experience in programming, blockchain technology and enterprise-scale cloud infrastructures. The frustration with the existing tower defenses projects platforms available on the market, and decided to stop complaining and just build their own solution. ### Where Can I Buy Satoshi Monsters (SSM)? SSM is available for trading on a growing number of decentralized exchanges across BSC. [PancakeSwap](https://coinmarketcap.com/exchanges/pancakeswap-v2/)offers swaps on Binance Smart Chain (BSC). and [Coinsbit](https://coinmarketcap.com/exchanges/coinsbit/) New to cryptocurrency? Read CoinMarketCap’s [easy guide](https://coinmarketcap.com/how-to-buy-bitcoin/) to buying Bitcoin or any other token. Platform: Binance Smart Chain. Team/Backers/Investors: The team is composed of six core members, Carlos Alberto He started programming more than 20 years ago, from an early age he participated and developed with crypto communities, currently he is one of the key people behind Faucetbox.io. Dener Santos, He has been working as a designer for many years, he is a specialist in game animations and SPINE, in addition to his enormous talent he is a professional MMA fighter, we feel much safer with him around. Jorge Santos Jorge is a Maths major, helps us mainly in building economic algorithms, is currently responsible for the development of the Lands system.Higor is responsible for the core of the game, he currently lives in another state, despite the distance higor was a great addition to the team. Rafael Dutra Rafa is responsible for customer service, he also controls our social networks. Roger Silva is our head of marketing, he is also responsible for controlling internal tasks. We also have two core engineers with zero access permissions to production systems and project wallets, and four community managers. \"","links":"https://www.satoshimonsters.cc/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/satoshi-monsters/logo.png"}