{"name":"MetaZero","id":"metazero","symbol":"mzero","description":"MetaZero is poised to transform gaming assets from mere gaming collectibles to investment vehicles. Our mission is to unlock the economic potential of these gaming assets, making them accessible and tradable as Synthetic RWA Omnichain tokens on the blockchain. The estimated market value of just the CS:GO gaming assets exceeds $3.5 billion, and MetaZero is strategically positioning itself to capitalize on this and other opportunities. Synthetic RWA Tokenization Wrapping Gaming Assets: At MetaZero, we will encapsulate gaming assets as OFTs and ONFTs leveraging LayerZero's tech, ensuring their authenticity and scarcity. This process creates synthetic RWAs, turning them into tangible investment vehicles. Market Accessibility: By tokenizing these assets, we break down barriers that have traditionally kept them within gaming communities for only gaming purposes, opening them up to a broader spectrum of investors for speculation. Bridging: Leveraging LayerZero's omnichain messaging protocol, we're crafting an innovative extension towards real gaming markets. Opportunities Speculation Vehicle: Recognizing the significant trading volume and value of certain gaming assets, MetaZero aims to provide a platform for investors to speculate on these digital assets, much like TradeFi or crypto assets. Democratization of Asset Investment: Our platform will enable users to engage in the investment and trading of these high-value gaming assets, previously accessible only to a niche market. Omnichain Integration Catalyst: $MZERO will act as a tunnel for communication between the traditional digital world and the omnichain future, capturing the value of in and outbound asset migration and management.","links":"http://metazero.gg","market_cap":3390185,"market_cap_rank":2734,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metazero/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x328a268b191ef593b72498a9e8a481c086eb21be"}}}