{"name":"Gyrowin","id":"gyrowin","symbol":"gw","description":"What is the project about? Gyrowin is a decentralized platform for gaming and finance that offers users lottery games, as well as lend and borrow against their collateralized assets without any risk of liquidation. Gyrowin also introduces the new fun way to stake its utility token in binance chain with multiple rewards sources resulting in higher yield for the participants. What makes your project unique? Gyrowin distinguishes itself by intertwining entertainment with financial innovation and social impact. It empowers users with governance capabilities, enabling them to vote on proposals and improvements. The protocol is supported by Chainlink and The Graph, ensuring robustness and security, with Chainlink providing price feeds, automation, and verifiable random number generation. Gyrowin's multifunctional approach, including features like the Money Plant vault, enables users to earn rewards while contributing to charitable causes. Also, everything is built to support cross-chain. History of your project. Launched on September 21, Gyrowin has achieved significant milestones, including the development and testing of its lottery and smart contracts. - Staking and 6/41 Lottery running in binance testnet (Testing on progress) - Pinksale fairlaunch presale (raised 100k+ USD) - Listing pair GW/USDT on pancake swap - Launched token on 21 sept 2023, UTC 20:00 - More than 20+ AMA in telegram What’s next for your project? Gyrowin aspires for broadened horizons with plans to launch its mobile app and extend its innovative features to support cross-chain interaction. The introduction of a referral system, omnichain borrowing and lending on various platforms, including Ethereum and Avalanche, and listings on major centralized exchanges are on the horizon. It aims to incorporate features like instant scratch NFT lottery and intends to launch its 2nd layer blockchain by 2025. What can your token be used for? $GYROWIN token is the catalyst for interaction within the Gyrowin ecosystem, empowering holders with governance participation, proposal initiation, and voting privileges. It grants access to enticing lottery games and the rewarding Money Plant vault. It’s a gateway to DeFi protocol benefits such as lucrative borrowing, lending, and staking opportunities. Being listed on PancakeSwap, it provides users with facile trading options, simultaneously reinforcing the ecosystem’s altruistic commitments and maintaining a balanced economic environment.","links":"https://gyro.win","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gyrowin/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x77774a06271d6a305caccdbc06f847def05c7777"}}}