{"name":"Limoverse","id":"limoverse","symbol":"limo","description":"The health & wellness ecosystem built on Web 3. Powered by the utility token LIMO. LIMOVERSE is an ultimate health & wellness ecosystem built on blockchain which will reward the users for staying healthy using our utility token called LIMO. It will be a destination where both health & wellness seekers and providers come together and share their services, knowledge, products etc for which they get rewarded. There are multiple projects inside LIMOVERSE. The projects inside Limoverse are: 1) HEALTHFi - Walk, jog, run or burn your calories and earn your rewards on a daily basis. 2) MODIFi - Be part of our personalized wellness program called EPLIMO (Epigenetic Lifestyle Modification) and start earning for maintaining your health on a daily basis. 3) PARTNERVERSE - Health & wellness practitioners and institutions can be part of Limoverse where they can offer their products/services/knowledge to the entire community. 4) CREATFi - This is for the creator economy. Creators can create and share their valuable contents and get rewarded in LIMOs. 5) DATAFi - Share your health data with research companies inside the LIMOVERSE ecosystem and get rewarded in LIMOs. 6) GAMEFi - Create your avatar, play and win the games inside LIMOVERSE and get rewarded in LIMOs. (Launching in 2024) 7) METAFi - Limoverse will be launching it metaverse called LIMO VALLEY by mid of April, 2023. It will be a virtual destination where you can do your exercise and various health practices in the metaverse which is a 5D experience. Users can consult virtually with practitioners who own centres in the LIMO VALLEY & each of these centres will be an NFT which will be owned by the practitioners.","links":"https://limoverse.io","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/limoverse/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x37e2ae82c454a6888e4bbb3e21a6607034832b4f"}}}