{"name":"Divi","id":"divi","symbol":"divi","description":"Divi is an eco-friendly blockchain project with two fundamental principles: self-custody & simplicity. True to the founding vision of \"crypto made easy,\" Divi is on a mission to reduce the complexity of blockchain technology with uncompromising self-custodial solutions, all while enabling network participants to earn a competitive rate of return (ROR). By leveraging its proof of stake (POS) consensus mechanism distributed across a diverse ecosystem of individual nodes, Divi offers a scalable FinTech solution ready for global adoption. Divi has developed an innovative, patent-pending UX-focused mobile wallet simple enough for non-technical users. Divi’s mobile solution, DiviWallet, is 100% self-custodial with near-instant global settlement and ultra-low transaction fees. Divi Wallet has several features that make it stand out from other mobile crypto wallets: human-readable addresses, non-custodial staking vaults, a lottery block, the ability to deploy a mobile masternode in one click, and supports in-app swaps between nearly 300 different crypto assets. Since completing the goals laid out in the original whitepaper, an updated roadmap was released in September 2022. Complete with vertically integrated solutions, Divi will allow organizations the ability to integrate their self-custodial wallet into their own business ecosystems. Other roadmap highlights include a robust DeFi protocol which will strengthen the $DIVI trading market, an innovative liquidity provisioning protocol for NFTs, and a loyalty framework that enables businesses to collaborate quicker and share loyalty assets. In addition, through the LightningWorks initiative, users will be able to utilize $DIVI via interactive comics, NFTs, and Web 3.0 gaming. Of course, users can expect continued coin integrations, as well.","links":"https://diviproject.org/","market_cap":6140604,"market_cap_rank":2195,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/divi/logo.png","detail_platform":{"ethereum":{"decimal_place":8,"contract_address":"0x246908bff0b1ba6ecadcf57fb94f6ae2fcd43a77","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x246908bff0b1ba6ecadcf57fb94f6ae2fcd43a77"}}}