{"name":"Metaverse ETP","id":"metaverse-etp","symbol":"etp","description":"Metaverse​ is a leading public blockchain based in China. Designed to facilitate low-cost, convenient transfer of digitized personal data and assets with unprecedented security and privacy, Metaverse aims to revolutionize the way financial services and transactions are processed, and to improve outdated and inefficient identity verification services with a network of ​Digital Assets​,​ Digital Identities​, and ​Oracle​ intermediaries. Metaverse is an open-source public blockchain that provides digital assets, digital identities and Oracles as a foundational infrastructure for social and enterprise needs. Through Blockchain-as-a-Service (BaaS), we make convenient, secure digital financial services accessible to all applications at virtually no cost. Founded in 2016, Metaverse went live in February of 2017. We strongly believe that blockchain technology is the catalyst for a better future - the New Reality. The concept is building a network of smart properties and a decentralized exchange for a smart and secure infrastructure. It already has dApps like Supernova running on the mainnet, and cross-chain compatibility with ERC-20 tokens is right around the corner in the project’s development roadmap. Metaverse ETP is used to value or collateralize smart contracts on the Metaverse blockchain network. It’s also used to pay transaction/gas fees. ETP is generated through PoW mining. It’ll soon introduce a PoS model to the platform. Metaverse supports digital identities, assets, oracles, and exchanges, making it a versatile blockchain 3.0 solution. Its development ecosystem already has a gold-backed crypto trading app on the market. Many more are in development for release before 2020. ETP is tradeable on a wide array of crypto exchanges. Its current PoW model will soon be supplemented by a PoS hybrid.\"","links":"https://mvs.org/","market_cap":568252,"market_cap_rank":4478,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metaverse-etp/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}