{"name":"Toman Coin","id":"toman-coin","symbol":"tmc","description":"What is the project about? Toman coin as cryptocurrency on Tron and Binance smart chain created by Toman Holding. It is under TMC & TMCB symbolsand provides crypto payment facilities to serve Borderless fiat transactions. Its focus is to hold and exchange on decentralized wallets and exchange. Toman coin with a network of independent dealers in countries made risk free connection of fiat money to the crypto market. What makes your project unique? Toman coin as cryptocurrency on Tron and Binance smart chain created by Toman Holding. It is under TMC & TMCB symbolsand provides crypto payment facilities to serve Borderless fiat transactions. Its focus is to hold and exchange on decentralized wallets and exchange. Toman coin with a network of independent dealers in countries made risk free connection of fiat money to the crypto market. History of your project. Toman coin as cryptocurrency on Tron and Binance smart chain created by Toman Holding. It is under TMC & TMCB symbolsand provides crypto payment facilities to serve Borderless fiat transactions. Its focus is to hold and exchange on decentralized wallets and exchange. Toman coin with a network of independent dealers in countries made risk free connection of fiat money to the crypto market. What’s next for your project? Toman coin as cryptocurrency on Tron and Binance smart chain created by Toman Holding. It is under TMC & TMCB symbolsand provides crypto payment facilities to serve Borderless fiat transactions. Its focus is to hold and exchange on decentralized wallets and exchange What can your token be used for? Toman coin as cryptocurrency on Tron and Binance smart chain created by Toman Holding. It is under TMC & TMCB symbolsand provides crypto payment facilities to serve Borderless fiat transactions. Its focus is to hold and exchange on decentralized wallets and exchange. Toman coin with a network of independent dealers in countries made risk free connection of fiat money to the crypto market.","links":"https://www.tomantmc.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/toman-coin/logo.png","detail_platform":{"tron":{"decimal_place":18,"contract_address":"TUBLxxJ1yMQ7Py2M5KVnVAbNASadtQvgMo"}}}