{"name":"Releap","id":"releap","symbol":"reap","description":"What is the project about? Releap Protocol is a decentralized, multi-chain and open-for-all social graph that allows users to wholly own and harness their audience and content. The Protocol is built to solve mainly two problems: (a) users can own, move and utilize their social connections across a variety of applications throughout the chain and (b) social applications can co-exist and take advantage of a collaborative database allowing them to focus on building for innovative and niche use cases. What makes your project unique? The Releap Protocol is designed with modularity as a fundamental concept and takes full advantage of Sui's architecture. The Protocol can scale quickly and ensure that users can fully own their Web3 assets. Additionally, Releap enables gas-less interactions so that dApps building on Releap have the option to abstract away gas fees when users interact with content. History of your project. The Releap Protocol was founded by Aaron Pon, inspired by his own struggle with Web2 social networks. The Protocol’s development began in the start of 2023 and was launched with the Releap App (an application built on the Releap Protocol) when the Sui Network went live. Since the Protocol’s development on the Sui Network, it has expanded onto zkSync with a MetaMask integration. What’s next for your project? Releap Protocol will proceed to develop greater tools for fair monetization systems such as the collect module, tipping, content gating and more. Releap Protocol development will also focus on improving user experience through additions such as the mobile app and content curation models. What can your token be used for? REAP is Releap Protocol’s native token that is deeply tied into the functioning of the Protocol. Users require REAP to vote on governance decisions or take part in Releap’s curation model. REAP is also required for users to create profiles on the Protocol.","links":"https://releap.xyz/","market_cap":81087,"market_cap_rank":6305,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/releap/logo.png","detail_platform":{"sui":{"decimal_place":9,"contract_address":"0xde2d3e02ba60b806f81ee9220be2a34932a513fe8d7f553167649e95de21c066"}}}