{"name":"Builders","id":"builders_binance-smart-chain","symbol":"builders","description":"Builders (BUILDERS) is a community-driven memecoin inspired by Binance founder CZ’s iconic phrase “Keep Building.” The project embodies the core values of perseverance, innovation, and unity, representing the unstoppable spirit of creators and believers within the BNB Chain ecosystem. Launched on September 22, 2025, Builders was created to motivate Web3 users to continue innovating, developing, and supporting one another, regardless of market conditions. It symbolizes the strength of community collaboration and the collective effort to move the blockchain industry forward. At its heart, Builders is more than just a memecoin it’s a movement. The project encourages people from across the globe, especially from China and Vietnam, to join together under a shared vision of growth and learning. Builders empowers both new and experienced participants in the crypto space to become contributors, creators, and educators in the expanding world of decentralized technology. With a total supply of 1 billion tokens and liquidity fully locked, Builders prioritizes transparency and community trust. The token’s fair distribution ensures that the power remains in the hands of the community the true builders of the ecosystem. Every holder, supporter, and contributor plays a vital role in shaping the project’s direction and helping expand its reach across the Web3 landscape. Builders’ long-term mission is to create a supportive environment for individuals and teams who are passionate about blockchain innovation. Through educational initiatives, collaborations, and community-driven campaigns, the project aims to highlight the importance of creativity, persistence, and shared success. In essence, Builders stands as a tribute to the “Keep Building” spirit motivating people to stay active, inspired, and constructive during every phase of the market. Whether you are a developer, designer, investor, or fan of crypto culture, Builders invites you to be part of a global community dedicated to building a better, stronger Web3 future.","links":"http://buildersbnb.com","market_cap":90927,"market_cap_rank":7161,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/builders_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x7ca2865cf319269ea5fe19dc1de16ca43e624444","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x7ca2865cf319269ea5fe19dc1de16ca43e624444"}},"is_native":false}