{"name":"Curve DAO","id":"curve-dao-token","symbol":"crv","description":"Similar to Uniswap, Curve Finance is an Automated Market Maker (AMM) based Decentralised Exchange (DEX). Unlike Uniswap, its main focus is only to swap between assets that are supposed to have the same value. This is useful in the DeFi ecosystem as there are plenty of wrapped tokens and synthetic tokens that aim to mimic the price of the real underlying asset. For example, one of the biggest pools is 3CRV, which is a stablecoin pool consisting of DAI, USDT, and USDC. Their ratio in the pool will be based on the supply and demand of the market. Depositing a coin with a lesser ratio will yield the user a higher percentage of the pool. As such when the ratio is heavily tilted to one of the coins, it may serve as a good chance to arbitrage. Curve Finance also supports yield-bearing tokens. For example, it collaborated with Yearn Finance to release yUSD pools that consisted of yDAI, yUSDT, yUSDC and yTUSD. Users that participated in this pool will not only have yield from the underlying yield-bearing tokens, but also the swap fees generated by the Curve pool. Including the yield farming rewards in terms of CRV tokens, liquidity providers of the pool actually have three sources of yield.","links":"https://www.curve.fi/","market_cap":250545310,"market_cap_rank":175,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/curve-dao-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd533a949740bb3306d119cc777fa900ba034cd52"},"optimistic-ethereum":{"decimal_place":18,"contract_address":"0x0994206dfe8de6ec6920ff4d779b0d950605fb53"},"polygon-pos":{"decimal_place":18,"contract_address":"0x172370d5cd63279efa6d502dab29171933a610af"},"fantom":{"decimal_place":18,"contract_address":"0x1e4f97b9f9f913c46f1632781732927b9019c68b"},"arbitrum-one":{"decimal_place":18,"contract_address":"0x11cdb42b0eb46d95f990bedd4695a6e3fa034978"},"energi":{"decimal_place":18,"contract_address":"0xd3319eaf3c4743ac75aace77befcfa445ed6e69e"},"sora":{"decimal_place":18,"contract_address":"0x002ead91a2de57b8855b53d4a62c25277073fd7f65f7e5e79f4936ed747fcad0"}}}