{"name":"X-BLOX","id":"x-blox","symbol":"xbx","description":"What is X-BLOX (XBX)? X-BLOX is Automated Market Maker (AMM) - a decentralized finance application (DeFi) that allows users to exchange tokens, providing liquidity through agriculture and earning fees in return. X-Blox decentralized exchange offers 10% discount on fees compared to PancakeSwap. It was launched in Febuary 2022 and is a decentralized exchange and farm for exchanging BEP20 tokens in Binance Smart Chain. X-BLOX uses an automated market maker model where users trade against a pool of liquidity. These pools are populated by users who deposit their funds into the pool and receive liquidity provider (LP) tokens in return. These tokens can later be used to recover your share of the pool as well as a portion of the trading fees. These LP tokens are known as FLIP. X-BLOX also allows users to place additional tokens such as X-BLOX and X-MINE. On the farm, users can deposit LP tokens and be rewarded with XBX. Who are the founders of X-Blox? X-BLOX is a decentralized exchange based on Intelligent Chain Binance ( DEX ) that was launched by public developers who are also part of the X-MINE project What makes X-BLOX unique? X-BLOX uses an automated market maker model, which means there are no order books and liquidity pools are used instead. A user can earn revenue by becoming a liquidity provider; by adding their tokens to the liquidity pool, they can grow LP tokens and wager their XBX to earn rewards. The XBX token is a BEP20 token originally released in Binance Smart Chain. XBX the main function is to encourage the provision of liquidity to the X-BLOX platform. Users can wager their tokens to earn rewards, which is done by depositing tokens from the Liquidity Provider and blocking them. This is known as farming and is rewarded by the system with XBX tokens. Tokens can be removed with zero timeout. XBX gives users the opportunity to invest and increase returns in the future, but comes with risks","links":"https://www.xhash.farm","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/x-blox/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x337c218f16dbc290fb841ee8b97a74dcdabfede8"}}}