{"name":"Crypto.com Wrapped BTC","id":"crypto-com-wrapped-btc","symbol":"cdcbtc","description":"What is CDCBTC? Crypto.com Wrapped BTC (CDCBTC) is a token backed 1:1 by native BTC in Crypto.com’s custody, with the underlying BTC held in Crypto.com’s cold storage. CDCBTC allows bitcoin holders to access decentralised finance (DeFi) applications on chain. Eligible Crypto.com users can obtain CDCBTC by withdrawing their native BTC from the platform to a supported non-BTC chain and swap CDCBTC for native BTC by depositing CDCBTC into their Crypto.com wallet. The Case for CDCBTC Bitcoin’s DeFi utilities on its native chain are limited because of a lack of smart contract functionality and compatibility with other chains. Several wrapped BTC products have been created to address this problem, but many fail to sufficiently mitigate counterparty and security risks. CDCBTC aims to enable token holders to unlock BTC’s DeFi capabilities across multiple chains: on-chain trading, collateralised borrowing, yield farming, restaking, and more. This will be done by offering a seamless and secure way to wrap and unwrap native BTC through the Crypto.com platform to multiple supported chains while addressing security issues by having the underlying BTC held in Crypto.com’s SOC 2 Type II compliant custodial solution. CDCBTC will be initially made available on Cronos Chain. Wrap and Unwrap of CDCBTC CDCBTC represents the underlying native BTC-backed 1:1 in Crypto.com’s custody. Mint/burn thresholds are set to ensure the underlying BTC backing CDCBTC is always larger than or equal to the circulating supply of CDCBTC. The exchange process between CDCBTC and BTC is as follows: Wrap: When users initiate a BTC withdrawal to a supported chain, they will receive CDCBTC in their destination wallet. Crypto.com will manage the minting/wrapping operation on the backend - native BTC will be moved to a dedicated BTC reserve wallet backing CDCBTC before new quantities of CDCBTC are minted on a 1:1 basis. Unwrap: When users initiate a CDCBTC deposit into their Crypto.com account, the CDCBTC is automatically unwrapped and they will receive native BTC from the dedicated BTC reserve wallet, available for trading or other use cases on the platform. Custody, Transparency, and Security The underlying BTC is held 1:1 via Crypto.com’s in-house Multiparty Computation (MPC) custody solution that has undergone SOC 2 (Service Organisation Control) Type II assessment by an independent auditor. It is an assurance through an independent auditor validating and auditing security controls and processes, focusing on the following aspects: Security, Availability, Processing Integrity, and Confidentiality. Guided by the SOC 2 Type II standards, the custody solution was designed to ensure that the security controls in place protect the solution itself from unauthorised access (system abuse, theft, fraud, etc.), unauthorised removal of data, misuse of software, and improper alteration or disclosure of information. Crypto.com has engaged SlowMist for CDCBTC’s smart contracts auditing. No critical vulnerabilities have been identified.","links":"http://crypto.com/cdcbtc","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-com-wrapped-btc/logo.png","detail_platform":{"cronos":{"decimal_place":8,"contract_address":"0x2e53c5586e12a99d4cae366e9fc5c14fe9c6495d"}}}