{"name":"Verse","id":"verse-bitcoin","symbol":"verse","description":"About VERSE Bitcoin.com's rewards and utility token VERSE accelerates global adoption of cryptocurrency in the self-custodial model through incentives and gamification. Since 2015, Bitcoin.com has been a global leader in introducing newcomers to Bitcoin and cryptocurrency. With over 50 million self-custody wallets created (as of Jun 2024) in its multichain DeFi-ready mobile app (the Bitcoin.com Wallet app), an award-winning news portal with over 2.5 million monthly readers, a wide range of educational resources, and 24-hour human support, Bitcoin.com is the world’s gateway to Bitcoin and beyond. By incentivizing and gamifying engagement in the Bitcoin.com ecosystem, VERSE supercharges Bitcoin.com’s mission to onboard the world to decentralized money and increase economic freedom. What makes VERSE different? VERSE is seamlessly integrated in the Bitcoin.com ecosystem and readily accessible to millions of users. Bitcoin.com attracts and retains millions of newcomers to crypto every year via its powerful brand, domain, and products. The ecosystem guides newcomers on their own individual journeys, enabling them to benefit from the rapidly expanding range of applications in crypto. What is the utility of VERSE token? VERSE can be earned by using products in Bitcoin.com’s ecosystem, held for discounts and perks, and used in apps and dApps. In late 2023, fxVERSE was deployed on Polygon, paving the way for a micro-rewards system. What are the key components of the Bitcoin.com VERSE ecosystem? At the heart of the ecosystem is the multichain Bitcoin.com Wallet app. Within the app, users can find a web3-enabled browser called Verse Explorer that allows for convenient interaction with a variety of dApps and web3 features. These include the multichain decentralized exchange Verse DEX, the Verse Voyager NFT collection and minting dApp, and a range of engaging dApps that are designed to educate users on how to safely interact with web3 products. How does the buy back and burn mechanism work? Bitcoin.com buys VERSE on the open market through Bitcoin.com’s decentralized exchange Verse DEX, third-party DEXs, centralized exchanges, or in Over-The-Counter trades. This VERSE is then sent to the Verse Burn Engine, where it accumulates until a burn is triggered (anyone can trigger a burn). What is the sustainable supple reduction mechanism? VERSE is allocated from the Ecosystem Fund to the Verse Burn Engine in a manner that is proportional to a given activity in the Verse/Bitcoin.com ecosystem, as well as in a manner that ensures that the reduction of supply is sustainable over the lifetime of the token.","links":"https://verse.bitcoin.com","market_cap":2570073,"market_cap_rank":2009,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/verse-bitcoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x249ca82617ec3dfb2589c4c17ab7ec9765350a18"},"polygon-pos":{"decimal_place":18,"contract_address":"0xc708d6f2153933daa50b2d0758955be0a93a8fec"}}}