{"name":"BetaCarbon","id":"betacarbon","symbol":"bcau","description":"BCAU token represents 1kg of Australian Carbon Credit Units (ACCUs). ACCUs are carbon credits issued by the Clean Energy Regulator of the Australian Government. The BCAU token is the only token backed by ACCUs and is focused on maintaining high integrity carbon. It was created to allow the public to purchase ACCUs as an investment opportunity, opening up access beyond wholesale clients. BetaCarbon was founded by Guy Dickinson in November 2021, who previously served as the Head of Global Markets and Treasurer of HSBC Australia. Seeing an opportunity in carbon trading, Guy left HSBC and established BetaCarbon. Owning the BCAU token provides a twofold benefit. Firstly, it offers an investment opportunity in a previously restricted asset class. Secondly, it contributes to real-world change by reducing the supply of ACCUs available to major CO2e emitters in Australia. This forces emitters to either change their practices to comply with emissions caps or purchase credits at a higher price due to lower ACCU availability. For typical consumers, the BCAU token serves solely as an investment. The tokens are minted as more ACCUs are held by BetaCarbon's custodian, increasing the notional amount of ACCUs held for the BCAU token. It's important to note that despite fluctuations in the total supply of BCAU tokens, they remain 100% notionally backed at all times. Changes in supply do not impact individual holdings. The tokens can be bought, traded, or accumulated to balance emissions. By purchasing BetaCarbon tokens, the demand for carbon credits increases, incentivizing new carbon projects and making emissions more expensive. BetaCarbon offers the opportunity to buy, hold, and trade digitized representations of high-quality carbon credits, contributing to the transition to a low-carbon economy. Australia's approach to carbon markets differs from others. Emissions-intensive activities do not require permission. Instead, certain companies have obligations to offset emissions a","links":"https://www.betacarbon.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/betacarbon/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xa64efd5fe826f62e310a951332b519e1e3871489"}}}