{"name":"Gnosis","id":"gnosis","symbol":"gno","description":"What is Gnosis? Gnosis is a collective of aligned projects revolutionizing payments infrastructure to make decentralized financial tools accessible and usable for all The Gnosis ecosystem is underpinned by Gnosis Chain, a highly secure, resilient, and decentralized EVM Layer 1 network and also includes the venture-building arms, Gnosis Studio and GnosisVC, the developer, investor, and incubator of a host of leading decentralized solutions. These projects are creating a radically inclusive infrastructure helping bridge the gap between blockchain technology and practical, everyday applications/use cases. History of Gnosis Idealistic engineers who believe in restoring people's control over their own lives through building open financial tooling, Gnosis evolved and created industry standard applications such as the Gnosis Safe (multisig and programmable account), Cow Protocol (formerly CowSwap and Gnosis Protocol), Conditional Tokens (prediction markets), Gnosis Auction, Zodiac (standard and tooling for composable DAOs). Most recently Gnosis launched, Gnosis Pay, which allows users to spend crypto anywhere through the Gnosis VISA-supported debit card, and more. What is Gnosis token (GNO)? GNO is the staking token of Gnosis Chain and the governance token for the GnosisDAO and an index token for the Gnosis ecosystem. GnosisVC incubates, invests in, and supports projects in all early stages, spinning incubated projects out where appropriate. The relationship between these ventures and the token can take several forms: Either GNO is used as a token directly or the Gnosis token is economically coupled with the project tokens.","links":"https://www.gnosis.io/","market_cap":581706667,"market_cap_rank":138,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gnosis/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6810e776880c02933d47db1b9fc05908e5386b96"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xa0b862f60edef4452f25b4160f177db44deb6cf1"},"xdai":{"decimal_place":18,"contract_address":"0x9c58bacc331c9aa871afd802db6379a98e80cedb"},"energi":{"decimal_place":18,"contract_address":"0xf452bff8e958c6f335f06fc3aac427ee195366fe"}}}