{"name":"Ovr","id":"ovr_base","symbol":"ovr","description":"OVER: Decentralized Physical AI & World's Largest 3D Map OVER is a leading Physical AI platform building the world's largest 3D map. Leveraging a Decentralized Physical Infrastructure Network (DePIN) framework, OVER incentivizes a global community of mappers with OVR Tokens to scan high-traffic locations using common smartphones and 360-degree cameras. With over 150,000 locations mapped and 60 million+ images, OVER possesses the most extensive 3D Map dataset globally. This proprietary data powers diverse Physical AI applications: from training cutting-edge Vision Foundation Models to enabling precise Visual Positioning Systems and fostering AI-powered Extended Reality (XR) publishing and browsing. Vision Foundation Models Training: OVER utilizes its vast 3D Map data to train Vision Foundation Models crucial for robotics machine perception, coherent 3D reconstruction, and generation from monocular views. OVER both directly trains these models and licenses its data to leading AI companies and research centers. Visual Positioning System (VPS): OVER offers an API-based, state-of-the-art Visual Positioning System (VPS) service across all its mapped locations. This technology allows devices and robots to determine their position and bearing in space with centimeter-level precision. This is critical for the future of robotics, augmented reality, and fleet management. Thanks to its patent-pending TEE-powered VPS, OVER ensures end-to-end privacy for re-localization tasks. XR Publishing and Browse: The synergy of 3D Maps, VPS, and a decentralized spatial domain system (OVRLand) has enabled a groundbreaking XR publishing platform. With over 880k OVRLand sold, and 23,000 geo-localized AR experiences already published, the platform includes an AI 3D asset generator, an in-app AR Publisher, a Web XR Builder, and a Unity SDK for complex XR creations. XR content can be triggered via a dedicated OVER app and simple QR codes, supporting smart glasses, smartphones, and VR headsets. Crypto Ecosystem: The OVER crypto ecosystem is fueled by two tokens: OVR (fungible) and OVRLand (non-fungible). OVR Token: The native utility token and the sole medium of exchange within the platform. OVR incentivizes mappers, facilitates OVRLand purchases, and drives ecosystem growth through Web2 revenue re-injection via token buyback and burns. OVRLand NFT: Represents spatial domains of 300 square meters mapped to the physical world. OVRLand owners gain XR publishing rights on physical locations and a share of revenues from B2B XR publishing layer activities. With over 1.3 million registered users, 880,000 OVRLands sold to 30,000+ unique wallets, 23,000+ AR experiences uploaded by 4,000+ publishers, and 150,000 OVRMaps representing 45 million 3D-mapped square meters, OVER is pioneering the decentralized Physical AI landscape. Discover more at www.overthereality.ai.","links":"https://www.overthereality.ai/","market_cap":2821701,"market_cap_rank":2611,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ovr/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0x27e3bc3a66e24cad043ac3d93a12a8070e3897ba","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0x27e3bc3a66e24cad043ac3d93a12a8070e3897ba"}},"is_native":false}