{"name":"Radical Chess","id":"radical-chess","symbol":"chess","description":"What is the project about? Radical Chess is a 2D and 3D futuristic play-to-earn (P2E) chess game like no other. It takes the game of chess to the next level with unique and exciting gameplay. The 3D version is called Radical Chess Humanoid. This game features human characters as the chess pieces. They all have unique attributes and skills. The 2D version is the classic chess game like most chess platforms out there but Radical Chess has very competitive leaderboards that would encourage and incentivize active users on the platform. What makes your project unique? Radical Chess has both 2D and 3D unlike 95% of chess platforms out there. Radical Chess Humanoid (The 3D version) is like the first of its kind. The characters are unique and bring chess game to life. History of your project. Radical Chess was birthed from the idea of bringing chess pieces to life. To let players explore their imagination of each chess piece. For example, what kind of soldier would you think the Bishop is if he was a person? Probably an archer? Yeah that's the kind of idea Radical Chess Humanoid is trying to bring to life. The project has been worked on for over a year now. What’s next for your project? Radical Chess is looking to integrate all the p2e features into the game, start organizing in-person chess tournaments so as to bridge the gap between the online and offline chess game. What can your token be used for? CHESS will be used as the main currency in the NFT marketplace. CHESS can be staked to generate passive income. CHESS will be used on the coaching platform as the only means to transact. CHESS can be used to get entries to tournaments. CHESS will be used as the only means of payment for users who want to add their own custom models. CHESS will be used to get entry into some exclusive game modes.","links":"https://radicalchess.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/radical-chess/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xf3abd8caced73f4113206ec275cee965f6ed1d44"}}}