{"name":"Selo","id":"selo","symbol":"selo","description":"What is the project about? SELO+ project is a a hyperlocal based life logging app with inbuilt Social-Fi and augmented NFT narrative. The ultimate problem that SELO+ aims to solve is the mass adaptation of Web3. We have created a web3-based secondary trading and community platform that meets the needs of ordinary people, making web3 services very accessible to many ordinary users who had difficulty accessing existing blockchains or cryptocurrencies. We solved the lack of community participation with the reward of digital assets and created a virtuous cycle. History of your project. Link to overall roadmap: https://wp.sellonplus.com/eng/roadmap/service-roadmap In the first two quarters of the year, SELO team has launched the reward system, SELO token, NFT Badge system and wallet which led to over 280,000 wallet users. In upcoming quarter, SELO+ team is planning to launch an individual app for better user experience and What's main services for your project? SELO+ tools include: * SELO+ Wallet that lets users to manage cryptoassets and earn reward assets. * Activity Wall is a list of campaigns and advertisements for users to participate in return for rewards (token, NFT, vouchers, etc.) * Collection is the game-fi NFT system that includes marketplace and reward system to further encourage users to participate in SELO+ ecosystem. * Advertising banner for local businesses to promote their services and goods. What can your token be used for? SELO is the governance token that serves as a medium to connect users and foster participation in the hyper-localized SELO+ platform. To facilitate global usage and trust, the blockchain-based SELO token acts as a delivery medium, encouraging community activities and expanding local services globally. We will provide various policies and services to control the liquidity of the token within the platform, divided into the producer side and the consumer side. SELO is used for: * Fees for processing transactions (i.e., SELO+ wallet, NFT marketplace, etc.) * Purchasing membership to maximize the reward activity * Promoting in hyperlocal ads, ads wall for every user engagement in its advertisement protocol. * Launching campaigns (group purchase, activity wall, etc)","links":"https://seloplus.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/selo/logo.png","detail_platform":{"klay-token":{"decimal_place":8,"contract_address":"0x342633c4a7f91094096e15b513f039af52e960d9"}}}