{"name":"Hatom","id":"hatom","symbol":"htm","description":"Hatom has built a complete Ecosystem dedicated to fostering DeFi on MultiversX, offering a range of products designed to shape the landscape, including a lending and borrowing protocol, liquid staking, a native stablecoin, and lending as a service among other ventures. Hatom's ecosystem is committed to providing users with secure, transparent, and user-friendly access to DeFi services while emphasizing scalability and security within the MultiversX blockchain. Instruments for managing excess liquidity and liquidity demand are an essential element in the operation of DeFi systems. Hatom addresses this critical component by bringing a lending and borrowing protocol to life on MultiversX. This enables collateralized on-chain loans via an intuitive interface, making it possible to access liquid capital without selling positions. The comprehensive money market ecosystem prioritizes security and convenience via a self-service app that supports multiple digital assets. Hatom has also developed a Liquid Staking module that brings additional benefits on top of staking, making it possible to access liquidity for the staked collateral. This in turn will attract even more participants in the MultiversX PoS economy, leading to more value locked into it, and increased security and stability for our network. Instead of staking the regular way, users will be able to use the smart contracts linked to Hatom’s network of node operators to deposit funds, and immediately receive sEGLD tokens, proportional to the amount of EGLD staked. The resulting sEGLD tokens is pegged to EGLD and will accrues in value following the staking rewards and can be redeemed for EGLD at any time, without the standard unbonding (locking) period.","links":"http://hatom.com/","market_cap":27345724,"market_cap_rank":933,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hatom/logo.png","detail_platform":{"elrond":{"decimal_place":18,"contract_address":"HTM-f51d55"}}}