{"name":"Akita Inu ASA","id":"akita-inu-asa","symbol":"akta","description":"What is Akita Inu (AKTA)? Akita Inu (AKTA) is a community-building token on the Algorand blockchain that aims to drive adoption of and engagement with the Algorand ecosystem. It hopes to achieve this goal by: 1) Building a strong community of users and developers within the Algorand ecosystem, 2) Forging and facilitating collaborations between ecosystem projects and creators, 3) Raising funds for charities and shelters that help animals in need, and 4) Creating a suite of open-source Web3 tools that support ecosystem members and allow them to interact more effectively with the Algorand community as a whole. Upon release, all of the dApps within the latter DeFi suite will feature Akita Inu (AKTA) as their native token. Akita Inu is also responsible for the Akita Kennel Club (AKC), a collection of one thousand unique NFTs that grant holders access to the Akita Kennel Club and a range of members-only benefits. Ten percent of all revenues from primary sales are donated to animal charities. How Many AKTA Tokens are there in Circulation? Akita Inu launched on October 26, 2021 with 1 billion tokens created at genesis. Of these, 40% (400MM) were airdropped to the Algorand community; 35% (350MM) were used to provide liquidity on the Tinyman exchange; 20% (200MM) were retained for the Community Development Fund; and 5% (50MM) were reserved for the Founder’s Wallet. According to the Akita Inu team, tokens in the Founder’s Wallet will not be touched for at least twelve months after genesis. Who is Responsible for Akita Inu? Akita Inu is the brainchild of Founder & CEO Ryan Roberts, a project manager and veteran cryptocurrency investor who has been involved in the crypto space for over a decade. Before founding Akita Inu, he was also active as an NFT developer on the WAX, Ethereum and Algorand blockchains. Development of the Akita Inu project is driven by a transatlantic team whose skill sets include smart contract development, web development, marketing and graphic desig","links":"https://nft.akita.community/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/akita-inu-asa/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}