{"name":"Vemate","id":"vemate_binance-smart-chain","symbol":"vmt","description":"Vemate is the most versatile and dynamic application on the market which supplies trading analysis tools, market information, fractional and tokenised NFT trading as well as the only fully integrated Crypto - NFT bridging marketplace. Stage 1 fully developed VeVe NFT alarm and analysis app, launched on the 5th April (1 month before any fundraising was held) on Android & iOS with 8000 users and growing by approximately 1000 every week since the Ecomi(VeVe) partnership announcement - the app is currently free to use. The reason why it is very popular is because it would increase VeVe NFT trading efficiency by 400% through price change alarms, low mint alarms, chart analysis, vault value tools, price tracking tools and many more which are being constantly rolled out. •After launch, VeVe users will be able to access the app only by holding either $100 in VMT tokens or $200 in OMI tokens. With a potential pool of 700,000 VeVe users who will hold the VMT token long term and never trade it because of its utility. Stage 2 A holistic NFT platform that will encompass an informational module(similar to Coinmarketcap) which will condense all the major blockchain data in one place, an analysis module(similar to Trading View) and an NFT marketplace/large volume fractional NFT exchange. All of the aforementioned will have an automated educational assistant which will serve to help the Crypto or new users to learn about NFTs. This would take place after these users have been eased into the market by the large volume fractional NFT trading which enables them to enter the market without learning a single new skill.","links":"https://vemate.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vemate/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xe615c5e7219f9801c3b75bc76e45a4dab3c38e51","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xe615c5e7219f9801c3b75bc76e45a4dab3c38e51"}},"is_native":false}