{"name":"peaq","id":"peaq","symbol":"peaq","description":"peaq’s mission is to transform the Internet of Things, representing things becoming aware and connected, into a fully decentralized and self-sufficient Economy of Things, which enables individuals and organizations to extract maximum value and opportunity from their vehicles, machines, robots and devices, with minimal risk and waste. This will unlock and democratize the machine economy for the betterment of society, whereas a centralized Economy of Things would hyper-focus power, data and resources into the hands of a few large corporations. The peaq network creates an infinite loop of value creation and distribution for network participants by combining novel DeFi mechanisms with machines as yield farmers, Self-Sovereign Identity (SSI), and an advanced NFT- based machine ownership, making it possible for vehicles, machines and devices to safely achieve full autonomy and interact and trade in a decentralized, self-sufficient economy. By using these machine-centric mechanisms the network not only aligns all network participants on the same goal - usage - but moreover it subsidizes the creation of new machines and their SSIs via its own Self-Sovereign Identity framework specifically designed for machines being used by Fortune 100 companies. peaq’s native $PEAQ token has three primary uses: to sustain the network, to act as a means of exchange and to enable decentralized ownership of both the machine economy and machines themselves through Decentralized Economy Ownership (DEO) and Decentralized Machine Ownership (DMO) - firsts for the machine economy. Enabling DEO and DMO creates strong incentives for enterprises and individuals to add machines to the network by making it possible to profit from their provision of service to society while removing costly barriers to deploying machines on the network.","links":"https://www.peaq.network/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/peaq/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}