{"name":"Pine","id":"pine","symbol":"pine","description":"The native cryptographically-secured fungible protocol token of Pine (ticker symbol $PINE) is a transferable representation of attributed governance and utility functions specified in the protocol/code of Pine, and which is designed to be used solely as an interoperable utility token thereon. $PINE functions as the native governance token, access token, and economic incentives which will be distributed to encourage users to exert efforts towards contribution and participation in the ecosystem on Pine, thereby creating a mutually beneficial system where every participant is fairly compensated for its efforts. $PINE is an integral and indispensable part of Pine, because without $PINE, there would be no incentive for users to expend resources to participate in activities or provide services for the benefit of the entire ecosystem on Pine. Given that additional $PINE will be awarded to a user based only on its actual usage, activity and efforts made on Pine and/or proportionate to the frequency and volume of transactions, users of Pine and/or holders of $PINE which did not actively participate will not receive any $PINE incentives. $PINE Holders will have control over the PineDAO which governs both the Pine protocol and the Pine Platform and manages their future development. $PINE would allow holders to propose and vote on on-chain governance proposals to determine future features and/or parameters of Pine, with voting weight calculated in proportion to the tokens staked (the right to vote is restricted solely to voting on features of Pine; it does not entitle $PINE holders to vote on the operation and management of the Company, its affiliates, or their assets or the disposition of such assets to token holders, or select the board of directors of these entities, or determine the development direction of these entities, nor does $PINE constitute any equity interest in any of these entities or any collective investment scheme; the arrangement is not intended to be any form of joint venture or partnership). For example, users may propose usage of the PineDAO Treasury (which holds protocol funds) for platform/protocol maintenance, enhancements, grants, strategic partnership budgets, governance initiatives and other incentive programs. After governance launch there will be no individual or corporate entity or other active promoter, sponsor, or group or affiliated party that maintains sole control over Pine. Pine itself is simply a blockchain protocol that, by design, does not offer any resources for utilisation As such, in order for the protocol to perform its core function as a NFT liquidity protocol, users would need to be incentivised to deposit assets in the borrowing liquidity pools to provide liquidity for loans. As their reward, these liquidity providers which help to promote adoption of Pine by staking or including assets to liquidity pools in exchange for LP tokens would be rewarded with $PINE, according to each user's relative contribution after various adjustment and correction parameters. By distributing $PINE in this manner, it ensures that the governance token will be distributed primarily to key network contributors and allow them to have a say in protocol parameters. Likewise, users which deposit their NFTs and take out loans may also participate in the user incentive programs. $PINE functions as a loyalty membership point, so users will be classified into different loyalty tiers based on the amount of $PINE held, user activity, and/or volume of transactions. $PINE Holders will get exclusive access to tier-based special perks and access rights, some examples are exclusive first rights to buy certain liquidated NFT assets, interest rate or service fee discount for borrowing, or achieving seniority in the platform which will allow the lender to charge more favourable interest rates on loans.","links":"https://pine.loans/","market_cap":77796,"market_cap_rank":6294,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pine/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x569424c5ee13884a193773fdc5d1c5f79c443a51"},"polygon-pos":{"decimal_place":18,"contract_address":"0x612d833c0c7a54cdfbe9a4328b6d658020563ec0"}}}