{"name":"eHive","id":"ehive","symbol":"ehive","description":"The eHive protocol is a community inspired experiment in DeFi Crowdsourcing built on the Ethereum Network. In the coming months, ETH 2.0 will be launched and change the network from a Proof of Work (PoW) system to the new Proof of Stake (PoS) model. To enable this change in network operations the Ethereum Network is required to have validators nodes facilitate and verify the on-chain transactions. These validators will be generating ETH fees similar to previous Ethereum miners. However, the baseline for creating a validator is currently set at a minimum of 32 ETH, which is well out of the range of the typical DeFi user. Since validators will be the backbone of the new Ethereum Network, eHive and the development team believe that all users of cryptocurrencies should have the opportunity to participate in supporting the future of DeFi whether you have 0.01 ETH or 32 ETH. Through our token and dashboard eHive plans to make validators and their revenue available to all holders big and small. As the eHive token trades on Automated Market Makers (AMMs) 3% of all transactions will be reserved for the purchase of validators when ETH 2.0 is pushed to the main net (Estimated to happen in the next two months). As the eHive community purchases and operates their own validators, holders of the eHive token will be able to stake their tokens in our custom distribution contract. This contract will distribute the ETH generated by the node daily to each staker based on their share of the pool. On top of the ETH rewards, stakers will also receive eHive tokens to distribute the remaining supply to active members of the community. These tokens will only be generated until the maximum supply of 1,000,000,000,000 (one trillion) is reached. These token rewards are estimated to last approximately 2-3 years from the initial staking launch. All features will be easily accessible and visible on our dashboard that can be found on our website.","links":"https://ethereumhive.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ehive/logo.png"}