{"name":"Department of Government Inefficiency","id":"doginhood","symbol":"dogin","description":"DoginHood is a memecoin on Solana, set to grow into an expansive ecosystem and community hub. Its first web3 product is the pioneering, first-ever fully gamified launch platform—“Degen Caravan”. Degen Caravan, as the first platform of its kind, is revolutionizing token launches by merging gamification with early investments. Players engage in a 24-hour event divided into hourly rounds, shooting Arrows to deal damage, earn points, and compete on leaderboards. What makes this platform truly unique is its deflationary system: every Arrow shot incurs a fee, with 50% directed to a Buyback, making $DOGIN deflationary. This way, players not only compete for allocation but actively boost the value of $DOGIN with each action. The 24-hour event, “Degen Caravan,” isn’t just gamified—it extends to the entire process of farming Arrows. Participants engage in a fully featured Telegram game where they must whack notorious cryptospace villains like Sam Dogman Fried and DogWon. We're accelerating content creation for DoginHood, aiming to deliver top-tier, memecoin-focused content that builds community, strengthens culture, and generally expands our IP. To support this, we’re also pushing real-life products infused with our IP, expanding our presence beyond the digital world. The first real-life product we launched is “DoginFUEL,” an energy drink that we’ll use to sponsor as many conferences as possible to boost visibility and brand awareness. We already confirmed 5 countries where our next product will be in established real world stores, to be revealed. By combining high-quality, unique content and real-world products with the highest standard of web3 solutions, DoginHood ensures its growth into a thriving, long-lasting ecosystem that provides numerous utilities for the token, making it deflationary.","links":"https://app.doginhood.io/","market_cap":45401,"market_cap_rank":7696,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/doginhood/logo.png","detail_platform":{"solana":{"decimal_place":5,"contract_address":"DoGinuF39MGaxJDeJ3QDk4qd2vXwkYf5TDYpkdpYjip","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/DoGinuF39MGaxJDeJ3QDk4qd2vXwkYf5TDYpkdpYjip"}}}