{"name":"PE PE POKEMOON","id":"pe-pe-pokemoon","symbol":"pemon","description":"What is the project about? Pepe Pokemoon is an immersive gaming platform that utilizes the power of blockchain technology, Non-Fungible Tokens (NFTs), and Web 3.0. It’s a universe where players can explore, battle, trade, and earn with unique Pokemon-inspired creatures, known as PePemons. Our native token, PEMON, is at the heart of the platform's economy, enabling various interactions within the game. What makes your project unique? Our project uniquely blends the nostalgic appeal of Pokemon with the revolutionary potential of blockchain technology. The utilization of NFTs allows players to truly own their in-game assets, while the decentralized nature of Web 3.0 ensures security, transparency, and control over data. Moreover, our game is designed to provide both entertainment and an opportunity to earn, adding real-world value to the gaming experience. History of your project. The idea of Pepe Pokemoon was born out of a desire to bring the excitement of Pokemon into the world of blockchain. We started the project in [year] and have since gathered a team of passionate developers, artists, and blockchain enthusiasts. Over time, we have created an engaging and vibrant gaming universe that brings players from around the world together. What’s next for your project? We have a comprehensive roadmap laid out for the future of Pepe Pokemoon. Our future plans include continuous enhancements to the gaming experience, introducing new PePemons and game features, and further developing our marketplace. We also plan to expand our partnerships with other blockchain projects and platforms to increase the utility and reach of PEMON. What can your token be used for? PEMON, our native token, is integral to the Pepe Pokemoon ecosystem. It serves multiple purposes - it is a medium of exchange, enabling players to buy, sell or trade PePemons and other in-game assets on our marketplace. It also grants players access to exclusive content and features within the game.","links":"https://pepepokemoon.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pe-pe-pokemoon/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xdb612e3b52d8eda1a3e27bde2c82cc2d9ca9a61d"}}}