{"name":"Keko","id":"keko_ethereum","symbol":"keko","description":"What is the project about? Kekobank is a parody of the traditional financial system and institutions performed through crypto-native initiatives that use the token $KEKO as the common thread. “Kekobank is crypto’s first legacy financial institution”. Kekobank brings the speed, transparency, accountability and reliability of banks, public organizations and regulators to crypto. Kekobank manages KEKO, the token that unites the community of people who feel true love and respect for traditional financial institutions. What makes your project unique? Kekobank experiments with humorous performances using DeFi techniques and primitives, like mints, burns or swaps, and crypto's tools like Telegram, Twitter, using the traditional banking mannerisms as a common thread. History of your project. KEKO was born on Counterparty, in the Bitcoin ecosystem It was a token embraced especially by Rarepepe collectors, who collected and gave KEKOs a use. One year later, the collection migrated to Ethereumas an ERC1155, preserving the original nature of KEKO as an NFT and becoming the center of Kekobank. Eventually, the ERC1155 proved too inflexible for Kekobank’s purchase, Kekobank launched the ERC20. Now the ERC-1155 version of KEKO serves as the reserve asset for the cash, ERC-20 version. What’s next for your project? $KEKO is Kekobank’s main currency and it is at the center of Kekobank’s actions. Kekobank has a roadmap of initiatives that leverage the features of DeFi to create entertaining experiences around $KEKO and KEKO. What can your token be used for? $KEKO is the community token of the Kekobank project. It can also be used to make purchases on Manifold","links":"http://www.kekobank.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/keko_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x2c7f442aab99d5e18cfae2291c507c0b5f3c1eb5","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x2c7f442aab99d5e18cfae2291c507c0b5f3c1eb5"}},"is_native":false}