{"name":"Indigo Protocol","id":"indigo-dao-governance-token","symbol":"indy","description":"What is Indigo Protocol? Indigo is an autonomous synthetics protocol for on-chain price exposure to real-world assets, built on Cardano, and has brought the first Native Stablecoin to the Cardano ecosystem, iUSD. How does Indigo work? Indigo allows anyone to create synthetic assets, known as iAssets. iAssets can be created using currencies such as stablecoins and ADA. They have the same price effect as holding the asset being replicated. This allows you to gain profit from the increase in price of an asset without owning the original asset itself. What are Synthetic Assets? Synthetic Assets give users exposure to a variety of assets without the need to actually own the underlying asset. These assets can be anything that has value in the real world. With its transparency, efficiency, low barriers to entry, and decentralized traits, the Blockchain can smoothly deliver all these assets to anyone with access to the Internet. The INDY governance token comes from its use in the Indigo DAO voting process. The total supply of INDY will be 35M tokens with a 6-decimal precision. The max supply of INDY will be distributed to protocol users, stakers, and LPs over the course of four years. We believe in a fair distribution of the INDY tokens to the early adopters of the protocol, therefore there will be NO community pre-sale via ICO/ISO/ISPO. What is the Indigo DAO? Indigo is a decentralized community-led project. The Indigo DAO owns the Indigo Protocol, including the application, website, and all intellectual property. A DAO (decentralized autonomous organization) is like a company, but instead of being incorporated in a country is established in a blockchain. You, the Indigo community, control the decisions for the Indigo DAO. You can cast your votes using the INDY token. A forum has been established to help facilitate community votes. All Indigo community members are encouraged to join the forum to propose, discuss and vote on ideas to guide Indigo’s future direction.","links":"https://indigoprotocol.io/","market_cap":34911858,"market_cap_rank":1115,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/indigo-dao-governance-token/logo.png","detail_platform":{"cardano":{"decimal_place":6,"contract_address":"533bb94a8850ee3ccbe483106489399112b74c905342cb1792a797a0"}}}