{"name":"Hycon","id":"hycon","symbol":"hyc","description":"HYCON, which stands for Hyper-Connected Coin, is the digital asset built on top of a faster and more scalable blockchain developed by the Infinity Project team in Gangnam, Seoul. Using a <a href=\"https://www.coingecko.com/en?hashing_algorithm=Directed+Acyclic+Graph+%28DAG%29&view=market\">DAG (Directed Acyclic Graph)</a> structure, it has the capability to publish several blocks simultaneously with the ability to resolve conflicting transactions and reject double-spends through the SPECTRE consensus algorithm. This makes HYCON a next-generation cryptocurrency which can be used in the real economy. Honest transactions can be confirmed or rejected definitively in mere seconds, due to the high volume of blocks published within that time interval. Transactional throughput up to 3000Tps on a 2MB/s connection can be achieved as a starting point of the project. The DAG structure coupled with the SPECTRE protocol allows for network latency to be essentially removed as a limiting factor on transactional throughput. Blocks that are received out of order can still be ordered based on their implied position in the DAG rather than the time they were received. HYCON is Phase 1 of the Infinity Project Ecosystem and positioned for wide adoption as an efficient medium of exchanging value for enterprises, small businesses, governments, NGOs, and individuals. Together with the Infinity blockchain, HYCON will power the Infinity Platform (Phase 2) and Infinity Decentralized Exchange (Phase 3). The Infinity Platform will feature a simple and intuitive user interface to empower anyone with the ability to create their own customized and private Infinity blockchain. For example, enterprise solutions built upon the Infinity Platform will help increase accountability, enhance transparency, and improve data security, thus bringing value to companies and society.","links":"https://hycon.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hycon/logo.png"}