{"name":"HODL","id":"hodl_solana","symbol":"hodl","description":"$HODL is a decentralized finance (DeFi) project built on the Solana blockchain, aiming to provide people with a means to celebrate and take part in the HODL movement. The significance of HODL in the space is significant given the nature of the phrase and its virality. Its deep roots have spread from top to bottom within the space which deeply embeds it within crypto culture. $HODL serves as a movement that aims to bring the crypto world together through exciting memes and community. Our token $HODL serves as a means for developing something special within the world of crypto which serves to rally people together towards a commonly understood and celebrated idea and cultural phenomenon. The meme $HODL has become an iconic and widely recognized term in the cryptocurrency and blockchain community. Originating from a misspelling of \"hold\" in a Bitcoin forum post in 2013, the term has since evolved into a rallying cry for long-term investors in the crypto space. The meme has been embraced by enthusiasts and professionals alike, symbolizing the steadfast belief in the potential of digital assets and the resilience of the crypto market The $HODL meme has transcended its original context and has been adopted as a symbol of resilience, determination, and conviction within the crypto community. It has become a lighthearted and relatable expression of the challenges and triumphs experienced by cryptocurrency enthusiasts, resonating with individuals who share a commitment to weathering the ups and downs of the market. In addition to its social recognition, HODL also has significant connections to current influencers within the space and will form significant partnerships with other large projects alongside companies!","links":"https://www.hodlonsol.vip/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hodl_solana/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"58UC31xFjDJhv1NnBF73mtxcsxN92SWjhYRzbfmvDREJ","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/58UC31xFjDJhv1NnBF73mtxcsxN92SWjhYRzbfmvDREJ"}},"is_native":false}