{"name":"Mad Viking Games Token","id":"mad-viking-games-token","symbol":"mvg","description":"What is the project about? Mad Viking Games, is a blockchain-based gaming company that aims to create a new kind of NFTs for video games. The studio uses the new game engine Unreal Engine 5 to develop two high quality video games, one of which is a turned-based game oriented towards Esports, while the other is an open-world game oriented towards exploration of the nine realms in Norse Mythology. What makes your project unique? Mad Viking Games unique in that it is inspired by Norse Mythology and uses Unreal Engine 5 to create High Quality video games. The project leaders are danes and direct descendants of the Vikings, which further adds to the authenticity of the project. History of your project. Mad Viking Games started in October 2021, and has recently migrated from the Vechain Blockchain to the BNB Smart Chain, where the marketplace, staking and governance platform will be launched. What’s next for your project? the studio will continue to develop the two video games, release them, and work on the platform. They aim to create a dynamic marketplace of buying and selling NFTs while providing an inclusive and participatory space for gamers and investors to influence the development of the games and projects. What can your token be used for? The MVG token is the core of the Mad Viking Games project and plays an important role in the platform's ecosystem. The token can be used to purchase NFTs on the platform's marketplace, as well as to stake and earn GEMS, a secondary token within the platform. Overall, the MVG token is a vital component of the Mad Viking Games project and provides users with a way to participate in the platform's ecosystem while also gaining access to unique gaming experiences and opportunities.","links":"https://madvikinggames.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mad-viking-games-token/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc45de8ab31140e9ced1575ec53ffffa1e3062576"}}}