{"name":"WolfWorksDAO","id":"wlitidao_polygon-pos","symbol":"wwd","description":"\"wLiti DAO (WLD)’s smart contract was deployed on Feb. 7th, 2022 and was listed on its first exchange (Quickswap) on Feb. 10th, 2022. It was created by a group of wLITI token holders who chose to use wLITI as the foundation for the WLD token. When a person deposits wLITI tokens into the DAO smart contract, WLD tokens are minted at a 1 to 1 ratio with the wLITI being deposited. wLITI tokens can be withdrawn from the DAO smart contract at any time, except for when the wLITI is converted into LITI tokens to represent all of the wLiti DAO members (a wLiti DAO member is anyone who owns WLD). When wLITI tokens are withdrawn from the DAO, the WLD tokens that are being swapped for the wLITI are burned at a 1 to 1 ration with the amount of wLITI being withdrawn. wLiti DAO will continuously evolve overtime to serve the best interests of the wLiti DAO members. The wLiti DAO’s governance smart contract will not be able to execute any transactions unless the wLiti DAO members approve the transaction through the use of proposals and voting. Proposals are proposed transactions that the wLiti DAO’s governance smart contract can execute. The transaction proposals can be created by any wLiti DAO member. The transaction proposals must have a majority vote from the DAO members to be before they can be approved and will not be executed by the wLiti DAO’s governance smart contract if it does not have a majority vote from the wLiti DAO members. In addition to wLITI being the foundational asset of wLiti DAO, the DAO owns more assets and offers additional services that will ultimately generate more revenue for wLiti DAO. This revenue will go to the DAO's treasury to fund the DAO's endeavors and / or be distributed to the wLiti DAO members. One of the assets that the DAO has acquired is 1% of a large investment default case that has a $1 billion claim. When awarded, a portion of this will be used to fund the DAO's treasury and the rest will be distributed prorata to the wLiti DAO members. wLiti DAO is working with other organizations, such as Athena Intelligence, to offer operational due diligence, scam prevention and insurance services to startup projects, vetting the company principals and offering ongoing scam / fraud monitoring protection and insurance. wLiti DAO’s treasury, owned and managed by the wLiti DAO members through the use of the wLiti DAO’s governance smart contract, will receive a one-time fee plus a small transaction tax to pay for future legal and investigative work. A portion of this revenue will be distributed prorata to the all of the wLiti DAO members. wLiti DAO members will also be able to take educational courses that are created by wLiti DAO, plus have the opportunity to earn bounties for field work, analysis, and penetration testing.\"","links":"https://wolfworks.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wlitidao/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xd3144ff5f388d36c0a445686c08540296d8b209b","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xd3144ff5f388d36c0a445686c08540296d8b209b"}},"is_native":false}