{"name":"Wizzwoods Token","id":"wizzwoods-token","symbol":"wizz","description":"Wizzwoods is an engaging open-world strategy farming game built on the TG Mini-app and Twitter Extensions. As you explore the world of Wizzwoods, you'll experience strategic production, user-generated content, multiplayer interactions, cross-chain trading, and more. You'll be immersed in a world that combines blockchain ownership with your gaming enjoyment, offering a captivating blend of management, creation, competition, and trading.​ Wizzwoods is set to be the top pool on Berachain, where $WIZZ LP pairs can earn the most $BGT. Our game allows users to earn yield through DeFi protocols or by providing liquidity, making it the top beneficiary of Berachain's POL/BGT mechanism. It’s not just a game; it’s a DeFi powerhouse. Imagine users interacting with complex DeFi protocols on Berachain simply by playing a game!​ Wizzwoods is a unique blend of Pixels, Axie Infinity, and DeFi Kingdoms, but with a twist—it’sinterchain with Berachain, TON, and Tabi. It’s the only game of its kind, bridging multiple blockchain ecosystems and unlocking a truly new gaming experience that only be achieved interchain.​ Unlike typical GameFi projects, Wizzwoods already generates substantial income from real users. Our external revenue streams are designed to make Wizzwoods a long-term success, providing value back to our community, while avoiding the pitfalls of the usual solely internal economy ponzia. This is sustainable GameFi at its finest.​ Behind every successful game that there is a thriving, actively engaged, and passionate community. From the launch of our first Twitter Extensions test version to the official TG Mini-app release, we have received enthusiastic responses from millions of players across dozens of countries and regions. With such momentum, there is no doubt our community will continue to grow and flourish.","links":"https://www.wizzwoods.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/wizzwoods-token/logo.png","detail_platform":{"berachain":{"decimal_place":18,"contract_address":"0x01c8a5ccad23a4d3764ef71c403862160aa2913a","geckoterminal_url":"https://www.geckoterminal.com/berachain/tokens/0x01c8a5ccad23a4d3764ef71c403862160aa2913a"}}}