{"name":"Green Grass Hopper","id":"green-grass-hopper","symbol":"$ggh","description":"GGH DESCRIPTION GGH (GREEN GRASS HOPPER), A True Defaltionary Token, is the utility token of Everestgaming.io - A complete Defi Casino. It is built to make our holders happy and be part of a strong community. We go above so that you can go beyond! The vision of $GGH is to generate wealth for a decentralized community in a safe and secure environment, leveraging DeFi protocols and impacting the globe for good, thereby cherishing the memory of our beloved Archie. Green Grass Hopper ($GGH) is created to help all of our holders to achieve their dream of being wealthy. We have created our utility before creating our token to ensure everyone benefits from day one. It is a real deflationary token with a total supply of 10 million that has a BUY-BACK & BURN MECHANISM built-in with every sale. GENERAL INFORMATION A. UTLITY – EVERESGAMING.IO IS LIVE with 24 Games and over 5000 players online. B. CREDIBILITY a. AUDITED CONTRACT by Verified Team b. KYC DONE Multiple (assure defi & Pinksale) c. DOXXED DEV d. BASED DEV with MULTIPLE PROJECTS e. SAFU CONTRACT by Verified Team. C. MULTI-CEX AND MULTI-DE LAUNCHES COMING SOON $GGH TOKEN INFORMATION 1. 1O MIL TOTAL SUPPLY 2. 15% BURN BEFORE LAUNCH 3. BUY/SALE TAX: 4/8 4% BUY - BACK & BURN ON EVERY SALE 4. CONTRACT IS HARD-CODED SO THAT TAX CAN NEVER GO OVER 8%5 5. NO PRIVATE SALE 6. WALLETS LOCKED FOR 1 YEAR a. LIQUIDITY b. DEVELOPER c. FOUNDATION 7 TEAM WALLET VESTED FOR 1 YEAR 8. 5% OF TOTAL TOKEN FOR STAKING REWARDS 9. 20% LEFT SIDE FOR REWARDS TO HOLDERS A TOKEN FOR THE PEOPLE. HTTPS://GREENHOPPER.IO/ $GGH FAIR LAUNCH HIGH LIGHTS 1. CONTRACT DONE BY SAFU TEAM 2. AUDITED BY CGF/NINJA – VERIFIED BASED 3. AGGRESSIVE MARKETING 4. CG/CMC FAST-TRACK LISTING 5. DEXVIEW/AVEDEX UPON LAUNCH 6. 20+ VOTING/TRENDING LISTED 7. MAX BUY 1 BNB 8. REWARDS FOR 1 BNB BUYERS a. 10% ADDITIONAL TOKENS b. WL to GGH NFT c. 10% OFF GGH NFT 9 3% AFFILIATE PINKSALE PROGRAM $GGH POST-LAUNCH 1. MULTI-EXCHANGE LISTING 2. MULTI-DEX LAUNCH 3. STRATEGIC MARKETING The vision of $GGH is to generate wealth for a decentralized community in a safe and secure environment, leveraging DeFi protocols and impacting the globe for good, thereby cherishing the memory of our beloved Archie. Green Grass Hopper ($GGH) is created to help all of our holders to achieve their dream of being wealthy. We have created our utility before creating our token to ensure everyone benefits from day one. It is a real deflationary token with a total supply of 10 million that has a BUY-BACK & BURN MECHANISM built-in with every sale. $GGH 🤑– A True Deflationary Token with 4% Buy Back & Burn 🔥on every sale – is the utility token of Live Everestgaming.io ♠️♥️♣️♦️with over 5100 players and 24 Games. 💥4% Buy & 8% Sale Tax with 4% with buy Back and Burn on every sell will make early investors $$$. 👍👍CG/CMC PRE LISTED. 🚀Based DEV. 🔥Many Exchanges Planned. ✅✅✅Trending all across. ⏰Aggressive Fair Launch and Post Launch Marketing in place. 👉Fair Launch Special: 1️⃣1 bnb Max per wallet buy.10% Rewards to all 1 bnb buyers that HODL 30 days plus 2️⃣WL to GGH NFT and 3️⃣10% off on GGH NFT with many Benefits. 3% Affiliate rewards. ✅LP 1 yr Locked 🔒 Dev wallet 1 yr Locked ✅Token of 2023 with the best rewards system for HOLDERS! Join Today.","links":"https://greenhopper.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/green-grass-hopper/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xb4cb54a2078816516ea1b176fba58b0a0bde815f"}}}