{"name":"Arkham","id":"arkham","symbol":"arkm","description":"Arkham is a cryptocurrency exchange and blockchain analytics platform offering a single site with everything a trader needs, including spot & derivatives trading, intelligence & analytics, and news & research, to millions of users around the world. Arkham Intel provides traders with advanced analytics to inform their trading and risk management with over 2 billion blockchain addresses labeled, 92% of on-chain value attributed, and $830 trillion of labeled asset flow. Arkham takes data directly from the blockchain and makes it usable and actionable by anyone via a searchable database of individuals and institutions showing their on-chain holdings, transactions, counterparties, and net worth. On top of this data, Arkham Intel offers a suite of advanced tooling, including alerts, network maps, custom dashboards, AI-powered market analysis, and an API. Arkham Exchange is a central limit order book (CLOB) spot and perpetuals exchange which integrates trading and intelligence for transparent and informed decision making. Select features include on-chain proof of funds verification, real-time analytics for deposits and withdrawals, REST and WebSocket APIs, and one-click analytics for any market. Arkham Exchange also offers a VIP affiliate program, points, referral commissions, trading competitions, and other incentives for rewarding users. Arkham was founded by Miguel Morel who serves as CEO. Miguel is a veteran entrepreneur in cryptocurrency markets. Miguel’s experience navigating crypto markets makes him familiar with the intelligence needs of decision makers in government, venture capital, and trading. He is also an investor in a number of technology startups.","links":"http://arkm.com/","market_cap":245558983,"market_cap_rank":298,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arkham/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6e2a43be0b1d33b726f0ca3b8de60b3482b8b050","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x6e2a43be0b1d33b726f0ca3b8de60b3482b8b050"}}}