{"name":"BB Gaming","id":"bb-gaming","symbol":"bb","description":"BB Gaming is a multiplayer role-playing game based around the BeansPack NFT collection. Apart from the ecosystem’s Big Beans token, the game’s primary token is $HONEY. Players can earn $HONEY through a number of different activities that include farming, breeding, and competing with other players. Through the implementation of Big Beans Gaming’s bespoke P2E model, players will be able to directly benefit from the value they provide. Beyond simply being able to earn tokens or embark on quests, BeansPack NFT holders will be able to secure governance rights, beta testing opportunities, and be afforded access to exclusive membership benefits such as the ability to add specific gaming features like weapons and ships. Further, the ability to purchase virtual land will provide investors with an opportunity to create passive income. These virtual land factories will be sold as individual properties that can be used to produce resources within the game. These resources can then be redeemed for the in-game currency $HONEY, allowing factory owners to earn an income from the resources their properties produce. In summary, Big Beans Gaming’s ecosystem will consist of the following: • Play-to-Earn gaming • NFTs • Virtual land • Cartoons and action figures • An exclusive NFT marketplace • Mini-games Their virtual currencies will include both the Beans token as well as the in-game $HONEY token that players will be able to earn through their play. The buyback system is designed to remove tokens from the total supply and is comprised of two separate components, here is the breakup of each of these. The primary component of the buyback system comes in the form of a simple sales tax. For every sale that is made on the platform, a 10% sales tax is charged in order to process the buy order. These tokens are then immediately burned thereby decreasing the total amount of tokens in the ecosystem. The secondary component of Big Beans’ buyback system is slightly more complex. This component effectively accelerates the increase of the tokens value by purchasing twice the U.S dollar value of the most recent sale in any given period. As a result, twice as many tokens are purchased thereby increasing the price of the token. After purchase, these tokens are also immediately burned from the total supply. These two components will ensure that a healthy supply of tokens is being consistently burned from the ecosystem preventing the currency from becoming the victim of inflation.","links":"https://bigbeansgaming.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bb-gaming/logo.png"}