{"name":"Reserve Rights","id":"reserve-rights-token","symbol":"rsr","description":"Reserve is a free, permissionless platform on Ethereum mainnet to build, deploy and govern asset-backed currencies referred to as “RTokens.” RTokens are always 1:1 asset-backed, allowing for permissionless minting and redeeming on-chain by users without the need for any middlemen. Overcollateralization is provided by RSR governance token stakers. Each RToken can have an entirely different governance system and is governed separately by ecosystem stakers. The Reserve Protocol launched on Ethereum mainnet in Oct 2022 and completed its fifth audit in Feb 2023. Three of the RTokens already live on the protocol are High Yield USD (hyUSD) is a secure high yield savings dollar with up to 8% APY expected to outpace the rate of inflation in over 100 countries around the world. ETHPlus (ETH+) is a safety-first diversified ETH staking index with up to 4.5% APY. Electronic Dollar (eUSD) is a hyper-resilient stablecoin built to endure black swan events, recently proving itself during the run on Silicon Valley Bank. The Reserve protocol enables the creation of a new kind of money that holds long term value better than fiat currency. Imagine a stable universal currency as reliable as the sunrise. That’s what we’re aiming for. The protocol has undergone an extensive four-year research and development process, resulting in a codebase that has been rigorously tested and audited.","links":"https://reserve.org/","market_cap":250295258,"market_cap_rank":202,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/reserve-rights-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x320623b8e4ff03373931769a31fc52a4e78b5d70"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xca5ca9083702c56b481d1eec86f1776fdbd2e594"},"base":{"decimal_place":18,"contract_address":"0xab36452dbac151be02b16ca17d8919826072f64a"},"energi":{"decimal_place":18,"contract_address":"0xfce13bb63b60f6e20ed846ae73ed242d29129800"}}}