{"name":"Reserve Rights","id":"reserve-rights-token","symbol":"rsr","description":"What Is Reserve Rights (RSR)? Reserve Rights (RSR) is an ERC-20 token that serves two main purposes for the Reserve protocol: overcollateralization of Reserve stablecoins (RTokens) through staking and governing them through proposing & voting on changes to their configuration. The Reserve Rights (RSR) token was launched in May 2019 following a successful initial exchange offering IEO on the Huobi Prime platform. What is Reserve Rights (RSR) used for? Besides being the governance token for Reserve stablecoins (RTokens), by which changes to RTokens can be proposed & voted for with RSR, Reserve Rights exists as a backstop to make Reserve stablecoin (RToken) holders whole in the unlikely event of a collateral token default. In order for RSR holders to provide this overcollateralization, they can decide to stake on any one RToken, or divide their RSR tokens by staking on multiple RTokens. RSR holders can also decide not to stake their RSR at all. In return for providing this first-loss capital, RSR stakers can expect to receive a portion of the revenue the RToken they stake on makes. As a general rule, RSR stakers can expect higher returns (APYs) the bigger the market cap of the RToken they stake on becomes. In contrast with the “staking” you see in a lot of other projects these days, RSR staking is built to last. In Reserve’s model, late participants do not pay for early participants, nor is a trust in staking of other parties required. For more detailed information on RSR staking, please refer to the RSR staking section in the protocol documentation: https://reserve.org/protocol/reserve_rights_rsr/#reserve-rights-staking. Who are the founders of Reserve? Reserve was co-founded by Nevin Freeman and Matt Elder. Freeman is a seasoned entrepreneur. He describes his life goal as \"solving the coordination problems that are stopping humanity from achieving its potential.\" Matt Elder, on the other hand, is an experienced engineer who previously worked for Google and Quixey, and worked to oversee the architecture of the Reserve protocol's technical implementation. Since its launch in 2019, the amount of contributors to the Reserve ecosystem has grown considerably, including community, engineers, and legal and compliance staff — all unified under the shared ambition to position Reserve as an open, massively scalable stablecoin platform that promotes economic prosperity. What Makes Reserve Rights Unique? Unlike other stablecoins that are typically backed by U.S. dollars (USD) held in reserve in a bank account controlled by the stablecoin issuer or a trusted custodian, Reserve stablecoins are backed by a basket of cryptocurrencies managed by smart contracts. These baskets can consist of any ERC-20 assets. During the initial stages, RTokens mostly include other cryptocurrencies, such as liquid staking tokens (e.g. stETH) or yield-bearing DeFi position (e.g. cUSDC). Eventually, the Reserve community will transition to more diverse baskets, which might include fiat currencies, securities, commodities and complex asset types, like synthetics and derivatives. Read more about Reserve’s long-term goals here: https://reserve.org/protocol/our_long_term_goal/ How Many Reserve Rights (RSR) Coins Are There in Circulation? Reserve Rights has a fixed supply of 100 billion tokens. Out of this, about 52% are currently in circulation as of September 2024. The maximum token supply has already been pre-mined, but a large proportion is locked for various reasons, including 49.4% of the supply locked in a smart contract known as the \"Slow wallet.” Funds from this wallet are released according to a deterministic schedule, which you can read more about here: https://blog.reserve.org/reducing-rsr-emissions-6da7f35917ba The Reserve Rights token initially launched with a circulating supply of 6.85 billion tokens, of which 3% were distributed to Huobi Prime IEO participants, 2.85% released as project tokens and 1% to private investors. All team, advisor, partner, and seed investor tokens have been unlocked via one of two options - one that has started in January 2022, and the other that started upon the launch of the full Reserve protocol on Ethereum mainnet. Read all about the Reserve Rights unlocking schedule here: https://reserve.org/protocol/reserve_rights_rsr/#reserve-rights-release-schedule. How Is the Reserve Rights Network Secured? Reserve Rights is currently an ERC-20 token based on the Ethereum blockchain. As a result, it is secured against attacks by a robust proof-of-work (POW) consensus mechanism backed by a network of thousands of Ethereum miners. Where Can You Buy Reserve Rights (RSR)? Reserve Rights (RSR) is a popular token that currently maintains excellent liquidity. It is available to purchase and trade on several of the most well-established cryptocurrency exchange platforms, including Binance, Huobi Global and OKX, and can be traded against various popular cryptocurrencies, including Bitcoin (BTC), Tether (USDT) and Ethereum (ETH), as well as the U.S. dollar (USD) on multiple platforms.","links":"https://reserve.org/","market_cap":753089138,"market_cap_rank":169,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/reserve-rights-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x320623b8e4ff03373931769a31fc52a4e78b5d70"},"arbitrum-one":{"decimal_place":18,"contract_address":"0xca5ca9083702c56b481d1eec86f1776fdbd2e594"},"base":{"decimal_place":18,"contract_address":"0xab36452dbac151be02b16ca17d8919826072f64a"},"energi":{"decimal_place":18,"contract_address":"0xfce13bb63b60f6e20ed846ae73ed242d29129800"}}}