{"name":"Crown by Third Time Games","id":"crown-by-third-time-games","symbol":"crown","description":"#What is CROWN CROWN is the official utility token of Photo Finish™ LIVE, which is the official game of the Kentucky Derby. It's a vital component of the game ecosystem and provides users with unique opportunities and benefits, and is integral for becoming a track owner within the game. #What Makes CROWN Unique? CROWN brings a novel application of blockchain technology to the world of digital horse racing and gaming. It allows for the operation of tracks within Photo Finish™ LIVE. The token serves multiple purposes – from paying for in-game benefits, to stake as a demonstration of ownership rights over tracks, to providing a form of reward for successful racing careers. #History of CROWN The concept of CROWN was born alongside Photo Finish™ LIVE. Its development and integration into the game ecosystem have been geared towards enhancing user experience and introducing decentralized elements to the world of digital horse racing. While relatively new in the blockchain space, CROWN is gaining traction rapidly due to its unique application, growing user base, and alignment with the top brands in the sport. #What’s Next for CROWN Future developments for CROWN include further enhancements to its utility within the Photo Finish™ LIVE ecosystem. It will continue to evolve in line with the needs and desires of the game's user base. Additional functionalities, game features and rewards systems may also be integrated with CROWN, further entrenching its importance within the game ecosystem. #Learn More - The tokenomics whitepaper: https://www.dropbox.com/s/1h8rm2nn8jt9afe/CrownWhitepaper.pdf?dl=0 - CROWN resource center: https://thirdtimegames.com/crown-staking-resource-center/","links":"https://thirdtimegames.com","market_cap":62661641,"market_cap_rank":595,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crown-by-third-time-games/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"GDfnEsia2WLAW5t8yx2X5j2mkfA74i5kwGdDuZHt7XmG"}}}