{"name":"Vara Network","id":"vara-network","symbol":"vara","description":"What is the project about? Vara Network is a substrate-based future proof smart contract platform that is fast, scalable, and makes it simple to create and deploy next-generation Web3.0 dApps Vara is the first standalone network in the Gear Protocol Gear is a next-gen cloud infrastructure platform providing most intuitive and frictionless environment for web2 and web3 developers to build complex infrastructure solutions and disruptive dApps for any ecosystem What makes your project unique? Vara is built upon three core concepts: The actor model, and persistent memory — two widely adopted primitives from massive computation and microservices architecture spaces Wasm — a WebAssembly-based virtual machine that runs on all modern browsers. Proven to be faster than any alternative web2 virtual machines Vara was created to serve as a wasm-native hub for innovative protocols that leverage parallel execution and asynchronous programming to deliver leading decentralized products in any segment History of your project. Gear Protocol and the Vara Network were originally created by Nikolay Volf, one of the core developers of Polkadot. In 2021, he embarked on building an advanced layer 1 smart contract platform using Substrate, Polkadot's custom framework. His vision included creating a platform that enables fast and efficient execution of robust, feature-rich dApps while in a seamless development environment similar to that of Web 2.0 development. He did this by harnessing the power of innovative technologies like Wasm, the Actor Model, and Persistent Memory. These technologies significantly enhance smart contract development and provide a seamless end-user experience and provide the foundation for the development of Vara Network. 1. Q2 2021 - Pre-Seed Round: In the second quarter of 2021, the Protocol secured its initial funding through a pre-seed round. This likely involved seeking investment from early-stage investors or venture capitalists to kickstart the development of the project. 2. Q4 2021 - Seed Round: In December 2021 raised $12 Million in Venture Round. Private investment round led by Blockchange Venture. In addition to Blockchange, other top venture capital funds participated in this round, including Three Arrows Capital, Lemniscap, Distributed Global, LAO, Mechanism Capital, Bitscale, Spartan Group LLC, HashKey, DI Ventures, Elysium Venture Capital, Signum Capital and P2P Economy lead by Konstantin Lomashuk, along with a number of top executives of Web3 Foundation and Parity Technologies. Dr. Gavin Wood, Founder and ex-CEO of Parity Technologies and one of the key individual investors participating in this round. 3. 2022 - Intensive Scaling and Development, First Test Integrations: Throughout the year 2022, Vara was focused on two primary activities. First, the engagement in an extensive outreach process to build up the team. Second, the project advanced its technical development efforts and started working on integrating their technology with various test environments to ensure its functionality and viability. 4. Q4 2022 - Testnet Launch. 5. Q1 2023 - PoA Launch: In the first quarter of 2023, Vara achieved launch of its Proof of Authority (PoA) consensus network, which is a chain candidate for mainnet. Current Status of Vara: Presently, the project boasts a talented and diverse decentralized workforce, consisting of dozens of engineers and other community members to drive the project's success. One of the remarkable aspects of Vara is its substantial pipeline of initiatives with over 40 projects. What’s next for your project? Current projects being researched and developed by the community: - Intensive testing and improvement of the actor model features in the blockchain space - Launch of the key stack of dApps in our parallel and asynchronous environment - Development of innovative infrastructure solutions (e.g offchain zk actors including machine learning) independently and together with the segment leaders What can your token be used for? VARA tokens maintain core utility features required for the network to operate: transaction fees staking and network security governance other: gas pools for gas reservation Contributors to the Gear protocol are exploring the mechanics of how to distribute a portion of block rewards directly toward dApp developers","links":"https://vara.network/","market_cap":44035679,"market_cap_rank":731,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/vara-network/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}