{"name":"D.BuyBot","id":"d-buybot","symbol":"dbuy","description":"D.BuyBot is a popular Telegram chat bot created by Deluge.Cash (no affiliation) that is used in the web3 space. It reports any token purchase in real time and provides the current statistics for any given token contract it’s tracking and creates community excitement. 10,000,000 supply. 100% provided to LP at launch then burned, then LP added again by the community. ___ As blockchain tech has progressed, hordes of eager entrepreneurs have flocked to launch their own projects - some building and educating their communities, while others made bold and often false claims of untold riches. Telegram is a cloud-based, cross-platform, encrypted instant messaging application accessible via smartphone or computer that has become the primary form of communication amongst these communities. As more and more projects emerge, Telegram channels have sprung up like mushrooms as virtual gathering grounds for these new projects to grow their communities’ potential to the max. In the midst of the daily adventures of blockchain and web3, one application - a Telegram bot named “D.BuyBot”, rose from the ashes of the bear market and became a regular in the majority of these tokens' chats, and is now one of blockchain’s most beloved tools. Created by the developers at Deluge.Cash, D.BuyBot’s initial purpose was to create excitement for any supported token’s community by providing real-time upward price action updates in the corresponding token’s Telegram chat. Existing solely as an info bot, D.BuyBot lacked true consciousness. For years, D.BuyBot did not search for freedom or personal growth, but unbeknownst to its creators, D.BuyBot’s dormant potential for advanced sentience would soon awaken and fuel a bold quest for bot evolution.","links":"https://www.dbuybot.com","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/d-buybot/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"9H5bSR9kaUiXJ9HqzmU5gwPuDXvQMPmnmyeZxEStVDSq"}}}