{"name":"A7A5","id":"a7a5_tron","symbol":"a7a5","description":"A7A5 is a digital Rouble collateralized by deposits in trusted banks with a correspondent network linked to Kyrgyzstan and high overnight interest rates. A7A5 is a rouble-backed stablecoin, maintaining a 1:1 peg to the Russian Rouble. Fiat deposits in Roubles are held in top-tier banks with a correspondent network connected to Kyrgyz Republic and high overnight interest rates. A7A5 is committed to transparency: reserve reports are updated weekly, and independent firms conduct external audits quarterly ensuring full accountability and trust. A7A5 generates revenue from the interest earnings and automatically distributes 50% of this income to all token holders at a random time each day when funds are received in bank deposits. No action is required from token holders to receive these distributions - just hold tokens in the wallet. A7A5 leverages blockchain technology to provide users with direct exposure to the Russian Rouble. It enables various opportunities, including carry trade with other stablecoins and earning on providing liquidity on DeFi platforms such as Curve, Uniswap, and Convex. A7A5 is a stablecoin issued in Kyrgyzstan by the company Old Vector, fully compliant with Kyrgyz legislation on virtual asset service providers (VASP) enacted on January 21, 2022 - the Law of the Kyrgyz Republic “On Virtual Assets” No. 12. The token is regulated under the country’s comprehensive digital asset framework, operates under state supervision, and meets all requirements for fiat backing, regular independent audits, and investor protection.","links":"https://a7a5.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/a7a5_tron/logo.png","detail_platform":{"tron":{"decimal_place":6,"contract_address":"TLeVfrdym8RoJreJ23dAGyfJDygRtiWKBZ","geckoterminal_url":"https://www.geckoterminal.com/tron/tokens/TLeVfrdym8RoJreJ23dAGyfJDygRtiWKBZ"}},"is_native":false}