{"name":"Astra DAO","id":"astra-dao","symbol":"astra","description":"## What Is Astra DAO (ASTRA)? Astra DAO is a decentralized and non-custodial automated crypto asset allocator built on Ethereum. Astra DAO provides convenient and practical access to crypto-oriented investment strategies. Astra DAO’s use case includes providing various investment products/indices, participation units marketplace, user staking, harvesting investment strategies profits, zero-fees user participation model, and an improvement culture using the DAO-managed Treasury. ASTRA is the native utility token, and it is used for: *Utilities Access - Astra token holders can vote, add their indices or join the network as investment managers and harvest performance fees. *Mean of Reward - Astra token will be used as a reward for network participants, paid out in staking rewards, liquidity provider (LP) rewards, and structured airdrops. *Development fund - Part of the Astra treasury pool will be reserved for ongoing development and improvement of the Astra network by funding development grants, bug bounties, and improvement ideas. *Treasury Reserve - Astra treasury will maintain a healthy supply and demand of ASTRA tokens in circulation. *Voting and Voting Power - ASTRA tokens holders can participate in voting, submit voting proposals, and act as DAO governors. *Staking - Platform participants will benefit from the staking protocol. ## How Many ASTRA Tokens Are There in Circulation? The total supply of Astra DAO token is initially capped at 100 Trillion tokens. The supply will only increase or decrease if the DAO votes to implement minting or token burn capability. Astra tokens will be distributed among seven main groups. A portion of the tokens will be initially locked. Locked tokens will be unlocked over a period of time for the different groups according to the schedule, starting on launch day. Astra DAO allocated 45% of its tokens to LM and community rewards and 10% to the growth and community grant fund to foster growth and development. ### Where Can I","links":"https://astradao.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astra-dao/logo.png"}