{"name":"Astra DAO","id":"astra-dao","symbol":"astradao","description":"What is the project about? Astra DAO is a decentralized and non-custodial automated crypto asset allocator built on Ethereum. Astra DAO provides convenient and practical access to crypto-oriented investment strategies. Astra DAO’s use case includes providing various investment products/indices, participation units marketplace, user staking, harvesting investment strategies profits, zero-fees user participation model, and an improvement culture using the DAO-managed Treasury. What makes your project unique? Researching and identifying profitable crypto assets is difficult for investors due to a lack of time and resources. And also, building a diversified crypto portfolio is complicated and expensive for investors. We are solving this by providing a decentralized index platform that encourages sustainable returns through active participation, governance, and management of value aggregation to all participants. History of your project. Launched VI - August 2022 with the following: ●Adding new custom products by users (creators) ●Staking score ●Adding human-managed products (investment managers) ●Exit fees progressive reduction mechanism ●Staking and Lockup vault ●Staking cooldown period ●iTokens staking ●Liquidity mining and Rewards system ●Loyalty appreciation (ranks + unlockable benefits) paired with staking score ●Governance forum ●Audit Launched V2 - May 2023 with the following: Chainanalysis KYT address blocking of wallets ● Gasless Voting ● Fix Stake and Restake functionality issue ● Reductio What’s next for your project? Ensuring we implement our user acquisition and marketing plans. What can your token be used for? *Utilities Access *Mean of Reward *Development fund *Treasury Reserve *Voting and Voting Power *Staking","links":"https://astradao.org","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/astra-dao/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7e9c15c43f0d6c4a12e6bdff7c7d55d0f80e3e23"}}}