{"name":"POKI","id":"poki_solana","symbol":"poki","description":"In the fast-moving world of Solana, traders, builders, and communities are always on the lookout for something that blends fun, utility, and excitement. That’s where POKI comes in. More than just a token, POKI is your entry pass to a thrilling journey across the Solana ecosystem, delivering both entertainment and opportunity in one sweet package. POKI isn’t just about speculation—it’s about creating a culture where holding a token feels like being part of an adventure. Imagine every chart movement, every pump, and every dip becoming part of a storyline that the community builds together. With its lighthearted spirit and bold vision, POKI transforms trading into an experience rather than a chore. Holding POKI is like strapping yourself in for a roller coaster—there are ups, downs, and surprises, but the ride is always unforgettable. On Solana, speed and low fees set the stage for innovation, and POKI embraces that environment fully. Transactions are fast, communities form quickly, and momentum builds in real time. POKI’s mission is to harness that energy and channel it into a growing movement. It’s not just another token sitting idly on the blockchain—it’s alive, moving with the market, and designed to bring people together. What makes POKI special is its dual identity: it’s both a meme and a mission. As a meme, it brings the fun, the culture, and the virality that crypto loves. As a mission, it provides structure, plans, and goals that keep the community anchored. A portion of supply is carefully allocated, strategies are transparent, and the roadmap is guided by the principle of sustainability. The balance between hype and long-term vision is what gives POKI its unique flavor. Whether you’re a casual trader looking for excitement, a Solana degen chasing the next big play, or a believer in community-driven projects, POKI welcomes you. This is not just a ticket you hold—it’s a pass that grants you access to moments, memes, and milestones that will define your crypto journey. The sweetest ride isn’t about the destination—it’s about the thrill of being on board. With POKI, you’re not just buying a token, you’re joining a movement that’s ready to light up Solana with energy, laughter, and growth. So buckle up, because the ride has just begun.","links":"https://pokiworld.org/","market_cap":8437.85,"market_cap_rank":11508,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/poki/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"4v2DRssbwaMbdMwqqN5EkSB9dCkKLorcg3ht9sHEpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/4v2DRssbwaMbdMwqqN5EkSB9dCkKLorcg3ht9sHEpump"}},"is_native":false}