{"name":"AICoin","id":"aicoin-2","symbol":"ai","description":"AICoin is a decentralized autonomous organization (DAO) built on the Ethereum blockchain that aims to revolutionize the way investment funds are managed. The project seeks to empower individual investors by providing them with a platform that leverages the wisdom of the crowd to make better investment decisions. AICoin's unique approach combines artificial intelligence (AI) and blockchain technology to create a transparent and efficient system for managing investment funds. The project's AI-powered algorithm analyzes data from multiple sources to identify potential investment opportunities and make data-driven decisions. AICoin has a strong history of delivering on its promises, having successfully launched its ICO in 2017 and raised over $10 million. Since then, the project has continued to develop its platform, and in 2020, AICoin launched its proprietary AI trading system, which has demonstrated strong performance in real-world trading scenarios. The next phase of AICoin's development will focus on expanding its platform and user base. The project plans to integrate with multiple cryptocurrency exchanges to provide investors with access to a wide range of trading opportunities. AICoin also plans to develop its social trading features, allowing users to follow and replicate the trades of successful investors on the platform. The AICoin token (AI) serves as the native utility token on the platform, allowing users to access various features and functions. The token can be used to pay for transaction fees, staking rewards, and voting rights in the DAO's decision-making process. The AI token is not intended to be a speculative investment and is solely used for utility purposes within the platform.","links":"https://www.aicoin.website/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/aicoin-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xc8354507f0361712143efa635cce060788888888","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0xc8354507f0361712143efa635cce060788888888"}}}