{"name":"PlayNity","id":"playnity","symbol":"ply","description":"PlayNity is approaching investors and players community on the Play2Earn growing trend in the metaverse space. Project delivers the possibility to earn from Play2Eearn games without engaging in all in-game process for investors and delivers for players the possibility to play P2E games risk-free without any capital requirement. In the area of Play2Earn, PlayNity project makes it possible for: - Players - to have a possibility to play Play2Earn games where they cannot afford to invest the required amount of money to start and maintain earnings. - Suppliers (investors) - to be able to allocate funds in the Play2Earn gaming expecting some earnings, without sacrificing time and requiring any knowledge about the detailed game mechanics and behind-the-scenes process. - Trainers who have wide knowledge in the scope of a wide variety of games - to have the possibility to train players and earn money without investment. - Managers who have experience in managing in-game NFTs and leading groups of scholars and trainers - to be able to earn even more with bigger teams. In principle, 20% of earned value will be spent on the tokens buyback and burn. It will make circulating tokens less inflationary and at some point, deflationary. 10% will be spent on the DAO maintenance costs, and the remaining 70% of the earnings is planned to be spent on the new in-game NFT purchases as well as releasing its own NFT collections to gather even higher earnings. Above numbers and treasury management policy can be adjusted to meet market conditions.","links":"https://playnity.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/playnity/logo.png","detail_platform":{"terra":{"decimal_place":6,"contract_address":"terra13awdgcx40tz5uygkgm79dytez3x87rpg4uhnvu"},"binance-smart-chain":{"decimal_place":6,"contract_address":"0x5f39dd1bb6db20f3e792c4489f514794cac6392c"},"ethereum":{"decimal_place":6,"contract_address":"0x20d60c6eb195868d4643f2c9b0809e4de6cc003d"}}}