{"name":"FINE 2.0","id":"fine-2-0","symbol":"fine2.0","description":"What is the project about? FINE 2.0 is not an upgrade. It's a Revolution!! The taxes on this are decent. It’s 1% Buy / Sell. Missed $FINE? Here is your second chance Unleashing the Next Level of Innovation and Adventure! With a fusion of cutting-edge advancements and awe-inspiring innovations, we're taking everything you loved about the original FINE and catapulting it into a whole new dimension of excitement! What makes your project unique? FINE 2.0 is not an upgrade. It's a Revolution!! The taxes on this are decent. It’s 1% Buy / Sell. Missed $FINE? Here is your second chance Unleashing the Next Level of Innovation and Adventure! With a fusion of cutting-edge advancements and awe-inspiring innovations, we're taking everything you loved about the original FINE and catapulting it into a whole new dimension of excitement! History of your project. FINE 2.0 is not an upgrade. It's a Revolution!! The taxes on this are decent. It’s 1% Buy / Sell. Missed $FINE? Here is your second chance Unleashing the Next Level of Innovation and Adventure! With a fusion of cutting-edge advancements and awe-inspiring innovations, we're taking everything you loved about the original FINE and catapulting it into a whole new dimension of excitement! What’s next for your project? FINE 2.0 is not an upgrade. It's a Revolution!! The taxes on this are decent. It’s 1% Buy / Sell. Missed $FINE? Here is your second chance Unleashing the Next Level of Innovation and Adventure! With a fusion of cutting-edge advancements and awe-inspiring innovations, we're taking everything you loved about the original FINE and catapulting it into a whole new dimension of excitement! What can your token be used for? FINE 2.0 is not an upgrade. It's a Revolution!! The taxes on this are decent. It’s 1% Buy / Sell. Missed $FINE? Here is your second chance Unleashing the Next Level of Innovation and Adventure! With a fusion of cutting-edge advancements and awe-inspiring innovations, we're taking everything you loved about the original FINE and catapulting it into a whole new dimension of excitement!","links":"https://finerc2.vip/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/fine-2-0/logo.png","detail_platform":{"ethereum":{"decimal_place":9,"contract_address":"0x803e102459e682f13760904408ad96dccee0c8d3"}}}