{"name":"RB Share","id":"rb-share_arbitrum-one","symbol":"rbx","description":"RB Share (RBX) is the second token of the RB Finance Protocol. RBX is how the value of the RB Protocol and shareholder trust in its ability to maintain RB close to peg is measured During epoch expansions the protocol mints RB and distributes it proportionally to all RBX holders who have staked their tokens in the Boardroom RB Finance is a Multi token accelerated ASC (Algorithmic Stable Coin) protocol on the Arbitrum blockchain, derived from Based Finance on Fantom. We are excited to be the the first-ever Tomb Fork project, pegged to the value of the $ARB token. As dedicated Arbinauts, our mission was to bring new utility to the recently airdropped $ARB tokens. We have achieved this by introducing Genesis, a platform where users can farm $RB tokens using their $ARB. RB Finance is also the premiere Tomb Fork pegged to $ARB, offering added utility to Camelot Dex by providing liquidity on it and featuring and its $Grail as a genesis token. In addition to that Curve 2pool and Tricrypto pool receipts can be deposited to earn additional rewards in RB Finance Our team comprises five experienced professionals in the crypto and DeFi space, actively participating in various protocols on Polygon, BSC, and Ftm. We are embarking on our first project on the Arbitrum blockchain, eager to contribute further to the community. One common issue with various Tomb Forks is their short lifespan due to the limited utility of peg tokens. Our goal is to extend the value of our RB token by incorporating it into new protocols, thereby enhancing the overall ecosystem. RB Finance offers Liquidity Providers the opportunity to earn RBX, which serves as both a share token and governance token for our platform. which serves asboth a share token and governance token for our platform. Users can stake RBX in our Boardroom to earn additional RB with each epoch. RBX holders will have voting rights (governance) on proposals to improve the protocol and future use cases within the RB Protocol.","links":"https://www.rbfi.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/rb-share_arbitrum-one/logo.png","detail_platform":{"arbitrum-one":{"decimal_place":18,"contract_address":"0x4c4b907bd5c38d14a084aac4f511a9b46f7ec429","geckoterminal_url":"https://www.geckoterminal.com/arbitrum/tokens/0x4c4b907bd5c38d14a084aac4f511a9b46f7ec429"}},"is_native":false}