{"name":"Guiser","id":"guiser","symbol":"guise","description":"Guiser serves as a privacy solution catering to a diverse range of crypto participants. Public blockchains, by nature, lack privacy; meaning all your transactions are open for anyone to trace. Whether it's repaying a friend, contributing to a cause, managing payroll, or engaging in active trading – in each case, the recipient can effortlessly link the transaction to a single wallet. Consequently, these transactions can lead to revealing your financial status, assets, investments, and spending patterns. Just as you don't display your net worth openly in real life, there's no reason why the crypto sphere should differ. Guiser.org is an aggregator of various non-kyc crypto exchange providers, renowned for its transactional privacy. The process involves processing your currency deposit on one exchange, sending it to another exchange and then converting it back to your chosen currency on another, breaking the link between the sending and receiving wallets. Primarily, Guiser functions as a platform that aggregates the finest non-custodial exchanges. The process involves receiving User Swap Requests and then directing them to top-notch, non-custodial instant exchanges. It's important to note that at no point does Guiser gain access to users' assets. We remain uninvolved in user transactions, refraining from receiving user deposits or transferring user funds. Our platform is meticulously structured to safeguard your funds. The only scenario where funds might be compromised is if a mistake is made, such as inputting an incorrect receiving address or depositing assets into an incorrect deposit address. We strongly recommend double-checking addresses before proceeding. Should an issue arise, rest assured that our dedicated support team is tirelessly committed to resolving it. They will diligently investigate the situation to locate your funds and facilitate their return to you.","links":"https://guiser.org/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/guiser/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7721a4cb6190edb11d47f51c20968436eccdafb8"}}}