{"name":"Ignite","id":"ignite-2","symbol":"igt","description":"Ignite Chain is powering the decentralized finance ecosystem not only for the individuals or end-users but for financial institutions & businesses that have cryptocurrency exposure. Defining itself as the next generation of blockchain, Ignite provides decentralized solutions to several on-chain partners ranging from small enterprises to big-tech & investment management funds. Ignite uses a self-regulating and self-sustainable network model that enables a pervasive trustless economy & the ideology of pure decentralization. Ignite blockchain network is created to form a decentralized and distributed community that would be able to develop, test, and launch new exciting blockchain technology-powered financial products and applications. To bring down heavy transaction fees and confirmation time, we are aiming for mass-market adoption by providing lower costs yet ultra-fast peer-to-peer network Ignite Chain is a public blockchain designed for mass adoption of blockchain technology by business users of all sizes. It is intended to serve as the foundation for a sustainable and scalable business blockchain ecosystem. From a technical point of view, the Ignite Chain is built upon proven blockchain innovations and novel technologies created for achieving mass adoption. These technologies include a Proof-of-Stake (PoS) consensus mechanism, meta transaction features, protocols of transaction fee delegation, on-chain governance, built-in smart contracts as well as tools for developers. The Ignite blockchain is open to the public, allowing participants from around the world to join in to secure and verify the record reflects an accurate state of affairs. Ignite Blockchain is not just a platform for recording transactions, it executes “smart contracts”–computer programs that directly control asset transfer between parties with objective and fair logic.","links":"https://ignite.info/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ignite-2/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x3bed11bb72f11fa734d5286537829e0c7c950d03"}}}