{"name":"Pylon Eco Token","id":"pylon-eco-token","symbol":"petn","description":"Short Description: A DeFi, Governance and Deflationary Open Source Ecosystem based Project with Open Source and Staking Reward Incentives Earning which brings mass crypto adoption. Long Description: Pylon Eco Token (PETN) is a product of Pylon Fintech. PETN is a Decentralized Finance (DeFi), Governance and Deflationary Open Source Ecosystem based Project with the benefit of Utility Token & Cryptocurrency. Being confident in the project, We offered for the first time in the Crypto Industry Buyback of all ICO Tokens. PETN also has staking reward incentives. We plan to bring Fan Tokens, NFT, Metaverse platforms to offer a complete set of use cases through our Pylon Eco Token in the future. People are using Pylon Eco Token (PETN) to Trade, Invest, Liquidity mining and in Pylon Ecosystem. We have plenty of ecosystems that can bring products and services together. We are using it in our daily life globally and we intend to bring mass crypto adoption in reality through our ecosystem. From Mobile Topup & Gift Cards, Travel (Hotels/Flights) booking, E-commerce, Auction, Gaming, Crypto wallet & Exchange and Payments & Cards solution. Once the projects are fully operational, we plan to bring Ecosystem projects to the Open Source developer community while remaining maintainers of the project. At the same time, we plan to transform Pylon Fintech into Decentralized Autonomous Organization (DAO). These diverse online businesses with open source ecosystem projects will provide significant leverage to use our tokens and make good revenue at the same time. PETN is trading in Centralized and Decentralized Exchanges. We are available in the top five crypto wallets. It is also available in hardware wallets to hold long-term tokens in cold storage. The Governance process decides most of our activities in the project. It also makes decentralized decisions among the token holders.","links":"https://www.pylontoken.com/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pylon-eco-token/logo.png"}