{"name":"Godcoin","id":"godcoin-2_base","symbol":"god","description":"Godcoin ($GOD) is the native token of InfiniGods and the Valhalla Protocol, which is powering the future of Mobile Gaming applications and infrastructure. The Valhalla Foundation has partnered with InfiniGods, the leading Web3 mobile gaming studio, to launch Godcoin ($GOD)—a token designed to revolutionize mobile gaming. $GOD aims to transform the mobile gaming experience for millions of players by introducing innovative gameplay, new economic models, enhanced player experiences, industry-disrupting blockchain infrastructure, and more. Mobile Gaming is the largest entertainment industry in the world, with over 2 billion people playing games on their smartphones daily, contributing to an annual expenditure exceeding $150 billion. Yet, it's stagnant and ripe for disruption. Enter $GOD and InfiniGods. InfiniGods is a free-to-play Web3 mobile gaming studio specializing in mythological-themed games and cutting-edge mobile gaming infrastructure. Founded in December 2021, InfiniGods has become the market leader in Web3 mobile gaming, driven by the success of its flagship title, King of Destiny. King Of Destiny is the leading Web3 mobile title in the “Luck Battle” category (e.g. MonopolyGo & CoinMaster), which is the fastest growing and highest monetizing genre in mobile. More broadly, $GOD powers the Valhalla Protocol, an infrastructure stack that unlocks transformative blockchain capabilities for millions of players, developers, advertisers, and more. The Valhalla Protocol is a comprehensive toolkit designed to allow developers to integrate web3 features seamlessly into any mobile game. InfiniGods’ founding team includes key members with experience at Facebook, Scopely, and Machine Zone. To date, the company has raised $17.3 million in funding, including an $8 million seed round in early 2022 led by Pantera Capital, Framework Ventures, and Animoca Brands. This was followed by an $8 million Series A investment in Q4 2023, funded entirely by Pantera Capital. In Q3 2024, InfiniGods raised a $1.3 million strategic round led by Arete Capital, with participation from LiquidX, Seedphrase, Grail.eth, Mando (Rekt), Max Crown (Co-Founder, MoonPay), and other notable figures in the crypto industry.","links":"https://www.valhallafoundation.xyz","market_cap":125080,"market_cap_rank":6639,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/godcoin-2_base/logo.png","detail_platform":{"base":{"decimal_place":18,"contract_address":"0xb5130f4767ab0acc579f25a76e8f9e977cb3f948","geckoterminal_url":"https://www.geckoterminal.com/base/tokens/0xb5130f4767ab0acc579f25a76e8f9e977cb3f948"}},"is_native":false}