{"name":"KlimaDAO","id":"klima-dao","symbol":"klima","description":"What Is KlimaDAO? KlimaDAO is building the infrastructure for a transparent, neutral, and public Digital Carbon Market to accelerate climate finance on a global scale. In 2022, KlimaDAO traded over $4 billion worth of carbon credit trade while growing treasury assets to over $100 million. Who uses KlimaDAO? As the base layer infrastructure for the Digital Carbon Market, KlimaDAO powers platforms such as Carbonmark, the universal carbon market, and works with organizations such as Polygon, Circle, and the Liechtenstein Bankers Association to help organizations such as airlines, auto companies, banks, Web3 projects, and individuals such as Mark Cuban to meet their sustainability goals. A brief history of KlimaDAO KlimaDAO was founded in 2021 by a group of individuals from three competing organizations who had been working to solve market failures in the traditional Voluntary Carbon Market. These founding Core contributors aimed to unite their diverse experience – in carbon markets, technology, and business strategy and execution – as part of a single mission, in order to solve bottlenecks in scaling climate finance globally. KlimaDAO has since grown to assemble the talents of over 50 contributors, and over 100,000 KLIMA token holders. In 2022 KlimaDAO launched its carbon retirement aggregator, enabling individuals and organizations to permissionlessly offset their carbon footprints. One of its landmark early users was the Polygon Network, which used KlimaDAO’s infrastructure to retire over 100,000 digital carbon credits to go carbon neutral. Brands such as Instagram, Nike, and Bentley chose to build with Polygon due to its leadership in sustainability. In March 2023 Carbonmark launched as the go-to platform for acquiring, trading, and retiring digital carbon. Carbonmark offers a seamless ‘Web 2.5’ user experience, enabling institutional access to tens of millions of carbon credits, and to KlimaDAO’s digital carbon infrastructure, without additional fees.","links":"https://klimadao.finance/","market_cap":16970861,"market_cap_rank":1439,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/klima-dao/logo.png","detail_platform":{"polygon-pos":{"decimal_place":9,"contract_address":"0x4e78011ce80ee02d2c3e649fb657e45898257815"},"base":{"decimal_place":18,"contract_address":"0xdcefd8c8fcc492630b943abcab3429f12ea9fea2"}}}