{"name":"Hiroki","id":"hiroki","symbol":"hiro","description":"Hiroki is a deflationary token built on the Binance Smart Chain Network, it was originally supposed to be a meme token but with the support we are getting from the community we decided to go a bit further into the development of our very own Blockchain as our major utility and also the creation of our unique swap that will use the $HIRO token as it's governance token with a unique function embedded in the smart contract to burn 1% of fees collected from the swap usage to burn $HIRO token there by reducing the supply over time there by making it truly deflationary. The development of our blockchain will feature functions such as covering many transactions per second and the gas fees will be extremely low to encourage builders to build on the Blockchain but not too low so as to incentivize validators on the Blockchain. The HiroChain (HIROC) is a new home for our community’s crypto content. This new blockchain will allow our creators and supporters to store, share, stream and trade any digital experience on the blockchain. Our high-performance network offers security and control over your data and content, with smart contracts and next generation security based on blockchain technology. It is built for the creator’s economy and with monetization opportunities in mind, allowing the users to create and sell digital assets (NFTs) minted on our platform and feature useful functions such as; event ticketing, paid content streaming and more Hiro Dapp: The development of the new blockchain offers a plethora of opportunities for our most creative and entrepreneurial community members. To be able to create a truly new and fully functioning ecosystem, we will search for and vote, for the best ideas and creative visions for useful dApps within our community, this way giving a chance to any of you to develop your ideas in real life and build something unique with the support of the team and collected funds.","links":"https://www.hirokitoken.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/hiroki/logo.png"}