{"name":"Monko","id":"monko","symbol":"monko","description":"Monko is an original Meme Character built on the Algorand Blockchain. The purpose is to bring attention to the Algorand blockchain through Humor, World Building and Low Cost NFT Discord and X Stickers. The MONKO Token Documentation is a conceptual paper that elucidates some of the main design principles and ideas for the creation of a digital token to be known as MONKO. The Token Documentation and the Website are intended for general informational purposes only and do not constitute a prospectus, an offer document, an offer of securities, a solicitation for investment, any offer to sell any product, item, or asset (whether digital or otherwise), or any offer to engage in business with any external individual or entity provided in said documentation. The information herein may not be exhaustive and does not imply any element of, or solicit in any way, a legally-binding or contractual relationship. There is no assurance as to the accuracy or completeness of such information and no representation, warranty or undertaking is or purported to be provided as to the accuracy or completeness of such information. Where the Token Documentation or the Website includes information that has been obtained from third party sources, the Company, the Distributor, their respective affiliates and/or the Monko contributors have not independently verified the accuracy or completeness of such information. Further, you acknowledge that the project development roadmap, network functionality are subject to change and that the Token Documentation or the Website may become outdated as a result; andn either the Company nor the Distributor is under any obligation to update or correct this document in connection therewith.","links":"https://www.bemonko.com/","market_cap":1403822,"market_cap_rank":3728,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/monko/logo.png","detail_platform":{"algorand":{"decimal_place":6,"contract_address":"2494786278"}}}