{"name":"BitCore","id":"bitcore","symbol":"btx","description":"BitCore is a cryptocurrency that is a UTXO fork of Bitcoin. Although you hear about hard forks, many people only know about hard Bitcoin forks, such as Bitcoin Cash and Bitcoin Gold; in contrast, few people know about BitCore or hybrid forks. Using Bitcoin's source code and technology, BitCore created a new blockchain; it made sure that the blockchain size was smaller and scalability was better. In addition, block timings are faster than Bitcoin, making mining ASIC-resistant as well. BitCore created a new blockchain on April 24, 2017. It took a snapshot of Bitcoin transaction and created 5 million transactions to fill all public addresses belonging to people who own 0.01 BTC or more. The funding ratio is 0.5 BTX: 1.0 BTC, but if you held bitcoins at the time of the snapshot, then you can apply for your share of BTX at a 1:1 conversion until October 30. BitCore is the first cryptocurrency that is a UTXO fork. But it is more than just a hybrid fork. It has tried to improve Bitcoin and solve the problems that plague it. For example, BitCore uses the MEGA-BTX consensus algorithm that is ASIC-resistant. This means that centralization of mining power is not possible, as the playing field is level and everyone has more or less the same opportunities. In addition, BitCore has 10 MB Segwit-enabled blocks that make the network capable of handling 17.6 billion transactions per year or 48 million transactions per day. BitCore is a cryptocurrency that promises a lot, especially with the new implementations that have made it algorithm and Masternodes platform, giving the entire crypto community the opportunity to mine BTX with PoW or Masternodes, even BTX holders can mine it with both PoW and Masternodes.","links":"https://bitcore.cc/","market_cap":2051386,"market_cap_rank":3225,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/bitcore/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}