{"name":"Metapro","id":"mpro-lab","symbol":"mpro","description":"Metapro is committed to advancing the infrastructure of web3 gaming and eSports markets. Through scalable architecture and strategic team building, Metapro drives the creation of groundbreaking solutions for the market. We are proud to have spearheaded the development of transformative products and initiatives, including: Metapro Wallet: A secure and user-friendly wallet designed to seamlessly interact with web3 applications and decentralized games, providing users with easy access to their digital assets. Web3 Game Arena: Hosting the largest web3 gaming event in Central Europe, the Web3 Game Arena brings together developers, gamers, and enthusiasts to celebrate the future of gaming on the blockchain. Assetto Corsa Web3 Manager: The first application built on top of a leading professional simracing simulator, enabling mod distribution through Metapro's NFTma. Degen Youki: A groundbreaking game fully integrated with Metapro infrastructure, available across multiple platforms including mobile devices. As part of our ecosystem, MPRO Lab plays a pivotal role in the development and implementation of decentralized storage solutions for games and assets. Our network of NODEs ensures secure and efficient storage, empowering developers and gamers alike. At the heart of the Metapro ecosystem lies the NFTma, a key component for tokenizing in-game assets and facilitating ownership on the blockchain. This innovative asset empowers developers to create unique and tradable items within their games, fostering a thriving economy of digital collectibles and experiences.","links":"https://mprolab.io/","market_cap":1010389,"market_cap_rank":2589,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/mpro-lab/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xd88611a629265c9af294ffdd2e7fa4546612273e"},"base":{"decimal_place":18,"contract_address":"0xd88611a629265c9af294ffdd2e7fa4546612273e"}}}