{"name":"SolClout","id":"solclout","symbol":"sct","description":"\"SolClout is envisioning a platform to build a formidable community powered by Solana, a high throughput, scalable public blockchain project. SolClout will allow for cryptocurrency projects and users to create and boot-strap Clout-driven communities geared towards building fast and sustainable social presences SolClout is an ecosystem of Apps. The brief description of each app is shared below: - SolClout World is the perfect Implementation of metaverse, virtual reality and blockchain to allow blockchain projects to build virtual ecosystems to interact with other projects, investors and influencers. This is similar to blockchain conferences/expos that were happening on a large scale pre-Covid. Projects can rent out stands to present their projects and visitors can visit these virtually. - SolClout Social is a simple blockchain-based social networking feature embedded within the application. Users can post their social updates while using the main application for its intended purpose. - SolClout Starter is a social IDO platform, SolClout Starter allows for projects to establish official communities. Users with best activity could receive allocation for the initial decentralized offering. So it’s basically integrating telegram communities into the IDO platform itself and making it more exciting. - SolClout Hub allows for projects to easily launch trading dapps and play-to-earn games. Projects will be able to utilize multitude of services provided by SolClout - SolClout Trading is a social trading platform inspired from Crypto Twitter. Users can signup and connect their exchange accounts and then copy trade with other expert traders. Once copy trading, a bot places the same trades that the expert trader you follow places. So this is like you buying a bot subscription without needing to configure trading strategies etc. You just have to follow an expert trader. \"","links":"https://www.solclout.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/solclout/logo.png","detail_platform":{"solana":{"decimal_place":9,"contract_address":"4Te4KJgjtnZe4aE2zne8G4NPfrPjCwDmaiEx9rKnyDVZ"}}}