{"name":"TrendAI","id":"trendai","symbol":"trendai","description":"What is the project about? TrendAI is a unique gamified trading platform that combines various sources of profit streams for token holders. Research on microcaps, trading indexes, and a unique way for holders to get exposed to trending tokens by holding one. What makes your project unique? What makes us unique is that we are a zero tax token that was fairly launched with no team tokens. We have self funded this project and have built a way for people to get exposure to microcaps without having to chase all the trends and token. You hold one token and our team of traders find promising tokens and add them to the multi sign wallets. As the account grows these funds go back directly to the holders of the token. History of your project. We are over 1 month old and have already secured partnerships, sponsors, and have paid out our holders. Our trades are public, our payouts are public, and we continue to grow through organic marketing. What’s next for your project? We have an entire roadmap laid out on the website but we are in the process of creating a Launchpad for projects, adding a paywall with Web 3 (demo is already working), and building out a platform to host AMAs and allow other researchers to collab. This also includes a Trending Coin report that will require holders to have a certain amount of tokens. What can your token be used for? The token is used to share revenue from the trading profits, allows users to access our research reports that are behind a Web 3 paywall, and the token holders are able to suggest future partnerships/projects they'd like to see us work with/add to the fund. This is a project built by traders for traders and we continue to grow organically.","links":"https://trendai.io/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/trendai/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x6fc73113fc1afab4c28d3dd4c537a1da6045d47d"}}}