{"name":"Dungeon","id":"dungeon","symbol":"dgn","description":"WHAT IS DUNGEON CRYPTO (DGN)? Dungeon Crypto is an RPG Play-to-earn strategy game of dungeon exploration, territorial conquest, landing and more built on the Binance Smart Chain (BSC). Our original purpose was to let players to earn money while enjoying the gaming experience like traditional online game, Dungeon Crypto uses the blockchain technology to provide a unique universe where the Heroes (DHERO) are the characters, and your mission is to recruit, evolve and battle. The main objective of the game is to train your heroes and explore dungeons in search of treasures. The more you explore, the higher the chance to get huge rewards. You can earn by exploring a dungeon. Every time you defeat an enemy, you get experience and loot. Clearing a dungeon will earn you massive rewards! Start exploring a dungeon now! What Makes Yield Guild Games Unique? One strong point that completely stood out from the NFT games at the time was the development of a separate sidechain to save gas fees for players. This is the advantage that players are extremely impressed with for Dungeon Crypto. Most early NFT games on the market had the disadvantage of high gas fees when the price of BNB increased sharply, sometimes Gas fee accounts for 10-20%, 30% of their in-game income. This is why players are no longer interested and leave the game. Dungeon Crypto - We use the best technologies available on the market to ensure all events and transactions in-game are transparent. What Makes $DGN Unique? Dungeon Crypto aims to provide a fun and profitable experience for players, to create a healthy and excited community around blockchain gaming.One of the strengths of the game is the nature of the community. Thus, the game offers a fantastic mechanism that the player and their friends can enjoy the rewards together forever. In short, the game is easy to play and collect valuable items. The vision of the game developers is for gamers to regain control of their digital assets, play to earn and increase the mainstream adoption of blockchain technology. Advantages of Dungeon Crypto ($DGN): No Transaction Fees: All players transactions will be done without any blockchain transaction fees. This saves our players money. High Performance: All transactions can be done instantly without waiting time like blockchain systems. Decreasing Tax System: Whenever you receive a $DGN in your account, this amount is linked to a hero and you need to claim this. The claim request has a decreasing tax system, through days, if you wait, you can claim your reward without paying any fees.","links":"https://dungeoncrypto.com","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/dungeon/logo.png"}