{"name":"TabbyPOS","id":"tabbypos","symbol":"epos","description":"What is the project about? TabbyPOS is a cash register terminal(Hardware) that supports cryptocurrency payments. It can handle various tasks for merchants, such as sales, settlement, and inventory management, as well as providing the ability to accept cryptocurrency payments. In addition, this cash register terminal features a built-in membership system that can convert points into cryptocurrency. TabbyPOS also records transaction history and cashier information and generates management reports such as sales and inventory reports. What makes your project unique? 1)TabbyPOS not only supports cryptocurrency payments but also has a built-in module for ordering and printing receipts, making it convenient for merchants to use. 2)TabbyPOS also features a built-in membership system that allows merchants to easily set up their own membership system without having to manage the exchange of goods or points, as points exist directly in the form of cryptocurrency and customers can freely use or exchange them. 3)TabbyPOS has an open API interface and is not a closed system, allowing it to collaborate with local POS enterprises and provide more diversified services. History of your project. In May 2022, Lee Koh Ching founded TabbyPOS. In August 2022, TabbyPOS issued tokens (EPOS) to raise funds on the Launch Pad platform of ErgoPAD. The fundraising was successfully completed in September 2022. TabbyPOS successfully released its Alpha version in March 2023. What’s next for your project? Our next plan is to support more mainstream cryptocurrencies and add more convenient features for daily life, such as paying utility bills, topping up mobile phone credit, and more. What can your token be used for? EPOS functions as a utility token and is used to pay for fees for token withdraw transactions. If merchants use TabbyPOS, they must also hold a certain number of EPOS.","links":"https://www.tabbylab.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/tabbypos/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}