{"name":"Zexicon","id":"zexicon","symbol":"zexi","description":"What is the project about? Zexicon is a project that implements digital entertainment and is a virtual human ecosystem with various entertainment content.Zexicon creates an environment where creative digital content published through entertainment virtual humans can be realized on the metaverse. What makes your project unique? ZEXICON is trying to solve problems in the existing entertainment industry through virtual humans. ZEXICON presents a model that grows from star-centered entertainment to content-centered entertainment. ZEXICON Entertainment builds content power to create a new generation with global market entry and virtual content platform and creates an era of one-person-one-virtual humans following the era of one-person-one-media through a transparent distribution process implemented with blockchain. History of your project. The ZEXICON project began in early 2022 by creating a team and publishing a white paper. ZEXI Token was issued in August 2022. It was first listed on the cryptocurrency exchange in March 2023. What’s next for your project? ZEXICON is currently working on an entertainment project based on META CEO: ZEXI Virtual Human and is building a new business model using it. In its own NFT marketplace, it will establish governance, such as issuing NFTs, auditions of aspiring candidates, and voting of participants, and ultimately build a metaverse entertainment platform. What can your token be used for? ZEXI Tokens can participate in Zexicon Social Production. Voting is conducted through the transmission of ZEXI tokens, and the records and results transmitted by the blockchain are permanently stored in the blockchain, which can be publicly verified by anyone, guaranteeing the transparency of voting. In addition, within the Zexicon platform, ZEXI tokens can be used as a payment method for purchasing all products, services, and content. Services where tokens can be used include marketplaces and communities.","links":"http://www.zexicon.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zexicon/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0x0c93709c4389b6eebdb0a4d3d60092bb61446382"}}}