{"name":"NinjaPepe","id":"ninjapepe","symbol":"ninjapepe","description":"NinjaPepe NFT is the genesis NFT collection of the NinjaPepe team, and it's a deflationary NFT collection. To diversify the NinjaPepe Genesis collection and make each piece of intricate artwork stylish and attractive, this set of 4800 NFTs contain a variety of different hand-designed 3D traits within this collection. NinjaPepe- Warrior Pepe Avatar NinjaPepe is the genesis NFT collection of team NinjaPepe. NinjaPepe is an NFT collection of 4800 Worrier Pepe Avatars that feature profile pictures of high-quality 3D frog-based characters with unique traits of PNG pictures built on Ethereum Blockchain that are procedurally generated by an advanced AI tool. NinjaPepe is the genesis NFT collection of team NinjaPepe. NinjaPepe is an NFT collection of 4800 Worrier Pepe Avatars that feature profile pictures of high-quality 3D frog-based characters with unique traits of PNG pictures built on Ethereum Blockchain that are procedurally generated by an advanced AI tool. Owners of NinjaPepe NFTs and $NinjaPepe tokens are considered members of the NinjaPepe Club and gain access to exclusive utilities and perks such as future NFTs airdrops, staking rewards, members-only future events, and access to limited edition merchandise. NinjaPepe NFT is not just any PNG NFT project. Our vision is to push the technology boundary of decentralized blockchain and NFT by building a Metaverse called MetaPepes, in which owners of NinjaPepe NFT Avatars can interact with one another in a Virtual Reality world, transact with $NinjaPepe Tokens as a currency, get rewarded through Metaverse utilities for contributing to the Metaverse by holding NinjaPepe NFTs. The possibilities are endless in the MetaPepes Metaverse. Each NinjaPepe NFT is a key allowing the holders to enter the Metaverse we are building. NinjaPepe team together found the most affecting reward system as fuel to boost the values of all project`s products and the community simultaneously. Our strong royal community will ben","links":"https://www.ninjapepe.club/","market_cap":null,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/ninjapepe/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x596a1017af27593e0ab371f74e36dc923f3b2c11"}}}