{"name":"TypeIt","id":"typeit","symbol":"type","description":"What is the project about? Type!t is a revolutionary new keyboard that allows users to earn a passive income simply by using it to conduct their day-to-day typing activities. This innovative keyboard has converted keyboard themes into non-fungible tokens, or NFTs, which users can own and use to earn tokens as they type. What makes your project unique? Type!t is a powerful app that enables users to earn income by typing. With features like buying and selling NFT keyboard themes, mystery boxes, and a marketplace, users can engage in the type-to-earn experience. They can purchase a unique keyboard NFT to start earning passive income simply by typing. The app also incorporates SocialFi activities, including private chats and interactive mini-games. Type!t prioritizes privacy and security with end-to-end encryption and decentralized data storage. Users can also create and share user-generated content as NFTs on the platform. What’s next for your project? The global market opportunity in both keyboard apps and Web3 is substantial. The keyboard app market is expected to reach $20 billion by 2025, driven by increasing smartphone usage and demand for improved typing speed and customization. Meanwhile, the Web3 market, including blockchain and cryptocurrency, is projected to reach $39.7 billion by 2025, with opportunities in finance, healthcare, energy, real estate, and the potential for financial inclusion and disrupting traditional systems. What can your token be used for? Type!t is a groundbreaking project that allows users to earn income by typing. It bridges the gap between Web2 and Web3, offering a smooth onboarding experience for users. With a focus on privacy protection and encryption, Type!t ensures the security of user data. It's a platform where users can earn passive income while typing and participate in a vibrant community.","links":"https://www.typeit.net/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/typeit/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xd9a44c40584288505931880c9915c6a5eb5f2fb1"}}}