{"name":"MiraQle","id":"miraqle","symbol":"mql","description":"Be the Change. No more Secrets. One United Currency. Mission and Vision \"Vision\": To establish a global network of decentralized, content creator and fan-driven pan entertainment platforms. \"Mission\": To transform the corporate-driven global music industry to a new dimension and bring fans to the core of the music industry. Founders CEO Ross Lee studied Business Management at Seoul National University. Ross witnessed the paradigm shift in the music industry during his early career in iRiver as advanced technology disrupted the traditional music business. With successful performances acknowledged from iRiver, he then joined POSCO and Nature Republic international business division continuing to passionately contribute in implementing innovative strategies adaptation. Through his numerous experiences, he became a passionate advocate of implementing innovative technology and tirelessly looked for ways to connect the dots to create a unified universe. CTO Min Jang was awarded a Ph.D. in Computer Science in POSTECH, one of the elite engineering colleges in Korea, and is one of the best experts not only in blockchain technology but also in modern computer science such as AI machine learning and data mining. He has contributed his knowledge in major projects such as Seoul National University New Technology Joint Research Center, LG Electronics, and Hancom Group. His expertise in building a blockchain ecosystem has allowed the MiraQle project to be developed into a stable and reliable ecosystem. Currently, he is serving as an adjunct professor in the Department of Value Creation & Convergence, an Operating Committee of the Blockchain Advanced Management Program, and Chairman of the APGC Blockchain Division. CMO David Om studied International Relations and Affairs at Korea University and debuted his career as a founder of F&I Institute which was a huge success. With his expertise in coordination and consulting, David then joined Dong-A Pharmaceutical as a Regional Man","links":"https://miraqle.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/miraqle/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x428dc22668e6f3468273634067e5545ed5417a3e"}}}