{"name":"Evil Pepe","id":"evil-pepe","symbol":"evilpepe","description":"What is the project about? Evil Pepe is a crypto meme coin with no utility or expectation of financial return. This token is for entertainment purposes only. Always DYOR before making financial decisions. Prices can go down as well as up. What makes your project unique? Evil Pepe ($EVILPEPE), the token that embraces the darker side of the meme coin game. We understand that sometimes, against all odds and reason, you're drawn to those trending shitcoins like a moth to a flame. But fear not! With $EVILPEPE, you can blame the mischievous Evil Pepe for your risky decisions and enjoy the thrill of the meme coin game. History of your project. Evil Pepe ($EVILPEPE) is a community-driven meme token built on Ethereum. Our token combines the chaotic energy of meme culture with the allure of financial speculation. By tapping into the universal experience of succumbing to FOMO, $EVILPEPE aims to create an unapologetically audacious community. We've all fallen victim to the allure of the latest trending shitcoin, knowing deep down that it's likely to rug. Against our better judgement, we ignore the warning signs and ape in anyway. Why? Because Evil Pepe made us do it. And here, my friends, you can blame him without shame. What’s next for your project? Unapologetic and Audacious $EVILPEPE represents a rebellion against the status quo of the cryptocurrency world. We refuse to conform to traditional expectations, embracing the audacity and irreverence that meme culture embodies. Our community thrives on pushing boundaries, challenging norms, and reveling in the chaotic unpredictability that makes meme coins so exhilarating. What can your token be used for? When you find yourself on the edge of reason, contemplating whether to heed the call of Evil Pepe, remember this: You are not alone. The meme coin game demands an embrace of your darker side. So, accept what your evil voice is telling you and dive into the presale with a wicked grin on your face. Blame Evil Pepe for you","links":"https://evilpepecoin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/evil-pepe/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x7bd44cf5c0566aab26150a0cd5c3d20c5535686f"}}}