{"name":"AraFi","id":"arafi","symbol":"ara","description":"AraFi is a sophisticated omnichain governance aggregator designed to optimize the potential returns and governance capabilities of DeFi stakeholders, promoting financial security, stability and scalability. The platform offers the opportunity to combine governance authority and maximize rewards through the liquid staking of locked/vote escrow tokens from various chains and protocols. These features enhance the liquidity of veTokens, which otherwise may not be easily tradable on their respective native chains. Using Ulysses the ability to enhance veToken liquidity will translate into a wider access to yield opportunities across multiple chains, not just the ones native to the veTokens. Incentives are offered for users to delegate their voting power to protocol governed pairs, allowing fractal and locked ARA holders to participate in the decision-making processes concerning significant protocol improvements and proposals. The protocol will utilize a rolling governance function to effectively scale with its user base and accumulated governance assets. This approach guarantees a just and democratic governance system that reflects the shared interests of a growing community. With the goal of maximizing liquidity and rewards for its users, while also consolidating governance under the ARA token, ARA aims to become the dominant Layer 2 governance hub for projects utilizing veTokens. This ambition empowers us to broaden our horizons, allowing for integration with a multitude of participants within the ecosystem. In doing so, we aim to generate substantial value not only for our token holders, but also for the broader Maiadao and Metis ecosystem.","links":"https://arafi.app/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/arafi/logo.png","detail_platform":{"metis-andromeda":{"decimal_place":18,"contract_address":"0x85b70d7e56bc8c4ddd7a5bb30e59b223da383e34"}}}