{"name":"KittyMineCoin","id":"kittyminecoin","symbol":"kmc","description":"Just like Bitcoin, $KMC is a layer-1 digital currency but has been implemented through a shared chat log common in many modern video games. $KMC simply uses a syntax specific to the Minecraft chat log for retrieving transactions and blocks that players hash. Implementation of this system in other games is very easy. As KMCoin runs currently, it consumes only 1Mb of RAM, generating trivial energy cost. The program itself is only half a megabyte and can run endlessly on any PC capable of running Java 8 and Minecraft for 146 years, given it can store 1Tb of information on the drive after this 146 year period. It has been designed so players may utilize a new method that packs away the ledger before the file becomes too large, for a fast sync time. The base algorithm itself generates a consensus hash from all of the core mechanisms that store the information and keep the sync time fast. For example, once one million players have been added to an in-game layer-1, KMCoin driven ledger, the max download size for a sync between blocks (30sec) would be roughly 330Mb, yielding a fast sync time. Furthermore, players do not have to download the entire ledger, as the previous information is sufficient for encompassing the immutability of the entire chain. KMCoin is a new approach to creating in-game wealth at the discretion of a community opposed to a central operator. The system ensures all players own their private information and does not break any game End User License Agreements. It is robust, fast and portable to other games with a chat log, given a syntax for retrieving blocks within this log is possible.It's the first ever utilizable blockchain in a video where you get rewarded by the ability to mine tokens by completing tasks in a videogame.","links":"https://www.thekittymine.com/","market_cap":100062,"market_cap_rank":7458,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/kittyminecoin/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"41fZewbrb8x24yE9KeMJExoVXCDggebPMEwRVvX8pump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/41fZewbrb8x24yE9KeMJExoVXCDggebPMEwRVvX8pump"}}}