{"name":"Octorand","id":"octorand","symbol":"octo","description":"What Is Octorand (OCTO)? Octorand is an ecosystem made up of a collection of configurable NFTs known as Primes (1,000 Gen1 Primes and 8,000 Gen2 Primes) and the deflationary currency OCTO. Each Prime is an Algorand Standard Asset (ASA) that has 8 (Gen1) or 16 (Gen2) letter traits, stored on the Algorand Blockchain. In the initial application, these traits can be transformed to spell words and phrases to earn badges and score points in a gamified competition. The ecosystem features a growing number of dApps - the initial application “Octoword” will be joined by the second dApp “Octodraw” in Q4 2022 with more dApps to follow. OCTO is the native utility token that is used to pay for all transactions within the Octorand ecosystem Fees for changing the letter attributes of Primes Fees for changing the artwork of Primes Fees to upvote / downvote Primes Fees to use the on-chain messaging facility which allows wallets in Algorand to message Prime owners Fees to store pixel art frames in the upcoming Octodraw dApp Being a deflationary token, OCTO is also a store of value. How Many OCTO Coins Are There in Circulation? Octorand launched on the 27th of January 2022 with the creation of the 1,000 Gen1 Primes. Each Gen1 Prime contained a store of 1,000 OCTO which were emitted at a constant rate of 0.0001 OCTO per second (8.64 OCTO per 24 hours). This makes a Total Supply of 1,000,000 OCTO. No more OCTO can be created. All of the stored OCTO were emitted from the Gen1 primes on the 17th May 2022. All transactions paid in OCTO are burned - the smart contract sends the transaction fee to the creator wallet which has been rekeyed so as to be verifiably inaccessible. As of the 19th of August 2022, 218K OCTO tokens have been burned leaving a remaining circulating supply of 781K tokens. Who Are the Founders of Octorand? Octorand is the brainchild of Developer Declan Rocco, assisted by Rob Sanders who is responsible for the Marketing of the Project. Declan is a career software dev","links":"https://octorand.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/octorand/logo.png","detail_platform":{"algorand":{"decimal_place":6,"contract_address":"559219992"}}}