{"name":"Chirpley","id":"chirpley_ethereum","symbol":"chrp","description":"Introduction Chirpley is the world’s first automated, peer-to-peer, all-in-one influencer marketplace specifically focussed on nano and micro influencers. Chirpley will provide marketers with the freedom to act fast and effectively, thanks to the possibility of a 1-click marketing bomb. Product Chirpley is an independent and fully decentralized marketplace to match brands and businesses with nano (1–5k followers) and micro-influencers (5–50k followers). Brands have been slow to realize that targeting smaller influencers is more lucrative, as their engagement level is almost 600% higher than for big influencers—Chirpley allows exactly this by giving both brands and influencers free access to its platform to connect. Problem For brands and businesses, running influencer campaigns manually is extremely time-consuming and inefficient. Furthermore, it is difficult for brands and businesses to understand how much they should pay influencers to promote their products and services. For nano and micro-influencers, way less opportunities exist than for big and well-known influencers. Further, smaller influencers often get compensated in companies’ goods and services, rather than cash. Solution Chirpley is the world’s first decentralized peer-to-peer influencer marketplace. A decentralized ecosystem powered by artificial intelligence and machine learning, which matches nano and micro-influencers with brands. Chirpley’s algorithm then calculates a fair price for a range of services from tweets, retweets, likes, video posts, etc. based on an influencer’s amount of impressions and engagement. This automated setup allows brands to leverage many smaller influencers easily and effortlessly with complete cost transparency, while creating earning opportunities for the influencers at the same time. Chirpley gives social media users the unique opportunity to monetize their social influence in an easy and transparent way by sharing content with their friends and followers.","links":"https://chirpley.ai","market_cap":291434,"market_cap_rank":5359,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/chirpley_ethereum/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x70bc0dc6414eb8974bc70685f798838a87d8cce4","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x70bc0dc6414eb8974bc70685f798838a87d8cce4"}},"is_native":false}