{"name":"Whyyoutouzhele","id":"whyyoutouzhele","symbol":"li","description":"The Li Coin ($LI), launched as a meme coin on December 19, 2024, marks the starting point of its ecosystem development. The foundation will focus on gradually improving the technical infrastructure, building a decentralized governance framework, and advancing the causes of press freedom and human rights protection through a DAO model centered around the issuance of $LI.Objective: To enhance the technical infrastructure surrounding the issued $LI, define the foundation’s mission and governance framework, and establish a solid foundation for future development. Key Tasks 1. Define the Foundation’s Mission and Vision • Publish a vision document for the foundation (Litepaper or Whitepaper 2.0) that outlines the use cases, governance model, and long-term plans for $LI. • Clarify the foundation’s core objectives: promoting press freedom, protecting human rights, and advancing decentralized governance. 2. Design a DAO Governance Framework • Draft DAO governance rules, including proposal processes, voting mechanisms, and fund allocation methods. • Ensure token holders’ governance rights, such as the right to propose, vote, and oversee fund allocation. 3. Improve the Operation Model of Li’s Twitter Account to Achieve Decentralization and Immutability Goals: • Build an independent account site based on decentralized social protocols to ensure that information cannot be deleted or censored. • Encourage more funded creators to adopt similar protocols, enhancing account security and independence. • Use decentralized protocols to upload news, human rights events, and articles, ensuring that the information cannot be deleted or censored. Implementation Steps: • Select suitable decentralized social protocols (e.g., Nostr, Lens Protocol, or Bluesky). • Establish an independent site to host Li’s content and integrate it with the chosen social protocols. • Promote use cases of decentralized social protocols to attract more creators to join. • Provide technical support to help creators migrate their content to decentralized networks.","market_cap":1495249,"market_cap_rank":3662,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/whyyoutouzhele/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"HhUVkZ1qz8vfMqZDemLyxBFxrHFKVSYAk7a6227Lpump","geckoterminal_url":"https://www.geckoterminal.com/solana/tokens/HhUVkZ1qz8vfMqZDemLyxBFxrHFKVSYAk7a6227Lpump"}}}