{"name":"Neopin","id":"neopin","symbol":"npt","description":"Experience the power of trust and stability, NEOPIN CeDeFi What is a “Trust”? How do you trust others? We say that we trust people not when they are friendly, but when we can transparently know who they are for a long time. What about commercial services? Why do we trust Amazon, Google, Apple and Samsung and give them all my card and personal information? We did not trust these services in the first place. These services became trustworthy with the value of their company based on secure long term interaction with users and technologies. However, any trust we place in these services are never immutable, just like people. This applies to both traditional finance and Web 3.0 markets as well. The traditional financial market provided reliable services, but we also hear news of some major banks being hacked or abusing users’ personal and/or financial information. DeFi was created to solve this problem, but it raised an issue of inability to filter users as the service is decentralized, leading to the potential abuse of criminal proceeds such as money laundering, etc. At NEOPIN, we wanted to solve this paradox by providing a transparent, reliable and stable financial service, but one that is user-oriented financial service. We believe that the best approach to providing innovative crypto services is to take advantage of both CeFi and DeFi. Pathways to CeDeFi The Trial and Failure of CeFi and DeFi The evolution of CeFi and DeFi has been rapid since the emergence of decentralized finance, centered around the Bitcoin and Ethereum networks. As a result, the ecosystems of layer 1 and layer 2 networks have grown significantly in a short period of time. However, a series of events in which the weaknesses of each area became starkly apparent have greatly affected the growth of the overall blockchain industry. Ultimately, CeFi, which includes centralized exchanges, has faced many problems due to unclear management of customer funds, excessive third-party leverage exposure, and ethical issues, resulting in many victims. DeFi has also faced challenges, including the oracle problem of difficulty in managing counterparty risk due to protocol flaws and cumulated issues that erupted at the same time and caused great damage. What is CeDeFi CeDeFi stands for \"Centralized-Decentralized Finance\". It is a new concept that aims to bridge the gap between centralized finance (CeFi) and decentralized finance (DeFi). The idea behind CeDeFi is to take the best aspects of both CeFi and DeFi and combine them to create a financial ecosystem that is more efficient, transparent, and user-friendly. CeFi has a reputation for stability, security and regulatory compliance, but it can be lacking in terms of transparency and accessibility. On the other hand, DeFi has a reputation for transparency, accessibility and innovation, but it can be lacking in terms of stability, security and regulatory compliance. CeDeFi aims to solve these problems by leveraging the strengths of both CeFi and DeFi, such as providing a stable and secure platform with regulatory compliance, while also providing transparency and accessibility as well as innovation and flexibility. The CeDeFi ecosystem is expected to bring many benefits to the financial industry, although it is still relatively new and rapidly evolving. For this reason, CeDeFi offers the DeFi products such as yield farming, lending, borrowing, liquidity staking and token swapping, which are available on the DeFi protocols and at the same time are compliant in terms of regulation. The necessity of CeDeFi The Web3 market is in need of a new direction for the continued growth and mass adoption that everyone has been clamoring for over the past decade. While we have been through all the noise and scandals coming from both centralized platforms and decentralized ecosystems, the innovators in the industry have been quietly preparing to embrace a regulatory environment that will allow them to build an open and welcoming ecosystem to invite traditional financial market participants. The reason why billions of dollars of traditional finance haven't been unlocked and deployed in the Web3 space is that there is no real bridge between the traditional world and the decentralized finance ecosystem. The lack of regulation and standards in the crypto space is what CeDeFi is designed to address. It does this by being compliant with the regulations that make it easier for law enforcement to identify potential criminals in a more straightforward way. CeDeFi is also characterized by centralized entities that make use of governance structures that are similar to those that are known from the traditional financial sector. At the same time, it leverages the efficiencies of decentralized finance for cost reduction. NEOPIN CeDeFi Landscape NEOPIN NEOPIN is a CeDeFi platform that has an innovative approach to the market, taking advantage of CeFi and DeFi: CeDeFi. The protocol aim to lead a new era of the CeDeFi by leveraging the stability and security of centralized systems with the flexibility and transparency of decentralized ones. Combining the strengths of both systems, providing its users with greater trust and stability through the implementation of KYC and AML procedures. Unlike address-based DeFi projects, which can be vulnerable to external security threats, NEOPIN has implemented strict security policies such as a KYC identification system and AML guidelines since it started operating in January 2022. NEOPIN offers a range of DeFi services, including staking, swap and yield farming in various cryptocurrencies. These services have been designed with ease of use and positive user experience in mind. NEOPIN is constantly working on innovative ideas that will allow its users to make use of the assets they have accumulated through the platform in a variety of ways, including X2E (P2E, S2E, M2E) and NFT services. Ultimately, based on its secure security protocols and regulatory environment, NEOPIN aims to become an open blockchain platform that bridges traditional finance and DeFi protocols for all users.","links":"https://neopin.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/neopin/logo.png","detail_platform":{"klay-token":{"decimal_place":18,"contract_address":"0xe06597d02a2c3aa7a9708de2cfa587b128bd3815"},"polygon-pos":{"decimal_place":18,"contract_address":"0x306ee01a6ba3b4a8e993fa2c1adc7ea24462000c"}}}