{"name":"Cholo Pepe","id":"cholo-pepe","symbol":"cholo","description":"Cholo Pepe is a memecoin by the people, for the people. CP's goal is to make $CHOLO a strong community meme coin for the tadpoles, not for the whales. Global marketing will be executed. La raza outreach will start in the hood and ripple out across oceans. - Commitment to Fair Launch - LP Will Be 100% Burned - Transparency of Wallets and Their Designations ​ There will be a creator’s wallet of 4 % for the team (2% for each team member), 8% strictly for marketing and ads, 2% for airdrops and 2% for burns. These address will be provided to the public that way it can be easily tracked. Backstory On Saturday June 15, 2024 in Los Angeles at the intersection of Cesar Chavez Ave and Soto St -- Chaos struck. The ring leader of the disruption, known locally as Cholo Pepe, incited chants of rage from the surrounding crowd while speaking to the ongoing trend of billionaires manipulating meme coin currencies to exacerbate their wealth at the expense of smaller coin holders. “I am fucking tired of seeing these bitch ass nerds steal money. They continue to steal from honest hardworking people. Those people are my neighbors, homies, and mi familia. Stealing from them is stealing from me. You foo’s have been taking advantage of my raza. It’s time me and my homies show you what’s up cabrónes. We’re going to suck you guys dry.” Whisperings of a proletariat meme coin launch constructed by Cholo Pepe and his raza are making waves across working class communities. What do we know right know? Not a lot. Cholo Pepe is keeping his lips tight on details of the new coin—but if the movement at the local level is any indication of the future success of the coin, you’ll want to keep yours eyes open for this one.","links":"https://www.cholopepe.info/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cholo-pepe/logo.png","detail_platform":{"solana":{"decimal_place":6,"contract_address":"C4gG6drd4zAGvx9WtG4HSFwXXeP1ZmXqD87VHz8Xpump"}}}