{"name":"00 Token","id":"zer0zer0_ethereum","symbol":"00","description":"P00LS is the leading community-first platform for creator cryptocurrencies. Traditional spheres of influence — from Hollywood to Wall Street and Silicon Valley — are converging more now than ever before, forming a new marketplace with creators, brands and their audiences at the center. A cultural revolution is underway, and it’s being led by the world’s creative class. To help build their ecosystems in this new world, P00LS empowers creators and brands to launch their own social tokens and distribute them to their communities. These tokens become the currencies for their respective ecosystems, providing audiences and consumers with exclusive access and more meaningful connections to their favorite brands and creators. With P00LS — the premier tool for accessing creator value — money is no longer the only currency. What is 00? The $00 token is the heart of the zerozero marketplace, powering all of your favorite creator coins. All creator tokens can be purchased and sold on the zerozero marketplace against $00. The $00 token is the master key to all creators and brands on P00LS. $00 isn’t just an entry ticket, but a stake in the ecosystem of all creator coins. The $00 community will have a role in shaping how brand and creator ecosystems develop and grow. The $00 token is a governance token, giving any holder voting rights within the zerozero marketplace, as well as access to the treasury of creator coins. Think of $00 as the center of mass for the creator coin galaxy. Use it to enter the solar system of every brand and creator on P00LS. The $00 token is an ERC-20 token minted on the Ethereum blockchain that works as a governance and access token for the zerozero DAO and its ecosystem.","links":"https://www.p00ls.io/","market_cap":1407165,"market_cap_rank":3337,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zer0zer0/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x881ba05de1e78f549cc63a8f6cabb1d4ad32250d","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x881ba05de1e78f549cc63a8f6cabb1d4ad32250d"}},"is_native":false}