{"name":"CZ Guardian","id":"cz-guardian_binance-smart-chain","symbol":"guard","description":"GUARDIAN ($GUARD) — a community-driven token on the BNB Chain embodying the ideas of loyalty, strength and protection. The CZ GUARDIAN token inhabits a space where community ethos merges with the principles of discipline and defence. On the BNB Chain, $GUARD was launched to serve not simply as a token but as a symbol: the guardian standing watch over the ecosystem. Within its design you’ll find the themes of steadfast support and resilience — the token aims to strengthen the collective, guarding the space rather than simply riding a trend. At its core, $GUARD is driven by a community rather than centralised hype. It emphasises loyalty — the notion that participants are aligned around shared purpose, and the token becomes a means of embodying that commitment. In this sense it is less about rapid elevation and more about building a reliable foundation: the guardian guarding the future of the chain. Strength is equally central — not just in price or market metrics, but in the capacity to persist, to support the network’s vitality even in changing conditions. Protection is the third pillar: $GUARD positions itself as a shield within its ecosystem. That means acting with clarity of intent and a sense of duty — to safeguard value, to sustain the protocol, and to protect the interests of the community. The token is not pitched as a short-term flip, but as a lasting presence, a sentinel for the framework in which it resides. Trading availability on multiple venues — notably liquidity pools on Uniswap and PancakeSwap — reinforces the token’s practical accessibility. That dual-pool approach supports diversification of access and reflects an intent to anchor $GUARD across the ecosystem rather than confine it to a single entry point. In launching $GUARD, the project invites users to join a guard-watch: a collective standing together, not just as holders, but as participants in sustaining the chain’s integrity and future. The imagery of the guardian is purposeful — disciplined, brave, and vigilant. When the token is described as the shield of the ecosystem, it means that the community, network and architecture are wrapped in a protective ethos, with $GUARD at its core. In short: $GUARD is a token built around the values of loyalty, strength and protection; deployed on the BNB Chain; driven by community; rooted in dual-pool liquidity strategy; and envisioned as the guardian of ecosystem futures rather than a fleeting narrative.","links":"https://czguard.com/","market_cap":5771.05,"market_cap_rank":12155,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/cz-guardian/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0x373fcadc912d0a0ef78f9eba01b05aba0f33013f","geckoterminal_url":"https://www.geckoterminal.com/bsc/tokens/0x373fcadc912d0a0ef78f9eba01b05aba0f33013f"}},"is_native":false}