{"name":"Encountr","id":"encountr","symbol":"enctr","description":"ENCTR (pronounced Encounter) is a decentralized protocol that was created to give true utility and sustainable staking rewards through its innovative revenue-sharing model. With a focus and revenue streams in the GameFi space we consider this a merge between GameFi and DeFi. ENCTR's goal is to create a community centered currency that merges the unique aspects of Decentralized Finance (DeFi) with the gaming industry. We believe Web3 is the future of gaming but we needed to create a logical and sustainable way so that we can fix the Play-To-Earn model to facilitate the transition of Web2 to Web3. ENCTR specifically wants to: 1. Redefine Play-To-Earn in a sustainable way 2. Create a community-centric currency that is backed by stablecoins which anyone can utilize and build upon. 3. Reward both gamers and non-gamers alike due to the aligned incentives through our Revenue Sharing Model 4. Develop an ecosystem of applications that utilize the ENCTR token providing true utility and function. All the features that the core team builds out for ENCTR are called Modules. Whenever we talk about new features we use this term. It is a way to showcase that we build segments of a mega-application at a time with all of the modules living within 1 application - The ENCTR App. The modules that the ENCTR core team creates provide utility to the token itself. Every aspect of ENCTR builds upon itself and every module that is created either utilizes the ENCTR token in some way or provides a revenue stream back to the ENCTR ecosystem. This includes: - Passive Income - Peer-to-peer eSports wagering (Battlescape) - Rotating systems of in-game achievements, backed by $ENCTR rewards upon completion (Arsenal) - Guild creation and participation in various ENCTR Official tournaments and brackets. (Legions)","links":"https://www.enctr.gg/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/encountr/logo.png"}