{"name":"Zelwin","id":"zelwin_polygon-pos","symbol":"zlw","description":"Zelwin has built a huge ecosystem between real sector of economics and digital assets. ZELWIN's Ecosystem: Zelwin.finance - Launchpad for IDO & INO Ex.Zelwin.com - Simple Сrypto Exchange Zelwin.com - Crypto-friendly Marketplace of Goods Zelwin Staking - Special earning program for ZLW holders and participants on IDOs Zelwin Bridge - The easiest way to exchange ZLW tokens between different chains: Ethereum (ERC20), Binance Smart Chain (BEP-20), Polygon (ex. Matic Mainnet). Zelwin IDO - Exclusive access to public rounds of promising crypto projects Zelwin is created the useful & simple platform for crypto IDOs (Initial Decentralized Offerings) and INOs (Initial NFT offerings). For early-stage crypto projects to raise capital to IDO participants, providing a chance to invest in a project early. And earnings programs for ZLW holders. When and how was Zelwin created? In 2019 - 11 teams worked on this powerful ecosystem, including developers, designers, sales specialists, programmers, blockchain technology specialists, lawyers, economists, PR specialists and marketers, HR specialists, e-commerce specialists, and many others. In 2020 - was first listing on CEX exchanges In addition, Zelwin ecosystem it is a ready-made product with a clear business model, mass adoption, and powerful affiliate program. How To Participate In a ZELWIN IDO? A few days before any new IDO, detailed instructions are announced in the official Telegram Zelwin Finance. To participate in each IDO at Zelwin platform, users must meet the following requirements: 1. Deposit any number of ZLW tokens on BEP-20 or Polygon (at least 100 ZLW) on any of the staking packages. 2. Every 100 ZLW = 1 Ticket (for example: 1000 ZLW = 10 Tickets) 3. Connect your wallet (MetaMask, TrustWallet etc.) on the IDO page and register for participation. 4. If you become the winner of the drawing, you will have the opportunity to claim the project tokens. What Makes Zelwin Unique and interesting for participants? - No KYC (Zelwin is the fully decentralized platform for launching new projects) - One wallet can only win 1 allocation (1 ticket), but the number of wallets is not limited - Holding more ZLW gives you more chances to win an allocation, because the number of winning tickets is assigned to specific tranches related to the number of ZLW staked. The more tickets you bet, the higher your chances of winning. - If you not win, your money for allocations will be return - If you staked ZLW on platform you can participate in all IDOs for a period of your staking. Media About Zelwin Ecosystem: Forbes, Entrepreneur, NASDAQ, RBC.ru, HackerNoon and many others. How to buy ZLW tokens? You can buy ZLW on different platforms: - PancakeSwap - On Zelwin - On CEX exchanges: Gate.io, DigiFinex, Probit, BitForex, Hotbit etc. If users still don't have MetaMask and BEP-20 wallet users can see here a full instruction from A to Z. For any other questions just ask in Telegram chat @ZelwinChat (support 24/7).","links":"https://zelwin.com/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/zelwin/logo.png","detail_platform":{"polygon-pos":{"decimal_place":18,"contract_address":"0xb5b8381b67248f832c7961bd265f021cd8d291a4","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xb5b8381b67248f832c7961bd265f021cd8d291a4"}},"is_native":false}