{"name":"HoneyWood","id":"honeywood","symbol":"cone","description":"What is the project about? Cosmos ecosystem based game, combines the most popular game mechanics: match3 and farming. The project uses two native coins: HoneyCoin and CONE, as well as Fruits for free-to-play players. A unique inflation control mechanic called \"Air\" was developed specifically for the game. The project's main thesis is \"Play to make the world better,\" the game's storyline touches on environmental issues, and players can be involved in useful causes in real life. What makes your project unique? - An economy balanced by the action of the players themselves - A separate blockchain run specifically for the game - Mobile wallet Moneta Today in which you can manage your own resources and play HoneyWood - Combination of match3 and farming game mechanics, 1 game - 2 mechanics - Utility coins in real life and other projects - Project focus on capitalization of game time History of your project. The development of the project began in 2020. At first, Moneta Today's own cryptocurrency wallet was created. The team consisted of several people, including the founder Roman Chizhikov. On May 13, 2022, the game was launched on mainnet. The team experienced a serious crisis in the crypto winter, halved the number of employees. Thanks to the support of the community of 18 countries the team was able to get out of the crisis. One year later, on March 2, 2023, CONE was listed on Bitmart. A month after the listing, there was a global unfreezing of all players' coins, as a result, the price of the coin fell heavily and bounced back from the bottom by 400%. What’s next for your project? - The team plans to launch a mobile app - Integrating coins into other games - Creating precedents for capitalizing game time based on millionaire cities - Planting the first 1,000 trees What can your token be used for? Coin can be used inside and outside the game in real life","links":"https://honeywood.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/honeywood/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":null}}}