{"name":"Reign of Terror","id":"reign-of-terror_binance-smart-chain","symbol":"reign","description":"What is the project about? Experience the cyberpunk world of Reign of Terror through three thrilling games: Awakening for unlocking vaults and win huge prizes, Uprising for leveling up and fusing agents to access higher rarities, and the full game: the premiere XCOM meets MMORPG-style tactical RPG where you establish your cyberpunk stronghold with your various squads of agents each with special skills and classes. What makes your project unique? - Participate in escalating tactical and strategic turn-based battles - Level up and ascend your agents to gain new powers and skins - Collect agents and run the right squad for the right mission - Craft weapons, items and equipment and use or sell them on the marketplace - PvP in asynchronous combat with matchmaking History of your project. [DONE] November 8 - NFT PFP Genesis Drop on Fractal [DONE] November 14 - NFT PFP Community Reveal [DONE] November 29 - Reign of Terror: Awakening Released [DONE] February 16 - First Launchpad Sales with StarLaunch and Solanium [DONE] April 12 - TGE + $REIGN Token Listing What’s next for your project? [End April] Awakening Vault Challenge (Community Board Game w/ Grand Prizes) - currently in testnet [Late May] Uprising (Web3 3D Free-to-Play RPG) [Q3 2023] Reign of Terror (SRPG Game 3 within the Reign of Terror World) Public Vertical Slice What can your token be used for? - Stake your NFTs in RoT: Awakening for Intel to run missions as well as participating in our large community map full of rewards - Fuse your agents and gear in RoT: Uprising to increase their rarities for increased power and rewards - Participate in a full in-game economy in our full game - Fuse agents and items together on chain to increase both its rarity and power on chain - Stake for multiple in-game benefits","links":"https://reignofterror.io/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/reign-of-terror_binance-smart-chain/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":18,"contract_address":"0xaa88fd757fa81ebbbce0eb1f324172d0e446093e"}},"is_native":false}