{"name":"PHT Stablecoin","id":"pht-stablecoin","symbol":"pht","description":"PHT is a stablecoin pegged 1:1 to the Philippine Peso (PHP) issued by Apacx Digital Ltd., maintaining a consistent and reliable value. As a blockchain-based “digital peso,” PHT is specifically designed for the Philippine market to enable faster, lower-cost transfers and payments. PHT adopts the time-tested overcollateralization model pioneered by MakerDAO’s DAI. Every PHT is minted by locking on-chain assets at a collateral ratio exceeding 100% (currently ~120%), with issuance and liquidation fully managed by smart contracts. In times of market volatility, the system automatically adjusts based on PHP exchange rates provided by Chainlink, ensuring PHT remains stable around 1 PHP. As APACX’s flagship product, PHT has already demonstrated exceptional real-world utility within various PayFi ecosystems, spanning OTC trading, cross-border remittances, consumer wallets, merchant gateways, and crypto card issuance, etc. With its market-proven security and transactional efficiency, PHT is reshaping the financial landscape across Southeast Asia. Looking ahead, PHT will continue to expand into a wide range of use cases — including but not limited to DeFi, blockchain gaming, NFT marketplaces, and other Web3 innovations, fueling the growth of Southeast Asia’s digital economy while delivering more accessible and inclusive digital payment solutions to users worldwide.","links":"https://www.apacx.io/PHT","market_cap":3906015,"market_cap_rank":2594,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/pht-stablecoin/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0xbe370ad45d44eb45174c4ec60b88839fef32c077","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0xbe370ad45d44eb45174c4ec60b88839fef32c077"},"tron":{"decimal_place":18,"contract_address":"TXdN5fvFjCdqjWJRvWmBzSRLBN7JLYmmrs","geckoterminal_url":"https://www.geckoterminal.com/tron/tokens/TXdN5fvFjCdqjWJRvWmBzSRLBN7JLYmmrs"},"polygon-pos":{"decimal_place":18,"contract_address":"0xe75220cb014dfb2d354bb59be26d7458bb8d0706","geckoterminal_url":"https://www.geckoterminal.com/polygon_pos/tokens/0xe75220cb014dfb2d354bb59be26d7458bb8d0706"}}}