{"name":"Gram Silver","id":"gram-silver_avalanche","symbol":"grams","description":"Launched in November 2022, Gram Silver Token (GRAMS) is an asset-backed token redeemable 1:1 for 1 gram of silver. Issued by Token Teknoloji Anonim Şirketi, this token is fully backed by silver on the blockchain at a 1:1 ratio and indexed to the price of silver. For every GRAMS created, an equivalent amount of physical silver is held as collateral in the company's reserves. GRAMS provides a cost-effective, fast and secure solution for global users, offering direct ownership with no storage costs and high accessibility for 24/7 transactions and transfers, regardless of geographical boundaries. Unlike silver transaction limits in the market, there are no minimum transaction limits for GRAMS transactions. GRAMS is created and runs on the Avalanche C-Chain and Polygon blockchain, and it is compatible with all blockchain wallets that support EVM. It uses smart contracts to automatically manage the collateralization process. As the demand for GRAMS tokens increases, the Token Teknoloji Anonim Şirketi will add the equivalent amount of physical grams of silver to its reserves for each GRAMS token upon the request of institutions wishing to meet their demand. This ensures that the 1:1 ratio between grams of silver and GRAMS is maintained whilst keeping the market in balance between supply and demand. And a coin burn function is built into the blockchain's smart contract to remove a predetermined amount of GRAMS tokens from circulation when needed, ensuring a balance between GRAMS and the gram of silver. Thanks to this mint-and-burn mechanism, the price of GRAMS is always in equilibrium with the price of the physical gram of silver.","links":"https://www.token.com.tr/en/reserve-tokens/gram-silver-grams/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/gram-silver_avalanche/logo.png","detail_platform":{"avalanche":{"decimal_place":18,"contract_address":"0x97cf07b5401b76d69bf48a4f6fdf63684e0748e0"}},"is_native":false}