{"name":"MetaniaGames","id":"metaniagames","symbol":"metania","description":"METANIA is building the Metaverse with Virtual reality (VR), plotted spaces and a fun marketplace. A virtual world with games combined with virtual reality technology, made up of exciting interconnected venues and site-appropriate NFTs, powered by Binance smart contracts and protected by the blockchain. METANIA allows users to be virtually \"\"there\"\" when they are physically anywhere in the world. METANIA aims to anticipate this upcoming revolution by combining cryptocurrency with the metaverse, creating an ethical, decentralized, fun, innovative project. METANIA is much more green, visionary, supportive of young ideas (angel investment) and unique in its field compared to most other cryptocurrency projects and uses blockchain to provide security. METANIA Token is BEP20 compliant, but incorporates another 'custom' protocol within METANIA that extends token functionality. Virtual reality environments and individuals can use METANIA tokens to purchase any NFTs, plots and virtual goods they want, and more. METANIA's interactive VR games, NFT Marketplace, and expanded realistic terrain programming will provide further input into the project. Purchasing or NFTs of related products will be made available as interactive shopping tiers. METANIA makes it easy to create virtual spaces so that creators and developers can increase profitability by buying and selling virtual goods directly in virtual reality. They will be able to create and sell virtual realistic lands and offer virtual goods such as virtual appearances, digital clothing and collectibles during events. Those in the community will also be able to interact with each other. Their virtual lands will be verified on the blockchain for their authenticity, rarity and value for all to see. Moreover, METANIA provides a smooth order to the VR gaming industry. Event and virtual sales tracking will control when programs are produced, with detailed analytics documented on the blockchain for all traditional programs where players have no say in what is broadcast.","links":"https://metania.games/","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/metaniagames/logo.png","detail_platform":{"binance-smart-chain":{"decimal_place":9,"contract_address":"0x6f64cc61d0d5542e40e6f2828cbdda84507d214d"}}}