{"name":"Quadrans","id":"quadrans","symbol":"qdt","description":"In recent years, innovations have driven the need for an advanced digital environment to accommodate the emergence of new technologies and trends, such as decentralised applications (dApps), Smart Contracts and the use of IoT devices. As integration and interoperability between technologies is becoming a priority, the creators of Quadrans have committed to build an accessible blockchain infrastructure to help new technologies develop and enhance how we live, work and relate to one another. Ethically, the project considers fundamental the principles of transparency, integrity, security and ownership of data in open decentralised environment. In order to pursue this objective, Quadrans Foundation was officially formed in August 2018 and acknowledged by the Swiss local authorities to guarantee the continuous, inclusive and ethical advancement of Quadrans technology into our communities. Today the Foundation collaborates with institutions, Government agencies and academic partners around the world to achieve its mission. Quadrans infrastructure is a public and open source blockchain designed to overcome the scalability challenge and reduce the instability of operational costs that affect existing blockchains. With significant designing effort, the current Quadrans protocol achieves high throughput in a secure way while maintaining decentralisation. Quadrans consensus mechanism uses three types of service nodes located throughout the network, called Masternodes, Miner nodes and Lightnodes and is designed to reduce energy consumption. The ability to speedup business practices through Smart Contracts has the specific aim to support the creation of new business models and promote an efficient, reliable and affordable use of the infrastructure. The Quadrans Blockchain runs on two cryptographic elements, Quadrans Tokens (QDT) and Quadrans Coins (QDC), designed as utilities to ensure the correct functioning of the infrastructure and support a suitable use in the indust","links":"https://quadrans.io","logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/quadrans/logo.png"}