{"name":"UTXO","id":"utxo","symbol":"utxo","description":"UTXO markting plan summary: UTXO Goals -> - Reach 1k Twitter, telegram and discord members within 1 weeks. - Reach 2K-5K twitter, telegram and discord members within 2/3 weeks. 1. How does UTXO reach his goals? - We have build the official UTXO meme website: utxo.site (in this way the UTXO meme core stays intact). - We have build also an addtional landingpage for the UTXO dapp, to explain how it works, benefits, utility and the vision of the project. - We are building now the UTXO back-end of the dapp. When the whole UTXO dapp is finished. We will setup a new marketing campaign on X to increase the exposure of the new UTXO Dapp and attract new investers and holders. Because UTXO is a meme token with new added utility. We think as a community we could attract more people after the development of the Dapp is finished. 2. UTXO social media account's UTXO is active on 3 different social media platforms. Telegram, Twitter and Discord (The discord server is almost ready and will go live this week) - Telegram: https://t.me/UTXO_SRC20 - Twitter: https://twitter.com/SRC20_UTXO - Discord: https://discord.gg/srk9GRm488 3. UTXO social media plan - We initiated the UTXO #Giveaway to increase the exposure on X. The UTXO giveaway is running for antoher 8 days. After the UTXO giveaway ended. We will start with a new social media campaign. - The UTXO SRC-721 Airdrop (only for people who have joined all 3 of the UTXO social media accounts and hold more than 100K UTXO tokens in their wallet). - We will create a social media content calender to be consistent in the UTXO Tweets. We just need time to set this auto tool poster up for twitter. - After the discord channel is live. We could hold an AMA every Week/month to engage with the utxo community and listen to the feedback. - We will ask the community members to write an UTXO blog every monday.So we could communicate the blog information via the X and discord posts. - Also, we could create a community poll to ask if the commu","links":"http://www.utxo.site/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/utxo/logo.png","detail_platform":{"":{"decimal_place":null,"contract_address":""}}}