{"name":"Crypto Sustainable Token","id":"crypto-sustainable-token_ethereum","symbol":"cst","description":"What Is CST? Crypto Sustainable Token (CST) is an innovative digital asset developed by PT Transaksi Sistem Digital (TSD), a legally incorporated Indonesian company established in September 2022 and officially recognized by the Ministry of Law and Human Rights. The project was created to strengthen the national crypto ecosystem by introducing a secure, efficient, and inclusive token designed for mass adoption. CST is built on the Ethereum Blockchain and leverages a robust technological foundation, including Proof-of-Stake (PoS) consensus, Curve25519 cryptography, and SHA-256 hashing. This combination ensures that CST operates on a resilient, energy-efficient, and scalable network. Beyond its role as a digital asset, CST is positioned as a utility token, intended for integration into a wide range of blockchain-based applications and services. What Are CST Utilities? A core utility of CST lies in its digital wallet (CST Wallet). The CST Wallet enables users to store, send, receive, and manage their tokens seamlessly and securely. It is designed for interoperability and cross-application integration, with a roadmap that includes multichain network expansion, allowing CST to function across multiple blockchain ecosystems. Another fundamental feature is the staking mechanism. By staking CST, token holders can contribute to network security while earning rewards, aligning user incentives with the sustainability of the ecosystem. This mechanism promotes community participation and provides continuous value for holders. Additionally, CST incorporates a community reward system that incentivizes active involvement. Members can earn recognition and rewards through activities such as event participation, project contributions, and collaborative initiatives. This transforms CST into both a community token and a reward token, fostering organic growth, engagement, and a strong sense of belonging among participants. CST Tokenomics The total supply of CST is capped at 10 million tokens, ensuring scarcity and controlled distribution. Allocation is carefully structured to balance liquidity,","links":"https://csttoken.net/","market_cap":0,"market_cap_rank":null,"logo":"https://raw.githubusercontent.com/Xellar-Protocol/xellar-assets/master/assets/crypto-sustainable-token/logo.png","detail_platform":{"ethereum":{"decimal_place":18,"contract_address":"0x3c41c80b966b92d345dc8fc91e5508bc7248da6e","geckoterminal_url":"https://www.geckoterminal.com/eth/tokens/0x3c41c80b966b92d345dc8fc91e5508bc7248da6e"}},"is_native":false}